{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.13.02.26.28/rise-of-empires-ice-and-fire-gems-generator-az.1.0.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "rise-of-empires-ice-and-fire-gems-generator-az",
  "catalog:commitId": "d3b3cbf7-d322-4ef4-a95a-9cb3dcbad0ca",
  "catalog:commitTimeStamp": "2022-01-13T02:26:28.0154238Z",
  "created": "2022-01-13T02:24:13.65Z",
  "description": "Free Rise Of Empires Ice And Fire Gems Generator are the web-based program which often works on machine learning, which in turn is produced by our developer around the clock to help players. You are going to see this resources generator apk will achieve to you all of the necessary attributes you prefer. In order to learn the truth about these hack download ios for Rise Of Empires Ice And Fire we're going to be screening all of them out there. cheat code apk ask players to do some of the ineffective chores and also attempt to avoid use the information provided by you.\n\nAcess ONLINE GENERATOR http://tnpps.xyz/8f0cded\n\nOver time we have noticed a plenty of online searches coming through, people looking for Rise Of Empires Ice And Fire Gems Generator for android or ios, Rise Of Empires Ice And Fire  hack download apk windows mobile. Thus, the primary element is that the generators of ours typically are not like others, this means you are able to buy 100 % free Gems without having a survey or verifications. Gems are just a feature of Rise Of Empires Ice And Fire that provides a virtual currency. In fact what we'll do is explain to you the evaluation procedure once.\n\n\n\nThe greatest thing regarding the Rise Of Empires Ice And Fire Gems Generator is that it does not need any set up, root, or even jailbreak. In present day post we'll be discussing Rise Of Empires Ice And Fire. The whole course of action only takes close to a minute, though the effects is huge. The real question is if all of these sites genuinely work. This won't take more than 2 minutes so we are going to send all the Gems of yours straight to your Rise Of Empires Ice And Fire bank account immediately after you've finished it.\n\n\n\nYou ought to first of all know that this new Rise Of Empires Ice And Fire Gems Generator will attach all the necessary Gems you'd like. It is likewise likely that none of them are employed at all. But enough with that in this article, we come to the particular process and also the instructions.\n\n\n\nYou could be convinced that if you may make use of this kind of new Rise Of Empires Ice And Fire Gems Generator you are going to manage to do this without having the fear of getting blacklisted. The craze on the game shouldn't be ended because of insufficient money. As a result, it is impossible to hack apk mod the game. Our team is continually improving the hack everything unlimited we are providing you with and this means that this strategy will additionally be a terrific free online generator for you guys. You can find various Gems generators and surprisingly many of them are authentic. In case you face a number of problems when it comes to this particular online generator activation code, you are able to message us and then we will respond you the minute we are able to.\n\n\n\nThe Rise Of Empires Ice And Fire Gems Generator is able to support generate any resource and assist with each and every element of the game. The ones which are working aren't worth the chance of getting your main account banned. So, making use of such mods could totally ban the Rise Of Empires Ice And Fire of yours of account.\n\nRise Of Empires Ice And Fire Gems Generator is a totally free application to make Gems for Rise Of Empires Ice And Fire users. The truth is, there's certainly no rocket science behind it, and everyone can undertake it. With our hack full version, your account is secure and it's very improbable your account is going to be banned as different hacks have unknowingly and blindly led their users to in history Use our Rise Of Empires Ice And Fire Gems hack how to get free Gems to incorporate limitless free Gems to the Rise Of Empires Ice And Fire account of yours! But before diving and I wish to tell you very clearly that in the game you've restricted access to Gems. We highly suggest against spending your hard earned cash on Gems.\n\n\n\nHow do i hack Rise Of Empires Ice And Fire, how can i hack Rise Of Empires Ice And Fire Gems, does",
  "id": "rise-of-empires-ice-and-fire-gems-generator-az",
  "isPrerelease": false,
  "lastEdited": "2022-01-13T02:26:16.91Z",
  "listed": true,
  "packageHash": "C6n87hZ5RXwWATEs+2o7z3l6EdmUXKXNSEUSAkpHtsaTMDwTMJpLxWSxGbltKdYeFNpDQcRt0BVq9shubpwcfQ==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 16752,
  "published": "2022-01-13T02:24:13.65Z",
  "verbatimVersion": "1.0.0",
  "version": "1.0.0",
  "dependencyGroups": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.13.02.26.28/rise-of-empires-ice-and-fire-gems-generator-az.1.0.0.json#dependencygroup/net6.0",
      "@type": "PackageDependencyGroup",
      "targetFramework": "net6.0"
    }
  ],
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.13.02.26.28/rise-of-empires-ice-and-fire-gems-generator-az.1.0.0.json#lib%5Cnet6.0%5CAppLogger.dll",
      "@type": "PackageEntry",
      "compressedLength": 1786,
      "fullName": "lib\\net6.0\\AppLogger.dll",
      "length": 4608,
      "name": "AppLogger.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.13.02.26.28/rise-of-empires-ice-and-fire-gems-generator-az.1.0.0.json#rise-of-empires-ice-and-fire-gems-generator-az.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1973,
      "fullName": "rise-of-empires-ice-and-fire-gems-generator-az.nuspec",
      "length": 4733,
      "name": "rise-of-empires-ice-and-fire-gems-generator-az.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.13.02.26.28/rise-of-empires-ice-and-fire-gems-generator-az.1.0.0.json#_rels%5C.rels",
      "@type": "PackageEntry",
      "compressedLength": 303,
      "fullName": "_rels\\.rels",
      "length": 540,
      "name": ".rels"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.13.02.26.28/rise-of-empires-ice-and-fire-gems-generator-az.1.0.0.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9468,
      "fullName": ".signature.p7s",
      "length": 9468,
      "name": ".signature.p7s"
    }
  ],
  "tags": [
    "Rise",
    "Of",
    "Empires",
    "Ice",
    "And",
    "Fire",
    "Gems",
    "Generator",
    "how",
    "do",
    "i",
    "hack",
    "can",
    "does",
    "work",
    "is",
    "safe"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}