{
  "@id": "https://api.nuget.org/v3/catalog0/data/2015.05.22.08.03.11/aspose.diagram.5.3.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "Aspose",
  "catalog:commitId": "51ced16f-38a7-481a-9fa7-11c32cc3eb8f",
  "catalog:commitTimeStamp": "2015-05-22T08:03:11.0496045Z",
  "copyright": "© Aspose 2002-2013. All Rights Reserved.",
  "created": "2015-05-22T08:02:15.887Z",
  "description": "Aspose.Diagram is a class library for working with Microsoft Visio files. It allows developers to create new diagrams and work with VSD, VSDX, VSS, VST, VSX, VTX, VDW and VDX files on ASP.NET web applications, web services and Windows applications. It allows you to open files and manipulate the elements of the diagram, from lines and fills, to more complex elements, and then export to VDX, VSX, VTX, XPS, HTML, SVG, SWF, XAML, image or PDF formats.",
  "iconUrl": "http://www.aspose.com/images/products/dotnet/Aspose.Diagram_128x128.png",
  "id": "Aspose.Diagram",
  "isPrerelease": false,
  "lastEdited": "0001-01-01T00:00:00Z",
  "licenseUrl": "http://www.aspose.com/corporate/purchase/end-user-license-agreement.aspx",
  "listed": true,
  "packageHash": "yc2WgSHRvwMRVr+1HbBw7V7f87lTCj+Vqy42mr3aLPxh1kbgW2UfGPR+/Wzlat+AFX0GmbKCX0OvxGXDKZ6OAQ==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 7318894,
  "projectUrl": "http://www.aspose.com/categories/.net-components/aspose.diagram-for-.net/default.aspx",
  "published": "2015-05-22T08:02:15.887Z",
  "releaseNotes": "This release introduces the features, enhancements,task and bug fixes as detailed below:\n\n    Bugs  \n    \n   DIAGRAMNET-50259-VSD to PDF export, extra white space on the left and right side of the drawing\n   DIAGRAMNET-50260-VSD to PNG export, extra white space on the left and right side of the drawing\n   DIAGRAMNET-50414-VSD to VDX conversion, Invalid XML error occurred\n   DIAGRAMNET-50415-VSD to PDF conversion, the output PDF document is blank   \n   DIAGRAMNET-50416-VSD to PDF conversion, the output PDF document is blank\n   DIAGRAMNET-50419-VSDX to SVG conversion, incorrect rendering of the hyperlinks      \n   DIAGRAMNET-50421-VSDX to PDF conversion, white space around the actual diagram\n   DIAGRAMNET-50422-VSDX to PDF conversion, the border line of the diagram is not preserved properly\n   DIAGRAMNET-50423-VSD to PDF conversion, the output PDF document is blank\n   DIAGRAMNET-50425-Diagram exception occurred while loading VSD file  \n   DIAGRAMNET-50426-VSDX to PDF conversion, the spaces between the text lines are not equivalent\n   DIAGRAMNET-50427-VSDX to PDF conversion, incorrect font name, size and line breaks\n   DIAGRAMNET-50428-VSDX to PDF conversion, tabs and spaces are ignored between the words\n   DIAGRAMNET-50429-VSDX to HTML conversion, the spaces between the text lines are not equivalent\n   DIAGRAMNET-50430-VSDX to HTML conversion, incorrect font name, size and line breaks\n   DIAGRAMNET-50431-VSDX to HTML conversion, tabs and spaces are ignored between the words\n   DIAGRAMNET-50435-Change Aspose.Diagram Package zip and PdfLicense folder names\n   DIAGRAMNET-50436-Remove Examples Dashboard from installer and DLL version\n   DIAGRAMNET-50440-VST to VDX conversion, macro modules are not preserved\n   DIAGRAMNET-50441-Shape is missing from the output HTML format",
  "requireLicenseAcceptance": true,
  "summary": "Aspose.Diagram is a class library for working with Microsoft Visio files.",
  "title": "Aspose.Diagram for .NET",
  "version": "5.3.0",
  "tags": [
    "Visio",
    "Diagram",
    "Aspose.Diagram",
    "VSD",
    "VSS",
    "VST",
    "VSX",
    "VTX",
    "VDW",
    "VDX"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    }
  }
}