{
  "@id": "https://api.nuget.org/v3/catalog0/data/2015.02.23.17.09.56/percolatoranalysisservices.0.2.1.2.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "Matt Hallmark",
  "catalog:commitId": "36ce1eef-bfeb-4157-a8b1-5a26062cdd5c",
  "catalog:commitTimeStamp": "2015-02-23T17:09:56.9953061Z",
  "copyright": "Copyright ©  2014, CoopDIGITy Inc",
  "created": "2015-02-18T17:05:13.367Z",
  "description": "A LINQ to MDX Psued-O-RM for Microsoft SQL Server Analysis Services",
  "iconUrl": "http://www.coopdigity.com/wp-content/uploads/2014/04/logo3.png",
  "id": "PercolatorAnalysisServices",
  "isPrerelease": false,
  "lastEdited": "2015-02-23T17:09:53.437Z",
  "licenseUrl": "http://opensource.org/licenses/MIT",
  "packageHash": "1X9g2aBZ7EY+x7l6BcQyuk5jF3sIc+PDb1JPakHZH8SmVICxQOQTvJJ34QpdjR+a5Bls55UXS7jyYeeDK2Y6bw==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 63672,
  "projectUrl": "http://www.coopdigity.com/products/percolator-analysis-services/",
  "published": "1900-01-01T00:00:00Z",
  "releaseNotes": "Finally, a way to query a Microsoft SQL Server Analysis Database with LINQ and type safe objects! \n\nBeta version - Comes without any warranties.  Please contact me via the \"Contact Owners\" link for any questions, comments, bugs, or features you think should be included. Any input is GREATLY appreciated. Make sure to read the \"Documentation\" text file that is included with the package. \n\nBeta Version 0.2 is here!\n\nIssues:\n    -An issue was found where a created member is sometimes added to an axis multiple times. This is being worked on.\n\nA big thanks goes out to Miguel Correia and Nuno Braz Oliveira for helping me find a lot of these bugs and lack of features, and really putting this project through the ringer! \n\nSome of these features were implemented due to them requesting more functionality. So if you wish to see something, or have a bug, TELL US! We do listen, I promise. \n\nFixes: \n    -Fixed the mapping issue with the Percolate method.\n    -Added some checks in the Include and Generator ttinclude files to strip out hyphens and periods.\n    -Hierarchies now translate instead of resulting in an empty string.\n    -Level members are now specified with multiple indexes.\n    -Cube names are now correctly referenced from the attribute, not the type name.\n\t\nChanges:\n\n    -Namespace changes\n        *Percolator.AnalysisServices\n            -Contains some base classes in the library.\n        *Percolator.AnalysisServices.Linq\n            -Contains the bulk of the objects used in MDX queries, as well as some other functionality.\n        *Percolator.AnalysisServices.Attributes\n            -Contains various attributes like the \"Tag\" or \"MapTo\" attributes.\n   \n    -TT Generator changed to only generate each dimension once, and then distribute each dimension to each cube thats uses said dimensions.\n    \n   -TT file allows the user to choose on generating non visible objects.\n\t\nFeatures: \n    -Added \"Create\" static method to sets and members for easy assembly.\n    \n    -PAS explicit changes\n\t*New methods replace old clunky ones. \"OnRows\" and \"OnColumns\" have been replaced with \"OnAxis\", and the other methods have changed as well to reflect a more \"Linq-ish\" query approach.\n\t*Object mapping via the \"Percolate<>\" method now allows the user to map to an object when the axis selections are no more than two.\n    \n    -Added extension methods to set Non Empty axes in LINQ query\n    \n    -Operator overloads - \"*\" and \"&\" - now allow the user to create cross joined and tuple sets on the fly.\n\nNotes:\n    -Although not listed as a dependency, some of the classes used in this library belong to the Microsoft.AnalysisServices.AdomdClient dll.  The project itself doesn't require the user to have this in the project to run, but some query methods allow the user to return a \"CellSet\" or \"AdomdDataReader\", which do belong to the AdomdClient dll.\n\n    -A preliminary product page has been setup on our site containing the documentation of this project.  If you would like to see it before downloading it, click the \"Product Site\" link to the left. Also, visit us at www.coopdigity.com.\n\n    -This product is still being developed, but soon we may be pulling it out of beta and releasing it as a full release.  Once we do that, it will more than likely be open sourced.  Until then, if you require the source code to work it into your project, that may be arranged. Contact us and we will get back to you on it.\n\n    -Thank you to everyone who has provided feedback! This project has been under continual development because you guys have been asking for more! Again, PLEASE contact us for any bug issues, questions, or features you would like to see.",
  "requireLicenseAcceptance": true,
  "summary": "A LINQ to MDX Psued-O-RM for Microsoft SQL Server Analysis Services",
  "title": "Percolator Analysis Services (Beta)",
  "version": "0.2.1.2",
  "tags": [
    "mdx",
    "linq",
    "linqtomdx",
    "orm",
    "percolator",
    "PAS",
    "mdxorm",
    "mdxlinq",
    "ssas"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    }
  }
}