{
  "@id": "https://api.nuget.org/v3/catalog0/data/2024.10.01.19.41.17/datajuggler.blazor.components.8.11.1.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "DataJuggler",
  "catalog:commitId": "389c5404-fc7f-498c-b998-7198d62dfbb8",
  "catalog:commitTimeStamp": "2024-10-01T19:41:17.0449968Z",
  "copyright": "2023 - Data Juggler - Use For Anything You Want, No Warranty.",
  "created": "2024-10-01T19:38:02.45Z",
  "description": "This project consists of an ImageButton, ProgressBar, Sprite, TextBoxComponent which can display as a TextBox, Multi-line TextBox or a CheckBox, a ComboBox, CheckedListComboBox, CheckedListBox, Grid, Label and a brand new Calendar Component.\n\n\t\tThe CSS file DataJuggler.Blazor.Components.css contains many useful classes to help style\n\t\tand position objects.\n\n\t\tThis version is for .Net 8.0.",
  "iconFile": "Merge Boxes Small.png",
  "id": "DataJuggler.Blazor.Components",
  "isPrerelease": false,
  "lastEdited": "2024-10-01T19:40:59.12Z",
  "licenseFile": "License.txt",
  "licenseUrl": "https://aka.ms/deprecateLicenseUrl",
  "listed": true,
  "packageHash": "Hxty6qMypZBhrZCgREoxj7dsBrSGujrVFq3f/5/Ix/7IDtzFovAQ9cKO06m2WJlgPtg6V6hNp8Ebdc/WKmpN4Q==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 387054,
  "projectUrl": "https://github.com/DataJuggler/DataJuggler.Blazor.Components",
  "published": "2024-10-01T19:38:02.45Z",
  "readmeFile": "README.md",
  "releaseNotes": "Version 8.0.0: This project has been updated to .NET 8. \n\t\t\n\t\tVersion 7.14.0: I added a Label component.\n\t\t\n\t\tVersion 7.13.7: Updated the Read Me with information about the new video.\n\t\t\n\t\tVersion 7.13.6:\n\t\tNew Video: \n\t\t\n\t\tHow To Use The Grid\n\t\thttps://youtu.be/_qDo9pNT5a8\n\n\t\tVersion 7.13.5\n\t\tNovermber 7, 2023: DataJuggler.Blazor.Components passed 100,000 Downloads\n\t\tI updated the Grid and created a new sample project to demo the Grid.\n\n\t\tThe sample project is called BubbleReportWeb\n\t\thttps://github.com/DataJuggler/BubbleReportWeb\n\n\t\tVersion 7.12.8\n\t\tNovember 2, 2023: I added a ClassName parameter to the Grid\n\n\t\tAugust 26, 2023: In celebration of 75,000 NuGet installs, I added two new features.\n\t\tFirst, I created a CheckedListBox component. I also added a new feature to the ComboBox,\n\t\tand that new features is a CheckedListMode. The combobox now supports check boxes and\n\t\tmultiple selections.\n\n\t\tAugust 13, 2023: DataJuggler.UltimateHelper and DataJuggler.Excelerate were updated.\n\n\t\tJuly 22, 2023: More updates  to NuGet package DataJuggler.Excelerate, and I need this update for my project\n\t\tBlazor Excelerate\n\n\t\tJuly 21, 2023: I updated NuGet package DataJuggler.Excelerate, and I need this update for my project\n\t\tBlazor Excelerate\n\n\t\tJuly 18, 2023: I fixed the checkbox component. The binding wasn't working when I thought I fixed it last time.\n\n\t\tJuly 9, 2023: I removed floats from the ComboBox component. I was having trouble \"stacking\" a TextBoxComponent\n\t\tbelow a ComboBox, so hopefully this fixes it. I also added a ComboBoxWidth parameter property on the ComboBox.\n\n\t\tJuly 6, 2023: I added an AutoComplete property, which defaults to false.\n\t\tThe reason for this is browsers like to fill in values, and the browser is confusing Email Address and User Name fields.\n\n\t\tJuly 2, 2023: I removed the floats from the TextBoxComponent. This will probably break\n\t\tsome existing users, but I am trying to make the control more consistant to work with.\n\t\tI also added a MarginBottom property. Use this in conjunction with the HeightUnit, which\n\t\tdefaults to px (pixels) and the MarginBottom is set to 8 by default.\n\n\t\tJune 3, 2023 B: I updated the Sprite component to have a SetVisible and optional parameter for Hide\n\t\twhen you call Stop.\n\n\t\tJune 3, 2023: My first attempt at Disabled for the Validation Component was wrong. I think my fix will work. Testing now.\n\n\t\tJune 2, 2023: I added an Enabled property and a method SetEnabled to the validation component.\n\t\tIf Enabled is false, disabled will appear in the input objects and be read only.\n\n\t\tMay 12, 2023: I updated the validation message to do a replace on Caption if it has colons in it. So you\n\t\tcan say User Name 'XYZ' is already taken, without it appearing 'User Name: 'XYZ'.\n\n\t\tMay 7, 2023: While working on a project, I noticed the LabelWidth doesn't work if the Column1Width is\n\t\ttoo small. I added code to LabelWidth to set Column1Width if it is too narrow. The order parameters\n\t\tare set can affect this. I also realized LabelTop was not used, so I added LabelTop to Column1 (CssClass).\n\n\t\tFeb. 22, 2023: I added LabelClassName to the ComboBox.\n\t\tI also added LabelLeft and LabelTop to the ComboBox.\n\n\t\tFeb. 1, 2023: I updated the CSS class with a clear class.\n\n\t\tJanuary 21, 2023: I was having a problem with Nuget packages being built. Not sure what broke.\n\t\tTesting again.\n\n\t\tDec 28, 2022\n\t\tv7.4.19-rc1: I am expirementing with Position Sticky for the button. The button is moving on me and I am trying\n\t\tto prevent that.\n\n\t\tDec 27, 2022\n\t\tv7.4.18: Float Left didn't work, so the 7.4.18-RC1 is removed.\n\n\t\tv7.4.6\n\t\t12.26.2022: The button in the grid didn't work first attempt. May try again later. I removed\n\t\tthe Parameter tag from the ImageButton ClickHandler property.\n\n\t\tv7.4.1\n\t\t12.25.2022: I am testing a button for a column in the grid.\n\n\t\t12.21.2022: Trying another way to do visibibility of the ComboBox.\n\n\t\t12.19.2022: I am cleaning up the TextBoxComponent.\n\n\t\t12.18.2022 B: I accidently left a color red in I was using for placement issues.\n\n\t\t12.18.2022: I finally fixed the TextBoxComponent. You should be able to just\n\t\tcreate one and set a few properties and have them line up correctly now.\n\n\t\t12.17.2022: I added an AutoComplete parameter to the TextBoxComponent.\n\t\tTrying to prevent browsers from filling in forms if you set this to false.\n\t\tAlso added Float Left to the Label and TextBox so that they stay inline better.\n\n\n\t\t12.16.2022: The ComboBox was defaulting to TextSizeEnum.Large. I fixed this to\n\t\tuse the TextSize default setting of Medium.\n\n\t\t12.11.2022: I changed the way Height & Width work again for the TextBoxComponent. I over complicated this at first by having\nTextBoxHeight / Width and a Control Height / Width. Now the Height & Width is applied to the TextBox.\nI added a HeightUnit property. I also added two parameter properties: ExternalId and ExternalIdDescription.\nNamedParameter also added the same two properties, and the values are set when the Enter key is pressed.\nA added a 'SendAllTextToParent' boolean property to the TextBoxComponent. I also added a method\nSetTextColor. I added a Refresh method to the ImageButton. I added an EditorClassName to the column object\nso you can style columns. I now use Column.ZIndex for the ZIndex for the edit display control. I removed\nthe EditZIndex property from the Grid.\n\n12.10.2022: I added a ShowCaption parameter to the TextBoxComponent. If the Caption parameter is set,\nShowCaption is set to true, else the caption will not show.\nI also changed the way Width and Height work. Now there is a Unit (string) property, and HeightStyle & WidthStyle.\nThese two read only properties return Height + Unit and Width + Unit.\n\n12.5.2022: I added an EditZIndex property to the grid. So the validation component used to edit has a z index.\n\n12.4.2022 C: I updated DataJuggler.Excelerate to the latest version which includes Row.FindColumnById.\n\n12.4.2022 B: I realized there can be more than one column needing to be edited, so I added Column.EditMode.\nOnly the column with Column.EditMode will show.\n\n12.4.2022: I changed how the grid works for entering EditMode. The grid now uses EditorText property\ninstead of Column.ColumnText when entering Edit Mode. If EditText is not set, EditorText returns ColumnText.\n\n12.3.2022: I realized today I did not have Visible defaulting to true on the TextBoxComponent.\n\n12.2.2022: Attempting to have the TextBoxComponent also SelectAll when it gets focus. Making it easier\nto change existing text. I also added a property Visible and a Property for Display. The css class \nnamed DisplayStyle is set to none if Visible = false, else Display is used. The default display\nif nothing is set is inline-block.\n\n\n12.1.2022: I fixed the TextBoxComponent to send an EnterPressed message to a parent. Before it would\nonly send the message if in a grid. I have the edit in place working for a client's project with both the grid\nand the TextBoxComponent. \n\n11.30.2022: I added some code to the validation component that should set focus to existing text when you\nset focus to the text in a textbox when you enter it. Not sure if I can make this a toggleable feature.\nI also updated the way Escape is handled in the grid. I also changed the CSS so the textbox appears inline\nat closer to the place where the read only display control was. Need to make this a parameter.\n\n11.29.2022: I am attempting to have the grid go into edit mode in the same location as the cell being edited.\nI am testing hitting Escape to have the grid exit edit mode. I have the grid exiting Edit Mode, but a call to\nthe parent that displays the data seems necessary.\n\n11.28.2022: I added the property Sender = this to the Grid when the Enter Key is pressed.\nI also set the SetFocus part to be in a Try Catch in case it is able to trap the error caused by SetFocus\nif a control is not visible.\n\n11.21.2022: I added two properties to the Grid component:\nExternalId - an Id such as a Table Id or other ways to identify how to save the data.\nExternalIdDescription - A string to help identify the ExternalId.\n\n11.19.2022: The ComboBox was ignoring the TextColor when you Expand or Close the ComboBox.\nI added a bool property for Rendered. The first pass I change the text color. Also, the TextSize for\nthe ComboBox and the ImageButton was just changed to use \"em\" instead of \"vh\".\nThe text size should change with zoom.\n\n11.18.2022: I am working on the ComboBox. I added a new theme for Black. It might not be working right,\nso use with caution at the moment.\n\n11.16.2022 C - I am working on the ImageButton and the ComboBox which uses the ImageButton.\nThings might change in the near future as I work through them.\n\n11.18.2022: I finally have the ComboBox working. More samples coming soon.\n\n11.16.2022 B: I changed WidthStyle to be a read only property. For some reason I am having trouble\ngetting the ComboBox to show up in a new project. \n\n11.16.2022: A newer veresion of DataJuggler.Excelerate was updated.\n\n11.15.2022: I added a Grid and updated the CSS file DataJuggler.Blazor.Components.\n\n11.10.2022: The grid is currently working in read only mode.\nI am working on being able to edit in place. I should have a demo project ready later this year.\n\n11.8.2022: This project has been updated to .NET 7.\nUse a 6.x version for .NET 6.\n\n11.15.2022: The Grid is working. I will publish some examples after I finish my clients project.\nAlso updates the CSS file with values of: \n\ndown(0 - 1000)\nleft(0 - 1000)\nright(0 - 1000)\nup(0 - 1000)\n\nExample:\ndown7\nright400\n\n11.8.2022: I am working on a Grid. The grid is a work in progress.\n\n10.20.2022: This version has been updated to .NET7.\n11.03.2022: I am working on a .NET 7 version. This includes a new Grid component.\n\n3.26.2022: Twitter barred me, so I removed the Twitter button from two of my sites, plus Bootstreap from all of\nmy packages and libraries. I don't use it. Motivated me to build a site to put them out of a business.\n\t\t\n1.23.2022: Version 6.0.0 has been released, which now targets .NET6.\n\t\n11.11.2021: \nVersion 5.0.0: Changed back to .Net 5.0, and changed the version number to match. .Net 6.0 is not ready\nfor production at this time (for my projects, which is all that matters).\n\t\t\n11.10.2021\nVersion 2.0.0: I updated to version 6.0. I tried to multi-target version 5.0 and version 6.0, but \nAspNet.Core.Components version 6.0 does not let you target .Net5.0.\n\t\t\nI want to take advantage of any speed improvements for 64 bit for \nPixelDatabase.Net website (https://pixeldatabase.net), so I am updating to 6.0.\n\t\t\nVersion 1.7.2 is the last .Net 5.0 version most likely. Sorry for any inconvenience, but I usually\nonly do new development on the latest unless I have a client that can't upgrade.\n\t\t\n11.7.2021\nVersion 1.7.2: The Nuget package DataJuggler.UltimateHelper was updated, so I released a new version of this\ncomponent.\n\n11.1.2021\nVersion 1.7.1: DataJuggler.UltimateHelper was updated, so I updated this project. No code changes.\n\n10.24.2021\nVersion 1.7.0: I updated to version 1.7 since I added a bunch of properties to many components.\n\n10.23.2021\nVersion 1.6.7: checking in with a few fixes and properties added for positioning elements.\n\n10.23.2021\nVersion 1.6.6: I added a few ZIndex properties to the ComboBox, and also I added a ZIndex property to the TextBoxComponent. I had an issue where the ComboBox when it dropped down was behind another item.\n\n10.19.2021\nVersion 1.6.5: I started working on Animating sprites. The current implentation has too much flickering. I read about ways to double buffer and smooth it out, but for now it was just an idea I wanted to add to my new project\nBlazor.Excelerate. If my animation could have been done in a few hours I would have included, but\nfor now I will just publish it and make this a 'nice to have feature if I ever get bored'.\n\n10.16.2021\nVersion 1.6.4: I added a SetVisible method and a Visible parameter to the ImageButton.\n\n10.14.2021\nVersion 1.6.3: Added Top and Left properties to the TextBoxComponent.\n\n10.14.2021\nVersion 1.6.2: I did some more testing and the ComboBox and ImageButtons had some improvements made.\n\n1.6.0: Added two new methods to the TextBoxComponent:\nSetTextValue\nSetCheckBoxValue\n\n1.5.12: Add the TextBoxHeight didn't do anything, since I forgot to apply it to the TextBoxCSS. Now fixed.\n\n1.5.11: The Height property needed a TextBoxHeight property also.\n\n1.5.10: I added a Height property. This is needed when Multiline is set to true. I also added a DefaultTextBoxHeight and MultilineTextBoxHeight. These have default values of 3.2 and 8 for now as I test, but can be set in your implementation. When setting Multiline to true, I needed a value to change the height to.\n\n1.5.9: I changed the default TextBoxWidth to 30 from 76, which messed up existing users\n\n1.5.8: I added a property 'TextBoxWidth', which is a double and set the value for TextBoxWidthPercent, a string.\n\n1.5.7: I added a Width property to the TextBoxComponent. This value is in percentage, and it defaults to 80 percent. Not sure if 80 is the right value or not. I also changed the Text-Align property to top for the label. This may need to be a Parameter.\n\n1.5.6: I forgot to add the Parameter tag to the Multiline propery.\n\n1.5.5: I added a Multiline propery to for description or long text fields\n\n1.5.4: I added the tag Parameter to the TextBoxComponent.LabelColor and TextBoxBackColor.\n\n1.5.2: I had a problem publishing a .Net 5 project, trying again.\n\nVersion 1.5.1: I accidently marked this project as depreciated, when I was having a temporary problem with my BlazorFileUpload component converting it to .Net 5. That has been resolved. \n\nVersion 1.5.0 - I updated to .Net 5.\n\n1.5.0: .Net 5.0 conversion of Nuget packages and Target Framework.\n\nNew version 1.4\nValidation Component\n\n1.4.11 - For some reason I added Open and Close curly brackets to a Blazor Styled Class.\nOops. Time for bed soon.\n\n1.4.10 - I was not using the Css classes that were in this library, except for the circle.scss, so I removed them.\nI also added some properties for the ValidationControl to help style it outside of this component.\n\n1.4.9 - I added CheckBoxXPostion and CheckBoxYPostion and got rid of CheckBoxVerticalPosition.\nSorry for the incovenience if you upgraded.\n\n1.4.8 - This is the same as 1.4.6. I have to update the control more carefully because I broke everything.\nI really hope this works.\n\n1.4.7 - Rolled Back Due To Errors Found After Publish\n\n1.4.6 - I made a breaking change to the Sprie component, but now when you set Sprite.Height or Width, it translates to HeightStyle = Height + \"vh\" and setting Width sets WidthStyle to Width + \"%\".\nPreviously it was set to HeightPixels and WidthPixels, and this causes zoom differences in a site.\n\n1.4.5 - I changed the XPosition and YPosition values to set XPositionStyle and YPositionStyle instead of\nXPositionPixels and YPositionPixels, because I changed the value to use % for X and vh for Y to make\nit scale better. Using px makes cites appear differently depending on zoom values.\n\n1.4.4 - I forgot to add the Opacity property to the sprity. Oops.\n\n1.4.3 - I added an Opacity property to the Sprity component. \n\n1.4.2 - I added a new property called CheckBoxVerticalPosition to the ValidationControl. This is only applicable\nwhen CheckBoxMode = true.\n\n1.4.1 - I fixed the images for UniqueImageUrl and TakenImageUrl to be embedded in the component.\n\n1.4.0 - I added a new TextBoxComponent.\n\n1.3.5 - I added a SetClientHandledIncrement method so I can turn this value on or off from outside the component.\n\n1.3.4 - I got this working finally. The property Important was needed to make the text color override.\nI actually am not using Blazor Styled for the Progress Bar now, which makes setup just add the Nuget package and the Css reference to Circles.css, which is easier for everyone.\n\n1.3.3 - I added 3 new Parameters:\nSize: Size, Small - Medium - Large - Medium is default\nColor: Blue, Green or Orange, Blue is Default\nTheme: Light or Dark, and I chose Dark as default\n\nAlso, two properties for Text:\nOverrideThemeColorForText - defaults to false.\nIf true, and a TextColor is provided, the TextColor will be used instead of the Theme color for Text.\n\nTextColor - The color to use for Text.\n\n\n1.3.2 - This actually works now. I am working on the documentation now for the new features.\n\n1.3.1 - I included the div for progresscontainer, which is meant to be used by the client, or I may expose a class for it soon.\n\n1.3.0 - My progress bar went from little league to the minors with this upgrade. I found a pure CSS way, and it works really well. Themes and more are coming, this is the first release, so it is back in beta.\n\n1.2.1 - I realzied my TextBoxComponent had a lot of code specific to my project PixelDatabase.Net, so I removed it for now. I will update it again later.\n\n1.2.0 - I added a new component called a TextBoxComponent.\nI also removed the ProgressBar from the Sprite Interface.\nI will update the Progress Bar in the near future, as I found a pure CSS way that is pretty cool.\n\n\n1.1.2 - I added a BackgroundColor property. To use it, you must set BackgroundImage to an empty string to override DarkBackground image.\n\n1.1.1 - The new ProgressBar now has a Theme for Circles or Squares. Also, I updated the Nuget packages to multi-target so .Net Standard and .Net Core can use them, without having to use the .Net Framework classes.\n\n1.1.0 - I didn't like my first progressbar as once I started testing in a real world environment it looked very choppy and was a little too futuristic to be used in most apps. This new look is pretty clean and their is a Theme option now for Squares or Circles.\n\n1.0.7 -After removing BlazorComponentBase class, OnComponentRegistered was no longer needed, so I removed it.\n\n1.0.6 - BlazorComponentBase class didn't seem to work as I expected, so I killed it.\n\n1.0.5 - I created a new BlazorComponentBase class and added a new method to IBlazorComponentParent called OnComponentRegistered.\n\n1.0.4 - I created two new classes NamedParameter and Message. \nA message contains a Text property a collection (Generic List) of NamedParameters.\n\nThis is a breaking change of the ReceiveData methods for the IBlazorComponent and IBlazorComponent parent .\nNow is the time to break anything.\n\n\n1.0.3 - I added two generic interfaces for IBlazorComponent and IBlazorComponent interface.\n\n1.0.2 - I added Scale property to the ProgressBar to make it easy to adjust the size.\n\n1.0.1 - I added a Sprite component.\n\n1.0.0 This is the first version I am releasing along with a Sample.",
  "repository": "",
  "verbatimVersion": "8.11.1",
  "version": "8.11.1",
  "dependencyGroups": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2024.10.01.19.41.17/datajuggler.blazor.components.8.11.1.json#dependencygroup/net8.0",
      "@type": "PackageDependencyGroup",
      "dependencies": [
        {
          "@id": "https://api.nuget.org/v3/catalog0/data/2024.10.01.19.41.17/datajuggler.blazor.components.8.11.1.json#dependencygroup/net8.0/datajuggler.blazorstyled",
          "@type": "PackageDependency",
          "id": "DataJuggler.BlazorStyled",
          "range": "[8.0.0, )"
        },
        {
          "@id": "https://api.nuget.org/v3/catalog0/data/2024.10.01.19.41.17/datajuggler.blazor.components.8.11.1.json#dependencygroup/net8.0/datajuggler.excelerate",
          "@type": "PackageDependency",
          "id": "DataJuggler.Excelerate",
          "range": "[8.0.10, )"
        },
        {
          "@id": "https://api.nuget.org/v3/catalog0/data/2024.10.01.19.41.17/datajuggler.blazor.components.8.11.1.json#dependencygroup/net8.0/datajuggler.ultimatehelper",
          "@type": "PackageDependency",
          "id": "DataJuggler.UltimateHelper",
          "range": "[8.1.3, )"
        },
        {
          "@id": "https://api.nuget.org/v3/catalog0/data/2024.10.01.19.41.17/datajuggler.blazor.components.8.11.1.json#dependencygroup/net8.0/microsoft.aspnetcore.components",
          "@type": "PackageDependency",
          "id": "Microsoft.AspNetCore.Components",
          "range": "[8.0.8, )"
        },
        {
          "@id": "https://api.nuget.org/v3/catalog0/data/2024.10.01.19.41.17/datajuggler.blazor.components.8.11.1.json#dependencygroup/net8.0/microsoft.aspnetcore.components.web",
          "@type": "PackageDependency",
          "id": "Microsoft.AspNetCore.Components.Web",
          "range": "[8.0.8, )"
        }
      ],
      "targetFramework": "net8.0"
    }
  ],
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2024.10.01.19.41.17/datajuggler.blazor.components.8.11.1.json#DataJuggler.Blazor.Components.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 7637,
      "fullName": "DataJuggler.Blazor.Components.nuspec",
      "length": 20883,
      "name": "DataJuggler.Blazor.Components.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2024.10.01.19.41.17/datajuggler.blazor.components.8.11.1.json#lib/net8.0/DataJuggler.Blazor.Components.dll",
      "@type": "PackageEntry",
      "compressedLength": 68454,
      "fullName": "lib/net8.0/DataJuggler.Blazor.Components.dll",
      "length": 200704,
      "name": "DataJuggler.Blazor.Components.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2024.10.01.19.41.17/datajuggler.blazor.components.8.11.1.json#staticwebassets/Images/Buttons/BlackButton.jpg",
      "@type": "PackageEntry",
      "compressedLength": 3360,
      "fullName": "staticwebassets/Images/Buttons/BlackButton.jpg",
      "length": 4435,
      "name": "BlackButton.jpg"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2024.10.01.19.41.17/datajuggler.blazor.components.8.11.1.json#staticwebassets/Images/Buttons/BlackButtonWide.jpg",
      "@type": "PackageEntry",
      "compressedLength": 4241,
      "fullName": "staticwebassets/Images/Buttons/BlackButtonWide.jpg",
      "length": 5764,
      "name": "BlackButtonWide.jpg"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2024.10.01.19.41.17/datajuggler.blazor.components.8.11.1.json#staticwebassets/Images/Buttons/BlackTriangleClosed.png",
      "@type": "PackageEntry",
      "compressedLength": 1971,
      "fullName": "staticwebassets/Images/Buttons/BlackTriangleClosed.png",
      "length": 1972,
      "name": "BlackTriangleClosed.png"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2024.10.01.19.41.17/datajuggler.blazor.components.8.11.1.json#staticwebassets/Images/Buttons/BlackTriangleOpen.png",
      "@type": "PackageEntry",
      "compressedLength": 1509,
      "fullName": "staticwebassets/Images/Buttons/BlackTriangleOpen.png",
      "length": 1504,
      "name": "BlackTriangleOpen.png"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2024.10.01.19.41.17/datajuggler.blazor.components.8.11.1.json#staticwebassets/Images/Buttons/BlueDownArrowGray32.png",
      "@type": "PackageEntry",
      "compressedLength": 1599,
      "fullName": "staticwebassets/Images/Buttons/BlueDownArrowGray32.png",
      "length": 1594,
      "name": "BlueDownArrowGray32.png"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2024.10.01.19.41.17/datajuggler.blazor.components.8.11.1.json#staticwebassets/Images/Buttons/BlueUpArrowGray32.png",
      "@type": "PackageEntry",
      "compressedLength": 1511,
      "fullName": "staticwebassets/Images/Buttons/BlueUpArrowGray32.png",
      "length": 1506,
      "name": "BlueUpArrowGray32.png"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2024.10.01.19.41.17/datajuggler.blazor.components.8.11.1.json#staticwebassets/Images/Buttons/BrownTriangleClosed.png",
      "@type": "PackageEntry",
      "compressedLength": 3423,
      "fullName": "staticwebassets/Images/Buttons/BrownTriangleClosed.png",
      "length": 3457,
      "name": "BrownTriangleClosed.png"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2024.10.01.19.41.17/datajuggler.blazor.components.8.11.1.json#staticwebassets/Images/Buttons/BrownTriangleOpen.png",
      "@type": "PackageEntry",
      "compressedLength": 2942,
      "fullName": "staticwebassets/Images/Buttons/BrownTriangleOpen.png",
      "length": 2971,
      "name": "BrownTriangleOpen.png"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2024.10.01.19.41.17/datajuggler.blazor.components.8.11.1.json#staticwebassets/Images/Buttons/TriangleButtonClosed.png",
      "@type": "PackageEntry",
      "compressedLength": 3372,
      "fullName": "staticwebassets/Images/Buttons/TriangleButtonClosed.png",
      "length": 3417,
      "name": "TriangleButtonClosed.png"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2024.10.01.19.41.17/datajuggler.blazor.components.8.11.1.json#staticwebassets/Images/Buttons/TriangleButtonOpen.png",
      "@type": "PackageEntry",
      "compressedLength": 2942,
      "fullName": "staticwebassets/Images/Buttons/TriangleButtonOpen.png",
      "length": 2971,
      "name": "TriangleButtonOpen.png"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2024.10.01.19.41.17/datajuggler.blazor.components.8.11.1.json#staticwebassets/Images/Buttons/VCRFirstSmall.png",
      "@type": "PackageEntry",
      "compressedLength": 1117,
      "fullName": "staticwebassets/Images/Buttons/VCRFirstSmall.png",
      "length": 1112,
      "name": "VCRFirstSmall.png"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2024.10.01.19.41.17/datajuggler.blazor.components.8.11.1.json#staticwebassets/Images/Buttons/VCRLastSmall.png",
      "@type": "PackageEntry",
      "compressedLength": 1124,
      "fullName": "staticwebassets/Images/Buttons/VCRLastSmall.png",
      "length": 1119,
      "name": "VCRLastSmall.png"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2024.10.01.19.41.17/datajuggler.blazor.components.8.11.1.json#staticwebassets/Images/Buttons/VCRNextSmall.png",
      "@type": "PackageEntry",
      "compressedLength": 749,
      "fullName": "staticwebassets/Images/Buttons/VCRNextSmall.png",
      "length": 744,
      "name": "VCRNextSmall.png"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2024.10.01.19.41.17/datajuggler.blazor.components.8.11.1.json#staticwebassets/Images/Buttons/VCRPrevSmall.png",
      "@type": "PackageEntry",
      "compressedLength": 757,
      "fullName": "staticwebassets/Images/Buttons/VCRPrevSmall.png",
      "length": 752,
      "name": "VCRPrevSmall.png"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2024.10.01.19.41.17/datajuggler.blazor.components.8.11.1.json#staticwebassets/Images/Failure.png",
      "@type": "PackageEntry",
      "compressedLength": 15431,
      "fullName": "staticwebassets/Images/Failure.png",
      "length": 15496,
      "name": "Failure.png"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2024.10.01.19.41.17/datajuggler.blazor.components.8.11.1.json#staticwebassets/Images/Headers/HeaderBlack.png",
      "@type": "PackageEntry",
      "compressedLength": 12680,
      "fullName": "staticwebassets/Images/Headers/HeaderBlack.png",
      "length": 12934,
      "name": "HeaderBlack.png"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2024.10.01.19.41.17/datajuggler.blazor.components.8.11.1.json#staticwebassets/Images/Headers/HeaderBlue.png",
      "@type": "PackageEntry",
      "compressedLength": 13886,
      "fullName": "staticwebassets/Images/Headers/HeaderBlue.png",
      "length": 14329,
      "name": "HeaderBlue.png"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2024.10.01.19.41.17/datajuggler.blazor.components.8.11.1.json#staticwebassets/Images/Headers/HeaderBrown.png",
      "@type": "PackageEntry",
      "compressedLength": 13751,
      "fullName": "staticwebassets/Images/Headers/HeaderBrown.png",
      "length": 14191,
      "name": "HeaderBrown.png"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2024.10.01.19.41.17/datajuggler.blazor.components.8.11.1.json#staticwebassets/Images/Headers/HeaderDark.png",
      "@type": "PackageEntry",
      "compressedLength": 13860,
      "fullName": "staticwebassets/Images/Headers/HeaderDark.png",
      "length": 14300,
      "name": "HeaderDark.png"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2024.10.01.19.41.17/datajuggler.blazor.components.8.11.1.json#staticwebassets/Images/Headers/HeaderRed.png",
      "@type": "PackageEntry",
      "compressedLength": 13858,
      "fullName": "staticwebassets/Images/Headers/HeaderRed.png",
      "length": 14326,
      "name": "HeaderRed.png"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2024.10.01.19.41.17/datajuggler.blazor.components.8.11.1.json#staticwebassets/Images/Logo%20Black%20Small.png",
      "@type": "PackageEntry",
      "compressedLength": 14839,
      "fullName": "staticwebassets/Images/Logo Black Small.png",
      "length": 14834,
      "name": "Logo Black Small.png"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2024.10.01.19.41.17/datajuggler.blazor.components.8.11.1.json#staticwebassets/Images/Logo%20Black.png",
      "@type": "PackageEntry",
      "compressedLength": 43965,
      "fullName": "staticwebassets/Images/Logo Black.png",
      "length": 43950,
      "name": "Logo Black.png"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2024.10.01.19.41.17/datajuggler.blazor.components.8.11.1.json#staticwebassets/Images/Success.png",
      "@type": "PackageEntry",
      "compressedLength": 12532,
      "fullName": "staticwebassets/Images/Success.png",
      "length": 12533,
      "name": "Success.png"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2024.10.01.19.41.17/datajuggler.blazor.components.8.11.1.json#staticwebassets/Images/darkbackground.png",
      "@type": "PackageEntry",
      "compressedLength": 137,
      "fullName": "staticwebassets/Images/darkbackground.png",
      "length": 230,
      "name": "darkbackground.png"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2024.10.01.19.41.17/datajuggler.blazor.components.8.11.1.json#staticwebassets/background.png",
      "@type": "PackageEntry",
      "compressedLength": 377,
      "fullName": "staticwebassets/background.png",
      "length": 378,
      "name": "background.png"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2024.10.01.19.41.17/datajuggler.blazor.components.8.11.1.json#staticwebassets/css/DataJuggler.Blazor.Components.css",
      "@type": "PackageEntry",
      "compressedLength": 63816,
      "fullName": "staticwebassets/css/DataJuggler.Blazor.Components.css",
      "length": 549507,
      "name": "DataJuggler.Blazor.Components.css"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2024.10.01.19.41.17/datajuggler.blazor.components.8.11.1.json#staticwebassets/css/circle.css",
      "@type": "PackageEntry",
      "compressedLength": 3230,
      "fullName": "staticwebassets/css/circle.css",
      "length": 27525,
      "name": "circle.css"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2024.10.01.19.41.17/datajuggler.blazor.components.8.11.1.json#staticwebassets/css/circle.scss",
      "@type": "PackageEntry",
      "compressedLength": 1277,
      "fullName": "staticwebassets/css/circle.scss",
      "length": 4289,
      "name": "circle.scss"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2024.10.01.19.41.17/datajuggler.blazor.components.8.11.1.json#staticwebassets/exampleJsInterop.js",
      "@type": "PackageEntry",
      "compressedLength": 181,
      "fullName": "staticwebassets/exampleJsInterop.js",
      "length": 235,
      "name": "exampleJsInterop.js"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2024.10.01.19.41.17/datajuggler.blazor.components.8.11.1.json#staticwebassets/favicon.ico",
      "@type": "PackageEntry",
      "compressedLength": 9413,
      "fullName": "staticwebassets/favicon.ico",
      "length": 32038,
      "name": "favicon.ico"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2024.10.01.19.41.17/datajuggler.blazor.components.8.11.1.json#build/Microsoft.AspNetCore.StaticWebAssets.props",
      "@type": "PackageEntry",
      "compressedLength": 1006,
      "fullName": "build/Microsoft.AspNetCore.StaticWebAssets.props",
      "length": 29671,
      "name": "Microsoft.AspNetCore.StaticWebAssets.props"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2024.10.01.19.41.17/datajuggler.blazor.components.8.11.1.json#build/DataJuggler.Blazor.Components.props",
      "@type": "PackageEntry",
      "compressedLength": 81,
      "fullName": "build/DataJuggler.Blazor.Components.props",
      "length": 91,
      "name": "DataJuggler.Blazor.Components.props"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2024.10.01.19.41.17/datajuggler.blazor.components.8.11.1.json#buildMultiTargeting/DataJuggler.Blazor.Components.props",
      "@type": "PackageEntry",
      "compressedLength": 82,
      "fullName": "buildMultiTargeting/DataJuggler.Blazor.Components.props",
      "length": 93,
      "name": "DataJuggler.Blazor.Components.props"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2024.10.01.19.41.17/datajuggler.blazor.components.8.11.1.json#buildTransitive/DataJuggler.Blazor.Components.props",
      "@type": "PackageEntry",
      "compressedLength": 96,
      "fullName": "buildTransitive/DataJuggler.Blazor.Components.props",
      "length": 107,
      "name": "DataJuggler.Blazor.Components.props"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2024.10.01.19.41.17/datajuggler.blazor.components.8.11.1.json#README.md",
      "@type": "PackageEntry",
      "compressedLength": 14284,
      "fullName": "README.md",
      "length": 48456,
      "name": "README.md"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2024.10.01.19.41.17/datajuggler.blazor.components.8.11.1.json#License.txt",
      "@type": "PackageEntry",
      "compressedLength": 751,
      "fullName": "License.txt",
      "length": 1340,
      "name": "License.txt"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2024.10.01.19.41.17/datajuggler.blazor.components.8.11.1.json#Merge%20Boxes%20Small.png",
      "@type": "PackageEntry",
      "compressedLength": 9881,
      "fullName": "Merge Boxes Small.png",
      "length": 11111,
      "name": "Merge Boxes Small.png"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2024.10.01.19.41.17/datajuggler.blazor.components.8.11.1.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 12930,
      "fullName": ".signature.p7s",
      "length": 12930,
      "name": ".signature.p7s"
    }
  ],
  "tags": [
    "Blazor",
    "C#",
    "UI",
    "Components",
    "ProgressBar",
    "Animation",
    "TextBoxComponent"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}