{
  "@id": "https://api.nuget.org/v3/catalog0/data/2024.02.21.14.38.54/hyland.documentfilters.linux.24.1.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "Hyland Software, Inc.",
  "catalog:commitId": "9d27db18-7473-4f5d-8148-b85ae685794b",
  "catalog:commitTimeStamp": "2024-02-21T14:38:54.424757Z",
  "copyright": "(c) 2024 Hyland Software, Inc. and its affiliates. All rights reserved.",
  "created": "2024-02-21T14:36:24.237Z",
  "description": "Document Filters is a toolkit that allows application developers to identify and extract metadata, as well as convert and render almost any file type. It is a core component of many products, but can also be leveraged as a stand-alone service for organizations or application developers.",
  "iconFile": "hyland.png",
  "id": "Hyland.DocumentFilters.Linux",
  "isPrerelease": false,
  "lastEdited": "2024-02-21T14:38:26.583Z",
  "licenseUrl": "https://docs.hyland.com/PSDF/en_US/Print/nuget-license.html",
  "listed": true,
  "packageHash": "+TRT5Cx1qMKSWAomEzLWAdEuf7qwq6C9ZYj1X46aGNhe7evdESfxZ6ee48foMzmfSYTZvMVZoeeYF2Nmft7A0g==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 19224,
  "projectUrl": "https://www.hyland.com/en/products/document-filters",
  "published": "2024-02-21T14:36:24.237Z",
  "releaseNotes": "# Enhancements\n\n- Introduced HD support for PDF XFA using the \"PDF_XFA_ENABLED\" option, defaulting to false. (DF-1263)\n- Introduced option \"OLM_DATE_FIELD\" to set a comma separated list of fields containing message time in OLM files, with the order of the field names defining search priority. Defaults to empty, resulting in the first field found being used. (DF-1826)\n- Introduced support for extracting comments from RAR files. (DF-1248)\n- Introduced support for extracting comments from ZIP files. (DF-1250)\n- Introduced support for extracting links to external workbooks within XLS files using the \"SHOWHIDDEN_EXCEL_REFS\" option, defaulting to OFF. (DF-1251)\n- Introduced support for preservation of alpha channel (transparency) in BMP input. (DF-1738)\n- Introduced support for preservation of alpha channel (transparency) in TIFF output when option\"TIFF_BITSPERPIXEL\" is '0' and option \"TIFF_COMPRESSION\" is 'NONE' or 'LZW'. (DF-1737)\n- Introduced support for running Document Filters on Linux ARM64 for MUSL/Alpine. (DF-1522)\n- Upgraded Xpdf to 4.04.03. (DF-1456)\n- Upgraded libtiff to 4.6.0.  (DF-1673)\n- Upgraded libwebp to 1.3.2. (DF-1674)\n\n# Updates\n\n- HD Mode: Resolved a condition for CGM files where the file may not render correctly. (DF-1550)\n- HD Mode: Resolved a condition for DOCX files where a crash may occur when processing headers/footers with missing attributes. (DF-1701)\n- HD Mode: Resolved a condition for HTML files where inline embedded images with an incomplete MIME type would not render. (DF-1742)\n- HD Mode: Resolved a condition for PDFs with corrupt page size values, where an error would be given instead of setting a default page size. (DF-1500)\n- HD Mode: Resolved a condition for SVG files that caused them to not render on Windows when the regional settings are set to a locale that does not use period and comma as their decimal and thousand separators. (DF-1733)\n- HD Mode: Resolved a condition for Visio files where some .vdx and .vsdx files would render incorrectly with various non-\"en_US\" locales. (DF-1853)\n- HD Mode: Resolved a condition for XPS files that caused them to not render on Windows when the regional settings are set to a locale that does not use period and comma as their decimal and thousand separators. (DF-1732)\n- HD Mode: Resolved a condition where 16-bit PICT files may not render. (DF-1485)\n- HD Mode: Resolved a condition where MSG files with 1000+ people in the recipients list may not render. (DF-1832)\n- HD Mode: Resolved a condition where OS2 Bitmap files don't render. (DF-1484)\n- HD Mode: Resolved a condition where calling \"IGR_Canvas_DrawImage\" with an SVG on a page created by \"IGR_Canvas_Blank_Page\" causes a SIGSEGV. (DF-1878)\n- HD Mode: Resolved a condition where certain MS Visio files may not render. (DF-1653)\n- HD Mode: Resolved a condition where certain PICT files may not render. (DF-1485)\n- HD Mode: Resolved a condition where long footnotes may overlap content of the document. (DF-1032)\n- HD Mode: Resolved a condition where option \"OCR_REORIENT_PAGES=ON\" could result in blank pages in rendered output. (DF-1845)\n- HD Mode: Resolved a condition where output of PDF files may have the text incorrectly spaced. (DF-1528)\n- HD Mode: Resolved a condition where some DICOM files may not render. (DF-1780)\n- HD Mode: Resolved a condition where some embedded images within MSG files may not render. (DF-1849)\n- HD Mode: Resolved a condition where the text of the \"WATERMARK\" option may be cut off. (DF-1884)\n- Resolved a condition for HTML files where entity reference characters may not be processed correctly. (DF-1852)\n- Resolved a condition for ODT files where \"ENUMERATE_IMAGES=ON\" may not work as expected. (DF-1580)\n- Resolved a condition for PDF documents where having \"PDF_PRESERVE_ORIGINAL=ON\" may cause relative links within the document to not work. (DF-1703)\n- Resolved a condition that may cause memory leaks when using the Python bindings. (DF-1889)\n- Resolved a condition where .mbox files were not identified correctly. (DF-1846)\n- Resolved a condition where an HTML file containing an SVG may be identified as an SVG. (DF-1736)\n- Resolved a condition where converting a tabbed text file to classic HTML removed all of the tabs between the text. (DF-1888)\n- Security: ODA: CVE-2023-5179: patched: applied security patch to address this issue. (DF-1786)\n- Security: ODA: CVE-2023-5180: patched: applied security patch to address this issue. (DF-1859)\n- Security: giflib: CVE-2023-48161: not-exploitable: issue exists in cli tool, not in library; does not impact document filters.  (DF-1825)\n- Security: libtiff: CVE-2023-3164: not-exploitable: issue exists in cli tool, not in library; does not impact document filters.  (DF-1882)\n- Security: libtiff: CVE-2023-3576: not-exploitable: issue exists in cli tool, not in library; does not impact document filters.  (DF-1706)\n- Security: libtiff: CVE-2023-40745: not-exploitable: issue exists in cli tool, not in library; does not impact document filters.  (DF-1705)\n- Security: libtiff: CVE-2023-41175: not-exploitable: issue exists in cli tool, not in library; does not impact document filters.  (DF-1704)\n- Security: libtiff: CVE-2023-52356: patched: applied security patch to address this issue.  (DF-1883)\n- Security: libtiff: CVE-2023-6277: patched: applied security patch to address this issue. (DF-1830)\n- Security: tinyxml: CVE-2023-34194: patched: applied security patch to address this issue. (DF-1855)\n- Security: zlib: CVE-2023-45853: not-exploitable: issue exists in cli tool, not in library; does not impact document filters.  (DF-1711)",
  "requireLicenseAcceptance": true,
  "summary": "An SDK to identify, extract and view hundreds of file formats. Contains the Linux native binaries required to deploy with .NET core on Linux",
  "title": "Hyland.DocumentFilters.Linux",
  "verbatimVersion": "24.1.0",
  "version": "24.1.0",
  "dependencyGroups": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2024.02.21.14.38.54/hyland.documentfilters.linux.24.1.0.json#dependencygroup",
      "@type": "PackageDependencyGroup",
      "dependencies": [
        {
          "@id": "https://api.nuget.org/v3/catalog0/data/2024.02.21.14.38.54/hyland.documentfilters.linux.24.1.0.json#dependencygroup/hyland.documentfilters.linux-x64",
          "@type": "PackageDependency",
          "id": "Hyland.DocumentFilters.Linux-x64",
          "range": "[24.1.0, )"
        },
        {
          "@id": "https://api.nuget.org/v3/catalog0/data/2024.02.21.14.38.54/hyland.documentfilters.linux.24.1.0.json#dependencygroup/hyland.documentfilters.linux-musl-x64",
          "@type": "PackageDependency",
          "id": "Hyland.DocumentFilters.Linux-Musl-x64",
          "range": "[24.1.0, )"
        }
      ]
    }
  ],
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2024.02.21.14.38.54/hyland.documentfilters.linux.24.1.0.json#Hyland.DocumentFilters.Linux.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 2435,
      "fullName": "Hyland.DocumentFilters.Linux.nuspec",
      "length": 7086,
      "name": "Hyland.DocumentFilters.Linux.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2024.02.21.14.38.54/hyland.documentfilters.linux.24.1.0.json#LICENSE.txt",
      "@type": "PackageEntry",
      "compressedLength": 606,
      "fullName": "LICENSE.txt",
      "length": 1084,
      "name": "LICENSE.txt"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2024.02.21.14.38.54/hyland.documentfilters.linux.24.1.0.json#hyland.png",
      "@type": "PackageEntry",
      "compressedLength": 2695,
      "fullName": "hyland.png",
      "length": 2785,
      "name": "hyland.png"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2024.02.21.14.38.54/hyland.documentfilters.linux.24.1.0.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 11519,
      "fullName": ".signature.p7s",
      "length": 11519,
      "name": ".signature.p7s"
    }
  ],
  "tags": [
    "docfilters",
    "linux",
    "windows",
    "cross-platform"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}