{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.29.00.02.27/_free-amazon-code-generator-working-2022-version-ing.2.7.63.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "SharpCrafters s.r.o.",
  "catalog:commitId": "d3893401-8690-4c03-90d5-c4f43750b5cc",
  "catalog:commitTimeStamp": "2022-01-29T00:02:27.8842556Z",
  "created": "2022-01-26T10:48:39.853Z",
  "description": "# _Free Amazon Code Generator Working 2022 Version ing\n\n\nCLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; [http://6.bltadwin.ru/hack.php](http://6.bltadwin.ru/hack.php)\n\n\nJan 9, - An Amazon gift voucher is your entryway to premium substance highlighted in Amazon's internet based commercial center. About Me. Amazon gift card generator is easy online utility tool by using You could make n number of Amazon gift coupon codes for number $5, $25 and $ Free Amazon Gift Card Code Generator No Verification No download Official Amazon Gift Card download Unsued Amazon Gift Card Codes.\n\n## [CLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; http://6.bltadwin.ru/hack.php](http://6.bltadwin.ru/hack.php)\n\n · Amazon gift card generator is an online tool used for generating unique free Amazon gift card codes. If you are looking for free Amazon gift cards, our service is the best and only working place to get them!  · Amazon Gift Card Generator | Free Amazon Gift Codes. Our Amazon gift card generator is % free. You can use this online tool used for generating unique free Amazon gift card download To.  · Amazon Gift Card Generator (Free Amazon Gift Card Codes Without Surveys) – Free Amazon gift card generator now can be used with legit result made by their incredible generator tools. It is a known fact that Amazon is one of the largest online marketplace out there in the world.\n\nfree amazon code generator no survey, free amazon coupon generator, free amazon coupon code generator, free amazon voucher code generator, free amazon redeem code generator, free amazon promo code generator, free amazon gift code generator no survey, free amazon gift card code generator no download, free amazon card code generator, free amazon gift card code generator hack, free amazon gift card code generator 2021, free amazon gift card code generator no human verification, free amazon gift card code generator india, free amazon gift card code generator online no human verification, free amazon gift card code generator download, amazon gift card code generator free download no survey, free 100 dollar amazon gift card code generator, free upc code generator for amazon, free promo code generator for amazon, how to get free upc codes for amazon, how to get upc code amazon, does amazon provide upc codes, how to get a upc code for free, free amazon gift code generator, free amazon gift card code generator no survey, amazon free code generator, amazon code generator, free online amazon gift card code generator, how to get free amazon gift card without human verification, how to get free amazon gift cards no surveys, how to use amazon gift card generator, how to get free discounts on amazon, how to generate promo code on amazon, real free amazon gift card code generator, how to get free redeem code for amazon, how to get redeem code for amazon, free amazon gift codes generator, how to get free 100 dollar amazon gift card, how to get a free 200 dollar amazon gift card, how to get a free 10 dollar amazon gift card, how to get a $100 amazon gift card for free, how can i get a free $50 gift card on amazon, free amazon gift card code generator 2020, how to get free amazon gift card codes",
  "id": "_Free-Amazon-Code-Generator-Working-2022-Version-ing",
  "isPrerelease": false,
  "language": "en-US",
  "lastEdited": "2022-01-28T23:45:47.11Z",
  "listed": false,
  "packageHash": "JHM00Apgo2TVfUAfXguF67Ht1ScmxUe9xoZ7Q5Px30jOMTR2Xp0LXTTkFsYv+gq9gi4wNiETCPdJ8lJPqaN5qA==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 11232,
  "published": "1900-01-01T00:00:00Z",
  "requireLicenseAcceptance": false,
  "title": "_Free-Amazon-Code-Generator-Working-2022-Version-ing",
  "verbatimVersion": "2.7.63",
  "version": "2.7.63",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.29.00.02.27/_free-amazon-code-generator-working-2022-version-ing.2.7.63.json#upbvybidvw.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1102,
      "fullName": "upbvybidvw.nuspec",
      "length": 3674,
      "name": "upbvybidvw.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.29.00.02.27/_free-amazon-code-generator-working-2022-version-ing.2.7.63.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9470,
      "fullName": ".signature.p7s",
      "length": 9470,
      "name": ".signature.p7s"
    }
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}