{
  "@id": "https://api.nuget.org/v3/catalog0/data/2015.02.01.18.59.10/uws.2.0.15.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "UltiDev LLC,Vlad Hrybok",
  "catalog:commitId": "824799a3-260c-4934-a2ee-d9fd3e0ea685",
  "catalog:commitTimeStamp": "2015-02-01T18:59:10.5795612Z",
  "copyright": "UltiDev LLC, 2005-2012",
  "created": "2012-04-12T01:03:56.27Z",
  "description": "UltiDev Web Server Pro (UWS), also known as UltiDev Cassini Pro, is an an advanced,redistributable web server for Windows that can be use as a regular web server to host web sites and ASP.NET applications, or packaged with your ASP.NET web application and installed on your customers' systems along with your web app or site, free of charge. Unlike Cassini or WebDev web servers, UWS is not a toy - UWS is a real deal.\nIf you have been using UltiDev Cassini, Miscrosoft Cassini, Microsoft WebDev, IIS Express or even IIS, it's time to make your life a whole lot easier and get UltiDev Web Server Pro.\nWhat's There\n- Support of ASP.NET 4, 3.x, 2.0 and 1.1.\n- Use InstallShield, Advanced Installer or Visual Studio 2010, 2008 or 2005 to create an installer for your ASP.NET web app that includes UltiDev Web Server as acomponent. After installation, register your web site or application with UWS using any of the following methods: manually, using UWS Explorer - our interactive application management console, or programmatically, with the command line registration utility.\n- .NET application management API.\n- COM application management API. \n- Ability to run applications as 32 bit on 64-bit systems.\n- Support of SSL.\n- Besides being permanently hosted by UWS Windows service, web applications can also be temporarily hosted by our Interactive Host for debugging and testing. UWS can even replace Visual Studio internal development web server with UWS Interactive Host.\n- Dramatically improved application uptime due to automatically restarted host processes when applications made them crash.\n- New security model suited for hosting Internet-facing sites and applications allows apps run under restricted Network Service account.\n- Multiple recyclable host processes enabling better security and application independence.\n- Support of virtual directories.\n- TCP port sharing.\n- Windows authentication.\n- Response content GZIP compression.\n- Backward-compatible with UltiDev Cassini Web Server",
  "iconUrl": "http://download.ultidev.com/Images/Proggy32.png",
  "id": "UWS",
  "isPrerelease": false,
  "language": "",
  "lastEdited": "0001-01-01T00:00:00Z",
  "packageHash": "ck1cEu2BkHGHcPWY9dKrY0+53DlXKk7oBf4MfraSyMR0eCt/Zpz1lqrDdkrFmUTVt+Yq/afOayc9zFlltBaumg==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 1760671,
  "projectUrl": "http://ultidev.com/products/UWS/",
  "published": "2012-04-12T01:03:58.737Z",
  "releaseNotes": "Build 15, February 28, 2012.\n\nChange: To uninstall UWS use \"Uninstall UltiDev Web Server Pro\" menu item from UWS Programs menu. New uninstallation routine displays list of applications currently hosted by UWS, giving users a chance to see which web applications will stop working in case UWS is uninstalled. Ability to uninstall UWS from \"Add/Remove Programs\" and \"Programs and Features\" has been removed.\n\nChange: At the end of stand-alone (full UI) installation of UWS, the UWS Explorer application management console is launched. This change does not affect cases when UWS installer is bundled as \"passive\", \"quiet\" or otherwise reduced-UI package, meaning UWS Explorer won't pop up in the process of your application installation.\n\nNew feature: added SSL/TLS support and Certificate Management. UWS can allows creating and managing X.509 digital certificates, both self-signed and production-level CA-signed ones.\n\nNew feature: simplified or automatic creation of desktop shortcuts to redistributable web applications when applications are registered with UWS. This significantly simplifies web application installation authoring.\n\nNew feature: launch your web application in the browser right after installation using \"/autostart\" parameter of UWS.RegApp.exe. There is a corresponding programmatic way to do the same using .NET and COM APIs.\n\nBug fix: Request process logic changed to let ASP.NET pipeline try to handle requests with no physical files mapped to the URL, before returning 404. This allows HttpHandlers to process requests that may look like potential 404.\n\nBug fix: UWS Explorer crashed when selected host process used more 2GB of RAM.\n\nBug fix: During application registration, taken listen-to URLs were not filtered out if Vdir was specified (non-\"/\").",
  "requireLicenseAcceptance": false,
  "summary": "UWS is a *redistributable* web server that can be bundled as a <2MB install prerequisite component with your ASP.NET application installation. Eliminate IIS from your requirement list by shipping UWS.",
  "title": "UltiDev Web Server Pro (UWS)",
  "version": "2.0.15",
  "tags": [
    "web",
    "server",
    "webdev",
    "cassini",
    "IIS",
    "UWS",
    "webserver",
    "iis",
    "express",
    "httplistener",
    "http.sys",
    "wcf",
    "asp.net",
    "ssl"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    }
  }
}