{
  "@id": "https://api.nuget.org/v3/catalog0/data/2015.02.01.23.52.43/aspose.words.11.5.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "Aspose",
  "catalog:commitId": "10b17c5b-502b-4283-8330-00acf3ac3b56",
  "catalog:commitTimeStamp": "2015-02-01T23:52:43.9740526Z",
  "copyright": "© Aspose 2002-2011. All Rights Reserved.",
  "created": "2012-07-03T03:29:41.95Z",
  "description": "Aspose.Words for .NET class library supports DOC, DOCX, RTF, HTML, OpenDocument, PDF, XPS, EPUB and other formats. With Aspose.Words you can generate, modify, convert, render and print documents without utilizing Microsoft Word®",
  "iconUrl": "http://www.aspose.com/images/products/dotnet/Aspose.Words_128x128.png",
  "id": "Aspose.Words",
  "isPrerelease": false,
  "lastEdited": "0001-01-01T00:00:00Z",
  "licenseUrl": "http://www.aspose.com/corporate/purchase/end-user-license-agreement.aspx",
  "packageHash": "B7UYip9zX/qQO6b+uqjkkZUi/5tGkMwKqgBM1nT4oODozMxd1IRi5IGcmYKeFQ2N2oZORwMhzfJCGwuRcR0LbA==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 12458330,
  "projectUrl": "http://www.aspose.com/categories/.net-components/aspose.words-for-.net/default.aspx",
  "published": "2012-07-03T03:29:41.95Z",
  "releaseNotes": "There are 143 improvements and fixes in this regular monthly release. Most notable are:\n\n• Added plaintext import format (TXT). Formatting of paragraphs and lists is supported\n• Support for reading and importing of AltChunk content (DOCX) into document model\n• Support for reading/writing MailMerge settings in RTF\n• Better validation of AW generated DOCX documents through OpenXML SDK 2.0\n• Office Math formulas are preserved during DOCX>DOC>DOCX and DOCX>WML>DOCX roundtrip scenarios\n• Table/row revisions are supported in DOCX\n• Improvements in table width handling for HTML and PDF\n• Added option to specify zoom factor and fit type in rendered PDF documents (see PdfSaveOptions.ZoomFactor and PdfSaveOptions.OpenFitOptions)\n• Supported signature image rendering for digital signature line in rendered PDF documents\n• Enhanced rendering of Office MathML\n• Fixed problem with CMYK image export to PDF\n• Fixed problem with decreased metafile size in some documents (fixed page formats)\n• Fixed problem with disappearing metafile images in rendered documents (fixed page formats)\n\nThis release introduces the features, enhancements, performance improvements, excptions and bug fixes as detailed below:\n\n• New features\n\nWORDSJAVA-566\tImplement condition compilation based on JLS 14.21.\nWORDSNET-1350\tTable and row revisions are lost during DOCX export.\nWORDSNET-1937\tSupport AltChunk tags.\nWORDSNET-2838\tConsider adding an option to specify fit options of PDF.\nWORDSNET-2979\tPreserve mail merge settings during load/save in RTF\nWORDSNET-4074\tSupport signature image rendering for digital signature line\nWORDSNET-4567\tTable rows are shifted right upon rendering.\nWORDSNET-5166\tTable rows are shifted during rendering.\nWORDSNET-5351\tWORDSNET-5350 Create a video for the converting MS Word documents to EPUB article\nWORDSNET-5614\tImplement access to font kerning data.\nWORDSNET-5785\tMerge field format switch i.e. DBCHAR is not preserved after open/save\nWORDSNET-5820\t/rtl/ Header Table rendered in reverse order, while converting docx to Pdf\nWORDSNET-5824\tSupport \"Align table rows independently\" compatibility option\nWORDSNET-5893\tConsider exporting default zoom setting when exporting to PDF\nWORDSNET-6220\tWORDSNET-6209 Preserve editable formulas after DOCX->DOC->DOCX and DOCX->WML->DOCX roundtrips.\nWORDSNET-6253\t/rtl/ Support layout of RTL tables\nWORDSNET-6254\t/rtl/ Support of RTL section layout\nWORDSNET-6280\tConsider adding ImageSaveOptions.UseBitonalConverter property\nWORDSNET-6346\tA 90 degrees roatated DrawingML is rendering incorrectly in Fixed page formats\nWORDSNET-6357\t/rtl/ Incorrect layout of RTL table\nWORDSNET-6474\tTables are misaligned when rendering to fixed page formats\n\n• Enhancements\n\nWORDSJAVA-50\tMailMerge to get java.sql.Clob and Blob object as an data source from ResulSet.\nWORDSJAVA-72\tCreate a demo “How to use Aspose.Words in Google App Engine”\nWORDSJAVA-76\tall 3d parity licensies in single file\nWORDSJAVA-442\tWORDSJAVA-478 Test Aspose.Words for Java with Java7 and consider providing special JAR for Java7.\nWORDSJAVA-449\tSupport Black&White and Grayscale ColorModes for Bitmaps\nWORDSJAVA-552\tAdd Java 7 as a supported version to the docs and readme\nWORDSJAVA-555\tSmall font (less than 1pt) rendered to emf with reduced scale\nWORDSJAVA-558\tSort out obfuscated classes by adding a prefix\nWORDSJAVA-561\tRemove from production code printing of suppressed runtime error messages from catch blocks - keep them in test code only.\nWORDSJAVA-567\tFormula updates with bookmark and other links\nWORDSNET-2788\t“InvalidOperationException: Not expected other image formats here.” Exception occurs during converting DOCX to DOC.\nWORDSNET-2862\t“FileCorruptedException” exception occurs during opening DOCX document.\nWORDSNET-4460\tText within large paragraph does not wrap around image on next page\nWORDSNET-4492\tContent inserted into Structured Document Tag should remove paragraph or line breaks (sdt)\nWORDSNET-4878\tLeft indent of paragraph is incorrect upon rendering.\nWORDSNET-5543\tParagraph Line spacing of Table changed on RTF to DOC conversion\nWORDSNET-5674\tFloating table is incorrectly rendered and overlaps first page\nWORDSNET-5725\tNested table, white spaces dropped within the cell while converting docx to pdf\nWORDSNET-5788\tTable content is not fitting properly within Page width in PDF/TIFF\nWORDSNET-6114\tSystem hangs instead of throwing FileCorruptedException\nWORDSNET-6209\tSupport advanced rendering of OfficeMath.\nWORDSNET-6216\tWORDSNET-6209 Investigate what font MS Word uses to render formulas.\nWORDSNET-6222\tFooter content is getting truncated during rendering\nWORDSNET-6283\tSupport macintosh TrueType fonts\nWORDSNET-6411\tUpdate documentation to ensure proper information on use of Client Profile version and System.Web is available\nWORDSNET-6413\tRTF to Doc conversion issue. Doc file is corrupted after conversion\nWORDSNET-6436\tWORDSNET-5746 Support characters from Unicode Supplementary Planes when rendering to XPS\nWORDSNET-6485\tChange public access modifiers to internal for ParaString and ParaStringBuilder classes\n\n• Performance\n\nWORDSNET-6341\tInvestigate why AW is holding memory after rendering\n\n• Exceptions\n\nWORDSNET-5301\tIndexOutOfRangeException occurs upon executing mail merge.\nWORDSNET-5520\tException on setting Table.PreferredWidth higher than 100 percent\nWORDSNET-5569\tIndexOutOfRangeException on calling UpdateFields on blank Formula Fields\nWORDSNET-5655\tArgumentException: Shape does not get rendered to HTML/PDF/TIFF etc\nWORDSNET-5736\tInvalidOperationException: occurs when appending two documents\nWORDSNET-5826\tEmpty stack error, while converting Word document to Pdf file\nWORDSNET-5981\tIndexOutOfRangeException occurs on calling UpdateFields on IF Field\nWORDSNET-6001\tInvalidOperationException occurs during converting DOCX to DOC\nWORDSNET-6059\tStackOverFlowException occurs on calling UpdateFields\nWORDSNET-6138\tSystem.NullReferenceException occurs during updating fields.\nWORDSNET-6159\tSystem.NullReferenceException occurs while updating fields.\nWORDSNET-6251\tArgumentException occurs during rendering DOC with a comment\nWORDSNET-6313\tSystem.ArgumentException occurs when prepends the content of one Word document to the start of another.\nWORDSNET-6317\tNullReferenceException occurs on calling UpdateFields\nWORDSNET-6319\tOverFlowException occurs upon rendering Shape to Fixed Page formats\nWORDSNET-6330\tSystem.ArgumentException occurs on calling UpdateFields\nWORDSNET-6331\tSystem.NullReferenceException occurs during rendering to Fixed Page Formats\nWORDSNET-6369\tAspose.Words.FileCorruptedException occurs upon loading DOCX\nWORDSNET-6371\t/rtl/ Exception while rendering Arabic document containing content controls\nWORDSNET-6415\tSystem.ArgumentException occurs on AppendDocument\nWORDSNET-6417\tDocument.PageCount throws System.NullReferenceException\nWORDSNET-6431\tSetting SourceFullName to string.Empty throws ArgumentException when saving to DOCX format\nWORDSNET-6456\tArgumentOutOfRangeException occurs during simple mail merge\nWORDSNET-6459\tAspose.Words.FileCorruptedException occurs upon loading DOC\nWORDSNET-6476\tException while converting Docx to PDF\nWORDSNET-6482\tException on Docx opening\nWORDSNET-6483\tAspose.Words.UnsupportedFileFormatException occurs upon loading DOCX\nWORDSNET-6506\tAspose.Words.FileCorruptedException occurs upon loading RTF\nWORDSNET-6512\tAspose.Words.FileCorruptedException occurs upon loading Word 2003 XML document\n\n• Bugs\n\nWORDSJAVA-70\tException when loading an encrypted ODT file\nWORDSJAVA-78\tThe share parameter in the File.Open method is not used\nWORDSJAVA-130\tDocVariable field is incorrectly updated.\nWORDSJAVA-500\tBrightness and contrast are not applied\nWORDSJAVA-515\timage fills all rectangle\nWORDSJAVA-553\tMetafile image with soft mask with transparency incorrectly exported to PDF-A/1B\nWORDSNET-3257\t“System.NullReferenceException : Object reference not set to an instance of an object.” occurs when call Clear();\nWORDSNET-3608\tSize of images is decreased during converting to PDF/XPS.\nWORDSNET-3624\tImage disappears after open/save.\nWORDSNET-3629\tImage size is different when render the document in different OS (Windows7 and Wondows2008Server)\nWORDSNET-3819\tVertical border of a table is rendered incorrectly\nWORDSNET-4290\tDOCPROPERTY fields related to DateTime are not updated correctly.\nWORDSNET-4453\tPosition of TextBox is changed after open/save using AW\nWORDSNET-4497\tSize of shape becomes smaller after rendering.\nWORDSNET-4619\tVML image in DOCX document disappears during conversion to DOC format\nWORDSNET-4644\tEMF images disappear during converting to PDF/XPS.\nWORDSNET-4691\tInvalidCastException occurs during Bookmark processing.\nWORDSNET-4919\tNullReferenceException occurs when call NodeCollection.Clear().\nWORDSNET-5250\tField is incorrectly updated during UpdateFileds\nWORDSNET-5331\tTable looks incorrect during rendering.\nWORDSNET-5363\tTable looks incorrect during rendering\nWORDSNET-5392\tRed border appears around table row during open/save.\nWORDSNET-5439\tFormula updates incorrectly.\nWORDSNET-5488\tSUM is calculated improperly if there is negative currency.\nWORDSNET-5596\tRTF content is changed during open/save.\nWORDSNET-5692\tIf expressions gets evaluated incorrectly upon calling UpdateFields\nWORDSNET-5699\t/rtl/ RTL text columns are swapped while rendering\nWORDSNET-5744\tTable Width are not preserved on DOC>HTML>DOC roundtrip\nWORDSNET-5758\tException while loading .docx file\nWORDSNET-5764\tUpdateFields calculates the product formula incorrectly in PDF\nWORDSNET-5813\tdoc to pdf conversion: Hyperlink to Bookmark is not working\nWORDSNET-5835\tWhile docx to Pdf, Page number text is not aligned as in input Word document\nWORDSNET-5962\tLarge image inserted using DocumentBuilder appears as long thin shape in output document\nWORDSNET-5983\tWhile converting docx to Pdf, incorrect text alignment.\nWORDSNET-6032\tExcel file, extracted from DOCX, has no worksheets in it\nWORDSNET-6111\tTable text collapse with list items when converting Doc to PDF/XPS format.\nWORDSNET-6250\tDocumentBuilder.InsertImage reduces Image Size to 0.75 by 0.75 points\nWORDSNET-6266\tDocx to PDF conversion issue with text\nWORDSNET-6281\tDoc to PDF conversion issue; Garbled characters appears in output PDF file\nWORDSNET-6285\tParagraph text splits across two lines in fixed page formats\nWORDSNET-6302\tReading DocVariables via a macro inside MS WORD throws error\nWORDSNET-6340\tException while converting Docx to Pdf\nWORDSNET-6349\tDocx to PDF conversion with option PdfCompliance.PdfA1b has issues when check with Preflight\nWORDSNET-6354\tBarcode appears incorrect during printing a PDF i.e. generated by Aspose.Words\nWORDSNET-6406\t/rtl/ Text rendering issue in PDF file: The text (\"גב  עה\")\nWORDSNET-6409\tConverting the doc to a PDF issue with image corrupted\nWORDSNET-6416\tException while using updatefields and mailmerge methods\nWORDSNET-6418\tInsertImage is not scaling the image 100%\nWORDSNET-6419\tHidden images become visible in output PDF/XPS files\nWORDSNET-6434\tDML Effects Refactoring\nWORDSNET-6449\tGetChildNode method returning different no. of Table Nodes in Vb.Net and C#\nWORDSNET-6451\tFont of MathML Equation do not change in output Doc/Pdf format\nWORDSNET-6457\tMetafile image is not rendering in PDF/XPS\nWORDSNET-6480\tDocx to PDF conversion issue with text Alignment\nWORDSNET-6481\tInvestigate why Images are rendering as Black Rectangles in Telerik's PdfViewer for Silverlight\nWORDSNET-6484\tODT document is not rendering properly\nWORDSNET-6511\tImages are rendering incorrectly in PDF\nWORDSNET-6522\tWORDSNET-6511 PDF anti-aliasing problem with transparent image\nWORDSNET-6523\tWORDSNET-6511 EMF+ dual GetDC problem",
  "requireLicenseAcceptance": true,
  "title": "Aspose.Words for .Net",
  "version": "11.5.0",
  "tags": [
    "Aspose.Words",
    "DOC",
    "DOCX",
    "RTF",
    "HTML",
    "OpenDocument",
    "XPS",
    "EPUB",
    "Word",
    "Document",
    "Processing"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    }
  }
}