{
  "@id": "https://api.nuget.org/v3/catalog0/data/2023.09.14.21.30.34/hyland.documentfilters.linux.23.3.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "Hyland Software, Inc.",
  "catalog:commitId": "a47ca8da-856e-47b3-aab2-ac067a07353e",
  "catalog:commitTimeStamp": "2023-09-14T21:30:34.3105862Z",
  "copyright": "(c) 2023 Hyland Software, Inc. and its affiliates. All rights reserved.",
  "created": "2023-09-14T21:27:55.89Z",
  "description": "Document Filters is a toolkit that allows application developers to identify and extract metadata, as well as convert and render almost any file type. It is a core component of many products, but can also be leveraged as a stand-alone service for organizations or application developers.",
  "iconFile": "hyland.png",
  "id": "Hyland.DocumentFilters.Linux",
  "isPrerelease": false,
  "lastEdited": "2023-09-14T21:30:26.987Z",
  "licenseUrl": "https://docs.hyland.com/PSDF/en_US/Print/nuget-license.html",
  "listed": true,
  "packageHash": "v1L4g1r3osIaV0Zdaia5dXh8bFUAANs5xZO0Bdi2v/F22vLmnC4Yt6Cwz1t76sP7Gv3POJJDzqreIFfaBR8yew==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 19378,
  "projectUrl": "https://www.hyland.com/en/products/document-filters",
  "published": "2023-09-14T21:27:55.89Z",
  "releaseNotes": "# Enhancements\n\n- Improved symbol character to Unicode character conversions. (DF-1531)\n- Introduced option \"SPREADSHEET_SHRINKTOFIT_LIMIT\" to control the lowest scale allowed when \"SPREADSHEET_SHRINKTOFIT\" is enabled, defaulting to 25%. (DF-1559)\n- Introduced password support for ODF files using \"IGR_Open_Ex\" callbacks. (DF-1257)\n- Introduced password support for PDF files using \"IGR_Open_Ex\" callbacks. (DF-1252)\n- Introduced support for \"OpenDocument Drawing\" isys:subType metadata. (DF-1621)\n- Introduced support for easily providing localization values for metadata names using \"IGR_Open_Ex\" callbacks for all modes. (DF-272)\n- Introduced support for the use of the Document Filters NuGet package within Native C++ projects. (DF-1060)\n- Upgraded LZMA SDK to 23.01. (DF-1629)\n- Upgraded bzip to 1.0.8. (DF-1615)\n- Upgraded libjpeg to 9e. (DF-1616)\n- Upgraded libpng to 1.6.40. (DF-1617)\n- Upgraded libtiff to 4.5.1. (DF-1642)\n- Upgraded libwebp to 1.3.1. (DF-1618)\n- Upgraded openjpeg to 2.5.0. (DF-1620)\n- Upgraded wavpack to 5.6.0. (DF-1619)\n- Upgraded zlib to 1.3.0. (DF-1643)\n\n# Updates\n\n- HD Mode: Resolved a condition for DWG files where the first page is rendered incorrectly. (DF-1572)\n- HD Mode: Resolved a condition for MSG files where a space character would be incorrectly included as part of a word's positional information. (DF-1602)\n- HD Mode: Resolved a condition for PDFs where having incorrect mask data would cause embedded images to not render. (DF-1578)\n- HD Mode: Resolved a condition for TIFFs where images with either the x or y DPI being 0 caused the image to not render. (DF-1614)\n- HD Mode: Resolved a condition where 4 bit per pixel TIFF images without a palette and using MIN_IS_WHITE were not rendering correctly. (DF-1613)\n- HD Mode: Resolved a condition where CGM files may not render. (DF-1549)\n- HD Mode: Resolved a condition where CR/LF characters would be removed from the subject of an EML file. (DF-1597)\n- HD Mode: Resolved a condition where DOC files converted to PNG may have the style of the title used for the first entry of a table of contents. (DF-1113)\n- HD Mode: Resolved a condition where JPEGs would be promoted to 24-bit. (DF-1590)\n- HD Mode: Resolved a condition where PDF redactions with PDF_PRESERVE_ORIGINAL may incorrectly scale, rotate, or mirror the content after successful redaction. (DF-1527)\n- HD Mode: Resolved a condition where bitmaps would be promoted to 24-bit. (DF-1509)\n- HD Mode: Resolved a condition where certain DOCX files may fail to render with the error message \"Page limit exceeded\" due to a paragraph-anchored graphic with text wrap forcing its anchor paragraph to the next page. (DF-1424)\n- HD Mode: Resolved a condition where certain DOCX files may fail to render with the error message \"Page limit exceeded\" due to a table with multiple repeat header rows being split across pages. (DF-1573)\n- HD Mode: Resolved a condition where certain DOCX files may not render in FreeBSD. (DF-1537)\n- HD Mode: Resolved a condition where converting an MSG file with embedded Excel objects to HTML may cause the objects to not render. (DF-1541)\n- HD Mode: Resolved a condition where converting documents containing EMF/WMF images to PDFs may cause a segmentation fault. (DF-1561)\n- HD Mode: Resolved a condition where palleted PNGs would be promoted to 32-bit. (DF-1589)\n- HD Mode: Resolved a condition where rendering images to a TIFF canvas would promote the image to 24-bit. (DF-1591)\n- HD Mode: Resolved a condition where specific TIFFs using OJPEG compression would not render. (DF-1592)\n- HD Mode: Resolved a condition where the conversion of an Excel file to .html would result in entire columns of values not visible in the .html output. (DF-1347)\n- Resolved a condition where metadata for WebP files would not be extracted. (DF-1639)\n- Resolved a condition where reported image sizes may be off by 1 due to pixel density stored as dots per centimeter. (DF-1012)\n- Resolved a condition where the .NET API would incorrectly return \"IGR_CANCELLED\" instead of throwing an exception. (DF-1637)\n- Security: 7-zip: CVE-2017-17969: not-exploitable: issue exists in desktop application, not in library; does not impact document filters. (DF-1624)\n- Security: 7-zip: CVE-2018-10115: not-exploitable: issue exists in desktop application, not in library; does not impact document filters. (DF-1627)\n- Security: 7-zip: CVE-2018-10172: not-exploitable: issue exists in desktop application, not in library; does not impact document filters. (DF-1623)\n- Security: 7-zip: CVE-2018-5996: not-exploitable: issue exists in desktop application, not in library; does not impact document filters. (DF-1628)\n- Security: Leptonica: CVE-2020-36277: not-exploitable: unused code block; does not impact document filters. (DF-1569)\n- Security: Leptonica: CVE-2020-36278: not-exploitable: unused code block; does not impact document filters. (DF-1569)\n- Security: Leptonica: CVE-2020-36279: not-exploitable: unused code block; does not impact document filters. (DF-1569)\n- Security: Leptonica: CVE-2020-36281: not-exploitable: unused code block; does not impact document filters. (DF-1569)\n- Security: Xpdf: CVE-2023-2662: not-exploitable: issue does not exist in version. (DF-1526)\n- Security: Xpdf: CVE-2023-2663: not-exploitable: issue does not exist in version. (DF-1524)\n- Security: Xpdf: CVE-2023-2664: not-exploitable: issue does not exist in version. (DF-1523)\n- Security: Xpdf: CVE-2023-3044: not-exploitable: issue does not exist in version. (DF-1557)\n- Security: giflib: CVE-2023-39742: not-exploitable: issue exists in cli tool, not in library; does not impact document filters. (DF-1650)\n- Security: libtiff: CVE-2020-18768: not-exploitable: issue does not exist in version. (DF-1649)\n- Security: libtiff: CVE-2022-40090: not-exploitable: issue does not exist in version. (DF-1648)\n- Security: libtiff: CVE-2023-25433: not-exploitable: issue exists in cli tool, not in library; does not impact document filters.  (DF-1575)\n- Security: libtiff: CVE-2023-25434: not-exploitable: issue exists in cli tool, not in library; does not impact document filters.  (DF-1564)\n- Security: libtiff: CVE-2023-25435: not-exploitable: issue exists in cli tool, not in library; does not impact document filters.  (DF-1570)\n- Security: libtiff: CVE-2023-26965: not-exploitable: issue exists in cli tool, not in library; does not impact document filters.  (DF-1563)\n- Security: libtiff: CVE-2023-26966: patched: applied security patch to address this issue. (DF-1574)\n- Security: libtiff: CVE-2023-2731: not-exploitable: issue does not exist in version. (DF-1542)\n- Security: libtiff: CVE-2023-2908: patched: applied security patch to address this issue. (DF-1583)\n- Security: libtiff: CVE-2023-30774: patched: applied security patch to address this issue. (DF-1544)\n- Security: libtiff: CVE-2023-30775: not-exploitable: issue exists in cli tool, not in library; does not impact document filters. (DF-1543)\n- Security: libtiff: CVE-2023-3316: not-exploitable: issue does not exist in version. (DF-1568)\n- Security: libtiff: CVE-2023-3618: not-exploitable: issue exists in cli tool, not in library; does not impact document filters. (DF-1595)\n- Security: libwebp: CVE-2023-1999: patched: applied security patch to address this issue. (DF-1577)\n- Security: libwebp: CVE-2023-4863: patched: applied security patch to address this issue. (DF-1670)\n- Security: unrar: CVE-2022-48579: not-exploitable: unused code block; does not impact document filters. (DF-1625)",
  "requireLicenseAcceptance": true,
  "summary": "An SDK to identify, extract and view hundreds of file formats. Contains the Linux native binaries required to deploy with .NET core on Linux",
  "title": "Hyland.DocumentFilters.Linux",
  "verbatimVersion": "23.3.0",
  "version": "23.3.0",
  "dependencyGroups": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2023.09.14.21.30.34/hyland.documentfilters.linux.23.3.0.json#dependencygroup",
      "@type": "PackageDependencyGroup",
      "dependencies": [
        {
          "@id": "https://api.nuget.org/v3/catalog0/data/2023.09.14.21.30.34/hyland.documentfilters.linux.23.3.0.json#dependencygroup/hyland.documentfilters.linux-x64",
          "@type": "PackageDependency",
          "id": "Hyland.DocumentFilters.Linux-x64",
          "range": "[23.3.0, )"
        },
        {
          "@id": "https://api.nuget.org/v3/catalog0/data/2023.09.14.21.30.34/hyland.documentfilters.linux.23.3.0.json#dependencygroup/hyland.documentfilters.linux-musl-x64",
          "@type": "PackageDependency",
          "id": "Hyland.DocumentFilters.Linux-Musl-x64",
          "range": "[23.3.0, )"
        }
      ]
    }
  ],
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2023.09.14.21.30.34/hyland.documentfilters.linux.23.3.0.json#Hyland.DocumentFilters.Linux.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 2590,
      "fullName": "Hyland.DocumentFilters.Linux.nuspec",
      "length": 8994,
      "name": "Hyland.DocumentFilters.Linux.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2023.09.14.21.30.34/hyland.documentfilters.linux.23.3.0.json#LICENSE.txt",
      "@type": "PackageEntry",
      "compressedLength": 606,
      "fullName": "LICENSE.txt",
      "length": 1084,
      "name": "LICENSE.txt"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2023.09.14.21.30.34/hyland.documentfilters.linux.23.3.0.json#hyland.png",
      "@type": "PackageEntry",
      "compressedLength": 2695,
      "fullName": "hyland.png",
      "length": 2785,
      "name": "hyland.png"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2023.09.14.21.30.34/hyland.documentfilters.linux.23.3.0.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 11520,
      "fullName": ".signature.p7s",
      "length": 11520,
      "name": ".signature.p7s"
    }
  ],
  "tags": [
    "docfilters",
    "linux",
    "windows",
    "cross-platform"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}