{
  "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.21.06.24.30/aspose.words.14.2.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "Aspose",
  "catalog:commitId": "1aa7f186-4f04-4423-a504-8cfcb449ffb0",
  "catalog:commitTimeStamp": "2018-10-21T06:24:30.0338525Z",
  "copyright": "(C) Aspose 2002-2014. All Rights Reserved.",
  "created": "2014-03-14T09:13:52.563Z",
  "description": "Aspose.Words for .NET is a class library for .NET that enables you to perform a wide range of document processing tasks directly within your .NET applications.",
  "iconUrl": "http://www.aspose.com/images/products/dotnet/Aspose.Words_128x128.png",
  "id": "Aspose.Words",
  "isPrerelease": false,
  "lastEdited": "2018-10-21T06:24:21.233Z",
  "licenseUrl": "http://www.aspose.com/corporate/purchase/end-user-license-agreement.aspx",
  "listed": true,
  "packageHash": "FZWaoNXaqwJaoVytGz1WmHvxblzV7dCAOn+WYy9oad9qgTK9+4l5pTvS9ctkgz9OkfOS4N+F9AWHKqdP1AchMw==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 8574107,
  "projectUrl": "http://www.aspose.com/categories/.net-components/aspose.words-for-.net/default.aspx",
  "published": "2014-03-14T09:13:52.563Z",
  "releaseNotes": "Aspose.Words for .NET 14.2 Release Notes\n\n\nMajor Features\n\nThere are 118 improvements and fixes in this regular monthly release. The most notable are: \n\n* Improved export of tabs and tab stop positions to HTML \n* Tab leaders are preserved when exporting to HTML \n* Move revisions are supported in RTF \n* Hyphenation is now supported in the layout engine (with external dictionaries) \n* Drop caps positioning improved \n* Improved rendering of hidden text \n* Improved rendering of Asian text, ordering of Arabic punctuation marks \n* DrawingML \"Inner Shadow\" effect rendering implemented \n* Multiline watermark rendering supports \"Fit to Bezier curves\" cases \n* Digitally signing XPS documents is possible now \n\n\nAll Changes\n\nWORDSNET-2150 MS Word does not highlight white spaces. AW should do the same. Bug \nWORDSNET-4838 Vertical alignment of table cell defined using table style, is lost during converting and rendering. Bug \nWORDSNET-5332 Content is moved to the next page after rendering. Bug \nWORDSNET-5333 Floating tables overlap and wrong text wrapping after rendering. Bug \nWORDSNET-5498 There is no chapter number before page number in TOC after updating fields. Bug \nWORDSNET-5574 Indent of text in table is incorrect after rendering. Bug \nWORDSNET-5928 /tab/ TabStops, TabLeader disappear when exporting to HTML Bug \nWORDSNET-6294 Stop rendering Highlight color of Empty Run in PDF Bug \nWORDSNET-6584 /revision marks/ Revisions are rendering incorrectly in PDF Bug \nWORDSNET-6907 /tab/ Support tabs in TOC on HTML export Bug \nWORDSNET-7116 Doc to Mhtml conversion issue with text alignment Bug \nWORDSNET-7269 Docx to HTML conversion issue with left indent Bug \nWORDSNET-7606 Dotted Tabs disappear when exporting to HTML Bug \nWORDSNET-7670 Include chapter number do not export in output PDF file Bug \nWORDSNET-7765 TabStops in FooterPrimary are not respected during exporting to Html Bug \nWORDSNET-8097 Doc to ODT conversion issue with merged cell Bug \nWORDSNET-9114 /Advanced tabs/ Tab character disturbs Paragraph layout in footer in PDF Bug \nWORDSNET-9188 Document.AppendDocument changes the text color using ImportFormatMode as UseDestinationStyles Bug \nWORDSNET-9199 Chinese font changes after conversion form RTF to Doc/Docx/Pdf Bug \nWORDSNET-9250 Document.Save does not preserve table's border line Bug \nWORDSNET-9276 A TextBox shape with Through wrapping causes misplaced rendering of another TextBox Bug \nWORDSNET-9298 supportMisalignedColumns tag is being inserted during open/save a HTML Bug \nWORDSNET-9321 Incorrect hyperlinks are imported into Aspose.Words DOM Bug \nWORDSNET-9339 First lines of list paragraphs have different left indentation in fixed page formats Bug \nWORDSNET-9359 UpdatePageLayout or UpdateFields changes left indentations of first lines of lists Bug \nWORDSNET-9364 Aspose.Words hangs when Document.PageCount is invoked Bug \nWORDSNET-9378 ROOT Improve hidden text handling. Incorrect alphabet is shown for a list item in PDF. Bug \nWORDSNET-9384 Link does not preserve in output Pdf file after conversion from HTML Bug \nWORDSNET-9395 Aspose.Words renders more pages in PDF than Microsoft Word 2013 Bug \nWORDSNET-9447 Tab leaders (dots) are not preserved when exporting to HTML Bug \nWORDSNET-9449 A tab character is exported to html incorrectly Bug \nWORDSNET-9461 Chinese characters in url are corrupted when rendering to Pdf Bug \nWORDSNET-9462 Aspose.Words does not import table's style attribute 'border-collapse:collapse' Bug \nWORDSNET-9470 Text in header is placed incorrectly after conversion from Docx to HTML Bug \nWORDSNET-9482 Text tags contained inside Text FormField are not merged Bug \nWORDSNET-9485 Suppress rendering of all hidden content in output Pdf Bug \nWORDSNET-9490 Suppress rendering of all hidden content in output Pdf Bug \nWORDSNET-9494 HTML to Docx/Doc conversion issue with table's border Bug \nWORDSNET-9502 Order of digits separated by arabic commas become invalid when saved to fixed formats Bug \nWORDSNET-9535 \"Error! Not a valid filename\" is displayed for INCLUDETEXT after mail merge Bug \nWORDSNET-9566 Aspose.Words.FileCorruptedException occurs when loading RTF file Bug \nWORDSNET-9576 Document.UpdateFields changes the PAGE field value Bug \nWORDSNET-9583 Text is truncated after conversion from Docx to BMP file format Bug \nWORDSNET-9607 HTML to Pdf conversion issue with font rendering Bug \nWORDSNET-9610 IMailMergeDataSource.GetValue is not invoked for nested regions contained inside IF field Bug \nWORDSNET-9611 Author, DateTime of a Revision is incorrectly returned Bug \nWORDSNET-9618 Non-zero space before the first paragraph of a document imported from preformatted HTML Bug \nWORDSNET-9619 No new paragraph is created for inline text imported from [pre] elements Bug \nWORDSNET-9620 Incorrect size of text imported from a paragraph that is a child of a [pre] element Bug \nWORDSNET-9621 A new line is not imported if it separates child elements of pre Bug \nWORDSNET-9624 Heading3 gray color appears when rendering to fixed page formats Bug \nWORDSNET-9639 RowFormat.HeightRule is changed after conversion from MHT to Doc/Docx Bug \nWORDSNET-9648 Company logo size is not preserved in Pdf Bug \nWORDSNET-9650 An AutoShape drawing renders at the end of previous page in Pdf Bug \nWORDSNET-9652 Shapes overlap the Table in HeaderPrimary during open/save an ODT Bug \nWORDSNET-9653 NullReferenceException occurs during rendering a DOC to fixed page formats Bug \nWORDSNET-9662 A DrawingML (.emf image) is not rendering as expected in Pdf Bug \nWORDSNET-9668 Tab stop positions are not preserved during open/save a DOC Bug \nWORDSNET-9671 Size of image is changed during importing from Html Bug \nWORDSNET-9683 SmartArt DrawingML is distorted when rendering to Pdf Bug \nWORDSNET-9699 JPG images are getting lost during rendering Bug \nWORDSNET-9700 Header/Footer heights are not reserved during open/save an ODT Bug \nWORDSNET-9714 Tabs are not respected during exporting to Html Bug \nWORDSNET-9723 A Shape and DrawingML are not visible in fixed page formats Bug \nWORDSNET-9735 Aspose.Words.Document does not load the checkboxes (Wingdings 2 font) Bug \nWORDSNET-2309 Line of text is missed during rendering/converting to PDF. Enhancement \nWORDSNET-4986 WordArt // Multiline // Multi-line watermark is not rendered properly. Enhancement \nWORDSNET-5084 Position of floating frames is incorrect after rendering. Enhancement \nWORDSNET-6376 RTF to PDF conversion issue Enhancement \nWORDSNET-8302 Formatting of PAGE field is not retained during rendering Enhancement \nWORDSNET-8368 /Advanced tabs/ A Paragraph's text wraps to the next line in FooterPrimary in PDF Enhancement \nWORDSNET-8574 Compatibility mode attribute is overwritten by DocumentValidator, breaking the document layout Enhancement \nWORDSNET-8639 Export/import tabs with center alignment to/from HTML Enhancement \nWORDSNET-9464 Tab spacing is incorrect when exporting to Html Enhancement \nWORDSNET-9465 Tab spacing is incorrect when exporting to Html Enhancement \nWORDSNET-9478 A Paragraph renders to the right side of Table in Pdf Enhancement \nWORDSNET-9556 Replace WriteRaw with StartElement/EndElement pair in HTML Export. Enhancement \nWORDSNET-9643 Alignment of WordArt text is not preserved during rendering/printing Enhancement \nWORDSNET-9663 Content is rendering on the previous pages in fixed page formats Enhancement \nWORDSNET-9665 DrawingML positions are not preserved when saving to fixed page formats Enhancement \nWORDSNET-9666 linked image does not update in output documents Enhancement \nWORDSNET-9693 Horizontal axis of composite chart are combined incorrectly Enhancement \nWORDSNET-9694 Axis labels if very right axis is rendered left, but should be rendered right. Enhancement \nWORDSNET-9710 Revision bar is displaying as very thick line in generated PDF Enhancement \nWORDSNET-9731 A picture is shifted up towards top page edge in Pdf Enhancement \nWORDSNET-9738 Paragraphs below Tables render (wrap) to their right sides in fixed page formats Enhancement \nWORDSNET-7667 NullReferenceException occurs during rendering to fixed page formats Exception \nWORDSNET-8905 NullReferenceException occurs when calling UpdateFields after Document.AppendDocument method Exception \nWORDSNET-9601 System.NullReferenceException is thrown while converting Docx to Fixed file format (Tiff) Exception \nWORDSNET-9608 System.InvalidOperationException is thrown while converting Docx to Pdf/Png Exception \nWORDSNET-9609 InvalidOperationException occurs during rendering to fixed page formats Exception \nWORDSNET-9616 Aspose.Words.FileCorruptedException occurs when loading a DOCX Exception \nWORDSNET-9623 System.InvalidOperationException is thrown while converting Docx to Tiff/Doc/Html Exception \nWORDSNET-9654 Aspose.Words.FileCorruptedException is thrown while loading MS Word 2013 document Exception \nWORDSNET-9656 InvalidOperationException with AcceptAllRevisions() Exception \nWORDSNET-9659 Document.UpdatePageLayout throws System.NullReferenceException Exception \nWORDSNET-9690 Document.Save method throws System.ArgumentOutOfRangeException while saving docx to Pdf Exception \nWORDSNET-1035 /tab/ Try to export tabs and tab positions to HTML better. Feature \nWORDSNET-2177 Consider adding “Automatically update document styles” option. Feature \nWORDSNET-2707 /hyphenation/ ROOT Support hyphenation Feature \nWORDSNET-2854 Digitally sign XPS documents Feature \nWORDSNET-4353 DrawingML SFX // Support \"Soft edges\" effect of shape upon rendering. Feature \nWORDSNET-5003 /tab/ Support tab leaders upon exporting to HTML Feature \nWORDSNET-6448 /revision marks/ Docx to PDF conver issue with text style. Feature \nWORDSNET-6618 /tab/ DOCX to HTML conversion issue with spaces after bullets Feature \nWORDSNET-6743 /revision marks/ Docx to Pdf conversion issue with hidden text when track changes is ON Feature \nWORDSNET-6901 /hyphenation/ Support hyphenation Feature \nWORDSNET-7096 /hyphenation/ Saving Word with one page as PDF results in a second page Feature \nWORDSNET-7280 Consider providing a property similar to UpdateStylesOnOpen Feature \nWORDSNET-7748 Export layout options as per Microsoft Word 2010 standard Feature \nWORDSNET-8677 Table position is changed after re-saving Docx Feature \nWORDSNET-9044 /hyphenation/ Docx to Pdf conversion issue with automatic text wrapping Feature \nWORDSNET-9100 Support rendering DrawingML effects. Feature \nWORDSNET-9174 /hyphenation/ Spacing between words is increaed in fixed page formats Feature \nWORDSNET-9213 /hyphenation/ Hyphenated content is not rendering correctly in PDF Feature \nWORDSNET-9319 Preserve trackmoves revision upon RTF round-trip. Feature \nWORDSNET-9540 Expose the compatibility mode property Feature \nWORDSNET-9528 List numbering is not visible in output Rtf Regression",
  "requireLicenseAcceptance": true,
  "title": "Aspose.Words for .NET",
  "verbatimVersion": "14.2.0",
  "version": "14.2.0",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.21.06.24.30/aspose.words.14.2.0.json#Aspose.Words.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 4047,
      "fullName": "Aspose.Words.nuspec",
      "length": 11828,
      "name": "Aspose.Words.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.21.06.24.30/aspose.words.14.2.0.json#lib/net2.0/Aspose.Words.dll",
      "@type": "PackageEntry",
      "compressedLength": 4279019,
      "fullName": "lib/net2.0/Aspose.Words.dll",
      "length": 9877504,
      "name": "Aspose.Words.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.21.06.24.30/aspose.words.14.2.0.json#lib/net3.5-client/Aspose.Words.dll",
      "@type": "PackageEntry",
      "compressedLength": 4278768,
      "fullName": "lib/net3.5-client/Aspose.Words.dll",
      "length": 9875968,
      "name": "Aspose.Words.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.21.06.24.30/aspose.words.14.2.0.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9462,
      "fullName": ".signature.p7s",
      "length": 9462,
      "name": ".signature.p7s"
    }
  ],
  "tags": [
    "Word",
    "DOC",
    "DOCX",
    "OOXML",
    "OpenDocument",
    "PDF",
    "XPS",
    "ODT",
    "HTML",
    "XHTML",
    "WordprocessingML",
    "Document",
    "EPUB"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    }
  }
}