{
  "@id": "https://api.nuget.org/v3/catalog0/data/2015.10.02.09.18.10/aspose.pdf.10.9.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "Aspose",
  "catalog:commitId": "425bd072-6173-4b56-82b7-a73d1b0b2346",
  "catalog:commitTimeStamp": "2015-10-02T09:18:10.6537065Z",
  "copyright": "©Aspose 2002-2014. All Rights Reserved.",
  "created": "2015-10-02T09:17:43.917Z",
  "description": "Aspose.Pdf for .NET is a PDF document creation and manipulation component that enables your .NET applications to read, write and manipulate existing PDF documents without using Adobe Acrobat. It also allows you to create forms and manage form fields embedded in a PDF document. This component is written in managed C# and it allows developers to add PDF creation and manipulation functionality to their Microsoft .NET applications (WinForms, ASP.NET and .NET Compact Framework).\n        Aspose.Pdf for .NET is affordable and offers an incredible wealth of features including PDF compression options; table creation and manipulation; support for graph objects; extensive hyperlink functionality; extended security controls; custom font handling; integration with data sources; add or remove bookmarks; create table of contents; add, update, delete attachments and annotations; import or export PDF form data; add, replace or remove text and images; split, concatenate, extract or inset pages; transform pages to image; print PDF documents and much more.",
  "iconUrl": "http://www.aspose.com/blogs/wp-content/uploads/2013/06/aspose-Pdf-for-net_100.png",
  "id": "Aspose.Pdf",
  "isPrerelease": false,
  "lastEdited": "0001-01-01T00:00:00Z",
  "licenseNames": "",
  "licenseReportUrl": "",
  "licenseUrl": "http://www.aspose.com/corporate/purchase/end-user-license-agreement.aspx",
  "listed": true,
  "packageHash": "HGyMAOvRrwM1+yUsA/8yzkaY+zFd3Dq/SW3FXtbEaFS3SF/uCL7pmMVoCDfyhSw7d3Pb1D6qGhvDhL3guNyRZQ==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 29967395,
  "projectUrl": "http://www.aspose.com/categories/.net-components/aspose.pdf-for-.net/default.aspx",
  "published": "2015-10-02T09:17:43.917Z",
  "releaseNotes": "This release introduces the features, enhancements and bug fixes as detailed below:\n\t\t\nEnhancements\nPDFNEWNET-39323 Support to add hyperlink to TextSegment\nPDFNEWNET-34401 Underline words are saved in an outer image file instead of being saved as CSS.(Hebrew PDF to HTML conversion)\nPDFNEWNET-36388 PDF to HTML - Underline text information is not included in style.css\n\nExceptions\nPDFNEWNET-39201 NullReferenceException during files concatenation\nPDFNEWNET-39437 API throws ArgumentOutOfRangeException when adding second TextFragment with starting with space using InlineParagraph\nPDFNEWNET-37856 Exception when trying to call Optimize() method\nPDFNEWNET-39417 ArgumentOutOfRangeException when adding TextFragment to PDF file\n\nBugs\nPDFNEWNET-39308 Performance issue in 9.1.0 and 10.7.0\nPDFNEWNET-33616 PDF Alignment Issues with XSL-FO to PDF\nPDFNEWNET-35589 PDF to XPS - resultant file is not showing contents\nPDFNEWNET-36336 Non-Egnlish characters are not appearing properly\nPDFNEWNET-37925 PDF to JPEG - Image on first page is turned upside down\nPDFNEWNET-37947 XML+XSLT to PDF: \"-\"character cause invalid PDF\nPDFNEWNET-38257 Attachment name is not being updated\nPDFNEWNET-38425 Fonts are not being Optimized when concatenating PDF files\nPDFNEWNET-38495 CallBackGetHocr is not working\nPDFNEWNET-38737 PDF to PDFA1b: output is not PDFA1b compliant\nPDFNEWNET-38775 EPUB to PDF - Conversion process hangs\nPDFNEWNET-38819 PDF to HTML - Text is overlapped in Header section\nPDFNEWNET-38852 PDF to PDFA1b compliance issue\nPDFNEWNET-38887 Heading object with long text is not being wrapped but moves off the top\nPDFNEWNET-38889 Heading with long text running off the page\nPDFNEWNET-39060 Colspan and Rowspan properties together in a row are not working properly\nPDFNEWNET-39115 PDF to HTML - Resultant file is not correct\nPDFNEWNET-39258 PDF to HTML - The output HTML is messed up\nPDFNEWNET-39262 Margin for image on subsequent page is not correct\nPDFNEWNET-39305 Title in TOC is Cut and page number is not visible in TOC\nPDFNEWNET-39322 Inline TextFragments with right alignment results wrong results\nPDFNEWNET-39336 The inline paragraph is rendered wrong in the table cell\nPDFNEWNET-39441 FormEditor.Facade.FontSize ignored with custom font\nPDFNEWNET-38879 Application hangs when trying to place scaled image in Table cell\nPDFNEWNET-38880 FloatingBox IsInNewPage not working as expected\nPDFNEWNET-37782 Cells with HtmlFragment text formatting issue\nPDFNEWNET-39123 Text is not wrapped to subsequent lines when using CharacterSpacing field\nPDFNEWNET-38116 TextFragmentAbsorber has very slow performance",
  "requireLicenseAcceptance": true,
  "summary": "Aspose.Pdf for .NET is an amazing component which provides the feature to create and manipulate PDF documents.",
  "title": "Aspose.Pdf for .NET",
  "verbatimVersion": "10.9.0",
  "version": "10.9.0",
  "tags": [
    "Aspose.Pdf",
    "PDF",
    "XFA",
    "XPS",
    "TIFF",
    "PCL",
    "SVG",
    "HTML",
    "XML",
    "XSL-FO",
    "FDF",
    "XFDF",
    "PDF/A",
    "form",
    "Portfolio",
    "EPUB",
    "PSD",
    "to",
    "XLS",
    "DOC"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    }
  }
}