{
  "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.22.23.23.11/aspose.pdf.9.0.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "Aspose",
  "catalog:commitId": "c4ad8c0c-e969-42de-bb11-4fa2e5897d00",
  "catalog:commitTimeStamp": "2018-10-22T23:23:11.674472Z",
  "copyright": "©Aspose 2002-2013. All Rights Reserved.",
  "created": "2014-03-01T13:37:26.363Z",
  "description": "Aspose.Pdf for .NET is a PDF document creation and manipulation component that enables your .NET applications to read, write and manipulate existing PDF documents without using Adobe Acrobat. It also allows you to create forms and manage form fields embedded in a PDF document. This component is written in managed C# and it allows developers to add PDF creation and manipulation functionality to their Microsoft .NET applications (WinForms, ASP.NET and .NET Compact Framework).\n        Aspose.Pdf for .NET is affordable and offers an incredible wealth of features including PDF compression options; table creation and manipulation; support for graph objects; extensive hyperlink functionality; extended security controls; custom font handling; integration with data sources; add or remove bookmarks; create table of contents; add, update, delete attachments and annotations; import or export PDF form data; add, replace or remove text and images; split, concatenate, extract or inset pages; transform pages to image; print PDF documents and much more.",
  "iconUrl": "http://www.aspose.com/blogs/wp-content/uploads/2013/06/aspose-Pdf-for-net_100.png",
  "id": "Aspose.Pdf",
  "isPrerelease": false,
  "lastEdited": "2018-10-22T23:22:58.06Z",
  "licenseUrl": "http://www.aspose.com/corporate/purchase/end-user-license-agreement.aspx",
  "listed": true,
  "packageHash": "c34ojFGKhQPUX+iNYKhs/tQgdkmiF8KU6xQW0E7iaXAzEH7VMCuI7VOXUC590px5h6wJiq/VPTsokYHxZXnY7w==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 30233922,
  "projectUrl": "http://www.aspose.com/categories/.net-components/aspose.pdf-for-.net/default.aspx",
  "published": "2014-03-01T13:37:26.363Z",
  "releaseNotes": "This release introduces the features, enhancements and bug fixes as detailed below:\n\nNew Features\nPDFNEWNET-29919\tConvert MHT file into PDF format\nPDFNEWNET-35467\tHow to Extract embedded certificate file and image from digitally signed PDF document.\nPDFNEWNET-36055\tExtract Signature information\nPDFNEWNET-36286\tAdd the ability to prefix CSS class names in style.css\nPDFNEWNET-36394\tExportBookmarksToXML() should return output in Stream or XmlDocument object\nPDFNEWNET-36435 PDF to HTML - Add a prefix to import directives\n\nEnhancements\nPDFNEWNET-34445\tSupport for Adobe Arabic font when using Right to Left Text\nPDFNEWNET-35653\tCenter the output and add a page border\nPDFNEWNET-35654\tAdd justified text into the HTML paragraph\nPDFNEWNET-35655\tPages should flow depending on screen resolution\nPDFNEWNET-35656\tIdentify tabular data an correctly alignment\nPDFNEWNET-35668\tPDF to HTML: Pages flow should dep\nPDFNEWNET-36044\tExtracting image from signature field\nPDFNEWNET-36273\tPDFNEWNET-35885 Improve performance of APS to Pdf conversion in context of HTML to Pdf scenario\nPDFNEWNET-36304\tOpening PDF document with Adobe Reader throws error \"FontPackage Required ..\"\nPDFNEWNET-36346\tPDFNEWNET-36332 Improve font substitution for different parts of text segment\nPDFNEWNET-36405 Improve Concatenation performance\n\nExceptions\nPDFNEWNET-34450\tObject Reference Exception thrown on Saving the document\nPDFNEWNET-35787\tException while converting PDF to PDF/A\nPDFNEWNET-35878\tException: Invalid Signature Object exception\nPDFNEWNET-36149\tWhile converting PDF to JPG StackOverFlowException is being raised\nPDFNEWNET-36315\tPDF to TIFF - StackOverflowException during conversion\n\nBugs\nPDFNEWNET-33822\tHTML to PDF conversion - Hang on Save\nPDFNEWNET-33866\tImages are not present when converting PDF to DOC format\nPDFNEWNET-34904\tPDF to XPS: Objects missing over resultant file\nPDFNEWNET-35684\tVerifySigned returning false\nPDFNEWNET-35712\tPDF to TIFF: StackOverflow exception arises\nPDFNEWNET-35885\tHTML to PDF: empty file is being generated\nPDFNEWNET-35898\tHTML to PDF: Table format is lost\nPDFNEWNET-36119\tSignature corrupts during ExportAnnotationsXfdf and ImportAnnotationFromXfdf\nPDFNEWNET-36157\tXPS to PDF: some text is missing in resultant PDF file\nPDFNEWNET-36158\tXPS to PDF: Rectangle renders incorrectly\nPDFNEWNET-36189\tPDF to HTML converter - used not exact fonts\nPDFNEWNET-36283 Keyword property enclosed in double quotes with use of comma or CR/LF\nPDFNEWNET-36348\tTXT to PDF - Special characters are not being rendered to PDF file\nPDFNEWNET-36354\tProblem with PdfFileEditor.Concatenate\nPDFNEWNET-36372\tXPS to PDF - resultant file is not correct\nPDFNEWNET-36380\tProblem converting PDF to PDF/A_1b\nPDFNEWNET-36390\tBookmark is skipping one page after chnaging bookmark zoom level to Inherit zoom\nPDFNEWNET-36398\tFirst page is corrupted if we make any change in the PDF\nPDFNEWNET-36404\tWhen adding TextStamp, fillable fields no longer work correctly\nPDFNEWNET-36412\tFlattening the fields shows hidden fields\nPDFNEWNET-36413\tFlattening form hides the visible fields\nPDFNEWNET-36429\tSaveNewInfo() method of PdfFileInfo class results a zero length file\nPDFNEWNET-36437 Large data, no new page created\nPDFNEWNET-36441\tUnable to certify the PDF document\nPDFNEWNET-36464\tPDFNEWNET-36332 Page splitting works wrong with new generator\nPDFNEWNET-36478 PDF to Excel - Image does not appear in resultant file",
  "requireLicenseAcceptance": true,
  "summary": "Aspose.Pdf for .NET is an amazing component which provides the feature to create and manipulate PDF documents.",
  "title": "Aspose.Pdf for .NET",
  "verbatimVersion": "9.0.0",
  "version": "9.0.0",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.22.23.23.11/aspose.pdf.9.0.0.json#Aspose.Pdf.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 2431,
      "fullName": "Aspose.Pdf.nuspec",
      "length": 5513,
      "name": "Aspose.Pdf.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.22.23.23.11/aspose.pdf.9.0.0.json#lib/net2.0/Aspose.Pdf.dll",
      "@type": "PackageEntry",
      "compressedLength": 15114099,
      "fullName": "lib/net2.0/Aspose.Pdf.dll",
      "length": 22052808,
      "name": "Aspose.Pdf.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.22.23.23.11/aspose.pdf.9.0.0.json#lib/net40-client/Aspose.Pdf.dll",
      "@type": "PackageEntry",
      "compressedLength": 15104271,
      "fullName": "lib/net40-client/Aspose.Pdf.dll",
      "length": 22037448,
      "name": "Aspose.Pdf.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.22.23.23.11/aspose.pdf.9.0.0.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9463,
      "fullName": ".signature.p7s",
      "length": 9463,
      "name": ".signature.p7s"
    }
  ],
  "tags": [
    "Aspose.Pdf",
    "PDF",
    "XFA",
    "XPS",
    "TIFF",
    "PCL",
    "SVG",
    "HTML",
    "XML",
    "XSL-FO",
    "FDF",
    "XFDF",
    "PDF/A",
    "form",
    "Portfolio",
    "EPUB",
    "PSD",
    "to",
    "XLS",
    "DOC"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    }
  }
}