{
  "@id": "https://api.nuget.org/v3/catalog0/data/2015.02.03.22.01.37/aspose.words.13.9.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "Aspose",
  "catalog:commitId": "faf8d08b-b577-40f8-882c-1b2f32eccd18",
  "catalog:commitTimeStamp": "2015-02-03T22:01:37.9807995Z",
  "copyright": "© Aspose 2002-2013. All Rights Reserved.",
  "created": "2013-10-09T06:27:53.947Z",
  "description": "Aspose.Words for .NET class library supports DOC, DOCX, RTF, HTML, OpenDocument, PDF, XPS, EPUB and other formats. With Aspose.Words you can generate, modify, convert, render and print documents without utilizing Microsoft Word®",
  "iconUrl": "http://www.aspose.com/images/products/dotnet/Aspose.Words_128x128.png",
  "id": "Aspose.Words",
  "isPrerelease": false,
  "lastEdited": "0001-01-01T00:00:00Z",
  "licenseUrl": "http://www.aspose.com/corporate/purchase/end-user-license-agreement.aspx",
  "packageHash": "+t4MdIjqlZvR437Rq/vuq78ppyxCIqVGm4wfrrJ0UeoiCqIXlbAJ+K3qI0LMYQ48mpy40Vvd4c0iYlMR7JNsEQ==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 10742138,
  "projectUrl": "http://www.aspose.com/categories/.net-components/aspose.words-for-.net/default.aspx",
  "published": "2013-10-09T06:27:53.947Z",
  "releaseNotes": "There are 115 improvements and fixes in this regular monthly release. The most notable are:\n\n• Further features and improvements in DrawingML Charts rendering\n• Textboxes rendering improvements\n• \"Zero-weight\" files are now supported\n• Various improvements in handling of MS Word formats\n\nThis release introduces the new features, enhancements and fixes to the excptions/bugs as detailed below:\n\n• New features\nWORDSNET-1638\t/cell border diagonal/ Render diagonal cell borders in the new layout\nWORDSNET-3315\t/Word Perfect Justification/ ROOT Extra page is added upon rendering.\nWORDSNET-3732\t/cell border diagonal/ Diagonal table border disappears during rendering.\nWORDSNET-6968\tSupport advanced chart features.\nWORDSNET-8084\tSupport advanced 3D charts features.\nWORDSNET-8867\tSupport \"Display Units\" upon rendering axis labels.\nWORDSNET-8877\tTab spacing is not respected in fixed page formats\nWORDSNET-8895\tDoc to Pdf conversion issue with text (underscore) rendering\nWORDSNET-8898\tAdd option in PdfSaveOptions for Open Type of Pdf\n\n• Enhancements\nWORDSJAVA-754\tUnproperly resolved RTL text with incorrect properties inside SDT.\nWORDSJAVA-772\tWMF XOR (SRCINVERT) operation unproperly rendered to PDF\nWORDSJAVA-773\tWmf image is filled by black background.\nWORDSJAVA-781\tPublically set TableName in com.aspose.words.DataTable\nWORDSNET-3270\tDistance between bullets and text is too big after importing HTML.\nWORDSNET-4197\tHTML export: Table's lines disappeared in IE9, Chrome, Opera browsers\nWORDSNET-5868\tCompatibilityOptions.DoNotExpandShiftReturn is not working with PDF files\nWORDSNET-6607\tFont has changed after appending one document to another\nWORDSNET-7023\tIncorrect floater vertical position if relative to a paragraph inside a floating table\nWORDSNET-7829\t/cell border diagonal/ Diagonal borders in a table cell are lost when rendering to PDF\nWORDSNET-8678\tAspose.Words.Document does not open empty document\nWORDSNET-8711\tDocx to HTML conversion issue with table border\nWORDSNET-8792\tMultiple bookmarks are generated in PDF for one bookmark in header of document\nWORDSNET-8801\tGroupShape causes Aspose.Words to throw System.ArgumentException during exporting a Doc to Html\nWORDSNET-8844\tPage Left Margin increases after conversion from HTML to Pdf\nWORDSNET-8849\tProvide method to add Built-in style in the Document.Styles collection\nWORDSNET-8860\tPage background is corrupted while rendering\nWORDSNET-8891\t'Times New Roman' 8pt text gets blurred when exported to image on Windows 8\nWORDSNET-8896\tDoc to Pdf conversion issue with Text Indents\n\n• Exceptions\nWORDSJAVA-750\tjava.lang.reflect.InvocationTargetException occurs when rendering Docx to Pdf\nWORDSJAVA-769\tNullPointerException occurs when saving doc as pdf in multiple threads\nWORDSNET-8788\tAspose.Words.FileCorruptedException occurs when loading RTF file\nWORDSNET-8798\tAspose.Words.FileCorruptedException occurs when loading RTF file\nWORDSNET-8816\tAspose.Words.FileCorruptedException occurs when loading Docx file\nWORDSNET-8843\tSystem.InvalidOperationException is thrown when BuiltInDocumentProperties.Thumbnail is used with Doc SaveFormat\nWORDSNET-8864\tSystem.InvalidOperationException is thrown while converting Docx to Pdf\nWORDSNET-8869\tOleFormat.SuggestedExtension throws System.IO.EndOfStreamException\nWORDSNET-8873\tDocument.UpdateFields method throws System.NullReferenceException\nWORDSNET-8889\tInvalidOperationException occurs during exporting DOC to HTML\nWORDSNET-8916\tSystem.ArgumentOutOfRangeException occurs during rendering/exporting to PDF/HTML\nWORDSNET-8917\tInvalidCastException occurs during rendering/exporting DOC to PDF/HTML\nWORDSNET-8934\tInvalidOperationException occurs during rendering/exporting DOC to PDF/HTML\n\n• Bugs\nWORDSJAVA-742\tAspose.Words.jdk16-13.6.0 causing apache-tomcat memory leak warning logs\nWORDSJAVA-762\tLost image effects.\nWORDSJAVA-774\tText inside inline OLE doesn't show.\nWORDSJAVA-777\tJPEGImageReader causes memory leak during PDF conversion on JDK1.6.0_45\nWORDSJAVA-780\tImport characters in range 0x80 - 0x9F from HTML documents encoded in 'ISO-8859-1'\nWORDSJAVA-783\tCultureInfo for uk-UA under win8\nWORDSJAVA-784\tCan't parse iTXt_chunk during reading Png\nWORDSJAVA-785\tLoad external CSS by URI with the 'file:' scheme with arbitrary number of slushes\nWORDSJAVA-792\tUnsupported FileFormat Exception during test save-load\nWORDSNET-5448\tContent inside the text box is trimmed.\nWORDSNET-6309\tExtended Unicode (Surrogate pair) characters are rendered incorrectly.\nWORDSNET-7066\tDocx to HTML conversion issue with GroupShapes\nWORDSNET-7073\t/clipping/ Doc to PDF conversion issue with Shape Cut off\nWORDSNET-7231\tThe amount of spacing after the paragraph is incorrectly set to Auto\nWORDSNET-7685\tDuring exporting RTF to HTML the output sizes becomes too big\nWORDSNET-7835\tFrame is destroyed after conversion to PDF\nWORDSNET-7951\t'margin' CSS style in Html is imported incorrectly for Paragraphs\nWORDSNET-8126\tTable content is truncated from the bottom in PDF\nWORDSNET-8538\tTextBox Shapes with Through wrapping are not visible in PDF\nWORDSNET-8592\tAspose.Words does not load images from MHTML\nWORDSNET-8616\tImages are convreterd to “red cross” after open/save MHT document\nWORDSNET-8626\tSome content is moved to the next line in fixed page formats\nWORDSNET-8635\tEmpty paragraphs become highlighted after conversion to HTML\nWORDSNET-8659\tBarcode image is getting cropped from top when rendering to PDF\nWORDSNET-8673\tGroup Shape is broken after conversion from Docx to Pdf\nWORDSNET-8686\tText in TextBox shape is not rendering to PDF\nWORDSNET-8688\tIncorrect position of text fields when rendering to PDF\nWORDSNET-8754\tText position is changed after conversion from Docx to Pdf\nWORDSNET-8761\tBackground color of GroupShape become black after rendering\nWORDSNET-8769\tText position of of first line of List paragraph is incorrect in Pdf\nWORDSNET-8772\tEmpty spaces are added after conversion from Docx to Doc\nWORDSNET-8808\tChrome does not display newly entered characters in Text FormField in Pdf\nWORDSNET-8809\tA square box is inserted in between list's bullet and text in Pdf\nWORDSNET-8813\tUseDestinationStyles is not working with Heading styles\nWORDSNET-8815\tDoc to Pdf conversion issue with mathematical formulas rendering\nWORDSNET-8828\tStructuredDocumentTag.ListItems do not load all list items in Aspose.Words DOM\nWORDSNET-8829\tPdfSaveOptions.PreserveFormFields (true) change the position of Form Fields in Pdf file\nWORDSNET-8834\tDocument.Save corrupts the Microsoft Word 2013 document\nWORDSNET-8845\tContents position is incorrect after joining documents with Document.AppendDocument\nWORDSNET-8850\tdoc.Styles[StyleIdentifier.NoteHeading] does not create style in the document\nWORDSNET-8852\tMailMerge.Execute repeats/duplicates a Footnote in output document\nWORDSNET-8858\tJapanese contents lost after conversion from Doc to Pdf\nWORDSNET-8862\tShape is rendered incorrectly\nWORDSNET-8863\tStyle inheritance does not work when copying style to another document\nWORDSNET-8868\tText of second line moves to first line after conversion from Docx to Pdf\nWORDSNET-8875\tDocx to Html conversion issue with formula (Image) rendering\nWORDSNET-8882\tDocument.RemoveUnusedResources changes list styles\nWORDSNET-8883\tPositions of frames are not preserved during rendering to PDF\nWORDSNET-8884\tPage margins are ignored when saved as PDF\nWORDSNET-8892\tDoc to Pdf conversion issue with PdfSaveOptions.PreserveFormFields\nWORDSNET-8893\tIncorrect Character Rendering while conversion from mhtml to fixed file format\nWORDSNET-8894\tDoc to Pdf conversion issue while rendering line\nWORDSNET-8908\tDate field format is not preserved during open/save an ODT\nWORDSNET-8930\tSaving MS Word document to Pdf loses space character for font Code 128\nWORDSNET-8938\tWebdings symbols are rendering as square boxes in Pdf\nWORDSNET-8939\tThe text alignment in Textbox is not preserved during converting to Pdf\nWORDSNET-8943\tShape is rendering at incorrect place in PDF\nWORDSNET-8961\tSpaceAfter value is not preserved during importing <p> from HTML\nWORDSNET-8963\tFont issue while inserting SVG into document\nWORDSNET-8965\tA customized Combo DrawingML chart is incorrectly rendering to PDF/JPEG\nWORDSNET-8977\tRun.Font.Bold return incorrect value for Revision type FormatChange\n\n• Performance\nWORDSJAVA-715\tGeneration of very big doc on Java 6 is slower than on Java 5\nWORDSJAVA-768\tCorrupt JPEG data: premature end of data segment error occurs during saving to HTML_FIXED\nWORDSNET-8823\tDocument.UpdateFields method hangs during calculating PAGE fields\nWORDSNET-8837\tShape causes Aspose.Words to hang during rendering DOC to PDF\n\n• Regressions\nWORDSNET-8915\tDocument.Save method throws System.DivideByZeroException\nWORDSNET-8923\tDocument.Save method throws System.DivideByZeroException\nWORDSNET-8924\tDocument.Save method throws System.DivideByZeroException\nWORDSNET-8925\tDocument.Save method throws System.DivideByZeroException\nWORDSNET-8926\tDocument.Save method throws System.DivideByZeroException\nWORDSNET-8927\tDocument.Save method throws System.DivideByZeroException\nWORDSNET-8928\tDocument.Save method throws System.DivideByZeroException\nWORDSNET-8929\tDocument.Save method throws System.DivideByZeroException\nWORDSNET-8935\tAspose.Words.FileCorruptedException occurs when loading DOC file",
  "requireLicenseAcceptance": true,
  "title": "Aspose.Words for .Net",
  "version": "13.9.0",
  "tags": [
    "Aspose.Words",
    "DOC",
    "DOCX",
    "RTF",
    "HTML",
    "OpenDocument",
    "XPS",
    "EPUB",
    "Word",
    "Document",
    "Processing"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    }
  }
}