{
  "@id": "https://api.nuget.org/v3/catalog0/data/2015.02.05.05.53.25/fastdfs.1.0.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "mr.wangya@qq.com",
  "catalog:commitId": "9cbc034d-4e58-4e60-9615-4610e538ed87",
  "catalog:commitTimeStamp": "2015-02-05T05:53:25.4642977Z",
  "copyright": "https://code.google.com/p/fastdfs/",
  "created": "2014-04-22T01:28:05.62Z",
  "description": "FastDFS is an open source high performance distributed file system (DFS). It's major functions include: file storing, file syncing and file accessing, and design for high capacity and load balancing.\n\nFastDFS is an open source high performance distributed file system. It's major functions include: file storing, file syncing and file accessing (file uploading and file downloading), and it can resolve the high capacity and load balancing problem. FastDFS should meet the requirement of the website whose service based on files such as photo sharing site and vidio sharing site.\n\nFastDFS has two roles: tracker and storage. The tracker takes charge of scheduling and load balancing for file access. The storage store files and it's function is file management including: file storing, file syncing, providing file access interface. It also manage the meta data which are attributes representing as key value pair of the file. For example: width=1024, the key is \"width\" and the value is \"1024\".\n\nThe tracker and storage contain one or more servers. The servers in the tracker or storage cluster can be added to or removed from the cluster by any time without affecting the online services. The servers in the tracker cluster are peer to peer.\n\nThe storarge servers organizing by the file volume/group to obtain high capacity. The storage system contains one or more volumes whose files are independent among these volumes. The capacity of the whole storage system equals to the sum of all volumes' capacity. A file volume contains one or more storage servers whose files are same among these servers. The servers in a file volume backup each other, and all these servers are load balancing. When adding a storage server to a volume, files already existing in this volume are replicated to this new server automatically, and when this replication done, system will switch this server online to providing storage services. When the whole storage capacity is insufficiency, you can add one or m",
  "iconUrl": "https://ssl.gstatic.com/codesite/ph/images/defaultlogo.png",
  "id": "FastDFS",
  "isPrerelease": false,
  "language": "",
  "lastEdited": "0001-01-01T00:00:00Z",
  "licenseUrl": "http://www.gnu.org/licenses/gpl.html",
  "minClientVersion": "1.0.0",
  "packageHash": "8qkvN9dCyOHoT0bS7HT/wlxlMCP8aXyuAi0zY3ecKLyNvJv44nTChYtt8Ijak1DlDev6D4Pq7wczyoIK/3X21A==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 35000,
  "projectUrl": "https://code.google.com/p/fastdfs/",
  "published": "2014-04-22T01:28:05.62Z",
  "releaseNotes": "20140422发布到Nuget。",
  "requireLicenseAcceptance": true,
  "summary": "FastDFS.net Client基础API类目。要求.net framework4哦！",
  "title": "FastDFS",
  "version": "1.0.0",
  "tags": [
    "FastDFS",
    "C#",
    ".NET"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    }
  }
}