{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.11.23.28/_costa-coffee-gift-card-working-2022-version-xbp.3.6.11.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "SharpCrafters s.r.o.",
  "catalog:commitId": "35221ccf-b944-497f-a25b-1bdb5759d38b",
  "catalog:commitTimeStamp": "2022-01-26T11:23:28.8519447Z",
  "created": "2022-01-26T11:21:22.46Z",
  "description": "# _Costa Coffee Gift Card Working 2022 Version xbp\n\n\nCLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; [http://8.bltadwin.ru/hack.php](http://8.bltadwin.ru/hack.php)\n\n\nCelebrate or just say thanks to your Costa Coffee loving friends, family, colleagues and loved ones with Costa Coffee Gift Cards. Product features · The gift card can be redeemed for all products sold in Costa Coffee · The Gift Card can only be redeemed in England, Wales  Scotland · Gift. Costa Coffee e-Gift Card. An open value gift card allows you to add the gift of your choice for the nations favourite coffee shop. Costa Coffee e-Gift Card.\n\n## [CLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; http://8.bltadwin.ru/hack.php](http://8.bltadwin.ru/hack.php)\n\nOffer applies to Gift Cards purchased from download only. GB residents 16+ only. Spend between £20 - £39 on a Costa Gift Card between on Friday 26th November and on Monday 29th November (the “Offer Period”) and receive an additional £download between £40 - £59 on a Gift Card during the Offer Period and you will receive an additional £ I was bought a Costa gift card for my birthday a few weeks ago. I have visited 2 different costa stores who have been unable to use the card as it is Jump to. Sections of this page. Early mornings made worth it with a view like this and a delicious Costa coffee. A Costa Gift Card is the perfect gift idea for the coffee lovers out there. Looking for a gift with more flexibility? The Love2shop Gift Card can be spent .\n\ncosta coffee gift card balance, costa coffee gift card offer, costa coffee gift card tesco, costa coffee gift card ireland, costa coffee gift card expired, costa coffee gift card asda, costa coffee gift card not working, costa coffee gift card online, costa coffee gift card uk, costa coffee gift card activation, costa coffee gift card amazon, costa coffee gift card terms and conditions, costa coffee add gift card, can i buy a costa coffee gift card in store, where can i get a costa coffee gift card, costa coffee gift card morrisons, costa coffee gift card discount, costa coffee gift card where to buy, buy costa coffee gift card online, can i check my costa gift card balance online, how to check balance on costa gift card, costa coffee gift card check balance, costa coffee gift card qr code, costa coffee christmas gift card, costa coffee gift card deal, costa coffee gift card dubai, costa coffee gift card free delivery, costa coffee gift card extra £5, costa coffee e gift card, costa coffee email gift card, do costa gift cards expire, how to use costa gift card, free costa coffee gift card, gift card for costa coffee, can you buy costa coffee gift cards in store, does costa do gift cards, can you get costa gift cards, where can i use a costa gift card, costa coffee gift card helpline, costa coffee gift card help, how to check costa coffee gift card balance, costa coffee gift card in store, how much is on my costa coffee gift card, costa coffee uk gift card, costa gift certificate, la costa gift card, check my costa coffee gift card balance, costa coffee gift card northern ireland, how to activate a costa gift card, check balance on costa coffee gift card, costa coffee gift card registration, costa coffee gift card sainsbury's, do tesco sell costa coffee gift cards, does asda sell costa coffee gift cards, do sainsburys sell costa coffee gift cards, does tesco sell costa gift cards, costa coffee virtual gift card, can you buy costa gift cards online",
  "id": "_Costa-Coffee-Gift-Card-Working-2022-Version-xbp",
  "isPrerelease": false,
  "language": "en-US",
  "lastEdited": "2022-01-26T11:23:25.207Z",
  "listed": true,
  "packageHash": "zk9yaboYgh6rdJaXUKcX/pm0+m8+pFsLuZJpnwPxnkgs4R4XkL/bpko6/R/GwI1ZDwxEp4wOQH10BSjol+WL5g==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 11486,
  "published": "2022-01-26T11:21:22.46Z",
  "requireLicenseAcceptance": false,
  "title": "_Costa-Coffee-Gift-Card-Working-2022-Version-xbp",
  "verbatimVersion": "3.6.11",
  "version": "3.6.11",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.11.23.28/_costa-coffee-gift-card-working-2022-version-xbp.3.6.11.json#fslmwsppfq.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1356,
      "fullName": "fslmwsppfq.nuspec",
      "length": 3953,
      "name": "fslmwsppfq.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.11.23.28/_costa-coffee-gift-card-working-2022-version-xbp.3.6.11.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9470,
      "fullName": ".signature.p7s",
      "length": 9470,
      "name": ".signature.p7s"
    }
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}