{
  "@id": "https://api.nuget.org/v3/catalog0/data/2015.08.06.02.06.00/spire.office.2.12.1.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "daisyrose",
  "catalog:commitId": "e44b7783-ab4c-48ca-8fbe-1e5dd23961fb",
  "catalog:commitTimeStamp": "2015-08-06T02:06:00.7732693Z",
  "copyright": "Copyright © 2015 e-iceblue. All Rights Reserved.",
  "created": "2015-08-06T02:05:04.597Z",
  "description": "Spire.Office for .NET is a combination of Enterprise-Level Office .NET components offered by E-iceblue. It includes Spire.Doc, Spire XLS, Spire.Presentation, Spire.PDF, Spire.DataExport, Spire.PDFViewer, Spire.DocViewer and Spire.BarCode. Spire.Office contains the most up-to-date versions of the above .NET components.\n\nWith Spire.Office for .NET, developers can create a wide range of applications. It enables developers to open, create, modify, convert, print, View MS Word, Excel, PowerPoint and PDF documents. Furthermore, it allows users to export data to popular files such as MS Word/Excel/RTF/Access, PowerPoint, PDF, XPS, HTML, XML, Text, CSV, DBF, Clipboard, SYLK, etc.\n\nAs an independent Office .NET component, Spire.Office doesn't need Microsoft Office to be installed on neither the development nor target systems. In addition, it is a better alternative to MS Office Automation in terms of security, stability, scalability, speed, price and features.\n\nSpire.Office for .NET can be linked into any type of a 32-bit or 64-bit .NET application including ASP.NET, Web Services and WinForms for .NET Framework version 2.0 to 4.5.",
  "iconUrl": "http://www.e-iceblue.com/images/product_logo/product_buy/officenet.png",
  "id": "Spire.Office",
  "isPrerelease": false,
  "language": "es-US",
  "lastEdited": "0001-01-01T00:00:00Z",
  "licenseUrl": "http://www.e-iceblue.com/Knowledgebase/Licensing/License-Agreement.html",
  "packageHash": "x87hAkGmNhWEaKBvm8zJ4s85SsuOAXYtJaETdeyaJDo+TFJX1tYuO4k/9sLxn8dVNQOBlBXRaJGYqj3B3Xla2w==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 24538914,
  "projectUrl": "http://www.e-iceblue.com/Introduce/spire-office-for-net.html",
  "published": "2015-08-06T02:05:04.597Z",
  "releaseNotes": "Spire.Office 2.12.1\n\nFix the issue that caused odd line inserted incorrectly when used sheet.InsertRow() method to insert new row in Excel.\nFix the issue that caused the exception that you appear to be using IE11 in IE7 emulation mode when convert html to PDF.\nFix the issue where the name of radiobutton field displayed incorrectly when added it to the PDF document.\nAddress the issue that caused Nullreference Exception when loaded XPS Document with custom font.\n\n\nSpire.Office 2.12\n\nSpire.Doc v5.5.31, \nSpire.PDF v3.4.119, \nSpire.XLS v7.8.1,\nSpire.Presentation v2.3.11,\nSpire.PDFViewer v2.6.77, \nSpire.DocViewer v2.0.9,\nSpire.DataExport v3.5.15,\nSpire.Barcode v1.2.6\n\nSpire.Doc\nNew Feature:\n\nAdd the feature to support the nested bookmark in PDF when convert .doc to pdf.\n\nBug Solutions:\n\nFixes the issue that caused the NullException when load RTF document.\nFixes the issue where the content displayed incorrectly when converts rtf to Html.\nFixes the issue that caused conversion failure when convert .docx to pdf.\nFixes the issue that caused \"Wrong signature\" Exception when load .docx document.\nFixes the issue that caused \"Date time value should be after 12/31/1900\" exception when load .docx document.\nFixes the issue that caused incorrect merge result.\nFixes the issue that caused content loss after .docx to .docx conversion.\nFixes the issue that caused list number loss after .doc to .txt conversion.\nFixes the issue where the AppendRTF method caused \"The object reference does not match an object instance\" exception.\nFixes the issue where some documents can't be saved.\nFixes the issue where some word documents can't be converted to PDF.\nFixes the issue that caused the content loss when converts .docx to PDF.\nAddresses the issue that caused some word documents loading failure.\nFixes the issue where image lost and right margin was wrong while converting docx file to pdf.\nFixes the issue that caused the content incorrect when convert .docx to pdf.\nResolves the issue that caused picture not shown in the PDF when the file path points to a server instead of a drive when convert RTF to PDF.\nFixes the issue where the fonts in the word document are not embedded in the pdf document when convert .docx to pdf.\nFixes the issue where content was incorrect when convert doc to pdf.\nFixes the issue that caused error when perform some replacement of texts.\nFixes the issue that caused OutOfMemoryException when save Html as Rtf.\nFixes the issue where the header content displayed difference between Word2010 and Word2013.\nResolves the issue that caused the table position not same as Word when convert docx to Pdf.\nFixes the issue that caused load error.\nAddresses the issue where the image didn't display when convert rtf to pdf.\nFixes the issue where the bookmark displayed incorrectly in pdf when convert doc to pdf.\n\nSpire.XLS\nNew Features:\n\nAdd new feature to add a picture to chart at a location, and then assign a hyperlink to it.\nAdd new feature to set dataField position in pivotTable.\nBug Solutions:\n\nFixes the issue where Strong encryption algorithms are not supported when load encrypted Excel document.\nFixes the issue that caused Excel document to PDF conversion failed.\nFixes the issue that caused content incorrect when convert Excel document to PDF.\nReduce the generated PDF document size when convert Excel document to PDF.\nAddresses the issue that caused the ArgumentOutOfRangeException when insert image into footer.\nFixes the issue where it is unable to read complete Excel file.\nResolves the issue that caused the xlsm/xlsx document failed to load.\nFixes the issue that caused the Exception that \"The number must be between 10 and 400\" when load .xlsx file.\nFixes the issue that caused IndexOutOfRangeException when load .xlsx file via stream.\nReduce the elapsed time while convert Excel document to image.\nSpire.PDF\nBug Solutions:\n\nFixes the issue that caused the image blurred when convert pdf to image.\nFixes the issue where the gradient color lost when convert pdf to image.\nFixes the issue where the page content was incorrect when merge pdf files.\nResolves the issue where the header template was not printed when print pdf.\nFixes the issue where blank page was printed when print pdf.\nFixes the issue where the text includes bracket can't be found when use FindText method to find text.\nFixes the issue that caused the \"division by zero\" exception when use loadfromxps method in COM library.",
  "requireLicenseAcceptance": true,
  "summary": "Spire.Office for .NET is a combination of Spire.Doc, Spire.XLS, Spire.Presentatin, Spire.PDF, Spire.DocViewer, Spire.PDFViewer, Spire.DataExport and Spire.Barcode.",
  "title": "Spire.Office for .NET",
  "version": "2.12.1",
  "tags": [
    "word",
    "excel",
    "presentation",
    "Pdf",
    "image",
    "dataexport",
    "barcode"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    }
  }
}