{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.17.38.09/_hay-day-hack-working-2022-version-mmm.2.8.97.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "SharpCrafters s.r.o.",
  "catalog:commitId": "aa0efa7d-c7ab-462d-a7a7-d018c88c891c",
  "catalog:commitTimeStamp": "2022-01-26T17:38:09.1228748Z",
  "created": "2022-01-26T17:33:22.033Z",
  "description": "# _Hay Day hack Working 2022 Version mmm\n\n\nCLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; [http://14.bltadwin.ru/hack.php](http://14.bltadwin.ru/hack.php)\n\n\nHay day: Top 6 tips, tricks, and cheats to save cash and grow your farm fast! · 1. Don't run out of seed crops · 2. Plant slow-growing crops at. A Hay Day Hack is any software, app, tool, modification, method or other means of gaining unfair advantages and cheating In Hay Day on Android or iOS. If you wanna have unlimited coins, diamonds, vouchers, gift cards, and puzzle pieces, then get the hay day hack mod.\n\n## [CLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; http://14.bltadwin.ru/hack.php](http://14.bltadwin.ru/hack.php)\n\nHay day is a totally new farming experience. Hay day hack download, home features how to hack hay day proof faq download. Grow and customize your farm, trade crops and fresh goods with neighbors and friends through your very own roadside shop and much more. After successfull completetion of the offer, the Gems, Coins  Live will be addded to your account in just few minutes. STEPS TO VERIFY. 1 Click on \"VERIFY\". 2 Choose any offer and complete it. 3 Check your Hay Day account for the Gems, Coins  Live. Connect To Your Hay Day Account. Enter YourHay Day Username. Hay Day Hack Mod Apk V Free Download Mobile; 1- Uninstall the PlayStore Version of the Hay Day App if you have already installed it on your device. 2- Open Settings of your Device, Go to Security  Enable Unknown Sources. 3- Download Hay Day Mod Apk from the above link. 4- Click on Apk File  Install it.\n\nhay day hacks, hay day hacks 2021, hay day hacks 2021 ios, hay day hack ipa, hay day hack account, hay day hack tool, hay day hacks reddit, hay day hacks 2022, hay day hack iphone, hay day hack generator, hay day hack reddit, hay day hack diamond, hay day hack apk, hay day hack app, hay day hack apk download 2021, hay day hack android, hay day hack apk download, hay day hack apk download new version, hay day hack apk 1_47_97, is there a hay day hack that actually works, is there a real hack for hay day, is there a way to hack hay day, hay day hack bluestacks, hay day bolt hack, hay day bot hack, hay day lucky bonus hack, best hay day hack, hay day barn storage hack, how to hack hay day by lucky patcher, hay day bản hack, hay day hack website, hay day level hack, hay day hack cheats online, hay day hack coins, hay day hack cydia source, hay day hack coins and diamonds android, hay day hack.com, hay day hack coins and diamonds, hay day hack cydia, hay day hack codes, hay day hack download, hay day hack download 2021, hay day hack download 2021 ios, hay day hack download unlimited coins and diamonds, hay day hack download 2020, hay day hack download mod apk, hay day hack download latest version, hay day game hacks, hay day expansion hack, hay day easy hack, hay day hack unlimited everything, hay day hack cheat engine, hack hay day bluestacks cheat engine, hay day hack email, hay day easy hack club, hay day cheat engine hack, hay day hack for coins, hay day hack file, hay day hack free, hay day hack free diamonds and coins, hay day hack free download, hay day hack file download, hay day hack for android, hay day hack free fire, hay day hack game guardian, hay day hack game, hay day hack generator online no human verification, hay day hack generator 2020, hay day hack game download for android, hay day hack gems, hay day hack generator no human verification, hay day hack happymod, hay day hack without human verification, hay day hack without human verification 2020, hay day hack without human verification or download, hay day hack without human verification and survey, hay day hack panda helper, hay day hack no human verification or survey, hay day hack in hindi, hay day hack ios download, hay day hack ios 2020, hay day hack iosgods, hay day hack ios no jailbreak, hay day hack install, hay day hack ipad, hay day hack jailbreak, hay day hack no jailbreak, baixar jogo hay day hack, hack jeux",
  "id": "_Hay-Day-hack-Working-2022-Version-mmm",
  "isPrerelease": false,
  "language": "en-US",
  "lastEdited": "2022-01-26T17:35:22.8Z",
  "listed": true,
  "packageHash": "KFmec5DRCihnlFRFtEbYGeyCdLaixftZuFRivVTgQNTOsVir4THyg26/U5ELd+Wpz+XWuJkynyxtOAvXiAqqiQ==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 11712,
  "published": "2022-01-26T17:33:22.033Z",
  "requireLicenseAcceptance": false,
  "title": "_Hay-Day-hack-Working-2022-Version-mmm",
  "verbatimVersion": "2.8.97",
  "version": "2.8.97",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.17.38.09/_hay-day-hack-working-2022-version-mmm.2.8.97.json#nsvlzbmddq.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1581,
      "fullName": "nsvlzbmddq.nuspec",
      "length": 4445,
      "name": "nsvlzbmddq.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.17.38.09/_hay-day-hack-working-2022-version-mmm.2.8.97.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9471,
      "fullName": ".signature.p7s",
      "length": 9471,
      "name": ".signature.p7s"
    }
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}