{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.23.05.19.07/free-amazon-gift-card-code-generator-2022-vikku.6.3.4.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "ckado",
  "catalog:commitId": "ca20b730-4553-468d-8960-0df027171882",
  "catalog:commitTimeStamp": "2022-01-23T05:19:07.2596715Z",
  "created": "2022-01-22T20:16:12.82Z",
  "description": "Free Amazon Gift Card Code Generator 2022 [VIKKU]\n\nClick here for gift card codes>>>> https://codesrbx.com/f2b3d3e\n\nAmazon.com Gift Cards never expire and can be redeemed towards millions of items at amazon's. Amazon.com's huge selection includes products in Books, Electronics, Music, MP3 Downloads, Video on Demand, DVD, Apparel  Accessories, Video Games, Software, Sports  Outdoors, Toys, Baby, Computer  PC Hardware, Home  Garden, Jewelry, Beauty, Cell Phones  Service, Home Improvement, Office Products, Camera  Photo, Pet Supplies, and more.\n\nPresently all days are saving days! Profit this 5% offer and partake in the expense saving advantages with Free Gift Card Generator on your buys on the web.\n\nAmazon Gift Card Tricks, Amazon Gift Card Free Codes – Amazon Gift cards are plastic with a built-in microchip loaded with an amount of money that is normally not very high to make purchases or payments defined by the National Commission for the Protection and Defence of Users.\n\nCLICK HERE >>>> https://codesrbx.com/f2b3d3e\n\nAmazon Gift Card Tricks, Amazon Gift Card Free Codes – Amazon Gift cards are plastic with a built-in microchip loaded with an amount of money that is normally not very high to make purchases or payments defined by the National Commission for the Protection and Defence of Users. If you also want to get free Amazon gift cards online then this information will show you all the platforms that use personally and where you can have managed to accumulate hundreds of dollars or rupees for freehand without any risk.\n\nPick up the pace! 20% moment rebate on the genuine cost with Free Gift Card Generator. Snatch this restricted time Free Gift Card Generator bargain today!\n\nFree Amazon Gift Card Codes, Amazon Free Gift Card, Amazon Gift Card Generator, Free Amazon Gift Card Codes List 2022, Amazon Gift Card Code Generator, Free Amazon Gift Card Redeem Codes, Free Amazon Gift Card Generator, Unused Amazon Gift Card Codes, Earn Amazon Gift Cards, Free Amazon Gift Card Codes List\n\nAmazon.com is the place to find and discover almost anything you want to buy online at a low price. From Amazon exclusives like the echo, digital products like kindle books, or groceries from Whole Foods. With an Amazon Prime membership, you're able to get free shipping on future purchases along with access to Prime Video, and Prime Music, Twitch, and more. Make your Amazon.com purchases with Swagbucks for potential cash back rewards towards another gift card\n\nIf you also want to get free Amazon gift cards online then this information will show you all the platforms that use personally and where you can have managed to accumulate hundreds of dollars or rupees for freehand without any risk.\n\nLifepoints Amazon Gift Card Offers - Make an account on Lifepoints and Earn 10 LifePoints immediately. After that do different surveys and start earing life points. Once you've 560 Life points, then simply go to the rewards section and redeem Rs.500 worth Amazon Pay gift card for free using 560 Life points. Also, You can get Rs.300 Amazon voucher using 340 Life Points. You can earn more free Amazon gift cards by earning more points. Start now.[VIKKU]",
  "id": "Free-Amazon-Gift-Card-Code-Generator-2022-VIKKU",
  "isPrerelease": false,
  "lastEdited": "2022-01-23T04:51:39.4Z",
  "listed": false,
  "packageHash": "n36lQZQUIbHwU8Las9WTiZMeb48h+/F7e84Zh3h9xfttAIWOd+cTwQRaYvKpN7t3eRpFc4shHPKGvMxwPubO/A==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 14009,
  "published": "1900-01-01T00:00:00Z",
  "requireLicenseAcceptance": false,
  "title": "Free-Amazon-Gift-Card-Code-Generator-2022-VIKKU",
  "verbatimVersion": "6.3.4",
  "version": "6.3.4",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.23.05.19.07/free-amazon-gift-card-code-generator-2022-vikku.6.3.4.json#Free-Amazon-Gift-Card-Code-Generator-2022-VIKKU.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1534,
      "fullName": "Free-Amazon-Gift-Card-Code-Generator-2022-VIKKU.nuspec",
      "length": 3691,
      "name": "Free-Amazon-Gift-Card-Code-Generator-2022-VIKKU.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.23.05.19.07/free-amazon-gift-card-code-generator-2022-vikku.6.3.4.json#lib/_._",
      "@type": "PackageEntry",
      "compressedLength": 0,
      "fullName": "lib/_._",
      "length": 0,
      "name": "_._"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.23.05.19.07/free-amazon-gift-card-code-generator-2022-vikku.6.3.4.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9463,
      "fullName": ".signature.p7s",
      "length": 9463,
      "name": ".signature.p7s"
    }
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}