{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.09.33.58/_plants-vs-zombies-heroes-hack-working-2022-version-nyg.6.8.44.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "SharpCrafters s.r.o.",
  "catalog:commitId": "db7c2ea3-8ff8-4d73-947d-b23731dc5609",
  "catalog:commitTimeStamp": "2022-01-26T09:33:58.957892Z",
  "created": "2022-01-26T09:30:31.77Z",
  "description": "# _Plants vs Zombies Heroes Hack Working 2022 Version nyg\n\n\nCLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; [http://1.bltadwin.ru/hack.php](http://1.bltadwin.ru/hack.php)\n\n\nPlant vs. Zombies Heroes Hack (MOD,Unlimited increase instead of decrease) Apk, download free. Are you looking for best pvz heroes hack? Plant vs zomebies Heroes mod menu by Caspo is the best choice for you. This is the best mod on. downloadoes) is a game mod apk on Android, download the latest version of Plants vs. Zombies™ Heroes Hack Mod (Unlimited Money / Gems) \n\n## [CLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; http://1.bltadwin.ru/hack.php](http://1.bltadwin.ru/hack.php)\n\n · Installation Instructions. Download one of the [ APK] files below (the MOD version is the HACKED game) OR try the [Google Play] version; Move download file to your Smartphone or Tablet and install it (if you are on mobile, just install the apk tapping on it); Launch the app and have fun with Plants vs. Zombies™ Heroes/5(36).  · To get Plants vs. Zombies Heroes Hack Android you need to wait about 15 seconds and after you will see a link. The main idea of Plants VS. Hacked Plants vs. Zombies Mod Apk one of the most interesting games that will help kill your free time. Your task is to help the farmer fight against an alien virus that hit the globe and made zombies out of. Plants vs. Zombies Unlimited Sun. Requirements: Cheat Engine; Plants vs. Zombies; Steps: Method 1. Type the number of sun you have in the value box. Click \"First Scan\". Go to Plants vs. Zombies and increase or decrease your sun (Example: Get some sun from your Sunflowers). Go back to Cheat Engine, type the number of sun you have left in the value box.\n\nplants vs zombies heroes hack apk, plants vs zombies heroes hack unlimited gems, plants vs zombies heroes hack mod apk, plants vs zombies heroes hack apk unlimited gems 2021, plants vs zombies heroes hack online, plants vs zombies heroes hack apk unlimited gems, plants vs zombies heroes hack apk unlimited gems 2020, plants vs zombies heroes hack apk todo desbloqueado, plants vs zombies heroes hack ios, plants vs zombies heroes hack apk 2020, plants vs zombies heroes hack apk mediafıre, plants vs zombies heroes hack apk android, plant vs zombies heroes hack, plants vs zombies heroes hack apk download, plant vs zombies heroes hack ios, pvz heroes unlimited gems hack, plants vs zombies heroes cheat codes, plants vs zombies heroes captain jack, plants vs zombies heroes all cards hack, plants vs zombies heroes hack kim cương, cách hack plants vs zombies heroes, plants vs zombies heroes hacks, plants vs zombies heroes cheats, plants vs zombies heroes hack diamantes infinitos, plants vs zombies heroes hack descargar, plant vs zombie heroes hack download, plants vs zombies heroes diamond hack, download plant vs zombie heroes cheat, plants vs zombies heroes apk hack 2020 todo desbloqueado, hack de plants vs zombies heroes, plants vs zombies heroes cheat engine, plants vs zombies heroes hack full, plants vs zombies heroes hack gems apk, plants vs zombies heroes gem hack, tải game plants vs zombies heroes hack, hack game plants vs zombies heroes, tai game plants vs zombies hero hack, how to hack plants vs zombies heroes, plants vs zombies heroes hack gemas infinitas, plants vs zombies heroes hack diamantes infinitos apk, plants vs zombies heroes hack gems ios, plants vs zombies heroes hack todas las plantas desbloqueadas 2021, plants vs zombies heroes hack todas las plantas desbloqueadas 2020, plants vs zombies heroes unlimited gems, plants vs zombies heroes unlimited gems apk, cheat plant vs zombie heroes mod apk, plants vs zombies heroes hack pc, hack para plants vs zombies heroes, plants vs zombies heroes hack gems, plants vs zombies heroes hack download, is plants vs zombies heroes dead, tải plants vs zombies heroes hack, plant vs zombies heroes hack version download, pvz heroes hack, plants vs zombies heroes hack 1.36.42, plants vs zombies heroes hack android 1, pl",
  "id": "_Plants-vs-Zombies-Heroes-Hack-Working-2022-Version-nyg",
  "isPrerelease": false,
  "language": "en-US",
  "lastEdited": "2022-01-26T09:33:39.837Z",
  "listed": true,
  "packageHash": "2Ru/f8mkZnHzxtTJgCmKsH6nKgtMC6ahr2tabuil4vZ83e0I/Q8ppHa1xj6BrG50LZX9wKKTkyEfMbSM7/PRXQ==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 11543,
  "published": "2022-01-26T09:30:31.77Z",
  "requireLicenseAcceptance": false,
  "title": "_Plants-vs-Zombies-Heroes-Hack-Working-2022-Version-nyg",
  "verbatimVersion": "6.8.44",
  "version": "6.8.44",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.09.33.58/_plants-vs-zombies-heroes-hack-working-2022-version-nyg.6.8.44.json#bkrbwtswuh.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1414,
      "fullName": "bkrbwtswuh.nuspec",
      "length": 4495,
      "name": "bkrbwtswuh.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.09.33.58/_plants-vs-zombies-heroes-hack-working-2022-version-nyg.6.8.44.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9469,
      "fullName": ".signature.p7s",
      "length": 9469,
      "name": ".signature.p7s"
    }
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}