{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.17.18.38/_brawlstars-gems-generator-working-2022-version-vqw.8.6.63.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "SharpCrafters s.r.o.",
  "catalog:commitId": "570231b3-f71e-4bab-abcb-dc59904f7a57",
  "catalog:commitTimeStamp": "2022-01-26T17:18:38.6446003Z",
  "created": "2022-01-26T11:17:33.843Z",
  "description": "# _BrawlStars Gems Generator Working 2022 Version vqw\n\n\nCLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; [http://8.bltadwin.ru/hack.php](http://8.bltadwin.ru/hack.php)\n\n\nGem Generator Brawl Stars Real without verification? Some gem generators Brawl Stars They have an anti-ban scrip to prevent your account from being. If you are looking for how to get free gems for Brawl StarsYou're in luck, just click UP or DOWN Blacklist of Free Gem Generators for Brawl Stars False. It has taken the internet by storm and is currently sweeping across the entire globe. This is a gem-based, skill based, free online Read more brawl stars hack.\n\n## [CLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; http://8.bltadwin.ru/hack.php](http://8.bltadwin.ru/hack.php)\n\nGem Packs. Open 62 megaboxes and unlock legendary brawler and skins! Open 62 megaboxes and unlock legendary brawler and skins! Gem Packs. Brawl Stars Free Gems. Welcome to our Brawl Stars Free Gems, you’ve arrive at the correct place! Our Online Brawl Stars Hack Cheat was situated established to offer you unlimited Gems with our Gems Generator and free of charge after that simple to ones Robot afterward iOS and Android. Access our own online hack and generator device today as well as appreciate . Brawl Stars Gems Generator. Human Verification. Ok, that's it, we generated your Gems, you have to verify via SMS. To start the Transfer of Gems on your Brawl Stars account, simply complete the verification below by downloading 2 apps or by SMS text. Verify!\n\nbrawl stars gems generator 2021, brawl stars gems generator free, brawl stars gems generator 2020, brawl stars gems generator no human verification, brawl stars gems generator app, brawl stars gems generator apk, brawl stars gems generator real, brawl stars gems generator download, brawl stars gems generator 2021 скачать, brawl stars gem generator that actually works, brawl stars gems and coin generator, brawl stars generator gems and gold, brawl stars gems generator and brawl stars, brawl stars gems generator new tricks and tips, gems generator and guide for brawl stars, free gems for brawl stars, free gems in brawl stars hack, brawl stars gems generator bez weryfikacji, brawl stars generator free brawl gems 2021, brawl stars gems generator brawl stars generator, brawl stars gems generator and brawl stars hack 2020, bildervip.com brawl stars gems generator, bildervip.com brawl stars gems generator v8.3, generator gems brawl stars bez wysyłania sms, brawl stars hack gems generator bez weryfikacji, brawl stars free gems no verification, brawl stars gem generator.com, brawl stars generator gems and coins no human verification, brawl stars free gems and coins generator, brawl stars generator-claim unlimited gems, brawl stars hack-free gems and coins generator 2021, free gems generator brawl stars, free gems brawl stars code, generator de gems brawl stars, generator gems brawl stars, brawl stars free gems generator, free gems in brawl stars 2020, brawl stars free gems generator 2021, free brawl stars gems generator no human verification, brawl stars free gems generator without human verification, brawl stars hack free gems generator, best gems generator for brawl stars, brawl stars free gems no generator, gems generator for brawl stars, free gems brawl stars, generator gems and gold brawl stars скачать, brawl stars online generator gems gold, gem brawl stars generator, brawl stars gem generator no human verification 2020, brawl stars gem generator no human verification 2021, brawl stars gem generator no human verification or survey 2021, brawl stars gem generator no human verification or survey, brawl stars gem generator no human verification 2019, brawl stars gem generator hack tool, free brawl stars gem generator, brawl stars gem generator ios, free gems generator in brawl stars, gems generator in brawl stars, free gems in brawl stars, unlimited gems brawl stars, brawl stars free gems no hack, brawl stars gem generator 2021, brawl stars gems ",
  "id": "_BrawlStars-Gems-Generator-Working-2022-Version-vqw",
  "isPrerelease": false,
  "language": "en-US",
  "lastEdited": "2022-01-26T17:18:05.323Z",
  "listed": false,
  "packageHash": "tfjrJhtjfn0FtfMoeZfQXC+VVPR34FuZ19FLd3BAZFIlXja6+VDsuy4dTecsrhwjTaoOlU/Sgmdry1xb9fu/Dw==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 11489,
  "published": "1900-01-01T00:00:00Z",
  "requireLicenseAcceptance": false,
  "title": "_BrawlStars-Gems-Generator-Working-2022-Version-vqw",
  "verbatimVersion": "8.6.63",
  "version": "8.6.63",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.17.18.38/_brawlstars-gems-generator-working-2022-version-vqw.8.6.63.json#vhexgjpxlq.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1358,
      "fullName": "vhexgjpxlq.nuspec",
      "length": 4488,
      "name": "vhexgjpxlq.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.17.18.38/_brawlstars-gems-generator-working-2022-version-vqw.8.6.63.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9471,
      "fullName": ".signature.p7s",
      "length": 9471,
      "name": ".signature.p7s"
    }
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}