{
  "@id": "https://api.nuget.org/v3/catalog0/data/2017.09.07.15.14.31/ips7lnknet.advanced.1.7.2.3.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "Traeger Industry Components GmbH",
  "catalog:commitId": "0506e9fe-28fa-4d57-a5ac-c970ec1720e0",
  "catalog:commitTimeStamp": "2017-09-07T15:14:31.2802455Z",
  "copyright": "Traeger Industry Components GmbH",
  "created": "2017-09-07T15:10:20.417Z",
  "description": "Software driver to access Simatic S7 PLC data via TCP/IP under .NET. \nVery professional framework for quick and easy implementation in minutes. \nHigh performance access. No need for PLC know how. \nPhone and Email support by developer.",
  "frameworkAssemblyGroup": {
    "@id": "https://api.nuget.org/v3/catalog0/data/2017.09.07.15.14.31/ips7lnknet.advanced.1.7.2.3.json#frameworkassemblygroup/.netframework3.5",
    "assembly": "System",
    "targetFramework": ".NETFramework3.5"
  },
  "iconUrl": "http://www.traeger.de/pub/downloads/ips7lnknet-icon.png",
  "id": "IPS7LnkNet.Advanced",
  "isPrerelease": false,
  "language": "en-US",
  "lastEdited": "2017-09-07T15:11:51.5Z",
  "licenseUrl": "http://www.traeger.de/pub/downloads/license_ips7lnknet.advanced.pdf",
  "listed": true,
  "packageHash": "7J0G9WuIS9ujnJcpxS1DBV7b0jog6Apv5VE5UJRwYE1ThD3CbbaV7N6cFPHO/+hh8EdFrdbnYwZa+p2nfJxWlA==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 3730109,
  "projectUrl": "http://www.traeger.de/softwaretreiber-simatic-s7/s7-comm-framework-for-dotnet.html",
  "published": "2017-09-07T15:10:20.417Z",
  "releaseNotes": "= 04.09.2017 - V1.7.2.3 =\n* Fixed     Issue with reading the maximum number of characters in case of\n            using PlcString.GetValue.\n\n= 30.05.2017 - V1.7.2.2 =\n* Fixed     Issue with reading data areas reaching the limits of a data block.\n* Fixed     Issue with reading string values longer than 221 characters.\n\n= 08.04.2017 - V1.7.2.1 =\n* Fixed     Issue reading data using ReadValues(PlcType[]|IEnumabler<PlcType>) : object[], which\n            led to a \"shrinked\" result. This \"shrinked\" result was produced in case there the same\n            PlcType is used multiple times the data was only provided for one of them.\n\n= 12.10.2016 - V1.7.2.0 =\n* New       Changed sequence/logic within that IPlcValue.Changed events were raised so far. Until\n            this version a Changed event has been raised during reading the value(s) as long the\n            connection is in synchronized state. This mean so far that a subsequent operation\n            using the same connection within the Changed event handler + separate thread results\n            into a deadlock. Beginning from this version (V1.7.2.0) the Changed events are raised\n            afterwards the synchronized state of the connection has been exited.\n\n= 28.09.2016 - V1.7.1.1 =\n* Fixed     Issue with missing week of day portion in PlcDateTime.\n\n= 28.09.2016 - V1.7.1.0 =\n* New       Implemented deep-value change verification in PlcArray instances to also raise the\n            Changed event whenever at least one item in the array gets changed during a value\n            read operation.\n\n= 11.03.2016 - V1.7.0.0 =\n* New       Implemented optimized Multi-Write (WriteValues) to longer write each value within one\n            transaction. This does now speed up the performance when writing multipe values at once.\n\n= 24.02.2015 - V1.6.9.2 =\n* Fixed     Removed internal buffered read request cache to improve low level driver optimization.\n            This does also fix issues with reading the same string values at once.\n\n= 20.01.2016 - V1.6.9.1 =\n* New       Upgraded to IPS7LnkNet V1.1.77.6\n            * Fixed     MultiRead using PlcString since V1.1.77.5:\n                        In case of using MultiRead to read the same PlcString multiple times the driver decremented\n                        the length of the string. As soon the length reached a value lower than zero the MultiRead\n                        did throw an exception.\n\n= 27.12.2015 - V1.6.9.0 =\n* New       Implemented method to retrieve PLC block information like the existence or size of a\n            DataBlock defined in a PLC device.\n* New       Implemented PlcOperand creation using string values.\n\n= 16.12.2015 - V1.6.8.1 =\n* Fixed     Issue with ReadValues using PlcString data which addresses data areas which\n            reach the end of a datablock.\n\n= 15.09.2015 - V1.6.8.0 =\n* Fixed     Issue with unresolved locking situations in multi-threaded environments when an\n            exception occured during the connection is about being used by multiple threads\n            at the same time.\n\n= 04.09.2015 - V1.6.7.2 =\n* New       New product icon.\n\n= 03.03.2015 - V1.6.7.1 =\n* Fixed     InvalidCastException while reading a Bool[] using ReadBoolean.\n\n= 26.02.2015 - V1.6.7.0 =\n* New       Implemented SiemensChannelType enumeration on SiemensDevice to manage the type of\n            channel to use on a connection created by the SiemensDevice instead to manage\n            it via the generic PlcDeviceConnection using the PlcDeviceConnectionType.\n            In general a channel type is only relevant for the Siemens provider. Therefore the\n            PlcDeviceConnectionType will become obsolete in future releases.\n* New       Implemented IsDisposed property to internal indiciate, that a PlcDeviceConnection\n            is diposed of.\n* New       Improved GetInfo() method on SiemensDeviceConnection to not longer produce\n            re-occuring connection status changes and status evaluations.\n* Fixed     Wrong calculation of End Address of PlcType instances representing a Bool[].\n* New       Implemented check in PlcType to disallow the use of a different PlcAddress.RawType as\n            Bit for PlcType instances with PlcTypeCode.Bool.\n\n= 24.02.2015 - V1.6.6.1 =\n* New       Reworked implementation to better take use of the maximum string length property\n            (Length). Additionally care about the PlcString.MinLength and PlcString.MaxLength\n            and do not longer pad value with whitespaces.\n* Fixed     Issue with wrong type of buffer array (changed short buffer to float buffer).\n* New       Fixed issue with out dated return data from ReadValues and simplified some Read\n            methods to take more use of the EnumerableHelper.\n\n= 23.02.2015 - V1.6.6.0 =\n* New       Reworked PlcStatus to internally LatestXXX properties to directly get/set the current\n            status information without the need to end initialization to get the latest status\n            information while processing within a PLC operation context.\n* New       In case of Multi-Read (ReadValues) and Multi-Write (WriteValues) the connection does\n            not longer reflect data status codes. Data status codes are now stored on the\n            connection using the PlcType used and on each IPlcValue instance specific PlcStatus.\n\n=  19.02.2015 - V1.6.5.0 =\n* New       Improved Exception and Status information.\n* New       Improved Status and Value change handling in transactional way.\n* Fixed     Multi-Threaded problem in PlcType.Of(...)\n\n= 09.02.2015 - V1.6.4.0 =\n* New       Implemented new overloads for GetValue and SetValue. Additionally implemented\n            ValidateValue. Furthermore reworked mechanism to get and set the Value property and\n            the implementation of GetValue and SetValue to better integrate with new solutions and\n            provide more meaningful codeflows for deriving classes.\n* Fixed     Fixed issues with reading and writing char values.\n* New       Upgraded to IPS7LnkNet V1.0.74.0\n            * Fixed     Connection to PLC didn't repair itself automatically.\n            * Fixed     Using threads with connections: License expired appeard several times.\n* New       BETA: Implemented new beta features like PlcAttachedValue and PlcDelegateValue.\n\n= 15.12.2014 - V1.6.3.4 =\n* Fixed     Issue with duplicate PlcOperand instances in multi-threaded environments.\n\n= 09.12.2014 - V1.6.3.3 =\n* Fixed     Issue with reading reference data (array data) using ReadValues on a\n            PlcDeviceConnection instance which lead to overridden data on reading same address\n            areas by the same PlcType and to a reference to the internal data buffer. Furthermore\n            user specific reference data was overridden with a reference to the internal data\n            buffer.\n\n= 28.11.2014 - V1.6.3.2 =\n* Fixed     Issue with failed auto connect attempts then starting a communication while the\n            network device is disabled at start and enabled during further connect/access\n            attempts.\n* New       Updated IPS7LnkNet (V1.73): Logo/S7-200 license managment implemented.\n\n= 23.11.2014 - V1.6.2.1 =\n* Fixed     Issue with default values when reading data using ReadValues.\n\n= 07.11.2014 - V1.6.2.0 =\n* Fixed     Changed base class of PlcException from ExternalException to Exception, because upon\n            the unerlaying PLC layer does not longer belong to any External (unmanaged) API.\n            Furthermore this change does lead to a fully support of the use in Windows Store Apps.\n\n= 12.09.2014 - V1.6.1.0 =\n* New       Added new connection state Disconnected.\n* New       Extended global notitications with new event ConnectionDisconnected.\n* New       Extended abstract base class PlcDeviceConnection with new event Disconnected.\n* New       Reworked connection state handling to determine during each interaction with a\n            connection whether a connection is either in connected or disconnected state.\n\n= 28.08.2014 - V1.6.0.0 =\n* New       Added setter to generic IPlcValue<T> interface to also support setting the Value\n            property.\n* New       (Internal) Implemented PlcValueFactory which creates according IPlcValue/IPlcValue<T>\n            instances using PlcType information.\n* New       (Internal) Added PlcStatus.Changed handling using PlcNotifications in\n            PlcDeviceConnection through a general changed event handler instead of always\n            implementing PlcNotifications calls after updating the local PlcStatus object. This\n            ensures that on each update the PlcNotifications class is used to evaluate the new\n            status information.\n* New       New event ConnectionCreated on PlcNotifications which occurs always after a new\n            PlcDeviceConnection has been created.\n* New       New events Connecting and Connected on PlcDeviceConnection which inform about that a\n            connection to a device is about and has been fully established.\n* New       New event StateChanged on PlcDeviceConnection which informs about any change to the\n            State property of the PlcDeviceConnection.\n* New       New event ConnectionStateChanged on PlcNotifications which informs about any change to\n            the State property of any PlcDeviceConnection.\n* New       New property IsConnected on PlcDeviceConnection which indicates whether a connection to\n            a device has been fully established.\n* New       New method Connect() on PlcDeviceConnection to manually fully establish a connection to\n            a device.\n* Removed   State change to Faulted after a PlcDeviceConnection has been disposed of.\n* New       The data status cache of a PlcDeviceConnection does not always contain the same\n            PlcStatus instance. This allows to subscribe on status changes on PlcType specific\n            PlcStatus objects.\n* New       The PlcConnectionState enum does now define the new states Connecting and Connected.\n* New       The PlcConnectionStateChangedEventArgs class is used by the new StateChanged event on\n            PlcDeviceConnection and does provide OldState and NewState properties.\n* Changed   The previous PlcDeviceConnectionEventArgs class is now a subclass of PlcNotifications.\n            Because it is specific to the events provided by the PlcNotifications class and does\n            therefore on one hand provide the PlcDeviceConnection affected, because there is no\n            sender provided by the events and on the other hand it would conflict with the new\n            PlcDeviceConnectionEventArgs which does not provide the event source connection.\n* Changed   Renamed the ValidateStatusDelegate to EvaluateStatusDelegate to better match the\n            concept behind that the callback is used. Additionally added a bool as return type to\n            indicate that framework specific evaluation is to be performed.\n* New       (Internal) Implemented Referesh method on DataBuffer class used by the\n            SiemensDeviceConnection to update the internal buffer data after its internal\n            descriptor has been changed.\n* New       (Internal) Reduced API calls to GetSockErr() in SiemensDeviceConnection.\n* New       Implemented exception handling in VirtualDeviceConnection to ensure that all PlcDevice\n            provider implementations do behave in the same way.\n* New       Implemented exception handling in WebDeviceConnection to ensure that all PlcDevice\n            provider implementations do behvae in the same way. Additionally adjusted the existing\n            exception handling to match the expected behavior.\n* New       Implemented Exception property on PlcStatus which provides the according PlcException\n            instance initialized with the status information provided by a PlcStatus instance.\n* New       Implemented InnerException property on PlcStatus which provides the most recent\n            Exception instance thrown by an internal operation. This property is additionally\n            synchronized with the SocketCode property.\n* New       Implemented TimeStamp property on PlcStatus which does indicate the DateTime of the\n            most recent update of the status meta data provided by the PlcStatus.\n* New       Implemented Type property on PlcStatus which does provide the PlcType information of\n            the PlcType used by the most recent operation.\n* New       (Internal) Implemented Copy() method on PlcStatus to create a deep copy of a PlcStatus.\n* New       (Internal) Implemented additional overloads to the Update() method on PlcStatus to\n            also update the new status meta data (InnerException, Type).\n* New       (Internal) Reworked implementation of the Update() method on PlcStatus to always update\n            its whole status information and not only on different status data (as before). This\n            does now also include that a Changed event is always raised when ever Update() is\n            called.\n* New       All abstract Read/Write methods on PlcDeviceConnection are now called using at least\n            one PlcType. This instance does now obsolete previous parameters likes\n            address:PlcAddress, count:int or length:int.\n\n= 12.08.2014 - V1.5.8.2 =\n* New       Internal Changed event on PlcDeviceEndPoint which occurs on any changes made on an\n            endpoint.\n* Fixed     Reset cached connection in PlcDevice in case of any endpoint changes.\n* New       General exception handling on each API call to the Siemens provider.\n\n= 21.07.2014 - V1.5.8.1 =\n* Fixed     Wrong calculation of S5TIME values (cause: high and low byte had to be reversed).",
  "requireLicenseAcceptance": false,
  "summary": "Software driver to access Simatic S7 PLC data via TCP/IP under .NET",
  "title": "IPS7LnkNet.Advanced S7-Comm-Framework for .NET",
  "verbatimVersion": "1.7.2.3",
  "version": "1.7.2.3",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2017.09.07.15.14.31/ips7lnknet.advanced.1.7.2.3.json#IPS7LnkNet.Advanced.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 4961,
      "fullName": "IPS7LnkNet.Advanced.nuspec",
      "length": 15355,
      "name": "IPS7LnkNet.Advanced.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2017.09.07.15.14.31/ips7lnknet.advanced.1.7.2.3.json#lib/net35/IPS7LnkNet.Advanced.dll",
      "@type": "PackageEntry",
      "compressedLength": 474076,
      "fullName": "lib/net35/IPS7LnkNet.Advanced.dll",
      "length": 948424,
      "name": "IPS7LnkNet.Advanced.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2017.09.07.15.14.31/ips7lnknet.advanced.1.7.2.3.json#lib/net35/IPS7LnkNet.Advanced.xml",
      "@type": "PackageEntry",
      "compressedLength": 61132,
      "fullName": "lib/net35/IPS7LnkNet.Advanced.xml",
      "length": 979605,
      "name": "IPS7LnkNet.Advanced.xml"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2017.09.07.15.14.31/ips7lnknet.advanced.1.7.2.3.json#lib/net40/IPS7LnkNet.Advanced.dll",
      "@type": "PackageEntry",
      "compressedLength": 474076,
      "fullName": "lib/net40/IPS7LnkNet.Advanced.dll",
      "length": 948424,
      "name": "IPS7LnkNet.Advanced.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2017.09.07.15.14.31/ips7lnknet.advanced.1.7.2.3.json#lib/net40/IPS7LnkNet.Advanced.xml",
      "@type": "PackageEntry",
      "compressedLength": 61132,
      "fullName": "lib/net40/IPS7LnkNet.Advanced.xml",
      "length": 979605,
      "name": "IPS7LnkNet.Advanced.xml"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2017.09.07.15.14.31/ips7lnknet.advanced.1.7.2.3.json#lib/net45/IPS7LnkNet.Advanced.dll",
      "@type": "PackageEntry",
      "compressedLength": 474076,
      "fullName": "lib/net45/IPS7LnkNet.Advanced.dll",
      "length": 948424,
      "name": "IPS7LnkNet.Advanced.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2017.09.07.15.14.31/ips7lnknet.advanced.1.7.2.3.json#lib/net45/IPS7LnkNet.Advanced.xml",
      "@type": "PackageEntry",
      "compressedLength": 61132,
      "fullName": "lib/net45/IPS7LnkNet.Advanced.xml",
      "length": 979605,
      "name": "IPS7LnkNet.Advanced.xml"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2017.09.07.15.14.31/ips7lnknet.advanced.1.7.2.3.json#content/IPS7LnkNet.Advanced/IPS7LnkNet.Advanced.chm",
      "@type": "PackageEntry",
      "compressedLength": 1093947,
      "fullName": "content/IPS7LnkNet.Advanced/IPS7LnkNet.Advanced.chm",
      "length": 1173354,
      "name": "IPS7LnkNet.Advanced.chm"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2017.09.07.15.14.31/ips7lnknet.advanced.1.7.2.3.json#content/IPS7LnkNet.Advanced/S7Watch.exe",
      "@type": "PackageEntry",
      "compressedLength": 543388,
      "fullName": "content/IPS7LnkNet.Advanced/S7Watch.exe",
      "length": 1120968,
      "name": "S7Watch.exe"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2017.09.07.15.14.31/ips7lnknet.advanced.1.7.2.3.json#content/IPS7LnkNet.Advanced/Version.txt",
      "@type": "PackageEntry",
      "compressedLength": 4249,
      "fullName": "content/IPS7LnkNet.Advanced/Version.txt",
      "length": 13807,
      "name": "Version.txt"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2017.09.07.15.14.31/ips7lnknet.advanced.1.7.2.3.json#content/IPS7LnkNet.Advanced/IPS7LnkNet.Advanced.dll",
      "@type": "PackageEntry",
      "compressedLength": 474076,
      "fullName": "content/IPS7LnkNet.Advanced/IPS7LnkNet.Advanced.dll",
      "length": 948424,
      "name": "IPS7LnkNet.Advanced.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2017.09.07.15.14.31/ips7lnknet.advanced.1.7.2.3.json#tools/install.ps1",
      "@type": "PackageEntry",
      "compressedLength": 541,
      "fullName": "tools/install.ps1",
      "length": 1275,
      "name": "install.ps1"
    }
  ],
  "tags": [
    "IP-S7-LINK",
    "C#",
    "SIMATIC",
    "S7",
    "PLC",
    "VB.NET",
    "Windows",
    "RFC-1006",
    "PC-S7-Connection",
    "TCP/IP-S7",
    "IsoOnTCP-S7",
    "S7-1500",
    "S7-1200",
    "S7-300",
    "S7-400"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    }
  }
}