{
  "@id": "https://api.nuget.org/v3/catalog0/data/2015.04.06.16.43.48/percolatoranalysisservices.0.2.3.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "Matt Hallmark",
  "catalog:commitId": "a118a956-830c-402e-ae3b-1636b238f470",
  "catalog:commitTimeStamp": "2015-04-06T16:43:48.6511929Z",
  "copyright": "Copyright © 2014, CoopDIGITy Inc",
  "created": "2015-03-04T23:32:06.463Z",
  "description": "A LINQ to MDX Psued-O-RM for Microsoft SQL Server Analysis Services",
  "iconUrl": "http://www.coopdigity.com/wp-content/uploads/2014/04/logo3.png",
  "id": "PercolatorAnalysisServices",
  "isPrerelease": false,
  "lastEdited": "2015-04-06T16:43:46.72Z",
  "licenseUrl": "http://opensource.org/licenses/MIT",
  "packageHash": "M+fqV2/kaBwTYK4qETLpASEoe7alf/L1OXMIOLsKBmp9Lz0j3Kg+ZiSDTn0YEKVgxUvNHWWewijznvfyeEv4rw==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 64168,
  "projectUrl": "http://www.coopdigity.com/products/percolator-analysis-services/",
  "published": "2015-03-04T23:32:06.463Z",
  "releaseNotes": "Finally, a way to query a Microsoft SQL Server Analysis Database with LINQ and type safe objects! \n\nBeta version - Comes without any warranties.  Please contact me via the \"Contact Owners\" link for any questions, comments, bugs, or features you think should be included. Any input is GREATLY appreciated. Make sure to read the \"Documentation\" text file that is included with the package. \n\nA big thanks goes out to Miguel Correia and Nuno Braz Oliveira for helping me find a lot of these bugs and lack of features, and really putting this project through the ringer! \n\nSome of these features were implemented due to them requesting more functionality. So if you wish to see something, or have a bug, TELL US! We do listen, I promise. \n\n---------------------------------------------------------\nUpcoming Changes:\n    -NEW VERSION ALMOST OUT!! (0.3.1)\n    * Version 3.1 has addressed:\n        -Fixing an issue with mapping to certain data types.\n\n        -A few small optimizations to the translators and the PAS objects.\n\n        -More Mdx methods.\n\n        -Stripping out the IQueryable implementations and creating PAS specific implementations for the standard LINQ free form syntax.  This means that anonymous queries will no longer be supported (that doesn't mean I've abandoned the concept entirely, just re thinking its application).  The old IQueryable implementation introduced confusion into what translation methods should be called, so I stripped it out and now both the Free Form syntax and PAS Explicit syntax flow through the same translations.\n\n        -The generated cube objects will use the singleton pattern instead of newing up an entire new cube with all new attributes (since no data gets mapped to those objects anyways).\n\n        -Adding arithmetic operator overloads (+, -, *, /) so members can be created from other members operations (i.e. Member.Create<Sales>(cube => cube.WholesaleDollars / cube.TransactionCount)).\n\n        -I've also been throwing around the idea of creating another TT file so users can define what classes they would like to use to map results to, instead of having to write out a class for each one. If this strikes you fancy, lemme know.\n\n---------------------------------------------------------\nNotes: \n    -Although not listed as a dependency, some of the classes used in this library belong to the Microsoft.AnalysisServices.AdomdClient dll.  The project itself doesn't require the user to have this in the project to run, but some query methods allow the user to return a \"CellSet\" or \"AdomdDataReader\", which do belong to the AdomdClient dll. \n\n    -A preliminary product page has been setup on our site containing the documentation of this project.  If you would like to see it before downloading it, click the \"Product Site\" link to the left. Also, visit us at www.coopdigity.com. \n\n    -This product is still being developed, but soon we may be pulling it out of beta and releasing it as a full release.  Once we do that, it will more than likely be open sourced.  Until then, if you require the source code to work it into your project, that may be arranged. Contact us and we will get back to you on it. \n\n    -Thank you to everyone who has provided feedback! This project has been under continual development because you guys have been asking for more! Again, PLEASE contact us for any bug issues, questions, or features you would like to see.\n\n",
  "requireLicenseAcceptance": true,
  "summary": "A LINQ to MDX Psued-O-RM for Microsoft SQL Server Analysis Services",
  "title": "Percolator Analysis Services (Beta)",
  "version": "0.2.3",
  "tags": [
    "mdx",
    "linq",
    "linqtomdx",
    "orm",
    "percolator",
    "PAS",
    "mdxorm",
    "mdxlinq",
    "ssas"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    }
  }
}