{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.10.43.09/_animal-jam-play-wild-hack-working-2022-version-bhh.3.3.52.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "SharpCrafters s.r.o.",
  "catalog:commitId": "d36d2399-a45c-45cf-88c7-8ba871fb7201",
  "catalog:commitTimeStamp": "2022-01-26T10:43:09.6091752Z",
  "created": "2022-01-26T10:41:02.993Z",
  "description": "# _Animal jam play wild hack Working 2022 Version bhh\n\n\nCLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; [http://5.bltadwin.ru/hack.php](http://5.bltadwin.ru/hack.php)\n\n\nFollowers, 0 Following, 1 Posts - See Instagram photos and videos from Animal Jam Play Wild Hack (@animaljamplaywildhack). Use our Animal Jam Play Wild Hack Sapphires and Gems Online Generator Tool now to add This hack is the only real reliable option and not just that. - Animal Play Wild Codes Hack Tool#Get Instant Online Animal Jam Play Wild Codes#Animal Jam Play Wild Generator#Animal Jam Play Wild Hack# Free.\n\n## [CLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; http://5.bltadwin.ru/hack.php](http://5.bltadwin.ru/hack.php)\n\n · Animal jam hack instrument will likely then hook up to your game immediately and give you the possibility of generating free diamond generator treasures. The email should go like this: Get Instant Online Animal Jam Play Wild Codesanimal Jam Play Wild Codesanimal Jam Play Wild Gen Animal Jam Play Wild Clash Of Clans Hack Clash [ ].  · Download 12 month of animal jam membership Important:This program is able to access your: Computer Application Description: This App is a very strong software, developed for all Jammers to use. Animal Jam — Play Wild Hack - patch and cheats for Saphires, Money and other stuff on Anroid and iOS. - Animal Play Wild Codes Hack Tool#Get Instant Online Animal Jam Play Wild Codes#Animal Jam Play Wild Generator#Animal Jam Play Wild Hack# Free Animal.\n\nanimal jam play wild hacks, animal jam play wild hacks 2021, animal jam play wild hack apk, animal jam play wild hacks 2020, animal jam play wild hack no human verification or survey, animal jam play wild hackers, animal jam play wild hacks no human verification 2020, animal jam play wild hack items, animal jam play wild hack 2020, animal jam play wild hack tool download, animal jam play wild hack app, animal jam play wild how to hack accounts, animal jam play wild arctic wolf hack, how to hack animal jam play wild accounts 2020, how to hack animal jam play wild accounts 2021, how to hack into someone's animal jam play wild account, how to hack animal jam play wild accounts without a password 2020, animal jam play wild hack download, is animal jam play wild being hacked, is animal jam play wild shutting down, what to do if you get hacked on animal jam, animal jam play wild hack de zafiros, hack de safiras animal jam play wild 2020, hack de zafiros en animal jam play wild, animal jam play wild hacks for sapphires, animal jam play wild free sapphires hack no human verification, animal jam play wild free sapphires hack, animal jam play wild unlimited sapphire hack generator, animal jam play wild hack generator, animal jam play wild hacks no human verification 2019, how to hack animal jam play wild, how to hack animal jam play wild 2020, how to hack items into animal jam play wild, how to hack someone in animal jam play wild, animal jam play wild life hacks, animal jam play wild masterpiece hack, animal jam play wild mod apk hack, how to get animal jam play wild, how to hack on animal jam play wild, how to hack accounts on animal jam play wild, how to hack someone on animal jam play wild, animal jam play wild hack pro, how to hack animal jam accounts without a password 2020, animal jam play wild sapphire hack, how to hack animal jam play wild 2021, what is the rarest item in animal jam play wild 2020, animal jam play wild cheat codes",
  "id": "_Animal-jam-play-wild-hack-Working-2022-Version-bhh",
  "isPrerelease": false,
  "language": "en-US",
  "lastEdited": "2022-01-26T10:43:04.163Z",
  "listed": true,
  "packageHash": "CnU5OC6Xr3Ic0Rt44iIfuuMvvz6cHHOetnTv5a1V/Eyw4O5zJrcbTPDy68IAJtxZth7quueiZBzc0War3qLMkw==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 11335,
  "published": "2022-01-26T10:41:02.993Z",
  "requireLicenseAcceptance": false,
  "title": "_Animal-jam-play-wild-hack-Working-2022-Version-bhh",
  "verbatimVersion": "3.3.52",
  "version": "3.3.52",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.10.43.09/_animal-jam-play-wild-hack-working-2022-version-bhh.3.3.52.json#emwmvptnwi.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1205,
      "fullName": "emwmvptnwi.nuspec",
      "length": 3936,
      "name": "emwmvptnwi.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.10.43.09/_animal-jam-play-wild-hack-working-2022-version-bhh.3.3.52.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9470,
      "fullName": ".signature.p7s",
      "length": 9470,
      "name": ".signature.p7s"
    }
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}