{
  "@id": "https://api.nuget.org/v3/catalog0/data/2016.01.29.12.30.33/jqwidgets_framework.4.0.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "jQWidgets",
  "catalog:commitId": "3ea085e2-c881-4ac9-aa9e-b72114fc8584",
  "catalog:commitTimeStamp": "2016-01-29T12:30:33.1762599Z",
  "created": "2016-01-29T12:30:16.737Z",
  "description": "jQWidgets is an advanced jQuery and HTML5 UI framework.\n\njQWidgets provides a comprehensive solution for building professional web sites and mobile apps. It is built entirely on open standards and technologies like HTML5, CSS, Javascript and jQuery. jQWidgets enables responsive web development and helps you create apps and websites that look beautiful on desktops, tablets and smart phones.\n\njQWidgets is a feature complete framework with professional touch-enabled jQuery widgets, themes, input validation, drag & drop plug-ins, data adapters, built-in WAI-ARIA accessibility, internationalization and MVVM support.",
  "developmentDependency": "true",
  "id": "jQWidgets_Framework",
  "isPrerelease": false,
  "lastEdited": "0001-01-01T00:00:00Z",
  "licenseNames": "",
  "licenseReportUrl": "",
  "licenseUrl": "http://www.jqwidgets.com/license/",
  "listed": true,
  "packageHash": "x2aW3iXJHQLPFwgXCqhqED8/BveZDpYgVzXAIRLwMV+lgHqxtDsR98SsIjLe2PmzJiK4HjyEoPN6bqVhBJM/Xg==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 2297279,
  "projectUrl": "http://www.jqwidgets.com/",
  "published": "2016-01-29T12:30:16.737Z",
  "releaseNotes": "jQWidgets v4.0.0 Release, Jan-27-2016\n\nWhat's New:\n\n- jqxKanban widget.\n- jqxKnob widget.\n- jqxSortable plug-in.\nWhat's Improved:\n\n- jqxNumberInput null value support.\nWhat's Fixed:\n\n- Fixed an issue in jqxScheduler regarding the rendering of appointments in Day/Week view with duration less than a single time slot.\n- Fixed an issue in jqxScheduler regarding the rendering of appointments in Day/Week view with more than 1 day duration.\n- Fixed an issue in jqxScheduler regarding the edit dialog widgets visibility.\n- Fixed an issue in jqxScheduler regarding the edit dialog's location field.\n- Fixed an issue in jqxScheduler regarding the weekstart in recurrenceAppointments export.\n- Fixed an issue in jqxScheduler regarding the changedAppointments property.\n- Fixed an issue in jqxScheduler regarding the legends rendering after re-binding the scheduler.\n- Fixed an issue in jqxGrid regarding the grouping and row details expand/collapse state maintenance.\n- Fixed an issue in jqxGrid regarding the grouping when deferred scrolling is enabled.\n- Fixed an issue in jqxCore regarding IE7, IE8 browser support.\n- Fixed an issue in jqxData.Export regarding the export to PDF in Firefox.\n- Fixed an issue in jqxDockingLayout regarding drop overlays not being displayed after \"loadLayout\" is called.\n- Fixed an issue in jqxDockingLayout regarding docked floatGroups losing their content after \"loadLayout\" is called.\n- Fixed an issue in jqxTextArea regarding the use of jQuery's .val() method.\n- Fixed an issue in jqxTextArea with text alignment when \"rtl\" is set to true.\n- Fixed an issue in jqxRating regarding the positioning of \"stars\" in containers with overflow.\n- Fixed an issue in jqxNotification occurring due to the ids of inner elements being duplicated.\n- Fixed an issue in jqxLayout and jqxDockingLayout occurring when \"height\" is set to a percentage value.\n- Fixed an issue in jqxLayout and jqxDockingLayout regarding resizing occurring when \"width\" or \"height\" is set to a percentage value.\n- Fixed an issue in jqxDockingLayout regarding the content of some docked float groups being lost when \"loadLayout\" is called.\n- Fixed an issue in jqxBulletChart regarding the dynamic setting of the \"ranges\" property.\n- Fixed an issue in jqxValidator regarding the class \"jqx-validator-error-element\" not being added to textarea elements when \"hintType\" is set to \"label\".",
  "requireLicenseAcceptance": false,
  "verbatimVersion": "4.0.0",
  "version": "4.0.0",
  "dependencyGroups": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2016.01.29.12.30.33/jqwidgets_framework.4.0.0.json#dependencygroup",
      "@type": "PackageDependencyGroup",
      "dependencies": [
        {
          "@id": "https://api.nuget.org/v3/catalog0/data/2016.01.29.12.30.33/jqwidgets_framework.4.0.0.json#dependencygroup/jquery",
          "@type": "PackageDependency",
          "id": "jQuery",
          "range": "[1.7.0, )"
        }
      ]
    }
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    }
  }
}