{
  "@id": "https://api.nuget.org/v3/catalog0/data/2015.02.07.02.05.11/spire.pdf.3.2.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "Administrator",
  "catalog:commitId": "00be802a-887e-42b1-bd0e-a025954f186b",
  "catalog:commitTimeStamp": "2015-02-07T02:05:11.9674826Z",
  "copyright": "Copyright © 2014 e-iceblue. All Rights Reserved.",
  "created": "2014-11-17T08:20:03.69Z",
  "description": "Spire.PDF for .NET is a versatile PDF library that enables software developers to generate, edit, read and manipulate PDF files within their own .NET applications. As a standalone PDF component, Spire.PDF for .NET provides users an incredible wealth of features without installing Adobe Acrobat. This component is completely written in C#, but also supports VB.NET, Windows Forms and ASP.NET. \nWith the Spire.PDF for .NET API, you can get the ability to read PDF text and image even attachments with high efficiency. Even the special content such as language written from right to left can be extracted such as Herbrew and Arabic. Other basic features such as text, image, table, shapes, hyperlinks, bookmark, headings, footnotes, lists, form fields, pagination, booklet barcode, attachments, transparency, annotations, actions, overlay etc all work great for users. As for security, Spire.PDF for .NET enables you to protect your PDF files by passwords and digital signature.",
  "iconUrl": "http://www.e-iceblue.com/images/product_logo/product_buy/pdfnet.png",
  "id": "Spire.PDF",
  "isPrerelease": false,
  "language": "en-US",
  "lastEdited": "0001-01-01T00:00:00Z",
  "licenseUrl": "http://www.e-iceblue.com/Knowledgebase/Licensing/License-Agreement.html",
  "packageHash": "rwphH8zr2+yAcMU1izLQNNfd8FhHj8wce5rBM7pLB+D3P+SOpFEAksmeFv165t/xFGp0u/3rb61FDHFrIoPXhw==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 20883827,
  "projectUrl": "http://www.e-iceblue.com/Introduce/pdf-for-net-introduce.html",
  "published": "2014-11-17T08:20:03.69Z",
  "releaseNotes": "Release version of Spire.PDF 3.2\n\nSpire.PDF 3.1.53\nImprove the performance of converting PDF to images in WPF.\nFix the issue that the color is incorrect when converting pdf to images.\nFix the issue that some text has background color is missing when converting pdf to images.\nFix the issue that graphics are missing when converting pdf to images.\nFix the issue that unicode in pdf table doesn't work when drawing data into pdf.\nFix the issue that the color is changed when printing PDF.\nFix the issue that some characters are bold when printing PDF.\nFix the issue that the font is garbled when printing PDF.\nFix the issue that the region of content is changed when printing PDF.\nFix the error\"System.OutOfMemoryException\" when loading html.\n\n\nSpire.PDF 3.1.24\nImprove RAM consuming performance on converting XPS to PDF.\nImprove time taking performance on converting PDF to Image.\nFix the error \"Invalid contents array\" when saving to pdf file after adding background image into pdf.\nFix the issue that some text was lost when printing PDF.\nFix the issue that the content was twisted when printing PDF.\nFix the issue that some characters were overlapping each other when printing PDF.\nFix the issue that red boxes were missing when converting PDF to Image.\nFix finding text issue in PDF was converted from DOCX by spire.doc.\nFix the error \"An item with the same key has already been added\" when extracting text from PDF.\n\nSpire.PDF 3.1.9\nFix the issue that the picture was incorrect when the image was converted from the PDF file by using the SaveAsImage method.\nFix the issue that the header of table was incorrect in converted image from PDF by using the SaveAsImage method.\nFix the issue that SaveAsDrawingImage method drew a redundant page border around the image.\nFix the error \"A generic error occurred in GDI+.\" occurred when converting PDF to XPS in WPF.\n\n\nSpire.PDF 3.0.59\nBug solutions:\nFix the issue that the red boxes and text were lost in converted Image from PDF.\nFix the issue that the data was cut in converted PDF from HTML.\nFix the error \"The index cannot be less than zero or greater than Count\" occurred when merging pdf files.\nFix the issue that the footer of the page was not printed.\nFix the error \"Arithmetic operation resulted in an overflow.\" occurred when drawing image in page.\n\n\nSpire.PDF 3.0.43\nNew features:\nAdd new feature to draw multiple string formats in a single grid cell.\nAdd a property Page.ActualSize to get actual size of page.\nAdd new method IsBlank() to detect if the content of page is blank.\n\nBug Solutions:\nFix the incorrect data issue in image converted from PDF \nFix the issue that column name is incorrect in image converted from PDF.\nImprove the time performance for converting HTML to PDF.\nFix the issue that PdfPageSize.A4 is not actual A4 size.\nFix the error \"Object reference not set to an instance of an object.\" caused in merging pdf files.\nFix the issue that the page is added to the end of the existing pdf when adding a blank page to the beginning of an existing PDF\nFix the issue that it adds additional horizontal scroll bar in HTML converted from PDF\n\n\n\nSpire.PDF 3.0.27\nNew features:\nAdd new feature to convert html string to PDF.\nAdd new feature pdf.SaveAsDrawingImage(pageIndex); to save pdf as DrawingImage for WPF\n\nBug Solutions:\nFix the error \"object reference not set to an instance of an object\" caused in converting PDF to Image.\nFix the blank output PDF issue after converting HTML to PDF.\nFix the \"Out of memory\" exception when using TrueType fonts embedded in the pdf file.\nFix the error \"Parameter is not valid\" caused in converting PDF to XPS.\nFix the issue that the pages render with a strange space in the beginning of the file when displaying PDF file inside a Print Preview Dialog.\nFix losing the fonts issue after merging two pdf files.\n\n\n\nSpire.PDF 2.9.51--When convert XPS to PDF, the error of missing letters has been fixed.\n\nSpire.PDF 2.9.43 this time offers you a smooth experience with extract image from PDF file. \nBug solutions:\n\n    Fixed a bug that PdfPageBase.ExtractImages() method did not refresh the image list after adding new images to PDF.\n    Fixed a bug that the pixel of the extracted images using PdfPageBase.ExtractImages() method was changed.",
  "requireLicenseAcceptance": false,
  "summary": "This package is designed to introduce developers a .NET PDF application Spire.PDF for .NET. This PDF application enables users to create, read, edit and maniplate PDF files with high efficiency.",
  "title": "Spire.PDF for .NET",
  "version": "3.2.0",
  "frameworkAssemblyGroup": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2015.02.07.02.05.11/spire.pdf.3.2.0.json#frameworkassemblygroup/.netframework2.0",
      "assembly": "Spire.PDF",
      "targetFramework": ".NETFramework2.0"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2015.02.07.02.05.11/spire.pdf.3.2.0.json#frameworkassemblygroup/.netframework3.5",
      "assembly": "Spire.PDF",
      "targetFramework": ".NETFramework3.5"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2015.02.07.02.05.11/spire.pdf.3.2.0.json#frameworkassemblygroup/.netframework4.0",
      "assembly": "Spire.PDF",
      "targetFramework": ".NETFramework4.0"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2015.02.07.02.05.11/spire.pdf.3.2.0.json#frameworkassemblygroup/.netframework4.0-client",
      "assembly": "Spire.PDF",
      "targetFramework": ".NETFramework4.0-Client"
    }
  ],
  "tags": [
    "PDF",
    "application",
    "library",
    "component",
    "control",
    "to",
    "XPS",
    "Image",
    "HTML",
    "PDF/A"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    }
  }
}