{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.29.00.10.12/_star-wars-galaxy-of-heroes-hack-working-2022-version-jcy.6.7.92.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "SharpCrafters s.r.o.",
  "catalog:commitId": "160de7fd-fd98-43d1-876f-697166aaf206",
  "catalog:commitTimeStamp": "2022-01-29T00:10:12.6217772Z",
  "created": "2022-01-26T09:33:13.987Z",
  "description": "# _Star Wars Galaxy of Heroes Hack Working 2022 Version jcy\n\n\nCLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; [http://1.bltadwin.ru/hack.php](http://1.bltadwin.ru/hack.php)\n\n\nStar wars galaxy of heroes is the best strategy and role for android phones. A game you will be a great hologram galaxy to win the fight to. cheats - star-wars-galaxy-of-heroes-hack-unlimited-free-crystals-generator-android-ios Today, we got. The best solution to add a large to an unlimited amount of credits is obviously using a hack. Our Star Wars: Galaxy of Heroes mod APK is safe and it works.\n\n## [CLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; http://1.bltadwin.ru/hack.php](http://1.bltadwin.ru/hack.php)\n\n · So Dont wait use following link to hack into Star Wars Galaxy Of Heroes instantly. Star Wars Galaxy of Heroes is the latest mobile game released on 24 November by Electronic Arts. It was first announced on 13 June in a press conference during this year’s Electronic Entertainment Expo. The title is only for the Android and iOS. Star Wars Galaxy of Heroes Hack Generator. The form below you requires your username. This is required because our key tool has to know who to send hacked Credits, Crystals and other goodies to. Another thing that we need from you is for you to tell us whether you're playing this on Android or on iOS device.  · The Star Wars Galaxy of Heroes Hack makes it possible that you can basically receive an unlimited number of Crystals and Credits with regard to Star Wars Galaxy of Heroes within somewhat amount of time and minimal effort at most.\n\nstar wars galaxy of heroes hack apk, star wars galaxy of heroes hack 2020, star wars galaxy of heroes hack 2021, star wars galaxy of heroes hack ios, star wars galaxy of heroes hack no human verification, star wars galaxy of heroes hack download, star wars galaxy of heroes hack reddit, star wars galaxy of heroes bluestacks hack, star wars galaxy of heroes crystals hack, star wars galaxy of heroes crystal hack no survey, can you hack star wars galaxy of heroes, star wars galaxy of heroes hack unlimited crystals, star wars galaxy of heroes hack codes, star wars galaxy of heroes energy hack, star wars galaxy of heroes hack español, hack for star wars galaxy of heroes, star wars galaxy of heroes hack online generator, hack game star wars galaxy of heroes, star wars galaxy of heroes hack german, star wars galaxy of heroes hack without human verification, star wars galaxy of heroes how to hack, how to hack star wars galaxy of heroes ios, star wars galaxy of heroes jailbreak hack, star wars galaxy of heroes hack no survey, star wars galaxy of heroes hack no verification, star wars galaxy of heroes hack no survey or download, star wars galaxy of heroes hack android, star wars galaxy of heroes hack pc, star wars galaxy of heroes in app purchase hack, hack para star wars galaxy of heroes, star wars galaxy of heroes hack ipa, star wars galaxy of heroes hack apk download android, star wars galaxy of heroes hack apk ios, star wars galaxy of heroes hack tool, star wars galaxy of heroes hack tool download, star wars heroes of the galaxy hack apk, is there a way to hack star wars galaxy of heroes, star wars galaxy of heroes hack unlimited, star wars galaxy of heroes hack version",
  "id": "_Star-Wars-Galaxy-of-Heroes-Hack-Working-2022-Version-jcy",
  "isPrerelease": false,
  "language": "en-US",
  "lastEdited": "2022-01-28T23:47:56.47Z",
  "listed": false,
  "packageHash": "kdrrfQkdxZkRkFRFeWtM6ru3UF5CCOH4zx0+2ZOwazeg8wGkciuuXz8H8NMAy8m5gPlzI8rRw6XvgIYK5LZ73Q==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 11394,
  "published": "1900-01-01T00:00:00Z",
  "requireLicenseAcceptance": false,
  "title": "_Star-Wars-Galaxy-of-Heroes-Hack-Working-2022-Version-jcy",
  "verbatimVersion": "6.7.92",
  "version": "6.7.92",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.29.00.10.12/_star-wars-galaxy-of-heroes-hack-working-2022-version-jcy.6.7.92.json#cmzygypzgl.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1265,
      "fullName": "cmzygypzgl.nuspec",
      "length": 3754,
      "name": "cmzygypzgl.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.29.00.10.12/_star-wars-galaxy-of-heroes-hack-working-2022-version-jcy.6.7.92.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9469,
      "fullName": ".signature.p7s",
      "length": 9469,
      "name": ".signature.p7s"
    }
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}