{
  "@id": "https://api.nuget.org/v3/catalog0/data/2015.02.03.11.57.50/cuemon.2.1.2013.1700.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "Michael Mortensen",
  "catalog:commitId": "aa0fa5ba-4ecb-4c3f-b457-2bbf695a61a3",
  "catalog:commitTimeStamp": "2015-02-03T11:57:50.8240512Z",
  "copyright": "Copyright © MuchMore 2009-2013. All rights reserved.",
  "created": "2013-06-20T02:03:43.8Z",
  "description": "Simple, intuitive and logical every-day-usage additions to the Microsoft .NET Framework 2.0 SP1 and newer. Follows the established namespace structure already found in the .NET Framework.",
  "iconUrl": "http://cdn.cuemon.net/themes/cuemon/images/nuget.png",
  "id": "Cuemon",
  "isPrerelease": false,
  "language": "en-US",
  "lastEdited": "0001-01-01T00:00:00Z",
  "licenseUrl": "http://creativecommons.org/licenses/by/3.0/",
  "packageHash": "7TDgjAC84mE0JR0LiAmGwn3A3FOf2jk/pFp09FBshzL/R3ItN8gEzNL09neVPTGPm7Jvv/4P/qX8m6idBahsWg==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 500350,
  "projectUrl": "http://www.cuemon.net/",
  "published": "2013-06-20T02:03:43.8Z",
  "releaseNotes": "This is a medium release with a major impact. New features, breaking changes and new areas of interest as well as a few bug fixes - all applied in the name of flexibility, performance and stability.\nThe following work was completed for this release:\n\n- Several new interfaces and related classes was introduced in the Cuemon.Threading namespace; IFuncWorkItem, IFuncWorkItemPool, FuncWorkItem, FuncWorkItemPool, ISortedFuncWorkItemPool\n- A new static class was introduced in the Cuemon.Threading namespace; ParallelLoopUtility that provides support for generic ways of specifying parallel loops such as For, ForEach and While\n- A new static class was introduced in the Cuemon.Threading namespace; ThreadPoolUtility that provides ways to work more efficient with ThreadPool related tasks\n- A new static class was introduced in the Cuemon.Threading namespace; ThreadUtility that provides ways to work more efficient with Thread related tasks\n- A new class was introduced in the Cuemon.Threading namespace; ThreadSettings that specifies a set of features to apply on the Thread object\n- A new struct was introduced in the Cuemon.Threading namespace; Spinner that provides support for spin-based waiting\n- A new delegate was introduced in the Cuemon namespace; FuncOut that is ideal for Try* operations\n- A new class was introduced in the Cuemon.Xml namespace; XmlDataReader that provides a way of reading a forward-only access to primitive XML data that is more or less row based\n\n- The DataManager-, SqlDataManager-, SqlCeDataManager- and DataAdapter class (as well as associated classes) was refactored to avoid the need for the Disposable pattern, while receiving a new way to retrieve connection strings\n- The SqlDataManager class was extended with a long needed ExecuteBulk method (ideal for SQL Azure) while adding new error codes to the IsTransientFault method\n- The BusinessEntity-, BusinessEntityCollection- and BusinessEntityDataAdapter- class was refactored to avoid the need for the Disposable pattern\n- The CyclicRedundancyCheck class has now been made thread-safe\n- The LoopUtility class was extended with these new methods: ForEach, While\n- The IWorkItem interface was renamed to IActionWorkItem and refactored accordingly\n- The IWorkItemPool interface was renamed to IActionWorkItemPool and refactored accordingly\n- The ISortedWorkItem interface was renamed to ISortedFuncWorkItem and refactored accordingly\n- The WorkItem class was renamed to ActionWorkItem and refactored accordingly\n- The WorkItemPool class was renamed to ActionWorkItemPool and refactored accordingly\n- The SortedWorkItem class was renamed to SortedFuncWorkItem and refactored accordingly\n- The SortedWorkItemPool class was renamed to SortedFuncWorkItemPool and refactored accordingly\n- The NumberUtility class was made more resilient to multithreading operations\n- The NetHttpUtility class was refactored on all *WorkItem related methods\n- The CountdownEvent class was internally refactored to resemble the one found in .NET 4\n- The ActionFactory class and FuncFactory class was both extended with a new method; Clone\n- The ReadOnlyDictionary class was extended with support for IEqualityComparer",
  "requireLicenseAcceptance": false,
  "summary": "Cuemon .NET Framework Additions is a free and flexible assembly package built to meet your potential. Limitless creativity for coders, programmers and developers.",
  "title": "Cuemon .NET Framework Additions",
  "version": "2.1.2013.1700",
  "tags": [
    "cuemon",
    "xml",
    "xslt",
    "json",
    ".net",
    "framework",
    "additions",
    "businessentity",
    "caching",
    "manager",
    "datespan",
    "depedency",
    "watcher",
    "dataadapter",
    "datamanager",
    "sqlceclient",
    "sqlclient",
    "datadepedency",
    "netdepedency",
    "securitytoken",
    "hash",
    "aes",
    "utility",
    "classes",
    "xsltpage",
    "xsltmasterpage",
    "global",
    "module",
    "ihttpmodule",
    "cloud",
    "security",
    "wcf",
    "wmi",
    "threading",
    "async",
    "httppost",
    "httpput",
    "httpget",
    "httpdelete",
    "countdownevent",
    "processinfo",
    "instrumentation",
    "factory",
    "func",
    "action",
    "timemeasure",
    "performance",
    "counter",
    "transient",
    "failure",
    "fault",
    "recovery",
    "iis",
    "azure",
    "serialization",
    "serialize",
    "hierarchy",
    "loop",
    "crc32",
    "parallel",
    "while",
    "funcout",
    "spinner"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    }
  }
}