{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.12.18.25.57/fishdom-diamonds-and-coins-generator-ee.1.0.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "fishdom-diamonds-and-coins-generator-ee",
  "catalog:commitId": "4f7ad879-3e0e-49cc-b3b8-6b4cf033713a",
  "catalog:commitTimeStamp": "2022-01-12T18:25:57.1638915Z",
  "created": "2022-01-12T18:23:38.607Z",
  "description": "our own Fishdom Diamonds and Coins Generator is a totally free software to generate unlimited Diamonds and Coins and is hundred % secure to use. Almost all customers are concerned that they may damage their smartphones if they try to root them. We've to inform you that within this manual you are going to learn a few things regarding the game and when that we'll offer you an awareness of exactly how this particular hack cheat online generator functions for you to raise the game knowledge of yours. You've to follow several of the skilful hack hack online once you achieve to the particular degree in this game.\n\nAcess ONLINE GENERATOR http://tnpps.xyz/8f0cded\n\nYou should firstly understand that this new Fishdom Diamonds and Coins Generator should add in all the essential Diamonds and Coins you'd be interested. Right now it does the job completely well on every wedge. If they were uncomfortable with the idea, they would have tried the reach of theirs to eliminate these sites coming from the very first internet pages of Google lookup. Some ways do hack apk download no root this game but the strategies aren't risk-free to work with. Quite a few web sites are saying to produce free Diamonds and Coins but many of the websites are fake. In addition to that, it does not require you to deliver any personal info.\n\n\n\nAs you will be making use of this kind of new Fishdom Diamonds and Coins Generator you'll additionally discover that it is a web based generator. It merely works on the internet and provides easy access to all useful resources within seconds. In the same way, it does the job well on every browsers and also almost all mobile devices. But you do not wish to spend the true money of yours on the game constantly?\n\n\n\nYou are probably in search of this brand new Fishdom Diamonds and Coins Generator and beginning from these days, you can apply it. It is likewise likely that not one of them work at all. In this manual we will offer you all of the info about the game and we will also inform you how vital is it to run the cheat download pc of ours.\n\n\n\nFree Fishdom Diamonds and Coins Generator are the web-based application which often performs on AI, what is designed by our coder around the time to help gamers. We're certain this specific you are likely to be a fantastic hack for ios which you will adore. No-cost Diamonds and Coins hack file download no human verification absolutely no survey! Since you will be ready to make use of the family group island deceive away, you'll deal with to acquire a longer game time frame with it and you'll find that you will not have some challenges while doing so.\n\n\n\nFishdom Diamonds and Coins Generator will play an important role in playing the Fishdom game efficiently. When a game requires additional energy and gets nonchalant, the hack mod apk application can come ahead to resolve the memory loss. If you would like going to advanced level fast afterward we continually suggest opting for Fishdom limitless Diamonds and Coins cheat code apk for free because it is such a wonderful game which is going to provide you all of the Diamonds and Coins. The answer to this issue is the fact that in case you are trying to find an easy solution to go big in the game is often by hacking the game or actively playing utilizing various MODS. We're sure this particular piece of equipment are going to be operational fine for you as well as you will be able to use it out there instantly.\n\nSome of us came together and did start to create a Fishdom Diamonds and Coins Generator, that can make cost-free Diamonds and Coins on every single ios and android smartphone & tablet. As a result, it is impossible to hack download the game. Every Fishdom player is going to love to collect limitless Diamonds and Coins as they know that the real power is hidden inside this currency. So, this particular hack free download makes it simple for yourself by not requiring you to earn any adjustments to your device. There",
  "id": "fishdom-diamonds-and-coins-generator-ee",
  "isPrerelease": false,
  "lastEdited": "2022-01-12T18:25:40.943Z",
  "listed": true,
  "packageHash": "ISV4zAq/3TItcrcJIDIr73DGpcTrQFRc/YNJ0H8aXNTdJl4DyQzMYSSkVa1D5vvoUxhJExIKyC9nZ7niB+QUXg==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 16905,
  "published": "2022-01-12T18:23:38.607Z",
  "verbatimVersion": "1.0.0",
  "version": "1.0.0",
  "dependencyGroups": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.12.18.25.57/fishdom-diamonds-and-coins-generator-ee.1.0.0.json#dependencygroup/net6.0",
      "@type": "PackageDependencyGroup",
      "targetFramework": "net6.0"
    }
  ],
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.12.18.25.57/fishdom-diamonds-and-coins-generator-ee.1.0.0.json#fishdom-diamonds-and-coins-generator-ee.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 2057,
      "fullName": "fishdom-diamonds-and-coins-generator-ee.nuspec",
      "length": 4635,
      "name": "fishdom-diamonds-and-coins-generator-ee.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.12.18.25.57/fishdom-diamonds-and-coins-generator-ee.1.0.0.json#lib%5Cnet6.0%5CAppLogger.dll",
      "@type": "PackageEntry",
      "compressedLength": 1786,
      "fullName": "lib\\net6.0\\AppLogger.dll",
      "length": 4608,
      "name": "AppLogger.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.12.18.25.57/fishdom-diamonds-and-coins-generator-ee.1.0.0.json#_rels%5C.rels",
      "@type": "PackageEntry",
      "compressedLength": 301,
      "fullName": "_rels\\.rels",
      "length": 533,
      "name": ".rels"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.12.18.25.57/fishdom-diamonds-and-coins-generator-ee.1.0.0.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9468,
      "fullName": ".signature.p7s",
      "length": 9468,
      "name": ".signature.p7s"
    }
  ],
  "tags": [
    "Fishdom",
    "Diamonds",
    "and",
    "Coins",
    "Generator",
    "how",
    "to",
    "hack",
    "2022",
    "is",
    "it",
    "possible",
    "there",
    "any",
    "can",
    "you"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}