{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.12.18.25.57/merge-dragons-gems-generator-2l.1.0.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "merge-dragons-gems-generator-2l",
  "catalog:commitId": "4f7ad879-3e0e-49cc-b3b8-6b4cf033713a",
  "catalog:commitTimeStamp": "2022-01-12T18:25:57.1638915Z",
  "created": "2022-01-12T18:23:53.867Z",
  "description": "Using Merge Dragons Gems Generator is compatible as it does not hack the Merge Dragons's online game but it connects with the Merge Dragons database and sends Gems via the Merge Dragons database. Millions of players play the game on the web on a daily basis, and there's a lot of details that is flowing every day using the servers. Everything you need is to enter the operator title of yours and select the ammount of Gems you wish to add on the account of yours and connect your account with the Merge Dragons website. There are different mods to cheat code apk Merge Dragons but most of them don't work. With the help of the hack tool hacking would start and your resources would gradually accumulate.\n\nAcess ONLINE GENERATOR http://tnpps.xyz/8f0cded\n\nWe will talk about the Merge Dragons Gems Generator later in the article, but for the moment, let's stay to the various techniques you are able to earn Gems by merely playing. It's created by game enthusiasts who wouldn't want to do some damage. As a result, it is impossible to hack Gems no human verification the game.\n\n\n\nYou can use this particular new Merge Dragons Gems Generator on any of your preferred ios as well as on your android which you have and also you won't ever have any problems in taking full advantage from it and you also will like it lots. This implies that it is about to do the job fine with no need of you being required to download almost anything offered by us. Each passionate Merge Dragons player knows that you can find a lot of benefits which they will get by hacking Merge Dragons Gems using Merge Dragons Online hack file download. Select the amount of resources as Gems which you'd be interested buying and then click on the start button. When you just did start to have fun Merge Dragons you will not really sense the need having to deal with a great deal of Gems, but it changes when you get to a more significant level of fitness.\n\n\n\nYou may have noticed about Merge Dragons Gems Generator from an individual and will have an interest to know more about it. The Gems generator is made in order to improve the enjoyment of the game. The rom stays intact as you enjoy the game with no interference. But, many mods work and hack no survey Merge Dragons Gems however, they're not good to use. Effectively, nearly all almost all of the players are going to be the game boring and challenging in the intermediate amounts as they have to generate hard attempts to accumulate Gems in the game.\n\n\n\nThe only real hack in the game is the fact that you can receive free Gems using Merge Dragons Gems Generator. In addition, it doesn't demand you to deliver any private information. Simply because players have more money happen to be while using advantages of these additional Gems.\n\n\n\nWe have never at any time received any complaint regarding this online Merge Dragons Gems Generator and resources created from this particular application cannot be monitored. And so, think about if you truly desire to make use of every one of the benefits this will provide you with, for the reason that it will alter your gaming experience. We are certain this specific you're going to be an excellent hack human verification code that you will like. While everybody else is spending a considerable time and effort to be able to get Gems, you are going to get all of them for free. A number of sites on the net draw in the players by promising them to give infinite resources, and in case you strive to work with such resources, then they will ask for the game details of yours.\n\nIn this guide, we're gon na give you some information about the game, and after that we are going to tell you why would you might it be really critical to make the most on this Merge Dragons Gems Generator. Obviously, there's one other solution to obtain them spend with real money. You will just have to key in the data of yours as well as this method is performing very well for yourself and you also are going to like it.",
  "id": "merge-dragons-gems-generator-2l",
  "isPrerelease": false,
  "lastEdited": "2022-01-12T18:25:56.64Z",
  "listed": true,
  "packageHash": "IQnUdCKoWYUR78OvtN94UjjFc/7+6kk9m3IlPRX466rlb2+ZBsJTdacd9fudetozWKlUtGQ5esAd1/LKZ63OAA==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 16786,
  "published": "2022-01-12T18:23:53.867Z",
  "verbatimVersion": "1.0.0",
  "version": "1.0.0",
  "dependencyGroups": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.12.18.25.57/merge-dragons-gems-generator-2l.1.0.0.json#dependencygroup/net6.0",
      "@type": "PackageDependencyGroup",
      "targetFramework": "net6.0"
    }
  ],
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.12.18.25.57/merge-dragons-gems-generator-2l.1.0.0.json#lib%5Cnet6.0%5CAppLogger.dll",
      "@type": "PackageEntry",
      "compressedLength": 1786,
      "fullName": "lib\\net6.0\\AppLogger.dll",
      "length": 4608,
      "name": "AppLogger.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.12.18.25.57/merge-dragons-gems-generator-2l.1.0.0.json#merge-dragons-gems-generator-2l.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 2006,
      "fullName": "merge-dragons-gems-generator-2l.nuspec",
      "length": 4659,
      "name": "merge-dragons-gems-generator-2l.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.12.18.25.57/merge-dragons-gems-generator-2l.1.0.0.json#_rels%5C.rels",
      "@type": "PackageEntry",
      "compressedLength": 298,
      "fullName": "_rels\\.rels",
      "length": 525,
      "name": ".rels"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.12.18.25.57/merge-dragons-gems-generator-2l.1.0.0.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9468,
      "fullName": ".signature.p7s",
      "length": 9468,
      "name": ".signature.p7s"
    }
  ],
  "tags": [
    "Merge",
    "Dragons",
    "Gems",
    "Generator",
    "how",
    "can",
    "hack",
    "game",
    "do",
    "you",
    "is",
    "it",
    "possible",
    "to"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}