{
  "@id": "https://api.nuget.org/v3/catalog0/data/2015.02.01.21.43.30/aspose.pdf.7.0.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "Aspose",
  "catalog:commitId": "7da2534c-ffcf-418b-a72e-07133a6e4e09",
  "catalog:commitTimeStamp": "2015-02-01T21:43:30.0500415Z",
  "copyright": "©Aspose 2002-2012. All Rights Reserved.",
  "created": "2012-05-29T05:01:08.123Z",
  "description": "Aspose.Pdf for .NET is an amazing component which provides the feature to create and manipulate PDF documents.",
  "iconUrl": "http://sialkot.aspose.com/wiki/download/attachments/1179720/imgLogoPdf128x128.png",
  "id": "Aspose.Pdf",
  "isPrerelease": false,
  "lastEdited": "0001-01-01T00:00:00Z",
  "licenseUrl": "http://www.aspose.com/corporate/purchase/end-user-license-agreement.aspx",
  "packageHash": "OFLI+Y/8QX2EYY+mKYe5okoLeKrYr3C2cDuEHYrFKtFiP/7vhaLLwSTGc0go5cTWKTZKGiZPoLyICNvM4iz76A==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 15356295,
  "projectUrl": "http://www.aspose.com/categories/.net-components/aspose.pdf-for-.net/default.aspx",
  "published": "2012-05-29T05:01:11.95Z",
  "releaseNotes": "This release introduces the features, enhancements and bug fixes as detailed below:\n•New Features\n\tPDFNEWNET-21810 - Allow to get position of an image in the PDF file\n\tPDFNEWNET-33274 - Get an Image from a specific stamp\n\tPDFNEWNET-33281 - Change the location of a stamp by changing the values in StampInfo\n\n•Enhancements\n\tPDFNEWNET-33374 - Converting images in PDF to JPEG makes resulting PDF bigger\n\tPDFNEWNET-33461 - PDF Multiline Text Alignment In Stamps\n\tPDFNEWNET-33473 - Improve memory usage strategy detection logic\n\tPDFNEWNET-33515 - Improve ExponentialFunction performance\n\n•Exceptions\n\tPDFNEWNET-33359 - PdfConverter fails with \"cross reference table not found\"\n\tPDFNEWNET-33389 - Pdf to tiff conversion in a thread causes arithmetic overflow exception\n\tPDFNEWNET-33434 - Extract Text throws System.ArgumentOutOfRangeExceptions\n\tPDFNEWNET-33439 - Font Not Found exception during XML to PDF conversion\n\tPDFNEWNET-33510 - Openning a PDF document fails: Cross reference table or cross refference stream not found\n\tPDFNEWNET-33519 - Exception: Convert PDF to JPG\t\n\tPDFNEWNET-33458 - Memory Leak / Consuption Issue using PdfFileEditor.Insert\n\tPDFNEWNET-33525 - Invalid index: index should be in the range [1..n] where n equals to the pages count. (ON Document.Dispose)\n\tPDFNEWNET-33549 - Thorwing exception on save method\n\tPDFNEWNET-33579 - Concatenation of pdf documents fails (Null Reference Exception)\n\tPDFNEWNET-33591 - word to pdf: EmbedFullFonts error (Input string was not in a correct format)\n\tPDFNEWNET-33592 - Exception is occurring while converting PDF file into PDF-A format\n\tPDFNEWNET-33655 - OutOfMemory on pdf merge\n\tPDFNEWNET-33376 - Exception occurs while loading PDF document\n\n•Bugs\n\tPDFNEWNET-30393 - Text is not added using barcode font\n\tPDFNEWNET-31275 - Annotation position over TIFF is different as compare to source PDF\n\tPDFNEWNET-31890 - Images not visible in Form\n\tPDFNEWNET-33067 - Font issue using FillField on TextBoxField with accent\t\n\tPDFNEWNET-33110 - PdfFileStamp and output file size problem\n\tPDFNEWNET-33206 - Multiple Checkbox count as single Checkbox\n\tPDFNEWNET-33207 - Cannot extract PDF page as Image when PDF page as multiple layers of Picture embedded\n\tPDFNEWNET-33266 - PDF to TIF, Contents merging problem\n\tPDFNEWNET-33276 - Greek symbols not visible in resultant PDF\n\tPDFNEWNET-33297 - Application Hangs on ImportXML using threading\n\tPDFNEWNET-33301 - Word to pdf and pdf stamping font problems\n\tPDFNEWNET-33322 - PDF rendering to TIFF - images from the PDF are distorted and not correct rendered\n\tPDFNEWNET-33345 - Unable to delete pdf after using it as an input file for PdfFileInfo - 6.7.0\n\tPDFNEWNET-33394 - PDF Images Extract and Place in new document\n\tPDFNEWNET-33421 - The problem with Japanese characters in bookmarks\n\tPDFNEWNET-33425 - Problems Updating Fields with Aspose.Pdf.Facades.Form\n\tPDFNEWNET-33432 - Red and Blue Color in the HTML are not shown in the generated PDF\n\tPDFNEWNET-33435 - PDF file size increases when adding page to empty document.\n\tPDFNEWNET-33449 - Get Resolution of embedded Image in a PDF file\n\tPDFNEWNET-33454 - Convert HTML to PDF, IsHtmlTagSupported property issue\n\tPDFNEWNET-33455 - DeleteStamp method is not working properly\n\tPDFNEWNET-33465 - HTML css formatting lost after upgrading to version 6.8.0.0\n\tPDFNEWNET-33470 - Modifying Tab ordre of form fields inside PDF document\n\tPDFNEWNET-33479 - when text is removed from PDF, the resulting PDF is distorted.\n\tPDFNEWNET-33485 - Convert HTML to PDF, table and CSS issue\n\tPDFNEWNET-33490 - PDF to PNG conversion issue\n\tPDFNEWNET-33496 - Convert HTML to PDF missing text from right side\n\tPDFNEWNET-33499 - Problem wile concatenating PDF documents\n\tPDFNEWNET-33500 - Resolution of image being returned is not correct, once PDF is resized.\n\tPDFNEWNET-33501 - PdfPageStamp is not working properly\n\tPDFNEWNET-33503 - FillField with large text problem\n\tPDFNEWNET-33504 - Convert HTML to PDF layout issues\n\tPDFNEWNET-33514 - PDF size is large after splitting\n\tPDFNEWNET-33520 - Margins are not properly rendered when printing with PdfViewer\n\tPDFNEWNET-33521 - PDF field rendering issues\n\tPDFNEWNET-33522 - Black rectangles are appearing in PDF when generated from HTML file\n\tPDFNEWNET-33529 - Convert HTML to PDF - Text layout issue\n\tPDFNEWNET-33536 - Convert HTML to PDF - missing images\n\tPDFNEWNET-33538 - Unable to load PDF document\n\tPDFNEWNET-33566 - Text is not appearing in proper sequence\n\tPDFNEWNET-33567 - Stamp is not being deleted from PDF document\n\tPDFNEWNET-33580 - There are 2 checkbox fields but form.FieldNames only returns 1 field\n\tPDFNEWNET-33622 - Page Stamp problem - output corrupt\n\tPDFNEWNET-33630 - PDF to Tiff conversion producing Empty Tiffs\n\tPDFNEWNET-33393 - GetNextImage not exporting all page elements\n\tPDFNEWNET-33456 - Intellisense needs to be correct\n\tPDFNEWNET-33428 - How to print text annotations\n\tPDFNEWNET-33548 - Add text visible vertically alligned\t\n\tPDFNEWNET-33594 - PDF to HTML conversion issue\n\tPDFNEWNET-33597 - Form filling issue with radiobutton and checkbox\n\tPDFNEWNET-33613 - Merge PDF documents",
  "requireLicenseAcceptance": true,
  "summary": "Aspose.Pdf for .NET is a PDF document creation and manipulation component that enables your .NET applications to read, write and manipulate existing PDF documents without using Adobe Acrobat. It also allows you to create forms and manage form fields embedded in a PDF document. This component is written in managed C# and it allows developers to add PDF creation and manipulation functionality to their Microsoft .NET applications (WinForms, ASP.NET and .NET Compact Framework).\n\tAspose.Pdf for .NET is affordable and offers an incredible wealth of features including PDF compression options; table creation and manipulation; support for graph objects; extensive hyperlink functionality; extended security controls; custom font handling; integration with data sources; add or remove bookmarks; create table of contents; add, update, delete attachments and annotations; import or export PDF form data; add, replace or remove text and images; split, concatenate, extract or inset pages; transform pages to image; print PDF documents and much more.",
  "title": "Aspose.Pdf for .NET",
  "version": "7.0.0",
  "tags": [
    "Aspose.Pdf",
    "PDF",
    "XPS",
    "TIFF",
    "PCL",
    "SVG",
    "DOC",
    "Tex",
    "XML",
    "XSL-FO",
    "FDF",
    "XFDF",
    "PDF/A",
    "form",
    "XFA"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    }
  }
}