{
  "@id": "https://api.nuget.org/v3/catalog0/data/2015.07.20.16.23.01/51degrees.mobi.3.2.3.1-beta1.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "James Rosewell, Iftikhar Ahmed, Mike Morozov",
  "catalog:commitId": "f6290187-0e49-4a59-9ba7-87aa77ee56ea",
  "catalog:commitTimeStamp": "2015-07-20T16:23:01.4820311Z",
  "copyright": "51Degrees Mobile Experts Limited",
  "created": "2015-07-20T16:15:54.18Z",
  "description": "The fastest, most accurate tools. Deployed by millions.\n      Request.Browser properties will be populated with data from 51Degrees Lite Device Data. Other features\n      include automatic image optimisation, monitoring of network conditions and client side feature detection.",
  "iconUrl": "https://51degrees.com/portals/0/Logos/Square%20Logo.png?width=128",
  "id": "51Degrees.mobi",
  "isPrerelease": true,
  "language": "en-GB",
  "lastEdited": "2015-07-20T16:22:34.377Z",
  "licenseUrl": "http://51degrees.codeplex.com/license",
  "packageHash": "Ta15Q7mIEaFtlTsc0nC4VhD5d54uyQJaI/h71uyWwPgl2j8qdAix9r6ylDbUTsNZgNXqPxIu8FCfDkxGUTcAFQ==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 162355,
  "projectUrl": "http://51degrees.com/Support/Documentation/NET",
  "published": "2015-07-20T16:15:54.18Z",
  "releaseNotes": "Version 3.2.3 Highlights\nThis release focuses on reducing memory consumption and improving performance when the device data file is used directly from the disk. \n* Embedded data has been removed from the assembly and now must be provided from the App_Data folder. \n* .NET 3.5 is not supported in this release in order to use memory mapped files and simplify overriding default browser capabilities. \n* In stream mode entity data properties that can allocate large arrays only initialise these arrays when needed.  \n* Caches used with stream operation are now fixed memory size and serviced via the thread pool. \n* Automatic update processes uses temporary files rather than main memory to verify integrity of updated files prior to using them. \n* Temporary files are now created in the App_Data/51Degrees folder of the web application rather than a UNC path or the master data file folder. \n* Values associated with Profiles are now retrieved using a more efficient algorithm. \n* DataSet.Properties collection now has a string accesser to make retrieving properties by name simpler. \n* Web sites using memory mode use a byte array to improve start up time.\n* Version 3.2 data file formats are supported in parallel with version 3.1 data files.\n* 51Degrees unit tests are now part of the open source distribution.\nImport Change: The embedded device data has been removed from the assembly and by default placed in the App_Data folder if used with a web site. The solution will not work without the associated data file being provided and the WebProvider.ActiveProvider property can now return null. \n\n-- Changes from 3.2.2 --\n\n\n1. Automatic download requests version 3.2 data file format.\n2. The active provider will not be initialised when data sharing is enabled.\n\n-- Changes from 3.2.1 --\n\n1. TrieProvider now support V3.2 data file format which includes embedded HTTP headers in the properties data array.\n2. TrieProvider supports NameValueCollection of HTTP headers rather than a single user agent string. An collection of device indexes is returned for each of the relevant headers. The collection can be used with new GetPropertyValue methods to return the property value from the most relevant HTTP header.\n3. If a file is used with the StreamFactory it will only be deleted if the IsTemporary parameter is set to true. Previously the extension of the file was used to determine if the file was temporary and eligible for deletion.\n4. Stream DataSet now exposes information related to the number of readers created and queued in the underlying Pool.\n5. Detector module no longer listens for PostAuthorizeRequest if image optimisation is disabled.\n6. Changing device detection or image optimisation enabled states will change web.config modules collection to ensure configured to listen for all requests, not just managed code.\n7. Changed image optimiser process to reduce memory consumption slightly, and ensure resized image is smaller than the original.\n\n-- Changes from 3.1.13 --\n\n1. The entity RankedSignatureIndex has been renamed to IntegerEntity along with the associated factories. This is so that the entity can be reused in the new lists for Nodes related to Signatures and Signatures related to Nodes where each list also contains 4 byte integer data types.\n2. A potential threading problem has been resolved in Profile entity by only referencing the property PropertyIndexToValues rather than its backed private field.\n3. Cache service method thread start is now synchronised.\n4. Memory/Profile.cs Init() method has been removed as the ValueIndexes and SignatureIndexes arrays are needed to support other methods and don’t need to be freed.\n5. Changed the Cache classes AddRecent and ServiceCache methods to prevent multiple service operations in multiple threads.\n6. Added a ResetCache method to the dataset.\n7. WebProvider in memory mode now uses a byte array in memory rather than constructing all instances of every entity. This reduces start up time.\n8. Unit tests have been added for performance, memory and major data error checks.\n9. V3.2 data format is now supported.",
  "requireLicenseAcceptance": false,
  "summary": "Fast & Accurate Device Detection. Deployed by millions.",
  "title": "51Degrees Mobile Detection & Optimisation",
  "version": "3.2.3.1-beta1",
  "dependencyGroups": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2015.07.20.16.23.01/51degrees.mobi.3.2.3.1-beta1.json#dependencygroup",
      "@type": "PackageDependencyGroup",
      "dependencies": [
        {
          "@id": "https://api.nuget.org/v3/catalog0/data/2015.07.20.16.23.01/51degrees.mobi.3.2.3.1-beta1.json#dependencygroup/microsoft.web.infrastructure",
          "@type": "PackageDependency",
          "id": "Microsoft.Web.Infrastructure",
          "range": "[1.0.0, )"
        }
      ]
    }
  ],
  "tags": [
    "mobile",
    "phone",
    "detection",
    "device",
    "data",
    "handset",
    "tablet",
    "responsive",
    "design",
    "images",
    "51degrees"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    }
  }
}