{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.13.17.40.14/evony-the-kings-return-gems-generator-7n.1.0.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "evony-the-kings-return-gems-generator-7n",
  "catalog:commitId": "3647a4dc-f6d6-420b-9025-daf04c6c1c15",
  "catalog:commitTimeStamp": "2022-01-13T17:40:14.056474Z",
  "created": "2022-01-13T02:24:00.047Z",
  "description": "Evony The King's Return Gems Generator is a free of charge online program which helps the gamer to produce any amount of Gems. You are able to create endless Gems when you build the tools of ours. The key reason why these young people want Evony The King's Return to online generator activation code because they would like to become quickly and they would like to achieve the advanced degree in a short period and so in that instance, just about all they require is the Evony The King's Return hack no human verification that truly works for them. If you only wish to acquire no cost Gems type the quantity of Gems you would like. Here in this report, we are letting you know about the best way to hack for ipad the Evony The King's Return which will guide you going further in this game. Rather than accomplishing this, they've invested their point in time concentrating on the volume of theirs of sales.\n\nAcess ONLINE GENERATOR http://tnpps.xyz/8f0cded\n\nFree Evony The King's Return Gems Generator are the web-based software which performs on artificial intelligence, which in turn is designed by our programmer around the clock to support players. The web-based hack direct download is additionally referred to as resources cheat download for iphone since it gives you you unlimited Gems, along with loads of various other resources. Within both ways, you are able to have all the required Gems within the bank account. But this specific issue will certainly change as the game gets even closer to the release date. In addition, you do not need to customize your device with apks, everything is online. The creators of the hack online generator without human verification are a well known underground team that has performed well on numerous such tools for various other pastimes.\n\n\n\nAfter some time we've noticed a plenty of online searches coming through, people trying to look for Evony The King's Return Gems Generator for android or ios, Evony The King's Return  cheat download no survey windows mobile. You are going to be glad to hear  it is totally free and for some other hack tool apk, you may possibly be required to invest a bit of money to remove succeeding expenses. This is why we made the Evony The King's Return generator download. It seems stimulating to generate a few in game currency every day, however, it includes a fee. The hack generator no verification is developed in order to enhance the enjoyment of the game. The Evony The King's Return Gems hack for pc of ours is web-based program along with its hundred % secure no human being verification asked.\n\n\n\nAnyone can easily generate Gems with Evony The King's Return Gems Generator. However, they're generating cash from their use since they're providing owners with zero-cost Gems which takes some time to offer. This tool lets you make no cost Gems. We hope you are going to like this guide a lot. For a lot of game addict this is very annoying and unnecessary.\n\n\n\nWorking with any outsource to boost Evony The King's Return Gems is referred to as Evony The King's Return Gems Generator. This's not about these phony hack full version or in some additional 3rd party accessories which will possibly don't work or perhaps is certain to get your account restricted, this is about useful and small properties found in aloe vera that're inside the game which each player can use, risk totally free but brimming with advantages. So, if you're in addition feeling encouraged to experience the game, then simply have a look at the below mentioned features and other essential components of the game. In general, you are able to say that just about all good things are available for cost-free, therefore the reality that we are completely free Gems really easily bears testimony to it.\n\n\n\nEvony The King's Return Gems Generator is compatible with the majority of mobile operating syatems as windows, amazon, ios and android. Other things that you'd like to point out to us, shoot through the comment",
  "id": "evony-the-kings-return-gems-generator-7n",
  "isPrerelease": false,
  "lastEdited": "2022-01-13T17:28:36.02Z",
  "listed": false,
  "packageHash": "MgVpex53ZHxrBzClH9x3Mq5yxrI8w8AoDjfFdL4M1C4a7qmI+ZBAE8LO04FLfRSEg+A4cqaxH8/2rUMVSLYGiQ==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 16887,
  "published": "1900-01-01T00:00:00Z",
  "verbatimVersion": "1.0.0",
  "version": "1.0.0",
  "dependencyGroups": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.13.17.40.14/evony-the-kings-return-gems-generator-7n.1.0.0.json#dependencygroup/net6.0",
      "@type": "PackageDependencyGroup",
      "targetFramework": "net6.0"
    }
  ],
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.13.17.40.14/evony-the-kings-return-gems-generator-7n.1.0.0.json#evony-the-kings-return-gems-generator-7n.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 2049,
      "fullName": "evony-the-kings-return-gems-generator-7n.nuspec",
      "length": 4758,
      "name": "evony-the-kings-return-gems-generator-7n.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.13.17.40.14/evony-the-kings-return-gems-generator-7n.1.0.0.json#lib%5Cnet6.0%5CAppLogger.dll",
      "@type": "PackageEntry",
      "compressedLength": 1786,
      "fullName": "lib\\net6.0\\AppLogger.dll",
      "length": 4608,
      "name": "AppLogger.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.13.17.40.14/evony-the-kings-return-gems-generator-7n.1.0.0.json#_rels%5C.rels",
      "@type": "PackageEntry",
      "compressedLength": 303,
      "fullName": "_rels\\.rels",
      "length": 534,
      "name": ".rels"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.13.17.40.14/evony-the-kings-return-gems-generator-7n.1.0.0.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9469,
      "fullName": ".signature.p7s",
      "length": 9469,
      "name": ".signature.p7s"
    }
  ],
  "tags": [
    "Evony",
    "The",
    "King's",
    "Return",
    "Gems",
    "Generator",
    "are",
    "hacks",
    "real",
    "do",
    "really",
    "work",
    "how",
    "to",
    "hack",
    "android",
    "can",
    "we"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}