{
  "@id": "https://api.nuget.org/v3/catalog0/data/2015.02.03.16.15.50/aspose.words.13.7.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "Aspose",
  "catalog:commitId": "12af1af7-1d5a-4fd9-94c1-0be78848f8f1",
  "catalog:commitTimeStamp": "2015-02-03T16:15:50.5704802Z",
  "copyright": "© Aspose 2002-2013. All Rights Reserved.",
  "created": "2013-08-04T17:40:12.477Z",
  "description": "Aspose.Words for .NET class library supports DOC, DOCX, RTF, HTML, OpenDocument, PDF, XPS, EPUB and other formats. With Aspose.Words you can generate, modify, convert, render and print documents without utilizing Microsoft Word®",
  "iconUrl": "http://www.aspose.com/images/products/dotnet/Aspose.Words_128x128.png",
  "id": "Aspose.Words",
  "isPrerelease": false,
  "lastEdited": "0001-01-01T00:00:00Z",
  "licenseUrl": "http://www.aspose.com/corporate/purchase/end-user-license-agreement.aspx",
  "packageHash": "JgduSUeIMLyvjXmk3Lk24zX48HLu0NhsgekcLF5BV6cAsCV6rfPrFg7OePRlAYFcf1FWqo4q+uCP/c/LEk43GQ==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 10589305,
  "projectUrl": "http://www.aspose.com/categories/.net-components/aspose.words-for-.net/default.aspx",
  "published": "2013-08-04T17:40:12.477Z",
  "releaseNotes": "There are 142 improvements and fixes in this regular monthly release. The most notable are:\n\n• Rendering of table diagonal borders\n• Document structure output into PDF/A-1a compliance\n• Export of SDT controls as editable PDF form fields\n• Improved text wrapping logic for section breaks\n• EQ (mathematical) fields rendering implemented\n• Added options for setting image resolution while rendering to PDF\n• Fixed problem with incorrect font rendering for Korean language\n• Supported theme overrides (OOXML)\n• Improved format revision support (including styles)\n• Several improvements in OLE support area\n\nThis release introduces the new features, enhancements and fixes to the excptions/bugs as detailed below:\n\n• New features\nWORDSNET-7987\tConsider exporting SDT controls as editable PDF form fields\nWORDSNET-8058\tLine ends is not considered during appling extrusion effect\nWORDSNET-8063\tColored chart becomes grayscale during open/save\nWORDSNET-8111\tCreate an article that describes how to use Aspose.Words in MS Access application\nWORDSNET-8167\t/cell border diagonal/ Diagonal borders in table cells are missing from fixed page formats\nWORDSNET-8271\tExport document logical structure to PdfRenderer along with APS model\nWORDSNET-8272\tWrite logical structure to PDF\nWORDSNET-8275\tText inside FORMDROPDOWN is not wrapping to multiple lines in PDF\nWORDSNET-8303\tImplement 'volume line' building for line with different Dash Style.\nWORDSNET-8390\tPreserve protection of selected ranges upon RTF round-trip.\nWORDSNET-8426\tRender DrawingML picture as ApsImage\nWORDSNET-8446\tSupport import of element 'image' in DOCX format\nWORDSNET-8458\tImplement 'volume line' building for line with different Dash Style for DML lines.\nWORDSNET-8475\tProvide PdfSaveOptions.ImageResolution property\nWORDSNET-8522\tProvide an option to keep source image resolution when rendering to PDF\nWORDSNET-8533\tProvide a way to distinguish different story types in LayoutApsBuilder\nWORDSNET-8534\tProvide a way to determine text language in LayoutApsBuilder\nWORDSNET-8535\tProvide a way to get AltText for pictures and tables in LayoutApsBuilder\n\n• Enhancements\nWORDSJAVA-696\tWrongly locked image scale causes wrong scale while saving\nWORDSJAVA-739\tAutoportable MailMergeDataSourceDataTable/DataRelation\nWORDSNET-2098\tLine spacing is different when appending one document to another\nWORDSNET-2968\tParagraph indentation is incorrect during rendering.\nWORDSNET-3526\tSUM(ABOVE) does not work if there are data inside brackets.\nWORDSNET-4284\tNEXTIF field with mail merge regions throws exception if last record in datasource\nWORDSNET-4303\tParagraph alignment is changed after appending document.\nWORDSNET-6612\tWingdings symbol in HTML are not appearing correctly in IE8 but Firefox.\nWORDSNET-7651\tMove external image files for TestImportJacobPalmeSamples tests into our wiki.\nWORDSNET-8260\tCaps of arrow disappear on shadows\nWORDSNET-8261\tSome arrows appear incorrectly if they have not extrusion effect.\nWORDSNET-8295\tTest SVG image support on mobile Safari\nWORDSNET-8307\tBorder width is ignored when paragraphs are positioned in HTML\nWORDSNET-8329\tUpdate EULA to 1st June revision\nWORDSNET-8337\tParagraphs overlap when viewing the output HtmlFixed file with IE6, IE7 or IE8\nWORDSNET-8388\tfont-size mentioned in html span tag is imported incorrectly in DOM\nWORDSNET-8433\tRendering of DrawingML in RGB color format\nWORDSNET-8437\tGet rid of Bbt. Use an easier implementation for iterator of PageParts.\nWORDSNET-8445\tMailMerge.Execute does not fill mail merge fields in the document\nWORDSNET-8461\tInserting data into a merge field using DocumentBuilder inside FieldMerging no longer works\nWORDSNET-8482\tDo not include empty headings to the PDF document outline\nWORDSNET-8484\tExpress - Update EULA to 1st June revision\nWORDSNET-8488\tA Table renders on to the bottom of previous page and gets truncated\nWORDSNET-8489\tTables inside TextBox Shape overlap the remaining content\nWORDSNET-8490\tA logo image gets partially rendered more towards top page edge in Pdf\nWORDSNET-8491\tMhtml filie is detected as txt\nWORDSNET-8495\tExtra blank page is added during rendering to PDF\nWORDSNET-8507\tFix bugs reported with DocumentLayoutHelper\nWORDSNET-8509\tDrawingML gets clipped and distorted when viewing print preview in Chrome\nWORDSNET-8524\tPng image is read (parsed) twice during saving to pdf.\nWORDSNET-8536\tDocx to Pdf conversion issue with list items when Run.Font.Hidden is set to false\nWORDSNET-8575\tText pushed to the next page, leaving a column empty.\nWORDSNET-8597\tTake into account shape type during textbox size calculation\n\n• Exceptions\nWORDSJAVA-743\tjava.lang.NegativeArraySizeException occurs when saving DOC to HTML\nWORDSNET-4569\tFileCorruptedException is thrown on Mhtml import\nWORDSNET-6303\tConsider adding resilency during updating formula fields\nWORDSNET-8282\tAspose.Words.FileCorruptedException occurs when loading MHTML file\nWORDSNET-8444\tDocumentLayoutHelper example code example throws Exception\nWORDSNET-8448\tDocument.Save throws System.InvalidOperationException (Stack empty)\nWORDSNET-8514\tXamlReader.Load throws XamlParserException when loading XamlFlowPack\nWORDSNET-8553\tNullReferenceException occurs during exporting DOC to HTML\nWORDSNET-8568\tNullReferenceException occurs during rendering to PDF or HTML\nWORDSNET-8571\tNullReferenceException occurs during exporting DOC to HTML or PDF\nWORDSNET-8573\tInvalidOperationException occurs when converting Doc to Html or Pdf\nWORDSNET-8577\tInvalidCastException occurs during loading a DOCX\nWORDSNET-8586\tStackOverflowException occurs during appending document to another document\nWORDSNET-8590\tShape.OleFormat.IconCaption throws exception\nWORDSNET-8606\tInvalidCastException occurs during Open/Save a DOC\n\n• Bugs\nWORDSJAVA-738\tInvestigate why does the default locale of JVM changes randomly\nWORDSNET-4965\tPosition of frame is incorrect after rendering.\nWORDSNET-5021\tA field with CHARFORMAT is bold on update, though field code is not bold.\nWORDSNET-6002\tImages are rendered as red crosses to document\nWORDSNET-6142\tField switch is incorrectly added to the end of an INCLUDEPICTURE field\nWORDSNET-6380\tImage in DOCX is not visible when rendering to HTML\nWORDSNET-6528\tMergefield with CAPS formatting switch produces incorrect results.\nWORDSNET-6794\tContent of Table in header is truncated in HTML\nWORDSNET-7166\t/revisions/ Cells have extra padding at the bottom in PDF\nWORDSNET-7490\tSEQ fields do not reset on the headings level\nWORDSNET-7909\tSEQ field \"\\s\" option is not taken into account by UpdateFields\nWORDSNET-8082\tUnwanted border around the OLEObject is added in PDF\nWORDSNET-8181\tMS Word 2013 displays broken RTL text\nWORDSNET-8183\tRTL text is reversed in Fixed Page HTML\nWORDSNET-8216\tDocumentBuilder does not inherit Bookmark formatting when moving cursor to that Bookmark\nWORDSNET-8249\tCharts do not render in HtmlFixed after conversion from Doc\nWORDSNET-8256\tIncorrect ActiveX control sized cause inline shape to wrap to the next line in PDF\nWORDSNET-8276\tFont.Hidden property returns old value for a revised document\nWORDSNET-8311\tComposite nodes are joined in a wrong way while field result removal.\nWORDSNET-8342\tWordML to Pdf conversion issue with DOCPROPERTY\nWORDSNET-8355\tCalling UpdateFields method twice turns on the Link To Previous option\nWORDSNET-8363\tSaveOptions.WarningCallback do not work for ImageSaveOptions (Tiff)\nWORDSNET-8374\tDirect formatting attributes are added to the Paragraphs and Runs inside SDT during UpdatePageLayout.\nWORDSNET-8409\tDocx to Doc conversion issue with mathematical formulas\nWORDSNET-8413\tAll formatting of copied style is not applied to Paragraphs\nWORDSNET-8423\tDocx to Pdf conversion issue with content misplacement\nWORDSNET-8431\tImageData.GrayScale property is not respected during rendering to PDF\nWORDSNET-8434\tOfficeMath equations are exported to HTML as blank images in Windows 8\nWORDSNET-8452\tFix JavaDoc error that occurs when running doc script\nWORDSNET-8459\tDoc to Pdf conversion issue with image rendering\nWORDSNET-8462\tParagraph gets unexpected line spacing after mail merge\nWORDSNET-8463\tTransparent background of an image is lost during rendering to PDF\nWORDSNET-8465\tStructuredDocumentTag Node does not import from one document to another\nWORDSNET-8477\tOleFormat.Save does not save the data of the embedded object\nWORDSNET-8479\tDocx to Pdf conversion issue with date rendering\nWORDSNET-8480\tA Hyperlink does not work when converting document to PDF\nWORDSNET-8481\tBullets are missing after conversion from Docx to Pdf\nWORDSNET-8485\tMargin-left of styled headers isn't correct when you have a table in the html\nWORDSNET-8486\tAn image in PDF is displayed very small in when converted from RTF\nWORDSNET-8494\tImport characters in range 0x80 - 0x9F from HTML documents encoded in 'ISO-8859-1'\nWORDSNET-8496\tH2 heading causes Row to render on the next page\nWORDSNET-8497\tTextBox shape overlaps the content around it's edges in PDF\nWORDSNET-8500\tUpdateFields places a TOC at incorrect position in output document\nWORDSNET-8505\tFont changes during importing nodes into another document\nWORDSNET-8508\tPAGE and NUMPAGES fields are displaying 'Error! Bookmark not defined' message in PDF\nWORDSNET-8510\tWhile generating a PdfA1b from DOCX it is showing white strip and removing content from textbox\nWORDSNET-8511\tNumber rendering issue with NumeralFormat.Context in mail merge\nWORDSNET-8516\tBold simulation issue with Chinese font\nWORDSNET-8519\tSome items in existing list are nested inside a new numbered list\nWORDSNET-8520\tDocx to Pdf Conversion issue with chart position\nWORDSNET-8521\tDocx to Pdf conversion issue with Legends rendering\nWORDSNET-8526\tFont fallback issue with Korean text\nWORDSNET-8527\tList items and their indentations are not preserved during open/save HTML\nWORDSNET-8529\tLeft indentation of list is not correct when converting HTML to DOC\nWORDSNET-8544\tTable.ClearBorders() adds borders to the Cells\nWORDSNET-8546\tDate Type StructuredDocumentTag do not render correctly in output Pdf\nWORDSNET-8547\tBullet symbols are rendering as question marks in IE 7 and IE8\nWORDSNET-8556\tDocx to Pdf conversion issue with vertical axis title\nWORDSNET-8559\tDocx to SVG conversion issue with RTL text\nWORDSNET-8560\tDoc to Pdf conversion issue with Font Courier New\nWORDSNET-8579\tHidden text becomes visible in XamlFlowPack\nWORDSNET-8582\tExtensive use of Frames in DOCX causes many formatting issues in EPUB\nWORDSNET-8591\tShape.OleFormat.IconCaption return incorrect value\n\n• Performance\nWORDSNET-8236\tInvestigate if special tags get tempered during printing DOC to RightFax\nWORDSNET-8555\tOptimize process of creating/caching LprSpan objects in SpanGenerator\nWORDSNET-8584\tDrawingML causes Aspose.Words to hang during rendering DOCX to PDF\n\n• Regressions\nWORDSNET-8380\tExportFontResources causes System.ArgumentException when exporting a DOC to EPUB\nWORDSNET-8385\tLanguage information is no longer exported to HTML\nWORDSNET-8432\tA Table splits into two tables during open/save a DOCX\nWORDSNET-8540\tSystem.ArgumentOutOfRangeException occurs during rendering to HTML\nWORDSNET-8548\tAspose.Words.FileCorruptedException occurs when loading a DOC\nWORDSNET-8549\tAspose.Words.FileCorruptedException occurs when loading a DOC\nWORDSNET-8550\tSystem.InvalidOperationException occurs during rendering DOC to HTML\nWORDSNET-8551\tSystem.InvalidOperationException occurs during rendering DOC to HTML\nWORDSNET-8554\tInvalidOperationException occurs during exporting DOC to HTML",
  "requireLicenseAcceptance": true,
  "title": "Aspose.Words for .Net",
  "version": "13.7.0",
  "tags": [
    "Aspose.Words",
    "DOC",
    "DOCX",
    "RTF",
    "HTML",
    "OpenDocument",
    "XPS",
    "EPUB",
    "Word",
    "Document",
    "Processing"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    }
  }
}