{
  "@id": "https://api.nuget.org/v3/catalog0/data/2023.12.13.14.18.33/stswexpress.0.4.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "Karol Staszewski",
  "catalog:commitId": "6b58b12b-2022-4ba3-89d2-a2a2bfa52617",
  "catalog:commitTimeStamp": "2023-12-13T14:18:33.0612784Z",
  "created": "2023-12-13T14:15:36.53Z",
  "description": "This is package containing:\n- new controls (many of them are similar to those from WinUI 3) or WPF controls with new style and/or new functionalities:\n- many helpful classes like commands, converters, exporting to Excel, extensions, geometry icons, logging system, mail sending, security etc.\n- possibility to scale GUI and change themes (light/dark)",
  "frameworkReferences": "",
  "iconFile": "logo.png",
  "id": "StswExpress",
  "isPrerelease": false,
  "lastEdited": "2023-12-13T14:18:13.183Z",
  "licenseExpression": "MIT",
  "licenseUrl": "https://licenses.nuget.org/MIT",
  "listed": true,
  "packageHash": "AyCOgyU68TZeJ5U3YiCEu167nogbuT6bgnJ6fXOrEIFpp1i9SMvgbGoNwWNCnaM86YfsbkWOwXXgRVsefSmnwQ==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 1341526,
  "projectUrl": "https://github.com/stsw133/StswExpress",
  "published": "2023-12-13T14:15:36.53Z",
  "readmeFile": "README.md",
  "releaseNotes": "New functionality:\n⦁ There is new category for Stsw controls named \"Charts\" that includes 2 new controls: StswChartLegend and StswChartPie used to present analytics data and statistics.\n⦁ New component controls: StswComponentDrop (almost the same functionality as StswDropButton), StswComponentHeader (almost the same functionality as StswHeader).\n⦁ New control: StswProgressRing (almost the same functionality as StswProgressBar).\n⦁ New control: StswToolTip (just a tooltip with layout scaling and with style that fits other Stsw controls).\n⦁ New extension to clone binding and new extension for getting attribute of T type from enum.\nChanged functionality:\n⦁ StswClippingBorder has been renamed into StswBorder and no longer clips its child by default. StswFilter has been renamed into StswFilterBox. IStswComponent has been renamed into IStswComponentControl. IStswSelection has been renamed into IStswSelectionItem. Added 3 new control interfaces: IStswCornerControl, IStswDropControl and IStswIconControl.\n⦁ All Stsw controls that have StswBorder inside their template implement IStswCornerControl interface that allows them to use two properties: \"CornerClipping\" and \"CornerRadius\". Latter is used to set radius of border's corners, former is used to clip all elements inside border that stick out of border when border has corner radius greater than 0.\n⦁ All Stsw controls that had arrow icon in their templates are now using separated internal control named StswDropArrow. Those controls no longer have \"ArrowVisibility\" property - instead arrow's visibility can be changed through dynamic visibility with key: \"StswDropArrow.Visibility\".\n⦁ All Stsw component controls changes their opacity on IsMouseOver and IsPressed instead of changing foreground brush. Additionally they have new properties for icon: \"IconFill\", \"IconStroke\" and \"IconStrokeThickness\".\n⦁ All Stsw controls that have \"MaxDropDownHeight\" property, have its default value equal to ⅓ of primary screen's height.\n⦁ Changed the way scale worked for icons and images:\nBefore: null fits content, auto fits whole space, star do nothing, value multiply by 12 pixels.\nAfter: null is not possible, auto fits content, star fits whole space, value multiply by 12 pixels.\n⦁ Changed the way some text modes worked for progress controls:\nBefore: value shows current value based on minimum and maximum.\nAfter: value shows exact value from property, progress shows what value was showing before.\n⦁ StswLogPanel derives from ListBox class now (simply to enable virtualization) and its templates have been improved.\n⦁ StswComponentPanel has been reworked and renamed into StswComponentSelector.\n⦁ StswTruncateLabel has been renamed into StswLabel and no longer truncates content by default.\n⦁ StswPager has been renamed into StswGallery and its goal now is presenting images. Also uses StswZoomPanel inside its template and can properly slide images with arrow keys.\n⦁ StswRatingControl instead of \"Orientation\" property with 2 options, has new \"Direction\" property that allows for all 4 direction modes for selecting value. Additionally it implements IStswIconControl interface now so its icon properties have \"Icon\" word prefix now.\n⦁ StswDropButton and StswSplitButton controls are derived from HeaderedItemsControl class now so they can use advanced header properties.\n⦁ StswToggleButton's \"Icon\" property has been removed and some properties have been renamed: \"CheckedGlyphBrush\" into \"GlyphBrushChecked\" and \"UncheckedGlyphBrush\" into \"GlyphBrushUnchecked\".\n⦁ StswColorPicker's and StswColorSelector's templates have been improved a little, no longer have outer border and additionally can have stretched content.\n⦁ StswGroupBox's and StswEpander's templates have been simplified.\n⦁ StswPopup's border thickness, corner radius and padding are now controlled by dynamic resource values.\n⦁ StswShifter has 4 new properties for border thickness, one for each of its buttons.\n⦁ StswAdaptiveBox can now pass \"Components\" and \"IsThreeState\" property values to box that is in use at the moment.\n⦁ StswFilterBox's \"FilterSqlColumn\" property has been renamed into \"FilterValuePath\".\n⦁ All Stsw controls no longer use \"RecognizesAccessKey\" property in their templates and no longer use \"ComponentAlignment\" and \"PopupThickness\" properties at all.\n⦁ Some changes in usage of theme brushes in Stsw controls - for example StswDropButton uses \"StswButton.Pressed.Background\" as its background brush when drop-down is open instead of \"StswDropButton.Checked.Background\".\n⦁ StswLog's import is improved.\n⦁ StswDatabase renamed to StswDatabases. Some methods are renamed and the way of importing and exporting \"Port\" is improved.\n⦁ Automatic language can be removed from confgiuration dialog now.\nBugfixes:\n⦁ StswToggleSwitch no longer have different size when is checked at start.\n⦁ StswListBox, StswListView and StswTreeView will properly determine if they are using ItemsSource of IStswSelectionItem type.\n⦁ StswSelectionBox's list box do not content scroll by default to elimiate bug with last empty item.\n⦁ StswColorBox, StswDatePicker and StswNumericBox no longer update their main property twice in certain situations.\n⦁ StswProgressBar's background and border can be changed in custom state mode.\n⦁ StswTabControl properly shows border when last tab is selected.\n⦁ StswImage's, StswFilterBox's and StswWindow's context menus are scaling with interface size from configuration dialog now.\n⦁ Bugfix for double date selections in StswCalendar when starting date had specified time.\n⦁ Bugfix for StswBindingList if list has been reseted.\n⦁ Bugfix for StswDataGrid's special column dynamic brushes for Dark and Pink themes.\n⦁ Stsw button controls no longer have additional grid in their template to fix clipping border since there exists \"CornerClipping\" property now.\n⦁ StswContentDialog will no longer throw exception if someone will try to close it multiple times in a moment.",
  "repository": "",
  "verbatimVersion": "0.4.0",
  "version": "0.4.0",
  "dependencyGroups": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2023.12.13.14.18.33/stswexpress.0.4.0.json#dependencygroup/net6.0-windows7.0",
      "@type": "PackageDependencyGroup",
      "dependencies": [
        {
          "@id": "https://api.nuget.org/v3/catalog0/data/2023.12.13.14.18.33/stswexpress.0.4.0.json#dependencygroup/net6.0-windows7.0/closedxml",
          "@type": "PackageDependency",
          "id": "ClosedXML",
          "range": "[0.102.1, )"
        },
        {
          "@id": "https://api.nuget.org/v3/catalog0/data/2023.12.13.14.18.33/stswexpress.0.4.0.json#dependencygroup/net6.0-windows7.0/newtonsoft.json",
          "@type": "PackageDependency",
          "id": "Newtonsoft.Json",
          "range": "[13.0.3, )"
        }
      ],
      "targetFramework": "net6.0-windows7.0"
    }
  ],
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2023.12.13.14.18.33/stswexpress.0.4.0.json#StswExpress.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 3057,
      "fullName": "StswExpress.nuspec",
      "length": 7636,
      "name": "StswExpress.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2023.12.13.14.18.33/stswexpress.0.4.0.json#lib/net6.0-windows7.0/StswExpress.dll",
      "@type": "PackageEntry",
      "compressedLength": 1322707,
      "fullName": "lib/net6.0-windows7.0/StswExpress.dll",
      "length": 6648832,
      "name": "StswExpress.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2023.12.13.14.18.33/stswexpress.0.4.0.json#README.md",
      "@type": "PackageEntry",
      "compressedLength": 1001,
      "fullName": "README.md",
      "length": 2292,
      "name": "README.md"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2023.12.13.14.18.33/stswexpress.0.4.0.json#logo.png",
      "@type": "PackageEntry",
      "compressedLength": 1104,
      "fullName": "logo.png",
      "length": 1195,
      "name": "logo.png"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2023.12.13.14.18.33/stswexpress.0.4.0.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 11513,
      "fullName": ".signature.p7s",
      "length": 11513,
      "name": ".signature.p7s"
    }
  ],
  "tags": [
    "Collection",
    "of",
    "controls",
    "helpers"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}