{
  "@id": "https://api.nuget.org/v3/catalog0/data/2015.02.01.18.52.25/aspose.words.11.2.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "Aspose",
  "catalog:commitId": "73c09f68-6389-4c41-928e-2519d8c98b74",
  "catalog:commitTimeStamp": "2015-02-01T18:52:25.5448703Z",
  "copyright": "© Aspose 2002-2011. All Rights Reserved.",
  "created": "2012-04-10T03:37:58.19Z",
  "description": "Aspose.Words for .NET class library supports DOC, DOCX, RTF, HTML, OpenDocument, PDF, XPS, EPUB and other formats. With Aspose.Words you can generate, modify, convert, render and print documents without utilizing Microsoft Word®",
  "iconUrl": "http://sialkot.aspose.com/wiki/download/attachments/1179725/imgLogoWords128x128.png",
  "id": "Aspose.Words",
  "isPrerelease": false,
  "lastEdited": "0001-01-01T00:00:00Z",
  "licenseUrl": "http://www.aspose.com/corporate/purchase/end-user-license-agreement.aspx",
  "packageHash": "OzNV+e3CDRZvXPfeGjrHgumQJAl08vSLf7e6AEGFdci3+7+mYGh4fMwTBKm+466r2uKiAy3eO5iFNj5p8fm5Jg==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 12136510,
  "projectUrl": "http://www.aspose.com/categories/.net-components/aspose.words-for-.net/default.aspx",
  "published": "2012-04-10T03:37:58.19Z",
  "releaseNotes": "There are 150 improvements and fixes in this regular monthly release. Most notable changes are:\n\n• Math equations can be imported/exported to RTF\n• Move revisions are supported\n• New “mustache” templating engine syntax is supported\n• Performance improvements for large documents\n• Detailed documentation about what features are supported in each document format\n• Linked textboxes are supported in layout and rendering\n• Subsetting of OpenType fonts with PostScript outlines in rendering\n\nThis release introduces the features, enhancements and bug fixes as detailed below:\n\n• New features\n\nWORDSNET-1698\tMake image type to string conversion method public\nWORDSNET-2056\tVerify and test that special symbols related to dates, times and numbers work\nWORDSNET-2081\tConsider exposing Font property of Shape.\nWORDSNET-2855\tSupport DOCX document encryption\nWORDSNET-3546\tRight aligned tabs are not rendered properly.\nWORDSNET-3742\tCreate a list of HTML features supported/unsupported upon importing HTML.\nWORDSNET-3809\tVertical alignment of text inside text box is ignored upon rendering.\nWORDSNET-3865\tSupport subsetting OpenType fonts with PostScript outlines\nWORDSNET-4049\tLinks to sub-document are lost after open/save document.\nWORDSNET-409\tImprove mail merge and bookmark performance.\nWORDSNET-4144\tAllow accessing Hyperlink property of DrawingML objects.\nWORDSNET-4163\tPreserve Equations formulas during open/save RTF.\nWORDSNET-4354\t/linked textboxes/ Textbox with text is missing during rendering.\nWORDSNET-446\tExport conforming paragraph borders to HTML\nWORDSNET-4824\tExpose Name and Descriptions and other properties of DrawingML\nWORDSNET-5233\tImplement Unified methods for Load and Save warnings across all Conversions formats\nWORDSNET-5586\tCreate a list of unsupported tags when exporting to RTF\nWORDSNET-5590\tWORDSNET-5557 Create a list of features supported during import for all supported formats\nWORDSNET-5591\tWORDSNET-5557 Create a list of features supported during export for all supported formats\nWORDSNET-560\tImprove DeleteFields functionality.\nWORDSNET-5649\t/linked textboxes/ Support rendering of linked textboxes.\nWORDSNET-5657\tPublic fields API - Complete implementing settable field code.\nWORDSNET-5821\tDOCX to DOC conversion issue : Some contents are missing\nWORDSNET-5957\tSupport NumberStyle.Hebrew1 - docx to html conversion problem\nWORDSNET-5999\tAdd new templating engine behavior to mail merge\nWORDSNET-6005\tCreate voice over script for the merging data into a document video\nWORDSNET-6018\tAdd TempFolder save option for DOCX format\nWORDSNET-68\tCreate tables from DataTable easily\nWORDSNET-701\tAdd an option to specify paragraph styles that go into the outline.\nWORDSNET-761\tSubdocuments not supported.\nWORDSNET-947\tProvide \"user friendly\" export/import feature descriptions\n\n• Enhancements\n\nWORDSNET-1097\tCompulsory downloading of referenced images when document is opened can cause unwelcome delays.\nWORDSNET-1228\tTracking changes are not visible when converting RTF to DOC\nWORDSNET-1498\tUpdate detailed supported features spreadsheet\nWORDSNET-2401\tExport cross references to HTML and Aspose.Pdf XML\nWORDSNET-2745\tStrike through option of paragraph break does not work.\nWORDSNET-2845\tBookmarks are missed from the document after open/save.\nWORDSNET-2883\t/cell borders:15/ Text appears too close to table border upon rendering.\nWORDSNET-3023\tShape disappears during open/save.\nWORDSNET-3124\tNested table looks not very good in OpenOffice.\nWORDSNET-3168\t/cell borders heading:5/ Bottom border of heading row is not rendered.\nWORDSNET-3457\tImprove field result output using new traversal facility\nWORDSNET-3729\tA table inside the textbox is rendered incorrectly.\nWORDSNET-3858\tSupport rendering of compound lines in PDF\nWORDSNET-3957\tINCLUDETEXT field is updated by AW differently than using MS Word.\nWORDSNET-4468\tSome bookmarks are missed upon loading the document.\nWORDSNET-4485\tBookmarks are lost after open/save document.\nWORDSNET-4565\tCheck how ePUB produced by Aspose.Words works on \"Sony PRS-650\"\nWORDSNET-4599\tWrong numbering style when convert to pdf or xps\nWORDSNET-4628\tDocument looks different when converted to pdf or xps.\nWORDSNET-5076\t/:5/ Table inside a frame is not handled properly.\nWORDSNET-5121\tStrip page numbers from the TOC\nWORDSNET-5227\t/cell borders heading:5/ Bottom border of the header row appears incorrect during rendering.\nWORDSNET-5280\tEnd-notes are lost after rendering.\nWORDSNET-5557\tCreate a list of supported and unsupported features for all formats supported by AW\nWORDSNET-5668\tWMF images are displayed incorrectly during rendering.\nWORDSNET-5715\tLayout gets disturbed upon converting DOCX with FormFields to PDF\nWORDSNET-5722\tParagraphs inside SDTs get separated by extra space in PDF\nWORDSNET-5773\tChange default values AddSpaceBetweenFarEastAndAlpha/AddSpaceBetweenFarEastAndDigit to true in Model\nWORDSNET-5839\tThick cell border overlaps the text below\nWORDSNET-5863\tTestSvg.TestEmbeddedFonts and TestSvg.TestPlacedGlyphs sometimes are red.\nWORDSNET-5885\tCreate voice over script for one of the AW tutorial videos\nWORDSNET-5894\tIncorrect style applied while saving document object as Pdf.\nWORDSNET-5937\tWhile converting doc to rtf, paragarph left indent value is incorrect.\nWORDSNET-5946\tCreate more voice over scripts for videos\nWORDSNET-5965\tAdd \"generated by\" comments into SVG documents.\nWORDSNET-5985\tWORDSNET-4628 Wrong font is selected for list numbers.\nWORDSNET-5996\tTrack Changes (Revisions) are lost on open/save\nWORDSNET-6011\tAspose.Words hangs during loading the DOC\nWORDSNET-6029\tRefactor converting integers to various text formats\nWORDSNET-604\tAdd a property controlling comments visibility in the document.\nWORDSNET-6056\tBullet symbols are lost upon exporting to HTML\nWORDSNET-6071\tIntroduce an enumeration to distinguish the different types of font source types\nWORDSNET-6093\tUpdate the EULA shipped with the installer\nWORDSNET-6095\tWORDSNET-5557 Add further reference links and information to features\nWORDSNET-6096\tWORDSNET-5557 Check through list of supported features during conversion from Word to ODT format\nWORDSNET-6097\tWORDSNET-5557 Add common user requested features and features found on JIRA to the features list\nWORDSNET-6099\tWORDSNET-5557 Upload supported features list to the online documentation\nWORDSNET-781\tExport page background to HTML\nWORDSNET-857\tPreserve spelling and grammar state during Open Save Open\n\n• Exceptions\n\nWORDSNET-2882\t\"System.StackOverflowException\" occurs during converting huge document (~3000 pages) to PDF\nWORDSNET-3365\tAspose.Words does not work in WPF application under framework 4.0.\nWORDSNET-4676\tMake sure that resources are thread-safe.\nWORDSNET-4792\tArgumentNullException occurs during converting to HTML\nWORDSNET-5024\tInvalidOperationException is thrown upon open/save DOCX document.\nWORDSNET-5365\tInvalidOperationException occurs during rendering.\nWORDSNET-5472\tNullReferenceException is thrown upon rendering.\nWORDSNET-5617\tUnsupportedFileFormatException is thrown upon opening HTML document.\nWORDSNET-5760\tAspose.Words.UnsupportedFileFormatException occurs upon loading HTM\nWORDSNET-5815\tObjectDisposedException upon loading MHTML document\nWORDSNET-5848\tInvalidCastException occurs during MailMerge\nWORDSNET-5878\tArgumentException: upon converting DOC to images\nWORDSNET-5914\t0th, 1st, 2nd list numbering format throws exception when converting to RTF\nWORDSNET-5917\tAspose.Words.FileCorruptedException occurs upon loading RTF\nWORDSNET-5918\tNullReferenceException when UpdatePageLayout is called after loading DOC\nWORDSNET-5942\tAspose.Words.FileCorruptedException occurs on loading RTF\nWORDSNET-5945\t\"NullReferenceException\" exception occurs during getting page count.\nWORDSNET-5947\tAspose.Words.FileCorruptedException occur while loading docx file.\nWORDSNET-5948\tAspose.Words.FileCorruptedException upon loading DOCX\n\n• Bugs\n\nWORDSNET-1428\tText is invisible in the HTML table inserted into the header in MS Word 2000\nWORDSNET-1519\tRTF importer creates two Body or two HeaderFooter of the same type for some documents\nWORDSNET-2166\t/clip:1/ Textbox clipping region needs to be inflated when it contains tables\nWORDSNET-2291\tOpenOffice 3.0 hangs on reading DOCX files created by AW\nWORDSNET-2608\tRow heights are different from the original document.\nWORDSNET-2619\tProblems during WML to DOCX conversion table layout in Aspose.Editor\nWORDSNET-2657\tTolls menu is inaccessible in MS Word 2003, when open document produced by AW.\nWORDSNET-2669\tDocument generated by Apsose.Words crashes MS Word 2002.\nWORDSNET-3120\tText inside shape disappears after open/save.\nWORDSNET-3293\tError message is shown when open document produced by Aspose.Words in MS Word 2003.\nWORDSNET-3539\tNo new lines for BR tag\nWORDSNET-3875\tColor of AutoShape is changed after open/save\nWORDSNET-3921\tContent without font inserted using InsertHTML method does not match the formatting of the surronding text anymore\nWORDSNET-4114\tWidowControl option does not work for paragraph style if save to RTF.\nWORDSNET-4237\tShape position is changed in output\nWORDSNET-4445\tSymbols of font \"Wingdings 2\" rendering incorrect to DOC format.\nWORDSNET-4576\tImage order is incorrect after open/save.\nWORDSNET-4577\tTable border overlaps image during rendering.\nWORDSNET-4591\tShape is distorted after updating fields.\nWORDSNET-468\tRange.Replace is slow\nWORDSNET-4787\tNumeration of list are not restarting while rendering.\nWORDSNET-4911\tTOC looks incorrect after UpdateFields.\nWORDSNET-4956\tPosition of shapes is incorrect during rendering.\nWORDSNET-4981\tTable looks incorrect after rendering ODT document.\nWORDSNET-5267\tHeight of textbox is bigger than needed after rendering.\nWORDSNET-5315\tTabs are ignored upon rendering.\nWORDSNET-5384\tOn DOCX to PDF conversion, a small picture that is placed inside primary footer of Word Document along with TextBox, gets rotated by 90 degrees anti clockwise.\nWORDSNET-5413\tWrong default value is taken for list input\nWORDSNET-5446\tIncorrect content rendering inside the text box.\nWORDSNET-5468\tPage background fill effects are lost after open/save\nWORDSNET-5487\tNonBreakingSpace appears underlined during rendering.\nWORDSNET-5527\tLong xmlns attrs break format and encoding determining of Html\nWORDSNET-5532\tAspose.Words reading RTF document Font settings incorrectly\nWORDSNET-5593\tUnwanted Left indent is added upon loading RTF\nWORDSNET-5806\tProblem with docx to Mhtml conversion\nWORDSNET-5833\tIncorrect rendering of numbers and bullets, while converting Rtf file to Word document\nWORDSNET-5837\tOutput Word 2003 xml document is corrupted by Aspose.Words\nWORDSNET-5872\tDocument.Print ignores User-defined paper source for printing\nWORDSNET-5908\tSpace is added in table cell when converting ODT to another format.\nWORDSNET-5920\tRTF to DOC conversion yields a garbage character in character style\nWORDSNET-5955\tIncorrect conversion of int to table column name\nWORDSNET-5961\tTable at the bottom is getting overlapped over the content in the previous page in Fixed Page formats\nWORDSNET-5980\tWhile converting WordML to Pdf, watermark missing.\nWORDSNET-5989\tEncrypted hyper-links are not open-able in browser when MS document is converted to PDF format.\nWORDSNET-6006\tShape in header is misplaced when rendering to Fixed Page formats\nWORDSNET-6015\tLogo Image becomes Black when rendering to TIFF with Ccitt4,Ccitt3 TiffCompression\nWORDSNET-6019\tMissing cell merge information after text update.\nWORDSNET-6043\tTable merged cells are not appearing correctly\nWORDSNET-6077\tFrame border is lost during rendering to Fixed Page formats\nWORDSNET-6085\tBar object in OfficeMath is read incorrectly.\nWORDSNET-687\tLine spacing with Arial Unicode MS font differs from MS Word.",
  "requireLicenseAcceptance": true,
  "title": "Aspose.Words for .Net",
  "version": "11.2.0",
  "tags": [
    "Aspose.Words",
    "DOC",
    "DOCX",
    "RTF",
    "HTML",
    "OpenDocument",
    "XPS",
    "EPUB",
    "Word",
    "Document",
    "Processing"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    }
  }
}