{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.16.20.32/_dream-league-soccer-working-2022-version-koz.6.6.52.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "SharpCrafters s.r.o.",
  "catalog:commitId": "26813a23-2915-40d3-80a2-f34ad96b5e2c",
  "catalog:commitTimeStamp": "2022-01-26T16:20:32.4795784Z",
  "created": "2022-01-26T16:18:13.643Z",
  "description": "# _Dream League Soccer Working 2022 Version koz\n\n\nCLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; [http://10.bltadwin.ru/hack.php](http://10.bltadwin.ru/hack.php)\n\n\nTải Hack Dream League Soccer Mod Apk - trò chơi dành cho những người chơi có niềm đam mê mãnh liệt với bóng đá. Download DLS apk. DREAM LEAGUE SOCCER Can you build the ultimate squad. Millions of players attempt it everyday. Play for free today! Download hack Dream League Soccer (DLS22) MOD Menu with many support features to help players can participate in many major football leagues and topped.\n\n## [CLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; http://10.bltadwin.ru/hack.php](http://10.bltadwin.ru/hack.php)\n\n · Dream League Soccer Download is an online football sports gaming application structured by First Touch Games Ltd. Last year it was released in November Now the latest gaming app is released in December Since the beginning of gaming series, number of modifications are made inside.  · 8/10 ( votes) - Download Dream League Soccer Android Free. Dream League Soccer has just arrived, the new version of the football manager by First Touch that aspires to beat giants of the likes of PES and FIFA. Just like every single summer over the last few years, we can start to 8/10().  · This Dream League Soccer is a game that, despite its name, has got nothing to do with First Touch's title: it's basically a soccer game about taking part in penalty shootouts. Nowhere near a realistic simulator with great graphics that intends to be a serious alternative to Konami's Pro Evolution or EA's FIFA. Soccer game about taking 8/10().\n\ndream league soccer 2022, dream league soccer 2021, dream league soccer 2019, dream league soccer 2016, dream league soccer 2020 download, dream league soccer 2018, dream league soccer 2022 release date, dream league soccer 2014, dream league soccer apkpure, dream league soccer app store, dream league soccer apk download 2018, dream league soccer all star cup, dream league soccer all players, dream league soccer argentina kit 2021, dream league soccer america kit, dream league soccer apk 2014, a dream league soccer 2020, a dream league soccer logo, is dream league soccer 2020 released, which dream league soccer is the best, is dream league soccer online, is dream league soccer 2021 out, is dream league 2020 out, dream league soccer best players, dream league soccer browser, dream league soccer best formation, dream league soccer barcelona kit 2022, dream league soccer barcelona kit 2021, dream league soccer barcelona logo, dream league soccer bayern munich kit 2021, dream league soccer best team, error 020b dream league soccer, error 020 b dream league soccer 2021, serie b kit dream league soccer, dream league soccer kits b nacional, logo dream league soccer b, codigo de error 020 b dream league soccer 2021, dream league soccer kits b nacional 2019, dream league soccer classic, dream league soccer chromebook, dream league soccer classic ios, dream league soccer classic play store, dream league soccer cheats, dream league soccer controller support, dream league soccer coins, dream league soccer commentator, dream league soccer c, f c barcelona dream league soccer kit, kit sheffield united f.c. dream league soccer 2020, barcelona s c logo dream league soccer 2019, uniforme alianza f.c dream league soccer 2021, kit dream league soccer serie c, uniforme alianza f.c dream league soccer 2020, dream league soccer divisions, dream league soccer download in chrome, dream league soccer dls, dream league soccer discord, dream league soccer divisions 2021, dream league soccer dls logo, dream league soccer download apkpure, dream league soccer download app store, dream league soccer error code 020b, dream league soccer error code 911, dream league soccer evolution, dream league soccer error, dream league soccer email, dream league soccer elite division, dream league soccer error 11, dream league soccer evolution 2020, logo e uniforme dream league soccer 201",
  "id": "_Dream-League-Soccer-Working-2022-Version-koz",
  "isPrerelease": false,
  "language": "en-US",
  "lastEdited": "2022-01-26T16:20:13.027Z",
  "listed": true,
  "packageHash": "TSXLvG8LsDGH6b+3mwCipIL5pGP9Gu79tlR5MQwmU0lNfd9zLUlYKyUZMTmg7zA8Ec3rawKcYJEN0BJEqY39sg==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 11672,
  "published": "2022-01-26T16:18:13.643Z",
  "requireLicenseAcceptance": false,
  "title": "_Dream-League-Soccer-Working-2022-Version-koz",
  "verbatimVersion": "6.6.52",
  "version": "6.6.52",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.16.20.32/_dream-league-soccer-working-2022-version-koz.6.6.52.json#nxlaqegwbg.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1546,
      "fullName": "nxlaqegwbg.nuspec",
      "length": 4498,
      "name": "nxlaqegwbg.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.16.20.32/_dream-league-soccer-working-2022-version-koz.6.6.52.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9466,
      "fullName": ".signature.p7s",
      "length": 9466,
      "name": ".signature.p7s"
    }
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}