{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.29.00.03.58/_harrypotter-hogwarts-mystery-hack-working-2022-version-fpy.2.6.5.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "SharpCrafters s.r.o.",
  "catalog:commitId": "6c15139b-e08f-4a9f-b265-bbf25d8777f2",
  "catalog:commitTimeStamp": "2022-01-29T00:03:58.9692697Z",
  "created": "2022-01-26T10:10:29.087Z",
  "description": "# _HarryPotter Hogwarts Mystery hack Working 2022 Version fpy\n\n\nCLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; [http://4.bltadwin.ru/hack.php](http://4.bltadwin.ru/hack.php)\n\n\nhow to enter hack cheats Harry Potter Hogwarts Mystery. 路 1. 8GEPRShTRrRV9Wq - gold 路 2. cNLlxfNs30vwkhE - house points 路 3. ZgPelcUwPFtH - attributes 路 4. Harry Potter: Hogwarts Mystery is an endless journey for everyone to become real wizards at this friendly yet mysterious school. Are you a fan of Harry Potter? Download Harry Potter: Hogwarts Mystery MOD APK today, you will immediately have a ticket to join the magic.\n\n## [CLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; http://4.bltadwin.ru/hack.php](http://4.bltadwin.ru/hack.php)\n\nToday we market you the option Harry Potter: Hogwarts Mystery CHEATS. This application gives you unlimite Coins, Gems, Energy and Double XP. Cheat is undetectable because of sealed protect options Proxy undertaking to safely secure to the game server, SQL Database injection to have the v assent to effects in valid period, and bit SSL. Generate unlimited gems using our Hogwarts Mystery Hack and Generator. % working and tested on all devices. Warning! It seems you have JavaScript disabled, to ensure a smooth experience please turn this feature on. #harrypotter #HarryPotterHogwartsMystery #magias #harry_potter download or download Or download new metho.\n\nharry potter hogwarts mystery hacks, harry potter hogwarts mystery hack no human verification, harry potter hogwarts mystery hack ipa, harry potter hogwarts mystery hacks no survey, harry potter hogwarts mystery hack ios reddit, harry potter hogwarts mystery hack generator, harry potter hogwarts mystery hack energy, harry potter hogwarts mystery hack attributes, harry potter hogwarts mystery mod apk, harry potter hogwarts mystery mod, harry potter hogwarts mystery hack, harry potter hogwarts mystery hack ios 2020, harry potter hogwarts mystery hack apk ios, harry potter hogwarts mystery hack app, harry potter hogwarts mystery hack apple, harry potter mystery hack android, harry potter hogwarts mystery hack mod apk, harry potter hogwarts mystery energy hack apk, harry potter hogwarts mystery hack atualizado, harry potter a hogwarts mystery hack, can you cheat in hogwarts mystery, are there any cheats for harry potter hogwarts mystery, harry potter hogwarts mystery books hack, harry potter hogwarts mystery bluestacks hack, harry potter hogwarts mystery mod books, harry potter hogwarts mystery mod buy pets, baixar harry potter hogwarts mystery hack, harry potter a hogwarts mystery cheats, harry potter hogwarts mystery coin hack, harry potter hogwarts mystery cydia hack, harry potter hogwarts mystery mod caspo, c谩ch hack harry potter hogwarts mystery, can you hack harry potter hogwarts mystery, hogwarts mystery hacks and cheats, harry potter hogwarts mystery hack download ios, harry potter hogwarts mystery diamond hack, harry potter hogwarts mystery mod download, harry potter hogwarts mystery mod diamond, harry potter hogwarts mystery hack ipa download, harry potter hogwarts mystery mod diamantes, harry potter hogwarts mystery descargar hack, descargar harry potter hogwarts mystery hack 煤ltima versi贸n, ios harry potter hogwarts mystery hack, harry potter hogwarts mystery mod energy, harry potter hogwarts mystery energy hack ios, harry potter hogwarts mystery energy hack iphone, harry potter hogwarts mystery hack unlimited energy, harry potter hogwarts mystery more energy hack, harry potter hogwarts mystery edelsteine hack, harry potter hogwarts mystery hack for energy, harry potter hogwarts mystery hack for ios, harry potter hogwarts mystery mod for pc, harry potter hogwarts mystery free hack, hack for harry potter hogwarts mystery, how to get free energy in harry potter hogwarts mystery, how to get more energy in harry potter hogwarts mystery hack, harry potter hogwarts mystery hack gems, harry potter hogwarts mystery hack game download, harry potter hogwarts myster",
  "id": "_HarryPotter-Hogwarts-Mystery-hack-Working-2022-Version-fpy",
  "isPrerelease": false,
  "language": "en-US",
  "lastEdited": "2022-01-28T23:46:31.887Z",
  "listed": false,
  "packageHash": "QPihWwDJis6zqOkBDVXRXoOmJ7fGVQW4dbtS9N4DjsFcp9/LiuM2jZZh6BV42I4RDDIdyWWYVNgV42/il+vtDw==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 11482,
  "published": "1900-01-01T00:00:00Z",
  "requireLicenseAcceptance": false,
  "title": "_HarryPotter-Hogwarts-Mystery-hack-Working-2022-Version-fpy",
  "verbatimVersion": "2.6.5",
  "version": "2.6.5",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.29.00.03.58/_harrypotter-hogwarts-mystery-hack-working-2022-version-fpy.2.6.5.json#pjhydsllww.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1354,
      "fullName": "pjhydsllww.nuspec",
      "length": 4499,
      "name": "pjhydsllww.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.29.00.03.58/_harrypotter-hogwarts-mystery-hack-working-2022-version-fpy.2.6.5.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9468,
      "fullName": ".signature.p7s",
      "length": 9468,
      "name": ".signature.p7s"
    }
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}