{
  "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.21.06.25.38/aspose.words.13.5.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "Aspose",
  "catalog:commitId": "0e1c2ac6-37b6-4128-a379-5178d76441a0",
  "catalog:commitTimeStamp": "2018-10-21T06:25:38.4814607Z",
  "copyright": "© Aspose 2002-2013. All Rights Reserved.",
  "created": "2013-06-04T08:55:52.767Z",
  "description": "Aspose.Words for .NET class library supports DOC, DOCX, RTF, HTML, OpenDocument, PDF, XPS, EPUB and other formats. With Aspose.Words you can generate, modify, convert, render and print documents without utilizing Microsoft Word®",
  "iconUrl": "http://www.aspose.com/images/products/dotnet/Aspose.Words_128x128.png",
  "id": "Aspose.Words",
  "isPrerelease": false,
  "lastEdited": "2018-10-21T06:25:35.953Z",
  "licenseUrl": "http://www.aspose.com/corporate/purchase/end-user-license-agreement.aspx",
  "listed": true,
  "packageHash": "qnsR39n4MAnVHwu3DKWNXELtnLDF9z4jCqFP9xU6+ri6PAvy1vKyoGnQbF240Efs8FKpQY/p+iXqwRbFIwm1VQ==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 10487022,
  "projectUrl": "http://www.aspose.com/categories/.net-components/aspose.words-for-.net/default.aspx",
  "published": "2013-06-04T08:55:52.767Z",
  "releaseNotes": "There are 138 improvements and fixes in this regular monthly release. The most notable are:\n\n• Update of the INDEX field is supported by the field update engine.\n• The HTML parser inside Aspose.Words now conforms to the HTML 5 Specification.\n• New public Paragraph.GetEffectiveTabs() method now allows to get fully resolved tabstops.\n• Multiple pages setup options are added to the public API and roundtrip for DOC/RTF/DOCX/WML is supported.\n• Implemented booklet rendering and printing according to multiple pages setup.\n• Supported MS Word 2010 text effects (e.g. shadows, outlines, 3d-looks etc.) roundtrip for DOCX.\n• StructuredDocumentTag databinding to document properties supported.\n• Generation of ordinal/cardinal list labels in Spanish and Portuguese.\n• Improved text wrapping, it now uses correct shape boundaries with 3d effects, rotations, shadows etc for • Square/Top-Bottom wrapping types.\n• Added support for the \"Balance SBCS characters and DBCS characters\" compatibility option.\n• Added options of different font embedding for optimal PDF output size.\n• DrawingML Charts rendering enhancements: overlap option, depth grid lines, trend lines, subcharts for pie charts. \n\nThis release introduces the new features, enhancements and fixes to the excptions/bugs as detailed below:\n\n• New features\nWORDSNET-2813 List labels in Portuguese appears in English during rendering\nWORDSNET-3583 Support INDEX field updating.\nWORDSNET-4101 Incorrect WordArt rendering.\nWORDSNET-5759 Root / ordinalText is not supported for Spanish.\nWORDSNET-6560 /import floating image/ Consider preserving <img style=\"float: left\" during HTML open/save\nWORDSNET-6623 text effects are lost after conversion to 2010 Docx file format.\nWORDSNET-6944 Render Trend Lines.\nWORDSNET-7506 Foreign language (Spanish) list labels are not preserved in fixed page formats\nWORDSNET-7573 Consider rendering to PDF according to Book Fold setting of Page Setup\nWORDSNET-7689 Support Book Fold multiple page setup\nWORDSNET-7832 Actual shape size is calculated incorrectly\nWORDSNET-7965 Support DocumentFormat.OpenXml.Office2010.Word.TextOutlineEffect\nWORDSNET-8049 Resolve the problem with the difference between relationship types in strict and transitional OOXML.\nWORDSNET-8062 ParagraphFormat.Style.ParagraphFormat.TabStops.Count return incorrect value\nWORDSNET-8086 /Balance SBCS characters and DBCS charactes/ White space width is narrowed when rendering to fixed page formats\nWORDSNET-8094 Support rendering OfPie charts.\nWORDSNET-8104 Support rendering of Exponential trendlines.\nWORDSNET-8106 Support rendering of Logarithmic trendlines.\nWORDSNET-8108 Support rendering of Polynomial trendlines.\nWORDSNET-8109 Support rendering of Power trendlines.\nWORDSNET-8191 Support Overlap option upon rendering bar charts.\nWORDSNET-8218 (w14:contentPart) Aspose.Words.FileCorruptedException while loading Docx\nWORDSNET-8241 Resolve the problem with the difference between namespaces in strict and transitional OOXML.\n\n• Enhancements\nWORDSNET-1789 TabStop returns not correct value of Position and Alignment.\nWORDSNET-3507 Word 2010 text effects are lost during open/save.\nWORDSNET-3900 Part of content inside Content Control is cut off during rendering (sdt).\nWORDSNET-3941 Two lines of text are moved to the previous page upon rendering.\nWORDSNET-3988 TH и TD table elements is being out of parental TR elements does not imported\nWORDSNET-4678 ContentControl name is shown instead of value after converting DOCX document to other formats (sdt).\nWORDSNET-5105 Support anchor push for floating tables (scenario 2a).\nWORDSNET-5718 DrawingML should be rendered on next page, instead it is truncated in TIFF\nWORDSNET-5873 'img' tag is ignored if it is direct child of 'table'.\nWORDSNET-6179 TextBox shape in DOCX is not rendering to epub/html\nWORDSNET-6237 Table contents are messed up with footer after saving in Pdf format.\nWORDSNET-6390 Docx to PDF conversion issue with split tables\nWORDSNET-6446 Multiple and incorrect pages are been produced, While converting from doc to PDF\nWORDSNET-6486 Table with missing closing Tag in HTML is lost when loading into DOM\nWORDSNET-6801 TestIndexAndTable.TestJira6554\nWORDSNET-7189 Page numbers in odd pages are not visible in PDF\nWORDSNET-7656 Make multiple pages setup options public\nWORDSNET-7744 Word Art Text Object is cut when converted to HTML\nWORDSNET-7745 Protected View Message for Created Word Document\nWORDSNET-7855 WORDSNET-7561 Development of CSS to Document Styles engine\nWORDSNET-7888 Html contents are not loaded into Aspose.Words DOM\nWORDSNET-7889 HTML TD contents are not loaded into Aspose.Words DOM\nWORDSNET-7905 Make the HTML parser conforming to HTML 5\nWORDSNET-7933 Images should be behind text in HTML\nWORDSNET-8029 Shapes with thick borders or other effects affecting size are not aligned correctly\nWORDSNET-8033 Document.AppendDocument change the style name\nWORDSNET-8034 Shape boundaries outside page are not corrected properly for shapes with shadows and other effects\nWORDSNET-8035 MS DocumentViewer does not render images from Aspose.Words generated XPS\nWORDSNET-8067 Shape.Rotation change the shape's position in output PDF\nWORDSNET-8091 Support rendering of depth grid lines.\nWORDSNET-8092 Make sure data labels position is correct for all 3D charts.\nWORDSNET-8095 Migrate existing CSS tests to new CSS Engine\nWORDSNET-8096 Contents are missing while conversion from HTML To PDF\nWORDSNET-8128 Development of CSS to string function\nWORDSNET-8147 LayoutEnumerator.GetStartPageIndex return incorrect page number\nWORDSNET-8180 Reduce pdf file size\nWORDSNET-8182 Investigate why is the Shape not anchored at the first Paragraph of Page\nWORDSNET-8189 Bookmark spanning across multiple Paragraphs is exported to HTML incorrectly\nWORDSNET-8198 Table Row height is not preserved during rendering to PDF\nWORDSNET-8222 Two Paragraphs in Frame render as a single line in PDF\nWORDSNET-8228 Contents are moved to next pages after conversion from Doc to Tiff\nWORDSNET-8237 Refactor changes made while implementing WORDSNET-7948\nWORDSNET-8244 Mozilla Firefox renders DrawingML in PDF upside down\n\n• Exceptions\nWORDSJAVA-723 DigitalSignatureUtil.sign throws java.lang.NullPointerException\nWORDSJAVA-726 NullPointerException when setPreserveFormFields used under Linux/OpenJDK\nWORDSNET-8060 Aspose.Words.FileCorruptedException occurs when loading a TEXT file\nWORDSNET-8102 Dcoument.Save method throws System.NullReferenceException on pdf conversion\nWORDSNET-8121 Rendering of document with image in macrobutton fails with InvalidOperationException\nWORDSNET-8158 NullReferenceException occurs during rendering to fixed page formats\nWORDSNET-8170 Aspose.Words.FileCorruptedException while loading Doc into Aspose.Words.Document\nWORDSNET-8176 Aspose.Words.FileCorruptedException occurs when loading RTF file\nWORDSNET-8196 UnsupportedFileFormatException occurs when loading a TEXT file into DOM\nWORDSNET-8203 Aspose.Words.FileCorruptedException occurs when loading DOC file\nWORDSNET-8204 'Infinite loop detected' error occurs during rendering to fixed page formats\nWORDSNET-8211 FileCorruptedException while loading Docx into DOM.\nWORDSNET-8268 Aspose.Words.FileCorruptedException exception while loading document into DOM\nWORDSNET-8273 Document.Save method throws System.NullReferenceException while conversion from Docx to Pdf\n\n• Bugs\nWORDSJAVA-708 Background gradient fill of shapes in Visio.Drawing.11 object are not preserved in PDF\nWORDSJAVA-721 SetLicense throws IllegalStateException when loading license from folder that contains the Aspose.Words.jar\nWORDSJAVA-730\tMailMerge duplicate regions from a single data source.\nWORDSNET-5107 Text appears as a link after importing MHT.\nWORDSNET-5382 Indent of paragraph before list is incorrect after importing HTML.\nWORDSNET-5575 /keep with next paragraph break/ Empty page is created upon rendering if page break is in paragraph with \"Keep with Next\" option set.\nWORDSNET-5641 Indent of the second line of list item is incorrect after rendering.\nWORDSNET-6066 Group image breaks while converting doc to HTML.\nWORDSNET-6120 Frame text collapsed after open / save Word document.\nWORDSNET-6788 Incorrect link in info panel of Flash document viewer\nWORDSNET-6856 Paragraph highlight colour appears in HTML\nWORDSNET-6908 ParagraphBreakFont.HighlightColor is visible when converting to HTML\nWORDSNET-7374 Databound values of SDT are not visible in fixed page formats\nWORDSNET-7380 ParagraphFormat.TabStops Property return no TabStops\nWORDSNET-7382 DrawingML nodes in Header/Footer are repeated multiple times during open/save\nWORDSNET-7677 Line Breaks Issue in Text Files\nWORDSNET-7682 SDT values are getting lost in fixed formats\nWORDSNET-7849 Floating Table is truncated at the end of Page in Fixed Page Formats\nWORDSNET-7853 Word for MAC is unable to merge Aspose.Words generated document\nWORDSNET-7854 ShapeRenderer doesn't correctly render shape with shadows.\nWORDSNET-7876 Shape is getting truncated from bottom when exporting to HTML\nWORDSNET-7970 System.NullReferenceException throws while conversion from Doc to Pdf conversion\nWORDSNET-7995 Doc to HTML conversion issue with table's cell width\nWORDSNET-8021 STYLEREF \"Überschrift 1\" (Heading 1) is not working for German language\nWORDSNET-8024 Horizontal Cell merging information is not preserved during open/save a DOCX\nWORDSNET-8070 HtmlSaveOptions.ExportRelativeFontSize do not work with bullet text\nWORDSNET-8073 Fix FileFormatDetector to detect the file as Text\nWORDSNET-8103 NodeImporter copies undesired styles to destination document\nWORDSNET-8145 Footnote numbers do not maintain super-scripted state during open/save odt\nWORDSNET-8149 DrawingML causes Aspose.Words to render a black strip on top of PDF\nWORDSNET-8150 DrawingML.ImageData.ImageType return unknown for gif images\nWORDSNET-8152 Afer mail merge the page numbers in TOC are not aligned\nWORDSNET-8155 Shape position is chagned after re-save the document\nWORDSNET-8162 Shapes fill is drawn outside of the shapes in ouput PDF\nWORDSNET-8163 The child nodes of StructuredDocumentTag become the NextSibling in Aspose.Words.Document\nWORDSNET-8164 After re-saving the docx the content formatting of StructuredDocumentTag is lost\nWORDSNET-8172 Customer's 3D Charts look many times higher than they should in output PDF\nWORDSNET-8184 RTF to Pdf conversion issue with fonts\nWORDSNET-8186 Doc to Pdf conversion issue with NumeralFormat\nWORDSNET-8188 RTF to html conversion issue with output html size\nWORDSNET-8190 Horizontal axis values of a Chart are displayed in place of Legend in PDF\nWORDSNET-8199 Image width is not preserved during rendering to PDF\nWORDSNET-8200 Image is overlapping text when rendering to PDF\nWORDSNET-8201 /keep with next paragraph break/ A blank page is inserted at the middle of PDF\nWORDSNET-8202 List Tab character incorrectly inherits formatting of ListLabel during rendering to PDF\nWORDSNET-8205 A nested Table is rendering on to the previous Page in PDF\nWORDSNET-8229 UpdateFields does not respect formatting specified via Advance field\nWORDSNET-8230 Incorrect List numbering after merging documents with UseDestinationStyles\nWORDSNET-8239 ParagraphFormat.SpaceBefore is not preserved during open/save RTF\nWORDSNET-8245 Hyperlink font is not retained during importing it to another Document\nWORDSNET-8246 A Table disappears from the output documents\nWORDSNET-8250 Vertical y-axis label is rotated by 45 degrees during rendering EMF chart image\nWORDSNET-8255 A blank page is inserted at the middle of PDF\nWORDSNET-8258 Shape.AlternativeText is empty when Shape node is inserted with insertHTML\n\n• Performance\nWORDSJAVA-722\tPerformance issue during DOC loading and rendering to PDF\n\n• Regressions\nWORDSNET-6603 Horizontal cell merging is malfunctioning\nWORDSNET-8050 Conditional mail merge stop mail merge operation - MoveToMergeField(String)\nWORDSNET-8088 ExecuteWithRegions merges values in a region from incorrect DataTable",
  "requireLicenseAcceptance": true,
  "title": "Aspose.Words for .Net",
  "verbatimVersion": "13.5.0",
  "version": "13.5.0",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.21.06.25.38/aspose.words.13.5.0.json#Aspose.Words.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 5337,
      "fullName": "Aspose.Words.nuspec",
      "length": 13117,
      "name": "Aspose.Words.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.21.06.25.38/aspose.words.13.5.0.json#lib/net2.0/Aspose.Words.dll",
      "@type": "PackageEntry",
      "compressedLength": 5234567,
      "fullName": "lib/net2.0/Aspose.Words.dll",
      "length": 9133056,
      "name": "Aspose.Words.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.21.06.25.38/aspose.words.13.5.0.json#lib/net3.5/Aspose.Words.dll",
      "@type": "PackageEntry",
      "compressedLength": 5234839,
      "fullName": "lib/net3.5/Aspose.Words.dll",
      "length": 9131520,
      "name": "Aspose.Words.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.21.06.25.38/aspose.words.13.5.0.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9463,
      "fullName": ".signature.p7s",
      "length": 9463,
      "name": ".signature.p7s"
    }
  ],
  "tags": [
    "Aspose.Words",
    "DOC",
    "DOCX",
    "RTF",
    "HTML",
    "OpenDocument",
    "XPS",
    "EPUB",
    "Word",
    "Document",
    "Processing"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    }
  }
}