{
  "@id": "https://api.nuget.org/v3/catalog0/data/2015.02.03.04.09.27/aspose.words.13.2.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "Aspose",
  "catalog:commitId": "8d9f7638-fae2-486f-8320-dca751e54215",
  "catalog:commitTimeStamp": "2015-02-03T04:09:27.7904852Z",
  "copyright": "© Aspose 2002-2011. All Rights Reserved.",
  "created": "2013-03-04T07:20:03.59Z",
  "description": "Aspose.Words for .NET class library supports DOC, DOCX, RTF, HTML, OpenDocument, PDF, XPS, EPUB and other formats. With Aspose.Words you can generate, modify, convert, render and print documents without utilizing Microsoft Word®",
  "iconUrl": "http://www.aspose.com/images/products/dotnet/Aspose.Words_128x128.png",
  "id": "Aspose.Words",
  "isPrerelease": false,
  "lastEdited": "0001-01-01T00:00:00Z",
  "licenseUrl": "http://www.aspose.com/corporate/purchase/end-user-license-agreement.aspx",
  "packageHash": "Fcjsm9GCWY/K/+ZWHmF6qk3XABBsnP64Xx+b3Q2sIiayEUbXBtYU8ZDHq2fFVLa+wpOAZOz+HHGzndiTAWsAoQ==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 10107035,
  "projectUrl": "http://www.aspose.com/categories/.net-components/aspose.words-for-.net/default.aspx",
  "published": "2013-03-04T07:20:03.59Z",
  "releaseNotes": "The most notable improvements and fixes are:\n\n• 3D effects are rendered for VML shapes.\n• Shadows are rendered for VML shapes.\n• PDF rendering performance is improved for documents with large JPEG images.\n• DrawingML Charts rendering new features added.\n• DIV elements in HTML are supported.\n• Non-binary OLE objects are supported in ODT.\n• Floating table breaking and positioning improved.\n• Layout of RTL tables and paragraphs improved. \n\nThis release introduces the new features, enhancements and fixes to the excptions/bugs as detailed below:\n\n• New features\nWORDSJAVA-691\tLinux font not support windows font glyphs\nWORDSNET-4189\tSupport basic 3D effects of shapes upon rendering.\nWORDSNET-5375\tDiv elements are not supported in the model.\nWORDSNET-6804\tSupport of extrusion effect rendering (lighting and shading)\nWORDSNET-6868\tShapes Shadows // WordArt shape is not rendering correctly in PDF\nWORDSNET-7244\tSupport rendering of leader lines upon rendering data labels.\nWORDSNET-7354\tSupport text rotation and direction upon rendering Axis labels.\nWORDSNET-7468\tShape shadow effects is not rendered in pdf output\nWORDSNET-7609\tHyperlink in PDF is not opened in a new window when specifying ContentDisposition.Inline option\nWORDSNET-7696\tSupport non binary OLE objects (<draw:object>) in ODT\nWORDSNET-7710\tAspose.Words renders more Pages than in original Docuement\nWORDSNET-7728\tCreate samples for the new access to page layout feature\nWORDSNET-7729\tTouch up PageSplitter sample\nWORDSNET-7730\tCreate a sample which demonstrates how to get page numbers of every node in a document\nWORDSNET-7731\tCreate a sample which demonstrates LayoutEnumerator\nWORDSNET-7732\tCreate a sample to add a image to every page without using the header or footer\nWORDSNET-7760\t/revision marks/ Support revisions in list numbers\nWORDSNET-7772\tCreate a basic wrapper for LayoutEnumerator which provides a object model API\nWORDSNET-7780\tProvide a way to access content of a TextColumn\nWORDSNET-7783\tPageSplitter: Heading numbers can be wrong\nWORDSNET-7839\tExport font subsets in WOFF (Web Open Font Format)\nWORDSNET-7842\tImplement writer for WOFF format.\n\n• Enhancements\nWORDSJAVA-674\tBroken Windows Metafile of huge size is saved as empty to PDF\nWORDSJAVA-677\tRender RTL text with complex or incorrect properties\nWORDSJAVA-687\tAdded WrapMode and affine transformations to PathGradient\nWORDSNET-2257\tShape shadow is lost upon rendering/converting to PDF.\nWORDSNET-3538\tBorders around table are partially lost after open/save.\nWORDSNET-6062\t/asian font substitution/ Doc to PDF conversion issue with Japanese character.\nWORDSNET-6444\t/asian font substitution/ Paragraph spacing needs to be improved during rendering to PDF\nWORDSNET-6655\tUnable to load document in 11.5.0 version\nWORDSNET-6704\tBottom border line of image disappears upon converting DOCX to DOC/RTF\nWORDSNET-6761\tRTF to PDF conversio issue with logo\nWORDSNET-7111\t3D effects of Shapes are lost during rendering to PDF\nWORDSNET-7155\tFloating table is rendering at the wrong page and cutting at the bottom in fixed page formats\nWORDSNET-7180\t/asian font substitution/ Some of the text is having a bold typeface in PDF\nWORDSNET-7184\tDecide if PrinterSettingsContainer should be public\nWORDSNET-7437\tRemove the dependency for WingDings 2 font while rendering checkboxes in PDF file\nWORDSNET-7457\tImprove axis labels auto rotation algorithm\nWORDSNET-7488\tTranslucent shape is rendered lighter than it should.\nWORDSNET-7555\tWORDSNET-6804 Fix incorrect face order\nWORDSNET-7582\t/asian font substitution/ Chinese text is formatted as bold in Pdf\nWORDSNET-7596\tSaving a DOCX stream to disk using IO.File results in Document corruption\nWORDSNET-7628\tOther\\TestBugInFilesFromRK.docx crashes\nWORDSNET-7644\tCell borders are not preserved in Pdf\nWORDSNET-7646\t/font substitution/ Special characters are rendered incorrectly while conversion from Doc to fixed file format\nWORDSNET-7657\tData labels are rendered incorrectly for bars, which height is less than tick size.\nWORDSNET-7663\tA Shape takes place of Paragraphs and moves them towards right page edge\nWORDSNET-7665\tTable is not rendering correctly while conversion from Docx to PDF\nWORDSNET-7703\tRefactor virtual list related classes.\nWORDSNET-7719\tSmall image boxes in DrawingML nodes are not preserved in fixed formats\nWORDSNET-7724\t/rtl floating table X compensation/ Floating RTL table is not positioned correctly\nWORDSNET-7725\tUpdate OOXML chart supported features list\nWORDSNET-7727\tPost blog and API changes for this month's release\nWORDSNET-7743\tUse AttributeConverter instead of direct access to RunPr properties in Layout\nWORDSNET-7753\tImplement support of simple shadows.\nWORDSNET-7756\tPageIndex value is swapped with the Width part of LayoutEnumerator.Rectangle property\nWORDSNET-7757\tPageIndex and Rectangle values of Run nodes returned by LayoutEnumerator are incorrect\nWORDSNET-7768\tConversion issue in Smart Art Shape Text\nWORDSNET-7781\tTest documents with PageSplitter sample\nWORDSNET-7791\tRenderedDocument class returns incorrect Rendered Last line of Column\nWORDSNET-7792\tLayoutEnumerator returns incorrect number of Columns\nWORDSNET-7820\tPage breaks can cause a second page when content is extracted\nWORDSNET-7823\tUse .ttf extension instead of .odttf for font resources when write FixedXaml\nWORDSNET-7833\tRTL line positioning is incorrect\nWORDSNET-7840\tCreate/find tool for validating generated WOFF files.\nWORDSNET-7844\tLast Paragraph of HeaderPrimary is missing when rendering to image formats\n\n• Exceptions\nWORDSJAVA-684\tStackOverflowError occurs during rendering to pdf when fonts are not available\nWORDSJAVA-689\tSaving Docx to Pdf fails becuse of missing Font\nWORDSJAVA-693\tStackOverflowError Exception while saving RTF to PDF at Linux OS\nWORDSJAVA-695\tStackOverflowError occurs while converting Doc to pdf\nWORDSNET-7216\tDocument.UpdateFields throws exception\nWORDSNET-7493\tUnsupportedFileFormatException occurs when loading a TEXT file into DOM\nWORDSNET-7513\tUnable to load Docx into Aspose.Words.Document\nWORDSNET-7595\tDocument.UpdateFields method throws exception\nWORDSNET-7604\tDoc to WordML conversion issue with .wmz data\nWORDSNET-7640\tException while conversion from WordML to PDF\nWORDSNET-7672\tAspose.words Digital signature issue at Windows XP\nWORDSNET-7686\tSystem.OutOfMemoryException occurs during loading a DOC\nWORDSNET-7702\tNullReferenceException occurs during rendering to fixed page formats\nWORDSNET-7711\tDocument constructor throws exception FileCorruptedException during loading RTF\nWORDSNET-7736\tRevision.ParentStyle throws System.InvalidOperationException\nWORDSNET-7751\tDocument.UpdateFields throws System.NullReferenceException\nWORDSNET-7803\tXamlReader.Load throws NullReferenceException when loading XamlFixed\nWORDSNET-7821\tFileCorruptedException is thrown on load of an HTML document\n\n• Bugs\nWORDSJAVA-656\tExplicit symbol Arabic font changed by run font.\nWORDSJAVA-660\tQUOTE field update.\nWORDSJAVA-666\tAspose.Words doesn't read NUL and EOT ascii Code Characters from RTF\nWORDSJAVA-673\tUnproperly ordered iso-8859-8 (Hebrew visually ordered) text.\nWORDSJAVA-678\tOne word rendered improperly in complex Arabic document.\nWORDSJAVA-679\tRtl text with incorrect RTL properties rendered improperly.\nWORDSJAVA-680\tRtl text with incorrect properties inside SDT.\nWORDSJAVA-681\tHebrewShaper bug\nWORDSJAVA-686\tPerl can't properly transfer Unicode string to Java code inside Inline::Java block\nWORDSJAVA-692\tJapanese text with code page ms932 looses few symbols when converting RTF to DOC\nWORDSNET-1773\t“DoNotDisplayPageBoundaries” has no effect when save document in DOC format.\nWORDSNET-2934\tEMF image is rendered improperly.\nWORDSNET-5302\tWatermark disappears after open/save DOCX document.\nWORDSNET-5738\tLists are getting rendered incorrectly on DOCX>DOCX\nWORDSNET-6395\tAspose.Words does not load complete text in HTML\nWORDSNET-6712\tBottom line of header lost after verticle cell merge and zooming out the doucment\nWORDSNET-6847\tThe indentation of Paragraph is not correct in PDF\nWORDSNET-6906\tHTML string truncates when converting to RTF\nWORDSNET-7341\t/row height/ Table's cell text do not render correctly in output PDF file\nWORDSNET-7342\t/row height/ Table's border do not render correctly in output PDF file\nWORDSNET-7351\tText in EMF image is shifted towards right in Xps\nWORDSNET-7376\tUpdateFields doesn't update the value of a STYLEREF field\nWORDSNET-7411\tDocx to PDF conversion issue with Pie Chart\nWORDSNET-7412\tDoc to PDF conversion issue with X-axis title's alignment\nWORDSNET-7461\tRTF to fixed file format conversion issue with character rendering\nWORDSNET-7487\tTable Row/Cell widths are not preserved during DOC to HTML to DOC roundtrip\nWORDSNET-7529\tParagraphFormat.LinesToDrop corrupts Table in ODT\nWORDSNET-7548\tDoc to RTF conversion issue with track changes\nWORDSNET-7550\tODT font size problem.\nWORDSNET-7551\tDoc to HTML conversion issue with image rendering\nWORDSNET-7552\tBookmark value is visible in place where ASK field was located\nWORDSNET-7558\tCell shading color is not preserved in Pdf\nWORDSNET-7559\tTable content is not preserved during open/save RTF\nWORDSNET-7571\tFont size is imported incorrectly when it by default (if it open in MSo)\nWORDSNET-7589\tShading.BackgroundPatternColor do not save in ODT\nWORDSNET-7593\tUpdateFields doesn't format MERGEFIELD values as Ordinals (English Words)\nWORDSNET-7599\tHtmlSaveOptions.ScaleImageToShapeSize false value is not working\nWORDSNET-7601\tList Tab Positions are incorrect in fixed page formats\nWORDSNET-7615\tDocx to PDF conversion issue with axis labels of charts\nWORDSNET-7626\tContents are misplaced after conversion from Docx to Fixed file format\nWORDSNET-7638\tOpen/Save a DOCX with Aspose.Words produces a corrupted document\nWORDSNET-7652\tTable width is not preserved during DOCX>HTML>DOCX roundtrip\nWORDSNET-7654\tAfter HTML import table width is different in DOC and DOCX\nWORDSNET-7660\tParagraph space after changes after using Document.AppendDocument with UseDestinationStyles\nWORDSNET-7668\tShape size is read incrorrectly from XML/DOCX\nWORDSNET-7674\tDocumentBuilder.InsertImage does not convert a wide image to Pdf\nWORDSNET-7678\tEmbedded Excel-Sheet (OLE) convert to picture after using AppendDocument\nWORDSNET-7681\tDOCX produced by Aspose.Words cannot be opened in MS Word.\nWORDSNET-7691\tQuestion marks after list label in HTML\nWORDSNET-7698\tFont size of superscript character is not preserved during DOCX to HTML to DOCX roundtrip\nWORDSNET-7699\tPDF page is spilling over to the next page after appending multiple documents\nWORDSNET-7706\tParagraph/Text Border is missing when saved to PDF, TIFF, XPS\nWORDSNET-7709\tQuotes are lost after import of an MHTML document\nWORDSNET-7712\tShapes in TIFF become distorted\nWORDSNET-7713\tTable in Shape is moved towards the left edge of Page in fixed formats\nWORDSNET-7714\tContent in Cells is moving to other Cells in different Rows in fixed formats\nWORDSNET-7715\tDocument.Unprotect turn off the track changes\nWORDSNET-7716\tNumber formatting is incorrect in Russian culture.\nWORDSNET-7718\tSpecial characters typed using the Symbol font are exported to HTML incorrectly\nWORDSNET-7720\tPosition of DrawingML is not preserved in fixed page formats\nWORDSNET-7726\tDocument.Save change the RTF contents to symbols\nWORDSNET-7733\tRTF produces bad output.\nWORDSNET-7738\tBorder appears around textbox after open/save.\nWORDSNET-7742\tbase64 image is not showing in Chrome and Firefox\nWORDSNET-7759\tStyles.AddCopy throws exception \"duplicate\"\nWORDSNET-7761\tFormatting of currency number is incorrect during MailMerge\nWORDSNET-7764\tIndentation of nested lists is not correct when importing from HTML\nWORDSNET-7770\tOddAndEvenPagesHeaderFooter is not preserved when importing Section to another Document\nWORDSNET-7782\tPageSplitter: Heading occurs first on the page it may have different height compared to the original document\nWORDSNET-7784\tPageSplitter: If page ends with section break then odd page can be created in output,\nWORDSNET-7785\tPageSplitter: TOC appearance is different\nWORDSNET-7793\tOpen/Save a DOCM with Aspose.Words produces a corrupted document\nWORDSNET-7805\tEnd of Table Rows do not match on Html2Doc2Html\nWORDSNET-7814\tThick and shrinked Telugu characters are produced in PDF\nWORDSNET-7841\tAlpha channel is lost using PdfImageCompression.Jpeg\nWORDSNET-7845\tHeader content is lost during open/save ODT\n\n• Performance\nWORDSNET-7566\tFile size of PDF is too big\n\n• Regression\nWORDSJAVA-694\tStackOverflowError occurs during rendering to pdf\nWORDSNET-7773\tException while loading Doc file into Aspose.Words.Document.\nWORDSNET-7858\tRTF to Pdf conversion issue with text rendering using font MS Mincho",
  "requireLicenseAcceptance": true,
  "title": "Aspose.Words for .Net",
  "version": "13.2.0",
  "tags": [
    "Aspose.Words",
    "DOC",
    "DOCX",
    "RTF",
    "HTML",
    "OpenDocument",
    "XPS",
    "EPUB",
    "Word",
    "Document",
    "Processing"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    }
  }
}