{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.12.17.17.33/lords-mobile-kingdom-wars-gems-generator-dx.1.0.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "lords-mobile-kingdom-wars-gems-generator-dx",
  "catalog:commitId": "8731ebf4-bacb-4a92-841a-1c539ccbb419",
  "catalog:commitTimeStamp": "2022-01-12T17:17:33.4024624Z",
  "created": "2022-01-12T17:15:29.567Z",
  "description": "This latest Lords Mobile Kingdom Wars Gems Generator is up and also you can have fun with it. With no them you won't have a lot of success. You'll find several solutions to gain free Gems along with a lot extra things to invest them on. Gems are among the extraordinary energy and you need to understand how to make use of the resources of yours skillfully. It simply results in a diversion in between the game's collection and the player's account. If you are interested in a faster process, now do not get this.\n\nAcess ONLINE GENERATOR http://tnpps.xyz/29bc6a7\n\nYou are able to use this particular new Lords Mobile Kingdom Wars Gems Generator on some of your desired ios as well as on your android which you've and you also won't ever have any problems in taking complete benefit from it and you are going to like it a lot. As a result from this I suggest you never to offer such info to unlawful apps as they could use this info to hack your game. You shouldn't excessively use it. The goal of the hack version app free download is to enhance the pleasure of the game. You are able to sometimes avail gamer 's war pass using Gems. Within just a couple mins you are gonna have all of the totally free skins and Gems you have usually dreamed of!\n\n\n\nLords Mobile Kingdom Wars Gems Generator for android and ios the way to get unlimited free Gems without any survey no human verification no password no download certainly no root no jailbreak. It seems stimulating to generate a number of in-game currency every day, though it comes with a price. It is going to help you to have experience that is incredible while enjoying absolutely free of charge currency collection services. And so, making use of such mods could completely ban the Lords Mobile Kingdom Wars of yours of profile. Gems hack for ipad may be the web-based software enables you to to have no cost Gems.\n\n\n\nLords Mobile Kingdom Wars Gems Generator is the easiest and safe method to get endless Gems. You might utilize various mods, but that's an alternative problem from the web based game and also hacking the Lords Mobile Kingdom Wars isn't actually a possible thing to do. A few designers as well as gamers don't adore to use an extra hack Gems app for producing Gems. We really wish that you start making use of the pedometar additionally because it is going to be accessible for free of charge. Collecting Gems isn't a simple undertaking while playing on the difficult levels, so use them smartly since you can earn Gems solely after levelling up in the game. The awesome element is the fact that this user friendly hack apk 2022 was created with no passwords and surveys where you can don't actually have to consume the device memory of yours by initiating needless downloads.\n\n\n\nYou must to begin with know that this new Lords Mobile Kingdom Wars Gems Generator will add all the necessary Gems you'd like. It is an effective as simply on mac because it does on a desktop computer or laptop. We actually hope that this hack Gems is gon na be performing very well for yourself so that as you'll be using it out there, you will see you won't have any challenges with it. The focus for our team of industry experts is actually the security in addition to being protection of this tool during its creation.\n\n\n\nSo if you wish to get permission to access a limitless number of Gems right away, now you are able to make the usage of the Lords Mobile Kingdom Wars Gems Generator for the job. When you face any issue make sure to make contact with us as soon as possible. This particular feature of the hack code is a verification method which will tell our system that you are not really a bot though you are able to ignore the verification procedure as long as your country and email is valid. In general, you are able to declare that just about all positives are available for cost-free, so the reality that we are free Gems really easily bears testimony to it. To avoid this particular, you can acquire a high",
  "id": "lords-mobile-kingdom-wars-gems-generator-dx",
  "isPrerelease": false,
  "lastEdited": "2022-01-12T17:17:31.92Z",
  "listed": true,
  "packageHash": "bQJGteei/b65afC3VW1XDQmwn5qj4+/86mTrM3T0rSVXOVWf6LyOc8ynr96Mc2E0Jf5aifAeu/wb1d9jHvq8vw==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 16945,
  "published": "2022-01-12T17:15:29.567Z",
  "verbatimVersion": "1.0.0",
  "version": "1.0.0",
  "dependencyGroups": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.12.17.17.33/lords-mobile-kingdom-wars-gems-generator-dx.1.0.0.json#dependencygroup/net6.0",
      "@type": "PackageDependencyGroup",
      "targetFramework": "net6.0"
    }
  ],
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.12.17.17.33/lords-mobile-kingdom-wars-gems-generator-dx.1.0.0.json#lib%5Cnet6.0%5CAppLogger.dll",
      "@type": "PackageEntry",
      "compressedLength": 1786,
      "fullName": "lib\\net6.0\\AppLogger.dll",
      "length": 4608,
      "name": "AppLogger.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.12.17.17.33/lords-mobile-kingdom-wars-gems-generator-dx.1.0.0.json#lords-mobile-kingdom-wars-gems-generator-dx.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 2076,
      "fullName": "lords-mobile-kingdom-wars-gems-generator-dx.nuspec",
      "length": 4753,
      "name": "lords-mobile-kingdom-wars-gems-generator-dx.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.12.17.17.33/lords-mobile-kingdom-wars-gems-generator-dx.1.0.0.json#_rels%5C.rels",
      "@type": "PackageEntry",
      "compressedLength": 307,
      "fullName": "_rels\\.rels",
      "length": 537,
      "name": ".rels"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.12.17.17.33/lords-mobile-kingdom-wars-gems-generator-dx.1.0.0.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9462,
      "fullName": ".signature.p7s",
      "length": 9462,
      "name": ".signature.p7s"
    }
  ],
  "tags": [
    "Lords",
    "Mobile",
    "Kingdom",
    "Wars",
    "Gems",
    "Generator",
    "how",
    "to",
    "hack",
    "ios",
    "free",
    "can",
    "you",
    "download",
    "version"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}