{
  "@id": "https://api.nuget.org/v3/catalog0/data/2015.02.02.23.46.06/af2010.0.1.4762.43083.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "AreaProg Consulting",
  "catalog:commitId": "4fb96bad-4e7d-4e1d-8477-787f7d6b6e24",
  "catalog:commitTimeStamp": "2015-02-02T23:46:06.3315297Z",
  "copyright": "© 2002 - 2012 Areaprog - Tous droits réservés.",
  "created": "2013-01-14T23:21:10.323Z",
  "description": "Nativement, le Framework .NET 3.5 et SharePoint 2010 fournissent un ensemble de fonctionnalités utiles. \"AreaProg Framework\" permet d'étendre cela en fournissant des méthodes d'extension permettant de faciliter le développement en .NET et SharePoint.\n\nLa partie SharePoint de ce Framework se focalise surtout sur l'amélioration de la gestion des content types. En effet, avec \"AreaProg Framework\", vous définissez vos content types en déclarant une classe C# basique. Celle-ci sera analysé par le \"Framework\" et le content type correspondant sera créé. En plus d'être plus simple que le XML, ce système est églalement plus sûr. Il est également possible d'utiliser par après cette classe pour recupérer, créer, modifier et supprimer des éléments dans des listes de façons très efficace.\n\nAprès mesure de performance, l'utilisation de ce Framework s'avère entre 10 et 15 fois plus rapide que LINQ for SharePoint.\n\nEnvie d'en savoir plus ? N'hésitez pas à télécharger ce Framework. Vous pouvez également retrouver des articles explicatifs à l'adresse \"http://www.areaprog.com/fmk\".",
  "iconUrl": "http://www.areaprog.com/img/af.ico",
  "id": "AF2010",
  "isPrerelease": false,
  "language": "fr-FR",
  "lastEdited": "0001-01-01T00:00:00Z",
  "packageHash": "kQyAdMKm9lK8rqgowuS5DBZl/maj4ErnQ4tI5dLUdRpb7pNWJjKwpi3B42RSyhU2xcejINJB0FEepSru1z+yiw==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 102398,
  "projectUrl": "http://www.areaprog.com/framework",
  "published": "2013-01-14T23:21:10.323Z",
  "releaseNotes": "- Gestion des méthodes imbriquées dans les requêtes \"LINQ\" utilisant SharePoint. Les requêtes du type \"Where().OrderBy().FirstOrDefault()\" sont mieux supportées.\n- Amélioration générale du support des requêtes \"LINQ\" utilisant SharePoint.\n- La méthode \"Query\" supporte maintenant un paramètre nommé \"strict\" permettant d'indiquer que les éléments basés sur des \"content types\" enfants à celui utilisé ne seront pas récupérés (si le paramètre est sur \"true\", étant la valeur par défaut).\n- Dans les versions précédentes, les \"lookups\" multiples étaient créées avec le type \"Lookup\" au lieu de \"LookupMulti\". Cela pouvait créer des incohérences sous certaines circonstances. Cette version corrige ce bug.\n- La ou les méthodes \"LINQ\" sont maintenant exécutées directement sur le résultat filtré renvoyé par SharePoint. Cela permet d'éviter de récupérer des éléments non voulus. Par exemple, \"Where(c => c.Title.Contains(\"A\")\" pouvait poser problème car \"CAML\" ne prend pas la casse en compte. La requête \"LINQ\" doit donc être exécutée à nouveau pour éviter de récupérer des éléments contenant un \"a\" mais pas de \"A\".\n- Dans le cas de requêtes successives, seule la première est traduite en \"CAML\". Par exemple \"Where(query1).OrderBy().First(query2)\", \"query2\" n'est plus transformée en \"CAML\" car cela provoque des résultats inattendus quand \"query1\" ne peut pas être intégralement convertie en \"CAML\".\n- Appeler la méthode \"ToString\" sur le résultat d'une requête \"LINQ\" utilisant SharePoint lançait une exception. Cette version corrige le problème.\n- Dû au fait que la requête \"LINQ\" est exécutée directement sur le résultat filtré renvoyé par SharePoint, un nombre plus important de méthodes \"LINQ\" sont supportées.",
  "requireLicenseAcceptance": false,
  "summary": "AreaProg Framework est un ensemble de DLL permettant de faciliter le développement en .NET 3.5 et SharePoint 2010.",
  "title": "AreaProg Framework (SharePoint 2010)",
  "version": "0.1.4762.43083",
  "tags": [
    "AreaProg",
    "Framework",
    "SharePoint",
    "Content",
    "types"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    }
  }
}