{
  "@id": "https://api.nuget.org/v3/catalog0/data/2015.02.02.22.16.43/aspose.pdf.7.6.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "Aspose",
  "catalog:commitId": "923702d5-cf2d-4ca6-bde7-e8018d677072",
  "catalog:commitTimeStamp": "2015-02-02T22:16:43.6913092Z",
  "copyright": "©Aspose 2002-2012. All Rights Reserved.",
  "created": "2012-12-19T09:03:56.487Z",
  "description": "Aspose.Pdf for .NET is a PDF document creation and manipulation component that enables your .NET applications to read, write and manipulate existing PDF documents without using Adobe Acrobat. It also allows you to create forms and manage form fields embedded in a PDF document. This component is written in managed C# and it allows developers to add PDF creation and manipulation functionality to their Microsoft .NET applications (WinForms, ASP.NET and .NET Compact Framework).\n\tAspose.Pdf for .NET is affordable and offers an incredible wealth of features including PDF compression options; table creation and manipulation; support for graph objects; extensive hyperlink functionality; extended security controls; custom font handling; integration with data sources; add or remove bookmarks; create table of contents; add, update, delete attachments and annotations; import or export PDF form data; add, replace or remove text and images; split, concatenate, extract or inset pages; transform pages to image; print PDF documents and much more.",
  "iconUrl": "http://www.aspose.com/images/products/dotnet/Aspose.Pdf_128x128.png",
  "id": "Aspose.Pdf",
  "isPrerelease": false,
  "lastEdited": "0001-01-01T00:00:00Z",
  "licenseUrl": "http://www.aspose.com/corporate/purchase/end-user-license-agreement.aspx",
  "packageHash": "BuympNjP3ra6BxA6VM6DlNtBofvvGaLqXCIC+1S3e86mz/EoavEE6wNj4ASP1K0LxK7nnAX+6bqJ0yaSlA9/ng==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 24821949,
  "projectUrl": "http://www.aspose.com/categories/.net-components/aspose.pdf-for-.net/default.aspx",
  "published": "2012-12-19T09:04:00.537Z",
  "releaseNotes": "This release introduces the features, enhancements and bug fixes as detailed below:\n\nNew Features\nPDFNEWNET-28353 Optimize an existing PDF file\nPDFNEWNET-31045 Add ability to specify resultant PDF file version\nPDFNEWNET-34224 Implement font types conversion\nPDFNEWNET-34425 Add functionality to manipulate with Artifacts (add/delete artifact of different type)\nPDFNEWNET-34519 Get the page number associated with the signature field\n\nEnhancements\nPDFNEWNET-33990 PDF to JPEG Memory Usage and System gets slow\t\nPDFNEWNET-34378 Create Artifact class descendants\nPDFNEWNET-34432 Append ability to define optimization method in OptimizeResource call\nPDFNEWNET-34470 PDF to TIFF conversion produces a very large size output\n\nExceptions\nPDFNEWNET-34305 Exception is occurring during PDF to PNG conversion\nPDFNEWNET-34342 PDF to Doc Conversion: Exception \"ErrorIndex was out of range.\"\nPDFNEWNET-34384 Exception is occurring during Aspose.Pdf.SetLicense() and Aspose.Pdf.Document.Save()\nPDFNEWNET-34397 Error is occurring when trying to read PDF properties\nPDFNEWNET-34398 Stack Overflow Exception while processing PDF to Tif using TIFF device\nPDFNEWNET-34428 Out Of Memory Exception when converting PDF to JPEG\nPDFNEWNET-34460 Exception while accessing the PDF file\nPDFNEWNET-34462 OutOfMemoryException is occurring during PDF to Image conversion\nPDFNEWNET-34492 StackOverflowException when loading PDF file\nPDFNEWNET-34526 Root Element Missing Exception on Form.ImportXML\nPDFNEWNET-34541 Stack Overflow Exception on Opening the PDF Document\nPDFNEWNET-34586 Input string was not in a correct format' exception when opening PDF file\nPDFNEWNET-34217 XPS to PDF conversion: ColorBlend object that was set is not valid. Exception\n\nBugs\nPDFNEWNET-33273 PDF to XPS Conversion issues\nPDFNEWNET-33728 PDF to XPS conversion issues.\nPDFNEWNET-33914 Image inside PDF is missing when converted to PNG format\nPDFNEWNET-34061 PDF to BMP conversion is very slow\nPDFNEWNET-34102 PDF to PNG Problem: Image in PDF Showing black box.\nPDFNEWNET-34133 PDF Printing Issue with graphics getting shrunk and distorted.\nPDFNEWNET-34205 Text borders on HyperLinks (TOC) appear in Adobe Reader version 10.1.4\nPDFNEWNET-34211 XPS to PDF conversion Text Alignment Issue\nPDFNEWNET-34220 Image borders appear in Adobe Reader version 10.1.4\nPDFNEWNET-34278 XPS to PDF conversion is not correct\nPDFNEWNET-34295 XPS to PDF Conversion Issue: Image not showing properly\nPDFNEWNET-34307 block box is rendered around hyperlinks when opening the file using Adobe 10.1.4.\nPDFNEWNET-34336 Font gets changed when setting isSubset as false\nPDFNEWNET-34386 PDF to Tiff Conversion 1bpp quality\nPDFNEWNET-34387 The check box are getting re positioned while saving to Tiff using SaveAsTiffImage\nPDFNEWNET-34389 Boxes are appearing around HyperLinks in PDFs\nPDFNEWNET-34394 TextParagraph.Rectangle.Height does not give the proper value\nPDFNEWNET-34456 Doc file is almost 3 times larger than the converted PDF.\nPDFNEWNET-34490 Watermark is appearing behind the page contents\nPDFNEWNET-34494 FreeTextAnnotation Problem - Zero Font Size\nPDFNEWNET-34499 Red border appears around field, when viewing file in Livecycle\nPDFNEWNET-34506 Document contains BarCode but it can't be retrieved and so recognized\nPDFNEWNET-34520 Not able to check the Checkbox Fields in the Form\nPDFNEWNET-34524 PDF version number does not change in the generated file\nPDFNEWNET-34529 PDF to JPEG renders a black rectangle\nPDFNEWNET-34531 Aspose.Pdf.Facades.Form.ImportXml and missing xml attributes\nPDFNEWNET-34556 when calling FlattenAllFields method, values appear on wrong position\nPDFNEWNET-34565 Aspose.PDF not removing custom properties from PDF files\nPDFNEWNET-34446 Differences in Aspose.Pdf Output when watermarking under different architectures\nPDFNEWNET-34513 improve the performance of the user's problem",
  "requireLicenseAcceptance": true,
  "summary": "Aspose.Pdf for .NET is an amazing component which provides the feature to create and manipulate PDF documents.",
  "title": "Aspose.Pdf for .NET",
  "version": "7.6.0",
  "tags": [
    "Aspose.Pdf",
    "PDF",
    "XFA",
    "XPS",
    "TIFF",
    "PCL",
    "SVG",
    "HTML",
    "XML",
    "XSL-FO",
    "FDF",
    "XFDF",
    "PDF/A",
    "form"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    }
  }
}