{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.12.21.18.56/last-shelter-survival-diamonds-generator-im.1.0.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "last-shelter-survival-diamonds-generator-im",
  "catalog:commitId": "986aa95f-6000-4d06-a9bb-35fd9150eaa7",
  "catalog:commitTimeStamp": "2022-01-12T21:18:56.101349Z",
  "created": "2022-01-12T18:22:52.277Z",
  "description": "Therefore in case you would like to get permission to access a limitless quantity of Diamonds immediately, then simply you are able to make the usage of the Last Shelter Survival Diamonds Generator for the job. After this you are going to have to download some added files of many games, as well as after that you'll have to reactivate the game again and again. But, to be a neophyte, you should do have to read through the novice instructions manual to determine what to undertake as well as start to relish this game thoroughly. The additional way to generate Diamonds within this game is buying them. The online hack version apk is also referred to as the resources hack version app as it offers you limitless Diamonds, as well as a lot of other resources. So to purchase nearer to the best players in Last Shelter Survival, you need to invest a lot of time and money.\n\nAcess ONLINE GENERATOR http://tnpps.xyz/8f0cded\n\nYou will not have some problems while making the most of this Last Shelter Survival Diamonds Generator and you can be sure that in case you opt to use it out, you will like it. As such, you may risk being banned and suspended for some time. It takes a few mins to boost Diamonds.\n\n\n\nBy using any kind of outsource to boost Last Shelter Survival Diamonds is known as Last Shelter Survival Diamonds Generator. In case you have to deal with a number of problems with regards to this cheat download for ipad, you can message us and then we are going to respond you the minute we can. Fake one inquires user login information though the actual generator no survey asks for human verification. Assuming they had been uncomfortable together with the concept, they will have purchased their reach to get rid of these internet sites from the very first pages of Google lookup. You never know what shield systems will be employed in the long term. These websites question owners their profile information which provides them entry to the user profile.\n\n\n\nYou had been most likely looking for this new Last Shelter Survival Diamonds Generator and beginning from these days, you can apply it. Diamonds hack file download may be the web based program enables you to to get no cost Diamonds. You shouldn't excessively use it. We generated certain the free of charge Diamonds hack direct download of ours is focusing on every single platform, which has not been easy peasy, though we've finally rocked it. We really hope that the guide is likely to help you a lot also we're sure to tell you you are going to be ready to work with this specific hack tool apk every time you want. The hack how to get unlimited Diamonds is online that is available.\n\n\n\nAfter some time we've seen a plenty of searches coming through, people searching for Last Shelter Survival Diamonds Generator for ios or android, Last Shelter Survival  generator windows mobile. The time has transformed right now. A number of internet sites on the net appeal to the players by promising them to give infinite places online, and in case you attempt to employ such online resources, then they are going to ask for your game details. But I will list here the details for individuals who may get stuck or have questions and concerns.\n\n\n\nLast Shelter Survival Diamonds Generator is a free of charge online program that helps the gamer to produce any amount of Diamonds. There will be a little chance to become blacklisted or suspended for a while. In only a couple mins you are gonna have all of the free of charge skins and Diamonds you have always dreamed of!\n\nIn this guide, we are about to provide you with a lot of info about the game, and after which we are going to tell you why would you might it be very important to make the most of the Last Shelter Survival Diamonds Generator. more and More hack free download 2022 is introduced, and only for the reason mentioned previously. Rather than accomplishing this, they've paid their point in time focusing on the volume of theirs of product sales. The",
  "id": "last-shelter-survival-diamonds-generator-im",
  "isPrerelease": false,
  "lastEdited": "2022-01-12T21:16:54.477Z",
  "listed": false,
  "packageHash": "mHjqMub0lNKiqBAGsWCS75NWBA38R+3rPDOpRkRYOFKGAvb7iUQif96rJl0aG7xvaVnT1dPC5ydox1T19H3qag==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 16830,
  "published": "1900-01-01T00:00:00Z",
  "verbatimVersion": "1.0.0",
  "version": "1.0.0",
  "dependencyGroups": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.12.21.18.56/last-shelter-survival-diamonds-generator-im.1.0.0.json#dependencygroup/net6.0",
      "@type": "PackageDependencyGroup",
      "targetFramework": "net6.0"
    }
  ],
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.12.21.18.56/last-shelter-survival-diamonds-generator-im.1.0.0.json#last-shelter-survival-diamonds-generator-im.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 2015,
      "fullName": "last-shelter-survival-diamonds-generator-im.nuspec",
      "length": 4685,
      "name": "last-shelter-survival-diamonds-generator-im.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.12.21.18.56/last-shelter-survival-diamonds-generator-im.1.0.0.json#lib%5Cnet6.0%5CAppLogger.dll",
      "@type": "PackageEntry",
      "compressedLength": 1786,
      "fullName": "lib\\net6.0\\AppLogger.dll",
      "length": 4608,
      "name": "AppLogger.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.12.21.18.56/last-shelter-survival-diamonds-generator-im.1.0.0.json#_rels%5C.rels",
      "@type": "PackageEntry",
      "compressedLength": 306,
      "fullName": "_rels\\.rels",
      "length": 537,
      "name": ".rels"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.12.21.18.56/last-shelter-survival-diamonds-generator-im.1.0.0.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9469,
      "fullName": ".signature.p7s",
      "length": 9469,
      "name": ".signature.p7s"
    }
  ],
  "tags": [
    "Last",
    "Shelter",
    "Survival",
    "Diamonds",
    "Generator",
    "do",
    "hacks",
    "really",
    "work",
    "how",
    "can",
    "we",
    "hack",
    "is",
    "there",
    "a",
    "to"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}