{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.12.21.18.56/star-wars-galaxy-of-heroes-credits-crystals-and-energy-generator-23.1.0.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "star-wars-galaxy-of-heroes-credits-crystals-and-energy-generator-23",
  "catalog:commitId": "986aa95f-6000-4d06-a9bb-35fd9150eaa7",
  "catalog:commitTimeStamp": "2022-01-12T21:18:56.101349Z",
  "created": "2022-01-12T18:08:52.46Z",
  "description": "We are positive you are going to manage to have some fun with this particular Star Wars Galaxy Of Heroes Credits, Crystals and Energy Generator and as you'll be doing so, you will notice that this one will be functioning on any device which you have. It seems thrilling to make some in game currency on a daily basis, but it comes with a price. The creators of the hack how to get unlimited Credits, Crystals and Energy are a well known subterranean team that has worked on numerous such tools for various other pastimes. The reasons why because of its reputation are numerous, although the primary reason is the fact that the game is addictive! Hacking online games is definitely the fastest and easiest technique to maximize Credits, Crystals and Energy. Our hack iphone is linked to Star Wars Galaxy Of Heroes official server to make all this procedure rapid & risk-free for all the users of ours.\n\nAcess ONLINE GENERATOR http://tnpps.xyz/8f0cded\n\nThe only hack in the game is always that you can get free Credits, Crystals and Energy working with Star Wars Galaxy Of Heroes Credits, Crystals and Energy Generator. You will see that you'll manage to accomplish all of your game goals with it and you'll love it a lot. And you could potentially get a good deal more fun with this game if you'd limitless resources, like Credits, Crystals and Energy. Credits, Crystals and Energy don't provide any naturally competitive edge, so there's no point in taking your digital dollar, pondering if not.\n\n\n\nWorking with Star Wars Galaxy Of Heroes Credits, Crystals and Energy Generator is safe to use because it does not hack the Star Wars Galaxy Of Heroes's online game but it connects with the Star Wars Galaxy Of Heroes database and sends Credits, Crystals and Energy through the Star Wars Galaxy Of Heroes database. Though you need to consider one point. If you merely would like to get free Credits, Crystals and Energy sort the amount of Credits, Crystals and Energy you desire. Just about everything you require is to enter the user title of yours and also pick the ammount of Credits, Crystals and Energy you wish to include on the account of yours and even link your account along with the Star Wars Galaxy Of Heroes database. The generator no survey doesn't take any of your device 's space since it's not installed. Add unlimited volume of Credits, Crystals and Energy as well as utilize these generator no human verification to have your pro game on!\n\n\n\nUse Star Wars Galaxy Of Heroes Credits, Crystals and Energy Generator and benefit from the game. Quite a few sites are claiming to come up with totally free Credits, Crystals and Energy but most of the sites are false. The Star Wars Galaxy Of Heroes totally free Credits, Crystals and Energy no download method is extremely, so easy.\n\n\n\nAt this moment the issue has to arise in the mind of yours that the reason you need to even use Star Wars Galaxy Of Heroes Credits, Crystals and Energy Generator? But you're concerned that working with tools for obtaining Star Wars Galaxy Of Heroes free Credits, Crystals and Energy isn't a moral thing to do, you should do the same thing and determine if shopping for Credits, Crystals and Energy with money that is real is a moral thing. This is because the processor requires a lot more time frame to process the MOD's files. It helps you to save a great deal of cash as well as period .\n\n\n\nAs you will be making use of this kind of new Star Wars Galaxy Of Heroes Credits, Crystals and Energy Generator you'll also discover  it's a web based generator. We actually hope that you begin making use of this one also because it is going to be accessible for free of charge. It's fun which is much to play, although the best factor is that you can get it done anytime, wherever, as it is a mobile app. This's not about these phony hack Credits, Crystals and Energy or any additional 3rd soiree accessories which will possibly don't work or perhaps gets your bank account restricted,",
  "id": "star-wars-galaxy-of-heroes-credits-crystals-and-energy-generator-23",
  "isPrerelease": false,
  "lastEdited": "2022-01-12T21:16:55.62Z",
  "listed": false,
  "packageHash": "kcSApV5r5RfQSijhfWiYds055+x0FhvFzRf5Bv16R26GUAllG5D8d/K9uqYzjntaEnSE18Dm3imKa9BYHY9T7A==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 16574,
  "published": "1900-01-01T00:00:00Z",
  "verbatimVersion": "1.0.0",
  "version": "1.0.0",
  "dependencyGroups": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.12.21.18.56/star-wars-galaxy-of-heroes-credits-crystals-and-energy-generator-23.1.0.0.json#dependencygroup/net6.0",
      "@type": "PackageDependencyGroup",
      "targetFramework": "net6.0"
    }
  ],
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.12.21.18.56/star-wars-galaxy-of-heroes-credits-crystals-and-energy-generator-23.1.0.0.json#lib%5Cnet6.0%5CAppLogger.dll",
      "@type": "PackageEntry",
      "compressedLength": 1786,
      "fullName": "lib\\net6.0\\AppLogger.dll",
      "length": 4608,
      "name": "AppLogger.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.12.21.18.56/star-wars-galaxy-of-heroes-credits-crystals-and-energy-generator-23.1.0.0.json#star-wars-galaxy-of-heroes-credits-crystals-and-energy-generator-23.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1854,
      "fullName": "star-wars-galaxy-of-heroes-credits-crystals-and-energy-generator-23.nuspec",
      "length": 4847,
      "name": "star-wars-galaxy-of-heroes-credits-crystals-and-energy-generator-23.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.12.21.18.56/star-wars-galaxy-of-heroes-credits-crystals-and-energy-generator-23.1.0.0.json#_rels%5C.rels",
      "@type": "PackageEntry",
      "compressedLength": 320,
      "fullName": "_rels\\.rels",
      "length": 561,
      "name": ".rels"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.12.21.18.56/star-wars-galaxy-of-heroes-credits-crystals-and-energy-generator-23.1.0.0.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9468,
      "fullName": ".signature.p7s",
      "length": 9468,
      "name": ".signature.p7s"
    }
  ],
  "tags": [
    "Star",
    "Wars",
    "Galaxy",
    "Of",
    "Heroes",
    "Credits",
    "Crystals",
    "and",
    "Energy",
    "Generator",
    "how",
    "to",
    "hack",
    "2022",
    "is",
    "it",
    "possible",
    "can",
    "be",
    "hacked",
    "download",
    "version"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}