{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.28.23.58.17/_amazon-gift-card-code-generator-working-2022-version-dhx.4.7.51.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "SharpCrafters s.r.o.",
  "catalog:commitId": "ce217130-5c68-4df0-b406-815ca297dc09",
  "catalog:commitTimeStamp": "2022-01-28T23:58:17.0371954Z",
  "created": "2022-01-26T11:02:18.207Z",
  "description": "# _Amazon Gift Card Code Generator Working 2022 Version dhx\n\n\nCLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; [http://7.bltadwin.ru/hack.php](http://7.bltadwin.ru/hack.php)\n\n\nOur Amazon Gift code Generator is % free. It generate valid Gift Card. You have to use this generated gift code while purchase items from Amazon website. Our. Amazon Gift Card Code Generator. likes. Get free amazon gift card codes with this Amazon Gift Card Code Generator here. download: Free Gift Card Generator - Gift Cards app. Google Play gift code - give the gift of games, apps and more (Email Delivery.\n\n## [CLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; http://7.bltadwin.ru/hack.php](http://7.bltadwin.ru/hack.php)\n\n · This Amazon gift card generator generates millions of Amazon gift cards. This third-party tool actually generates promo codes for redeeming codes for gift cards on Amazon. One can use these codes to get real Amazon gift cards. Although the possibility of working these codes is unknown. And these codes are valid for a very small amount of time.  · First, go to the Amazon Gift Card Code Generator page. Choose the gift card amount and get your code without any survey. Select Device, Country, and Click on Generate button as shown in the. Amazon code generator is both simple and allowed to utilize the tool. It's possible to create the boundless quantity of gift card codes utilizing this generator.\n\namazon gift card code generator + checker, amazon gift card code generator reddit, amazon gift card code generator 2021, amazon gift card code generator site, amazon gift card code generator no verification, amazon gift card code generator no human verification, amazon gift card code generator free, amazon gift card code generator 2022, amazon gift card code generator apk, amazon gift card code generator 2020, amazon gift card code generator india 2020, amazon gift card code generator india 2021, amazon gift card code generator india, real amazon gift card code generator, 100 amazon gift card code generator, amazon gift card code generator crack, amazon gift card claim code generator, amazon.com gift card code generator, amazon.ca gift card code generator, how to use amazon gift card generator, is amazon gift card generator real, amazon gift card code generator download for pc, amazon gift card code generator download, free amazon gift card code generator download, amazon gift card code generator free download no survey, 50 dollar amazon gift card code generator, gift card code generator amazon, amazon gift card code generator v.3.2.exe serial key, amazon gift card code generator fake, free amazon gift card code generator no download, free amazon gift card code generator hack, free amazon gift card code generator 2021, free amazon gift card code generator no human verification, get free amazon gift card code generator, how to get free amazon gift card codes, how to get free redeem code for amazon, how to get a free 1000 amazon gift card, amazon gift card generator code, amazon gift card code generator without human verification, amazon gift card generator hack code, amazon gift card code generator no survey no human verification, free amazon gift card code generator online no human verification, amazon.in gift card code generator, amazon gift cards codes generator, amazon gift card free code generator, amazon gift card code generator with money, how to generate amazon gift card code, how to get a $100 amazon gift card for free, how to get $10 amazon gift card, amazon gift card codes generator, free online amazon gift card code generator, amazon gift card code generator no survey, free amazon gift card code generator no survey, amazon uk gift card code generator no survey, amazon gift card code generator online no download no survey, amazon gift card code generator online, free amazon gift card code generator online tool, how to get free amazon gift cards no surveys, online amazon gift card code, amazon gift card code generator pro, amazon ",
  "id": "_Amazon-Gift-Card-Code-Generator-Working-2022-Version-dhx",
  "isPrerelease": false,
  "language": "en-US",
  "lastEdited": "2022-01-28T23:45:38.72Z",
  "listed": false,
  "packageHash": "YBDW3F29WdQmJJXk/E83spdM0OR6i9fTT6e/dZ/I01uZBrCMt2RPrfnHoivGqQraslstrXmrLrf/7Wy6KnOc8Q==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 11352,
  "published": "1900-01-01T00:00:00Z",
  "requireLicenseAcceptance": false,
  "title": "_Amazon-Gift-Card-Code-Generator-Working-2022-Version-dhx",
  "verbatimVersion": "4.7.51",
  "version": "4.7.51",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.28.23.58.17/_amazon-gift-card-code-generator-working-2022-version-dhx.4.7.51.json#yxixptcnxj.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1221,
      "fullName": "yxixptcnxj.nuspec",
      "length": 4487,
      "name": "yxixptcnxj.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.28.23.58.17/_amazon-gift-card-code-generator-working-2022-version-dhx.4.7.51.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9471,
      "fullName": ".signature.p7s",
      "length": 9471,
      "name": ".signature.p7s"
    }
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}