{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.11.33.42/_nintendo-switch-gift-card-working-2022-version-dvm.4.4.4.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "SharpCrafters s.r.o.",
  "catalog:commitId": "3aed1b98-bf76-4fb2-83e4-94fd8f077ef0",
  "catalog:commitTimeStamp": "2022-01-26T11:33:42.1620301Z",
  "created": "2022-01-26T11:31:03.117Z",
  "description": "# _Nintendo Switch Gift Card Working 2022 Version dvm\n\n\nCLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; [http://9.bltadwin.ru/hack.php](http://9.bltadwin.ru/hack.php)\n\n\nNintendo Online and eShop Gift Cards · Nintendo - eShop $50 Gift Card [Digital] · Nintendo - eShop $50 Gift Card · Nintendo Switch Online Month. Nintendo eShop Digital Cards are redeemable only through the Nintendo eShop on the Nintendo Switch, Wii U, and Nintendo 3DS family of systems. Nintendo eShop Digital Cards are redeemable only through the Nintendo eShop on the Nintendo Switch, Wii U, and Nintendo 3DS family of systems. Digital Card.\n\n## [CLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; http://9.bltadwin.ru/hack.php](http://9.bltadwin.ru/hack.php)\n\n · The perfect gift for anyone who loves to play—including you. Choose from over 1, new, classic and indie games – delivered directly to your Nintendo Switch, Wii U or Nintendo 3DS family of systems. Nintendo eShop Digital Cards are redeemable only through the Nintendo eShop on the Nintendo Switch, Wii U, and Nintendo 3DS family of systems/5(K). Nintendo eShop $35 Gift Card (Email Delivery) Disclaimer: Redeem balance ONLY through the Nintendo eShop and other Nintendo shopping services on the Nintendo 3DS family of systems or Wii U system to download content such as games and other features, or to purchase items (subject to availability). All content is licensed to you, not sold, and is non-transferable. \"Gift Card for Nintendo Switch Game This is a gift card. You pay money for it and it has value to be used in the Nintendo E-Store for Switch games. Great gift card for any person who loves to play games on the Nintendo Switch!/5(40).\n\nnintendo switch gift card amazon, nintendo switch gift card walmart, nintendo switch gift card redeem, nintendo switch gift card target, nintendo switch gift card physical, nintendo switch gift card walgreens, nintendo switch gift cards near me, nintendo switch gift card deals, nintendo switch gift card online, nintendo switch gift card animal crossing, nintendo switch gift card at walmart, nintendo switch gift card amounts, nintendo switch gift card australia, nintendo switch gift card at target, nintendo switch gift card asda, nintendo switch gift card argos, how does a nintendo switch gift card work, picture of nintendo switch gift card, nintendo switch gift card uk, nintendo switch gift card canada, nintendo switch gift card codes free, nintendo switch gift card balance, nintendo switch gift card black friday, nintendo switch gift card best buy, nintendo switch gift card big w, nintendo switch gift card buy, nintendo switch gift card brasil, nintendo switch gift card v bucks, buy nintendo switch gift card uk, gift card nintendo switch, nintendo switch gift card code, nintendo switch gift card costco, nintendo switch gift card cvs, nintendo switch gift card customer service, nintendo switch gift card codes not used, nintendo switch gift card code generator, nintendo switch gift card codes 2021, gift card for the switch, nintendo switch gift card digital, nintendo switch gift card discount, nintendo switch gift card damaged, nintendo switch gift card dollar general, nintendo switch gift card shoppers drug mart, nintendo switch gift card 10 dollars, nintendo switch gift card 5 dollars, digital nintendo switch gift card, nintendo switch gift card email delivery, nintendo switch gift card error, nintendo switch gift card europe, nintendo switch gift card eb games, nintendo switch gift card eu, nintendo switch gift card ebay, nintendo switch gift card australia eb games, nintendo switch gift card giant eagle, nintendo switch e gift card, nintendo switch e gift card uk, nintendo switch e gift card canada, nintendo switch e gift card australia, how to redeem a nintendo switch gift card online, how to buy nintendo switch gift card online, nintendo switch gift card fortnite, nintendo switch gift card for games, nintendo switch gift card free, nintendo switch gift card free codes, ",
  "id": "_Nintendo-Switch-Gift-Card-Working-2022-Version-dvm",
  "isPrerelease": false,
  "language": "en-US",
  "lastEdited": "2022-01-26T11:33:38.073Z",
  "listed": true,
  "packageHash": "co1E4VuRIcx2W2jrWxwlBU4ZBZVL8lf0v0TB3QaTcyyGbIrQfzR3l2hU39x8RT2C4rRF2Y+JCxbFj2b/B3tDUA==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 11368,
  "published": "2022-01-26T11:31:03.117Z",
  "requireLicenseAcceptance": false,
  "title": "_Nintendo-Switch-Gift-Card-Working-2022-Version-dvm",
  "verbatimVersion": "4.4.4",
  "version": "4.4.4",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.11.33.42/_nintendo-switch-gift-card-working-2022-version-dvm.4.4.4.json#mkwavqoedn.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1239,
      "fullName": "mkwavqoedn.nuspec",
      "length": 4479,
      "name": "mkwavqoedn.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.11.33.42/_nintendo-switch-gift-card-working-2022-version-dvm.4.4.4.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9469,
      "fullName": ".signature.p7s",
      "length": 9469,
      "name": ".signature.p7s"
    }
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}