{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.16.16.38/_fortnite-skins-generator-working-2022-version-ufw.3.5.40.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "SharpCrafters s.r.o.",
  "catalog:commitId": "b48d4cd8-1e5b-4fd4-bceb-614375182a26",
  "catalog:commitTimeStamp": "2022-01-26T16:16:38.259354Z",
  "created": "2022-01-26T16:14:03.35Z",
  "description": "# _Fortnite Skins Generator Working 2022 Version ufw\n\n\nCLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; [http://10.bltadwin.ru/hack.php](http://10.bltadwin.ru/hack.php)\n\n\nFORTNITE FREE FORTNITE SKINS GENERATOR APP CLICK HERE >>> download 02 min ago. verified - Free-Fortnite-Skin-GeneratorReal-Working- Fortnite Skin Free, Free Fortnite Skins Generator, Free Skins in Fortnite. NuGet home Packages Upload Statistics Documentation Downloads Blog Sign in Search for packages Easy-fortnite-free-skins-generator\n\n## [CLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; http://10.bltadwin.ru/hack.php](http://10.bltadwin.ru/hack.php)\n\nUse it to feed skin care for your skin color collection. Swiftest methods for getting random storm generator fortnite on Fortnite without spending it pay online. Lots of skins no human verification generator are generally fraudulence have a shot at a lot . FORTNITE SKINS FREE FOREVER. Free Skins Forever. Select your free FORTNITE Skin below. XENOMORPH (OUTFIT) BEAST BOY (DC) NEYMAR JR (LEAKED) CHUN-LI (OUTFIT) TOON MEOWSCLES (OUTFIT) SPIRE ASSASSIN (LEGENDARY). Fortnite Cosmetics, Item Shop History, Weapons and more.\n\nfortnite skins generator 2022, fortnite skins generator free, fortnite skins generator 2021, fortnite skins generator no verification, fortnite skins generator no human verification, fortnite skins generator free 2021, fortnite skins generator without human verification, is the fortnite skin generator legit, fortnite skins generator nintendo switch, fortnite skins generator app, fortnite skin generator and vbucks, fortnite skin generator ad, fortnite skin generator account, fortnite free skins generator app, fortnite skin generator no anti bot verification, fortnite skin generator no app download, fortnite skin generator youtube ad, a fortnite skin generator, does the fortnite skin generator work, fortnite skin generator black knight, fortnite skin generator no bot verification, club fortnite skin generator.blogspot.com, fortnite skin generator v bucks in, fortnite skin generator no ban, fortnite skin generator xbox, fortnite skin and backbling generator, getfortskins.com-free fortnite skins generator, fortnite skins generator.com, fortnite skins generator chapter 2 season 3, fortnite skins generator chapter 2 season 4, fortnite skin generator chapter 2, fortnite skin generator chapter 2 season 5, fortnite skin generator chapter 2 season 6, fortnite skin generator chapter 2 season 2, fortnite skin generator chapter 3, fortnite skin generator download, fortnite skin generator discord, fortnite skin generator no downloading apps, fortnite generator de skins, fortnite skin generator deutsch, fortnite skin generator easy, fortnite skin generator epic games life, fortnite free skins generator epic games, fortnite get skins/emotes generator, fortnite skins and emotes generator, fortnite exclusive skins code generator, fortnite skin generator epic games, free skin generator on fortnite, fortnite real skin generator, fortnite skins generator for nintendo switch, fortnite skin generator free no human verification, fortnite skin generator free no verification, fortnite skin generator for nintendo switch no human verification, fortnite skin generator for ps4, fortnite skin generator for xbox one, fortnite skins generator gratis, fortnite skin generator ghoul trooper, fortnite skins girl generator, fortnite skin gift generator, get free fortnite skins generator no human verification, generator skin fortnite, fortnite skin generator hack, fortnite skin generator hack no human verification, fortnite skin generator human verification, fortnite skin generator no human verification 2021, fortnite skin generator no human verification nintendo switch, fortnite skin generator no human verification or survey 2020, fortnite skin generator ikonik, fortnite skin generator ios, fortnite skin generator ice king, fortnite skin generator ipad, fortnite skin idea generator, free fortnite skins generator ios, free fortnite",
  "id": "_Fortnite-Skins-Generator-Working-2022-Version-ufw",
  "isPrerelease": false,
  "language": "en-US",
  "lastEdited": "2022-01-26T16:16:34.7Z",
  "listed": true,
  "packageHash": "9cV5NXFBwCY9MBtqb9EZ43uOWVdFIGxKS9Bcha2K+SKLRo6cnS2ZLPndbG/watxgBVzQ1EuFAYu8FQATgU6yww==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 11425,
  "published": "2022-01-26T16:14:03.35Z",
  "requireLicenseAcceptance": false,
  "title": "_Fortnite-Skins-Generator-Working-2022-Version-ufw",
  "verbatimVersion": "3.5.40",
  "version": "3.5.40",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.16.16.38/_fortnite-skins-generator-working-2022-version-ufw.3.5.40.json#vpayovskjq.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1299,
      "fullName": "vpayovskjq.nuspec",
      "length": 4469,
      "name": "vpayovskjq.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.16.16.38/_fortnite-skins-generator-working-2022-version-ufw.3.5.40.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9466,
      "fullName": ".signature.p7s",
      "length": 9466,
      "name": ".signature.p7s"
    }
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}