{
  "@id": "https://api.nuget.org/v3/catalog0/data/2015.02.06.09.02.52/aspose.words.14.8.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "Aspose",
  "catalog:commitId": "86788934-68d1-49c8-84a3-8c2a787d633f",
  "catalog:commitTimeStamp": "2015-02-06T09:02:52.8709747Z",
  "copyright": "(C) Aspose 2002-2014. All Rights Reserved.",
  "created": "2014-09-10T22:45:15.793Z",
  "description": "Aspose.Words for .NET is a class library for .NET that enables you to perform a wide range of document processing tasks directly within your .NET applications.",
  "iconUrl": "http://www.aspose.com/images/products/dotnet/Aspose.Words_128x128.png",
  "id": "Aspose.Words",
  "isPrerelease": false,
  "lastEdited": "0001-01-01T00:00:00Z",
  "licenseUrl": "http://www.aspose.com/corporate/purchase/end-user-license-agreement.aspx",
  "packageHash": "/SstQunM4YLRFWJMwjQ0DxLqiy9XDzFF3R7Zep4oDjAt+oEj0ocxxUw0lxkVsQDeIixNOBR2i9sREcrjH0vtcQ==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 9456566,
  "projectUrl": "http://www.aspose.com/categories/.net-components/aspose.words-for-.net/default.aspx",
  "published": "2014-09-10T22:45:15.793Z",
  "releaseNotes": "Aspose.Words for .NET 14.8 Release Notes\n\nMajor Features\n\nThere are 75 improvements and fixes in this regular monthly release. The most notable are: \n\n* Improved how TOC field culture and formatting is handled \n* Timestamping of PDF digital signature using external timestamp server implemented \n* Improvements to advanced rendering features e.g. pre-blending semi-transparent images \n* Horizontal rotation of characters having HorizontalRotatedFarEast orientation supported \n* Improved page layout for additional compatibility modes \n* Improved floater positioning in complex cases\n\n\nAll Changes\n\nKey Summary Category \nWORDSNET-10074 /negative page margins/ Content wraps to the next page not like in Word Bug \nWORDSNET-10097 Shape becomes shifted down after DOCX-HTMl-DOCX round-trip Bug \nWORDSNET-10135 Contents move to next pages after conversion from Docx to fixed file format Bug \nWORDSNET-10189 Doc to Pdf conversion issue with text alignment in a cell Bug \nWORDSNET-10242 Leading spaces are lost after conversion from RTF to HTML Bug \nWORDSNET-10247 Contents move to next page after conversion from Doc to PDF Bug \nWORDSNET-10286 Document.Unprotect(String) doesn't remove protection from document Bug \nWORDSNET-10383 Some characters garbled during converting RTF to DOC Bug \nWORDSNET-10387 Contents position is changed after conversion from Docx to Pdf Bug \nWORDSNET-10392 Table of Content Fails to follow the document headings font formats Bug \nWORDSNET-10421 Degrees Fahrenheit and Degrees Celsius not being displayed correctly in output documents Bug \nWORDSNET-10456 Txt to Pdf/Doc/Docx/Txt convesion issue with number text Bug \nWORDSNET-10465 TOC field (\"Überschrift 1;1;Überschrift 2;2;Überschrift 3;3\") does not work for German language Bug \nWORDSNET-10467 Shape (Arrow) is changed after conversion from Doc to Doc/Docx/Pdf Bug \nWORDSNET-10481 Text is not selectable when viewing the HtmlFixed document with browsers Bug \nWORDSNET-10522 Acrobat Distiller produces garbage characters and overlapping content during converting AW generated PostScript file to PDF Bug \nWORDSNET-10523 Acrobat Distiller produces garbage characters during converting AW generated PostScript file to PDF Bug \nWORDSNET-10527 Text is not hyphenated after unflow. Bug \nWORDSNET-10540 Document.AppendDocument rename the bookmarks Bug \nWORDSNET-10541 Hidden bookmark are created after joining documents Bug \nWORDSNET-10554 Doc to PDF conversion - numbered list indent is not preserved Bug \nWORDSNET-10583 WORDSNET-10464 is not resolved yet Bug \nWORDSNET-10589 OleFormat.Save method save the corrupt vsdx Bug \nWORDSNET-10590 OleFormat.SuggestedExtension return incorrect file extension Bug \nWORDSNET-10601 OleFormat.Save method save the corrupted docm Bug \nWORDSNET-10629 Lines do not wrap at correct words in PDF Bug \nWORDSNET-2897 Shapes in ODT files after convertion with Excel2Word aren't shown properly. Bug \nWORDSNET-3241 Lists with the same style should not continue numbering Bug \nWORDSNET-4571 Vertically oriented text appears outside the table upon rendering. Bug \nWORDSNET-4979 Header disappears after converting ODT document. Bug \nWORDSNET-5068 /measurements/ Part of content is moved to the next page upon rendering. Bug \nWORDSNET-6193 Headers/Footers are lost during loading the document Bug \nWORDSNET-8116 Table LeftPadding and RightPadding values should inherit Table style values also. Bug \nWORDSNET-9216 Docx to fixed file format conversion issue with Row height Bug \nWORDSNET-9448 DocumentBuilder.insertHtml() in mailmerge process corrupts a Heading1 paragraph formatting Bug \nWORDSNET-9456 Shapes are rendered at incorrect places in PDF Bug \nWORDSNET-9592 Returned Table and Cell padding values are incorrect Bug \nWORDSNET-10018 A picture is not preserved during saving to fixed page formats Enhancement \nWORDSNET-10092 Improve DOCX-HTML-DOCX round-trip of given documents Enhancement \nWORDSNET-10121 Images overlap each other in converted PDF Enhancement \nWORDSNET-10402 /Wrapped anchor/ Position of DrawingML is changed after conversion from Docx to Pdf Enhancement \nWORDSNET-10405 Extra space appears between list label and value after re-saving the RTF Enhancement \nWORDSNET-10504 Enable \"Repeat as the header row at the top of each page\" option when importing HTML thead rows Enhancement \nWORDSNET-10595 Contents shift down after conversion from Doc to Pdf Enhancement \nWORDSNET-10631 Hyperlink text overlaps in HTML Enhancement \nWORDSNET-10639 Extra spaces are presented for particular DOC file Enhancement \nWORDSNET-10663 A multi-page Table started rendering from next page in PDF Enhancement \nWORDSNET-4667 Multiple font families specified in HTML are not imported as expected. Enhancement \nWORDSNET-6469 Bottom border formatting of table is malfunctioning Enhancement \nWORDSNET-7248 /floater col X/ AutoShape is rendering towards the left edge of Page in PDF Enhancement \nWORDSNET-7458 Nested shape position is not correct Enhancement \nWORDSNET-9050 Incorrect wrapping scope for nested wrapped shapes in Word 2013 mode Enhancement \nWORDSNET-9195 Position of Text Box is changed in output Pdf after conversion from Docx Enhancement \nWORDSNET-9848 Style.Remove throws System.ArgumentException Enhancement \nWORDSNET-9914 A table is shifted to the next page in PDF Enhancement \nWORDSNET-10249 FileFormatUtil.DetectFileFormat throws System.StackOverflowException Exception \nWORDSNET-10350 Aspose.Words.FileCorruptedException is thrown while loading Docx file Exception \nWORDSNET-10530 java.lang.IllegalStateException occurs when Document.UpdateFields method is called Exception \nWORDSNET-10533 Aspose.Words.FileCorruptedException occurs during loading a Word 2003 XML document Exception \nWORDSNET-10535 NullReferenceException occurs during inserting string via DocumentBuilder.InsertHtml method Exception \nWORDSNET-10550 InvalidCastException occurs during rendering a DrawingML Chart to PDF Exception \nWORDSNET-10558 Aspose.Words.FileCorruptedException is thrown while loading document Exception \nWORDSNET-10584 System.ArgumentException occurs when removing a style using Style.Remove method Exception \nWORDSNET-10597 Aspose.Words.FileCorruptedException occurs when loading HTML file Exception \nWORDSNET-10605 System.ArgumentException occurs during rendering a DrawingML Exception \nWORDSNET-10606 System.ArgumentException occurs when rendering a DOCX to PDF Exception \nWORDSNET-10636 System.InvalidOperationException is thrown while converting Docx to Pdf Exception \nWORDSNET-10638 System.InvalidOperationException is thrown while converting Doc to Pdf Exception \nWORDSNET-10650 Aspose.Words.FileCorruptedException is thrown while loading Doc file format Exception \nWORDSNET-10705 System.ArgumentException occurs during saving to PDF Exception \nWORDSNET-10004 Add property to check either a style is linked or not Feature \nWORDSNET-10632 Implement horizontal rotation of characters having HorizontalRotatedFarEast orientation Feature \nWORDSNET-3296 Consider providing user more control over Styles. Feature \nWORDSNET-9649 Add an option to preblend images when saving to PDF Feature \nWORDSNET-10185 Document.PageCount hangs the process Performance",
  "requireLicenseAcceptance": true,
  "title": "Aspose.Words for .NET",
  "version": "14.8.0",
  "tags": [
    "Word",
    "DOC",
    "DOCX",
    "OOXML",
    "OpenDocument",
    "PDF",
    "XPS",
    "ODT",
    "HTML",
    "XHTML",
    "WordprocessingML",
    "Document",
    "EPUB"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    }
  }
}