{
  "@id": "https://api.nuget.org/v3/catalog0/data/2015.02.07.07.55.46/aspose.pdf.9.9.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "Aspose",
  "catalog:commitId": "20c4c581-f816-4b17-bd7a-31e16e9003f4",
  "catalog:commitTimeStamp": "2015-02-07T07:55:46.0048096Z",
  "copyright": "©Aspose 2002-2014. All Rights Reserved.",
  "created": "2014-12-09T11:36:12.243Z",
  "description": "Aspose.Pdf for .NET is a PDF document creation and manipulation component that enables your .NET applications to read, write and manipulate existing PDF documents without using Adobe Acrobat. It also allows you to create forms and manage form fields embedded in a PDF document. This component is written in managed C# and it allows developers to add PDF creation and manipulation functionality to their Microsoft .NET applications (WinForms, ASP.NET and .NET Compact Framework).\n        Aspose.Pdf for .NET is affordable and offers an incredible wealth of features including PDF compression options; table creation and manipulation; support for graph objects; extensive hyperlink functionality; extended security controls; custom font handling; integration with data sources; add or remove bookmarks; create table of contents; add, update, delete attachments and annotations; import or export PDF form data; add, replace or remove text and images; split, concatenate, extract or inset pages; transform pages to image; print PDF documents and much more.",
  "iconUrl": "http://www.aspose.com/blogs/wp-content/uploads/2013/06/aspose-Pdf-for-net_100.png",
  "id": "Aspose.Pdf",
  "isPrerelease": false,
  "lastEdited": "0001-01-01T00:00:00Z",
  "licenseUrl": "http://www.aspose.com/corporate/purchase/end-user-license-agreement.aspx",
  "packageHash": "7Rt46lrLj7sztvsMzG4hdjS7ss9R4WQiPfBnXfn98Rx5aGjZek9mEtDfdTvJN4KbYQXdw3TLdkeGEPy2W2A62A==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 28758362,
  "projectUrl": "http://www.aspose.com/categories/.net-components/aspose.pdf-for-.net/default.aspx",
  "published": "2014-12-09T11:36:12.243Z",
  "releaseNotes": "This release introduces the features, enhancements and bug fixes as detailed below:\n\nNew Features\n\nPDFNEWNET-36614\tExtract text based on columns\nPDFNEWNET-37211\tIdentify if image in PDF is Colored or Black & White\nPDFNEWNET-36693\tExtract RawFormat from XImages from PDFDocument.Pages.Resources.Images\nPDFNEWNET-36338\tSetting Header/Footer once for new PDF document\nPDFNEWNET-37393\tIntegrate Imaging into Aspose.Pdf\nPDFNEWNET-37542\tExtract table borders as image\n\nEnhancements\n\nPDFNEWNET-37830\tImprove on-fly resources optimization\nPDFNEWNET-36469\tHow to set printer driver setting\nPDFNEWNET-37125\tXSL-FO to PDF - Font Name issue\n\nExceptions\n\nPDFNEWNET-37208\tFont not found exception when saving PDF document\nPDFNEWNET-37778\tException while loading PDF document\nPDFNEWNET-37768\tDocument() method throws ArgumentNullException\nPDFNEWNET-37825\tException while opening PDF document\nPDFNEWNET-37874\tMulti-column section followed by another section on same page crashes during save\nPDFNEWNET-37688\tOutOfMemory exception during PDF merge\nPDFNEWNET-34509\tXslLoadException during XML to PDF conversion\nPDFNEWNET-37627\tPDF to PDF/A - OutOfMemoryException during conversion\n\nBugs\n\nPDFNEWNET-37689 When trying to concatenate PDF files, the application hangs\nPDFNEWNET-37759 PDF to Image - Arrow of line Annotation is missing in resultant file\nPDFNEWNET-37252\tPDF to HTML - Transparent text loses its transparency after conversion\nPDFNEWNET-37341\tPDF to HTML: Incorrect output HTML-missing images\nPDFNEWNET-37789\tBorder appearance changes with zoom factor\nPDFNEWNET-37749\tText replace changes font face to Times New Roman\nPDFNEWNET-37748\tTextFragmentAbrober issue: Font of text is changed in output PDF file.\nPDFNEWNET-37819\tPDF Table cells rowspan not working, when page breaks\nPDFNEWNET-37851\tIncorrect text generated\nPDFNEWNET-37691\tMerging the pages of same PDF increases the resultant file size\nPDFNEWNET-37870 Old generator does not throws IOException on a locked file\nPDFNEWNET-37705 TextFragmentAbsorber getting incorrect position of text position and occurrences\nPDFNEWNET-34894\tTextFragmentAbsorber behaving abnormally\nPDFNEWNET-37527\tPDF to PNG: output image is too small\nPDFNEWNET-36142\tOptimizeResources(..) method is not reducing file size\nPDFNEWNET-30840\tIssue while adding Text to an existing PDF document\nPDFNEWNET-36181\tPDF to HTML - Hyperlink is removed in resultant file\nPDFNEWNET-37729\tImage object is returning inorrect resolution value\nPDFNEWNET-37875\tWhen adding Image to table cell and setting Image height, application hangs\nPDFNEWNET-37517\tPDF to HTML conversion throws OutOfMemoryException\nPDFNEWNET-35543\tText is printing with thicker lines\nPDFNEWNET-37790\tTables appearance issue\nPDFNEWNET-37826\tAdded footer overflowing the document\nPDFNEWNET-37359\tPDF to JPEG - page contents are distorted\nPDFNEWNET-37804\tTimeZone is removed from ModifyDate field\nPDFNEWNET-37692\tOptimizeResources() method makes PDF unreadable\nPDFNEWNET-37631\tPDF to TIFF - Euro sign mangled in output file\nPDFNEWNET-37816\tPDF to JPEG - Characters are incomplete on resultant image\nPDFNEWNET-37723\tFilling form with AutoFiller loses the javascript\nPDFNEWNET-37695\tImage count issue\nPDFNEWNET-37756\tError when Image field is flattened\nPDFNEWNET-37807\tPDF to PDFA: compliance failure\nPDFNEWNET-37774\tTOC expanding beyond one page resultants in incorrect hyperlinks\nPDFNEWNET-37344\tCheckbox field types don't always get checked in PDF\nPDFNEWNET-37755\tProblem concatenating PDF files using PdfFileEditor\nPDFNEWNET-37810\tPDF to JPEG: White rectangle instead of image's part\nPDFNEWNET-37750 Text replace increases space between letters\nPDFNEWNET-34894 TextFragmentAbsorber behaving abnormally\nPDFNEWNET-37419 PDF to XLS: Two columns merged into a single column",
  "requireLicenseAcceptance": true,
  "summary": "Aspose.Pdf for .NET is an amazing component which provides the feature to create and manipulate PDF documents.",
  "title": "Aspose.Pdf for .NET",
  "version": "9.9.0",
  "tags": [
    "Aspose.Pdf",
    "PDF",
    "XFA",
    "XPS",
    "TIFF",
    "PCL",
    "SVG",
    "HTML",
    "XML",
    "XSL-FO",
    "FDF",
    "XFDF",
    "PDF/A",
    "form",
    "Portfolio",
    "EPUB",
    "PSD",
    "to",
    "XLS",
    "DOC"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    }
  }
}