{
  "@id": "https://api.nuget.org/v3/catalog0/data/2016.02.03.21.54.30/aspose.words.16.1.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "Aspose",
  "catalog:commitId": "44b9a944-7681-4aaa-9fc0-070fc5958e80",
  "catalog:commitTimeStamp": "2016-02-03T21:54:30.8517655Z",
  "copyright": "(C) Aspose 2002-2016. All Rights Reserved.",
  "created": "2016-02-03T21:54:24.43Z",
  "description": "Aspose.Words for .NET is a class library for .NET that enables you to perform a wide range of document processing tasks directly within your .NET applications.",
  "iconUrl": "http://www.aspose.com/images/products/dotnet/Aspose.Words_128x128.png",
  "id": "Aspose.Words",
  "isPrerelease": false,
  "lastEdited": "0001-01-01T00:00:00Z",
  "licenseNames": "",
  "licenseReportUrl": "",
  "licenseUrl": "http://www.aspose.com/corporate/purchase/end-user-license-agreement.aspx",
  "listed": true,
  "packageHash": "Y5arbMI89Drt2z2SB8uSwZ3ZEuiRBOYeQTSHALxumFMMTOwvqikfXpiZNpLtZkR8gMabLAXRMl5M/tUu/K+35g==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 21229240,
  "projectUrl": "http://www.aspose.com/categories/.net-components/aspose.words-for-.net/default.aspx",
  "published": "2016-02-03T21:54:24.43Z",
  "releaseNotes": "Aspose.Words for .NET 16.1 Release Notes\n\n\nMajor Features\n\nThere are 133 improvements and fixes in this regular monthly release. The most notable are:\n\n* Implemented auto-fit table grid calculation for several classes of tables\n* EMF+ images now can be rendered without the GDI+ \n* Comments rendering improved\n* Word 6.0 binary DOC files are supported now\n* Added public methods for inserting signature lines\n* Added ability to configure document hyphenation options\n* Added capability to get mail merge regions hierarchy\n* Added more public classes and methods to work with fields in a document\n* Font sources can now be specified for each document instance\n* Implemented line counting (Document.BuiltInDocumentProperties.Lines)\n\n\nAll Changes\n\nKey\tSummary\tCategory\nWORDSNET-10588\tText is overlapped after conversion from Docx to Pdf\tBug\nWORDSNET-11410\tInserting one document into another causes indent issue\tBug\nWORDSNET-11532\tODT to Pdf conversion issue with frame layout\tBug\nWORDSNET-11953\tBuiltInDocumentProperties.Lines returns incorrect number of lines\tBug\nWORDSNET-12017\t/noExtraLineSpacing + suppressBottomSpacing/ Word Compatibility Options lost when creating PDF\tBug\nWORDSNET-12235\tContent cutting from left edge, Table disappears from top and unwanted rows appear in PDF\tBug\nWORDSNET-12291\t/noExtraLineSpacing + suppressBottomSpacing/ Docx to Pdf conversion issue with text position\tBug\nWORDSNET-12415\tRTF to Html conversion issue with Shape's text\tBug\nWORDSNET-12493\t/FloaterList.GetIndexAtOrAfterComparer.IsThisOrder/ System.InvalidOperationException during saving to PDF\tBug\nWORDSNET-12546\tHeaderFooter contents are not exported to Html\tBug\nWORDSNET-12602\tMailMerge.CleanupOptions change TOC into Hyperlink fields\tBug\nWORDSNET-12615\tAspose.Words loads text with two fonts into one Run\tBug\nWORDSNET-12632\tTestDefect3873 contrast sidebar is rendered incorrectly.\tBug\nWORDSNET-12633\tTestDefect3873 shadow size is incorrect\tBug\nWORDSNET-12657\tTable header row truncates in PDF\tBug\nWORDSNET-12665\tImage Shadow lost during open/save a RTF\tBug\nWORDSNET-12676\tShape size is different in output RTF and Docx\tBug\nWORDSNET-12681\tPosition of shapes are changed in output Pdf\tBug\nWORDSNET-12737\tNewline characters inside URLs prevent HTML import from loading resources\tBug\nWORDSNET-12749\tContent moves to previous page and behind picture in PDF\tBug\nWORDSNET-12752\tUnable to open cloned document in MS Office\tBug\nWORDSNET-12757\tSet ShapeBase.HRef to empty string does not remove hyperlink\tBug\nWORDSNET-12796\tIncorrect series interval values in charts in exported HTML\tBug\nWORDSNET-12797\tIncorrect series interval values and Primary and Secondary vertical Axis Titles are replaced in charts in exported HTML\tBug\nWORDSNET-12829\tIncorrect inline shape width returned by ActualBounds\tBug\nWORDSNET-12837\tIncorrect font on wml to docx conversion\tBug\nWORDSNET-12838\tIncorrect spacing after paragraph on wml to docx conversion\tBug\nWORDSNET-12851\tRtf to Pdf conversion issue with font rendering\tBug\nWORDSNET-12885\tTable header getting truncated in the output PDF\tBug\nWORDSNET-12888\tShape (text) rotation is lost after conversion from Docx to Pdf\tBug\nWORDSNET-12896\tChines text overlaps in same paragraph in output HtmlFixed\tBug\nWORDSNET-12905\tUpdateFields produces TOC that is different to Word\tBug\nWORDSNET-12906\tDocx to Doc/Pdf conversion issue with Vertical axis of chart\tBug\nWORDSNET-12907\tHorizontal axis of chart are changed after saving Docx to Doc/Pdf\tBug\nWORDSNET-12915\tPosition of Korean text is changed in output Pdf\tBug\nWORDSNET-12924\tHtml to Docx/Pdf conversion issue with text rendering\tBug\nWORDSNET-12926\tSystem.InvalidOperationException in GetStartPageIndex\tBug\nWORDSNET-12936\tShape.SizeInPoints changes on GetShapeRenderer() call\tBug\nWORDSNET-12940\tContent is scattered in Aspose.Words generated DOC\tBug\nWORDSNET-12941\t/FloaterList.GetIndexAtOrAfterComparer.IsThisOrder/ Aspose.Words generates a corrupt PDF file\tBug\nWORDSNET-12953\tText effect is lost after conversion from Docx to HtmlFixed\tBug\nWORDSNET-12955\tDocument.WarningCallback returns incorrect output\tBug\nWORDSNET-12959\tTable's row width is increased after removing another row\tBug\nWORDSNET-12999\t/noExtraLineSpacing/ Docx to Pdf conversion issue with text position according to line numbers\tBug\nWORDSNET-13007\tPage numbers are not visible after DOCM to PDF\tBug\nWORDSNET-3238\tIncorrect behaviour for text:start-value attribute of list item\tBug\nWORDSNET-3447\tFont is changed during open/save.\tBug\nWORDSNET-6439\tComments are rendering incorrectly in PDF\tBug\nWORDSNET-6703\tDoc to ePub conversion, incorrect output\tBug\nWORDSNET-10909\tBuiltInDocumentProperties.Lines return incorrect value\tEnhancement\nWORDSNET-11686\tDisplay warnings for fonts replaced using FontSettings.addFontSubstitutes\tEnhancement\nWORDSNET-12166\tA big negative value of 'margin-left' causes image part hiding after exporting from DOCX to HTML.\tEnhancement\nWORDSNET-12557\tImproper Restriction of XML External Entity Reference (XXE).\tEnhancement\nWORDSNET-12883\tTables misaligned in rendered PDF\tEnhancement\nWORDSNET-12930\tEnhancement in WORDSNET-1432\tEnhancement\nWORDSNET-5394\tConsider providing Aspose.Words.dll built for .NET 4.0\tEnhancement\nWORDSNET-9240\tTable column widths are calculated incorrectly during rendering\tEnhancement\nWORDSNET-11687\t/pre-word97/ Support reading for Word6.0/Word95 documents.\tException\nWORDSNET-12504\t/FloaterList.GetIndexAtOrAfterComparer.IsThisOrder/ System.InvalidOperationException is thrown while saving Doc to image/pdf\tException\nWORDSNET-12578\t/FloaterList.GetIndexAtOrAfterComparer.IsThisOrder/ Document.PageCount throws System.InvalidOperationException\tException\nWORDSNET-12689\tDocument.Save throws System.NullReferenceException\tException\nWORDSNET-12762\tAspose.Words.FileCorruptedException occurs upon loading a DOCX\tException\nWORDSNET-12822\t/FloaterList.GetIndexAtOrAfterComparer.IsThisOrder/ Document.PageCount throws System.InvalidOperationException\tException\nWORDSNET-12842\tAspose.Words.FileCorruptedException occurs upon loading a DOCX\tException\nWORDSNET-12880\tNullReferenceException occurs when saving to PDF\tException\nWORDSNET-12881\tSystem.OutOfMemoryException during DOCX to PDF conversion\tException\nWORDSNET-12889\tAspose.Words.FileCorruptedException occurs upon loading a DOC\tException\nWORDSNET-12890\tSystem.ArgumentOutOfRangeException occurs during open/save a DOCX\tException\nWORDSNET-12902\tSystem.ArgumentOutOfRangeException occurs during rendering to PDF\tException\nWORDSNET-12910\tSystem.IndexOutOfRangeException occurs during rendering to PDF\tException\nWORDSNET-12911\tSystem.ArgumentOutOfRangeException occurs during rendering to PDF\tException\nWORDSNET-12913\tSystem.ArgumentOutOfRangeException occurs during rendering to PDF\tException\nWORDSNET-12914\tSystem.ArgumentOutOfRangeException occurs during rendering to PDF\tException\nWORDSNET-12928\tDocument.UpdatePageLayout throws System.ArgumentOutOfRangeException\tException\nWORDSNET-12931\tDocument.Save throws System.ArgumentOutOfRangeException while saving Docx to Doc/Pdf\tException\nWORDSNET-12957\tSystem.NullReferenceException is thrown while saving Docx to Pdf\tException\nWORDSNET-12966\tSystem.ArgumentOutOfRangeException is thrown while re-saving Docx\tException\nWORDSNET-12988\t/FloaterList.GetIndexAtOrAfterComparer.IsThisOrder/ Document.GetPageInfo throws System.InvalidOperationException\tException\nWORDSNET-12992\tSystem.ArgumentOutOfRangeException occurs during rendering to PDF\tException\nWORDSNET-13000\tSystem.ArgumentOutOfRangeException occurs during rendering to PDF\tException\nWORDSNET-10186\tTable column widths are calculated incorrectly during rendering\tFeature\nWORDSNET-10366\tTable nested inside SDT is not rendering correctly in fixed page formats\tFeature\nWORDSNET-10534\tReduction of vertical spacing between two Tables results in incorrect Document.PageCount value\tFeature\nWORDSNET-10609\tTable width calculation problem in PDF\tFeature\nWORDSNET-10694\tFormatting of table is lost after conversion from Docx to Pdf\tFeature\nWORDSNET-10852\tDocument.PageCount returns wrong value\tFeature\nWORDSNET-10926\tWhen changing the page layout, table in footer is not resizing in PDF\tFeature\nWORDSNET-10978\tAdd feature to import font properties from based on style when font properties are not defined\tFeature\nWORDSNET-10983\tStructuredDocumentTag is missing after conversion from Docx to Pdf\tFeature\nWORDSNET-11007\tTable does not render correctly in output Pdf file\tFeature\nWORDSNET-11208\tSupport signature line (not digital signature) in Word documents\tFeature\nWORDSNET-11349\tDifferent Word and PDF output when table auto fit is set to true\tFeature\nWORDSNET-11368\tAdd option in HtmlFixedSaveOptions to export FORMCHECKBOX as [input type=\"checkbox\"]\tFeature\nWORDSNET-11375\tAdd option in HtmlFixedSaveOptions to export FORMDROPDOWN into select, option tags\tFeature\nWORDSNET-11746\t/pre-word97/ Support pre-Word97 format\tFeature\nWORDSNET-11801\tProvide way to use Aspose' hyphenation functionality when no input document is involved\tFeature\nWORDSNET-11835\tDoc to Pdf conversion issue with Cell's text rendering\tFeature\nWORDSNET-12006\tIncorrect table width in PDF saved from DOCX\tFeature\nWORDSNET-12045\tProvide option to check document for automatic hyphenation\tFeature\nWORDSNET-12058\tText overlaps the Shape while saving docx to pdf\tFeature\nWORDSNET-12115\tImplement public fields API v2.0 (add support for building arbitrary fields and field arguments)\tFeature\nWORDSNET-12143\tMyriadPro font not rendered correctly in output EMF\tFeature\nWORDSNET-12309\tSupport merge fields' table hierarchy as XML node\tFeature\nWORDSNET-12321\tAllow to specify font sources per document\tFeature\nWORDSNET-12443\tTable header does not render correctly in output Pdf\tFeature\nWORDSNET-12738\tAdd feature to preserve mustache tags if field is not used\tFeature\nWORDSNET-12945\tAdd to public fields API \"RemoveFormField\" method\tFeature\nWORDSNET-12960\tCell's width is changed in output Pdf\tFeature\nWORDSNET-12967\tAdd to public API feature to replace mustache tags with corresponding merge fields\tFeature\nWORDSNET-1570\tImport floating objects from HTML\tFeature\nWORDSNET-2338\tAllow enabling “Auto Hyphenate” option on a document.\tFeature\nWORDSNET-253\tAdd capability to replace hyperlinks with other ones\tFeature\nWORDSNET-2726\tOne table column is missed upon rendering.\tFeature\nWORDSNET-3334\tTable width in multicolumn document is incorrect upon rendering\tFeature\nWORDSNET-3881\t/pre-word97/ Support loading pre-Word97 format\tFeature\nWORDSNET-427\tAllow retrieving merge field names for a particular region.\tFeature\nWORDSNET-4464\tLarge pictures it table are truncated at right.\tFeature\nWORDSNET-4499\tUpdate Barcode fields\tFeature\nWORDSNET-4694\tTable narrows when rendering to pdf.\tFeature\nWORDSNET-5193\tWidth of table is incorrect, when width is specified in percents.\tFeature\nWORDSNET-6242\tTable cells are not wide enough, causing the text to wrap incorrectly.\tFeature\nWORDSNET-6670\tVertical text position in TextBox becomes Horizontal during rendering\tFeature\nWORDSNET-7496\tWidths of cells and tables are not correct in PNG\tFeature\nWORDSNET-7739\tTable does not resize itself when rendered to fixed formats\tFeature\nWORDSNET-8014\tTable width is incorrect in PDF\tFeature\nWORDSNET-8317\tWord to PDF issue with table rendering, the table gets squeezed\tFeature\nWORDSNET-9330\tTable column widths are calculated incorrectly during rendering\tFeature\nWORDSNET-9344\tText overlap after conversion from Docx to Pdf\tFeature\nWORDSNET-9557\tTable column widths are calculated incorrectly during rendering\tFeature\nWORDSNET-5092\tFull document traverse for each seq field degrades UpdateFields() performance.\tPerformance\nWORDSNET-12830\tRTF to Doc/Docx/Pdf conversion issue with content position\tRegression\nWORDSNET-12886\tFont size not preserved during open/save a RTF\tRegression\nWORDSNET-12944\tAspose.Words.FileCorruptedException is thrown while loading RTF\tRegression",
  "requireLicenseAcceptance": true,
  "title": "Aspose.Words for .NET",
  "verbatimVersion": "16.1.0",
  "version": "16.1.0",
  "tags": [
    "Word",
    "DOC",
    "DOCX",
    "OOXML",
    "OpenDocument",
    "PDF",
    "XPS",
    "ODT",
    "HTML",
    "XHTML",
    "WordprocessingML",
    "Document",
    "EPUB"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    }
  }
}