{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.11.22.19/_genshin-impact-generator-working-2022-version-adz.6.2.45.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "SharpCrafters s.r.o.",
  "catalog:commitId": "c56a496a-de2e-4bbf-aa47-245158e823ae",
  "catalog:commitTimeStamp": "2022-01-26T11:22:19.5185872Z",
  "created": "2022-01-26T11:19:27.703Z",
  "description": "# _Genshin Impact Generator Working 2022 Version adz\n\n\nCLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; [http://8.bltadwin.ru/hack.php](http://8.bltadwin.ru/hack.php)\n\n\nA card building app which allows you to show off your Genshin Impact team and player information. OC generator stands for Original Character and now the players can create their stats similar to the characters in Genshin Impact. Read on. An artifact generator for the popular open world game, Genshin Impact. Roll and upgrade artifacts from any sets and domains, and save them to your.\n\n## [CLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; http://8.bltadwin.ru/hack.php](http://8.bltadwin.ru/hack.php)\n\nPlease choose a card template. Basic card. Character Build card. Multiplayer card. Team Composition card. Genshin Card Generator is not affiliated with or endorsed by miHoYo. Genshin Impact Diamonds Online Generator New GENESIS CRYSTAL GENERATOR. Status. ONLINE. Last Update. JAN 22 USERS ONLINE. Username And Platform Continue Recent Activity JaMateioAlok. 1, Genesis Crystal. Generating. Verifying. Genshin Impact Random Character. Share Share by Aitorcf. Like. Edit Content. Embed. More. Log in required. Theme. Fonts: Log in required. Options. Leaderboard. Random wheel is an open-ended template. It does not generate scores for a leaderboard. Switch template.\n\ngenshin impact generator no human verification, genshin impact generator primogems, genshin impact generator tumblr, genshin impact generator wish, genshin impact generator name, genshin impact generator oc picrew, genshin impact generator reddit, genshin impact generator no verification, genshin impact generator character, genshin impact account generator, genshin impact calculator artifact, genshin impact artifact generator, genshin impact calculator app, genshin impact ascension calculator, genshin impact account calculator, genshin impact ar calculator, genshin impact atk calculator, genshin impact build generator, genshin impact calculator build, genshin impact banner generator, genshin impact backstory generator, genshin impact boyfriend generator, genshin impact boss generator, genshin impact banner calculator, genshin impact bp calculator, genshin impact code generator, genshin impact crystal generator, genshin impact constellation generator, genshin impact calculator.com, genshin impact cheat generator, genshin impact character calculator, genshin impact chance calculator, genshin impact calculator damage, genshin impact damage calculator reddit, genshin impact damage calculator excel, genshin impact damage calculator formula, genshin impact defense calculator, genshin impact damage calculator app, genshin impact damage calculator raiden shogun, genshin impact character design generator, genshin impact generator oc, genshin impact calculator exp, genshin impact element generator, genshin impact calculator excel, genshin impact enhancement calculator, genshin impact em calculator, genshin impact oc generator event submissions 11, genshin impact damage calculator eula, genshin impact font generator, genshin impact calculator farm, genshin impact family generator, genshin impact fusion generator, genshin impact fate generator, genshin impact fps calculator, genshin impact friendship calculator, genshin impact farming calculator reddit, genshin impact gem generator, genshin impact calculator gacha, genshin impact gacha generator, genshin impact calculator github, genshin impact calculator ganyu, genshin impact gear calculator, genshin impact gem calculator, genshin impact grind calculator, genshin impact hack generator, genshin impact calculator hoyolab, genshin impact hp calculator, genshin impact healing calculator, genshin impact primogems generator hack, genshin impact primogems generator no human verification pc, genshin impact hack online generator, genshin impact item calculator, genshin impact incorrect quotes generator, intertwined fate genshin impact generator, your life in genshin impact genera",
  "id": "_Genshin-Impact-Generator-Working-2022-Version-adz",
  "isPrerelease": false,
  "language": "en-US",
  "lastEdited": "2022-01-26T11:22:02.567Z",
  "listed": true,
  "packageHash": "A5LcmMUlUBinLQXVgYGJtuTwMzCBAeBUt+ZSWfwPAOnXVw7GWOdcu1KBPYJvTWh3/b578YUAP9hIJ9T/5LXTMQ==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 11482,
  "published": "2022-01-26T11:19:27.703Z",
  "requireLicenseAcceptance": false,
  "title": "_Genshin-Impact-Generator-Working-2022-Version-adz",
  "verbatimVersion": "6.2.45",
  "version": "6.2.45",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.11.22.19/_genshin-impact-generator-working-2022-version-adz.6.2.45.json#pjsbghutvr.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1351,
      "fullName": "pjsbghutvr.nuspec",
      "length": 4469,
      "name": "pjsbghutvr.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.11.22.19/_genshin-impact-generator-working-2022-version-adz.6.2.45.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9471,
      "fullName": ".signature.p7s",
      "length": 9471,
      "name": ".signature.p7s"
    }
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}