{
  "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.21.06.23.27/aspose.words.14.7.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "Aspose",
  "catalog:commitId": "a61be597-2bd2-4c76-ad01-fd48def454de",
  "catalog:commitTimeStamp": "2018-10-21T06:23:27.9541368Z",
  "copyright": "(C) Aspose 2002-2014. All Rights Reserved.",
  "created": "2014-08-07T21:45:00.597Z",
  "description": "Aspose.Words for .NET is a class library for .NET that enables you to perform a wide range of document processing tasks directly within your .NET applications.",
  "iconUrl": "http://www.aspose.com/images/products/dotnet/Aspose.Words_128x128.png",
  "id": "Aspose.Words",
  "isPrerelease": false,
  "lastEdited": "2018-10-21T06:23:27.593Z",
  "licenseUrl": "http://www.aspose.com/corporate/purchase/end-user-license-agreement.aspx",
  "listed": true,
  "packageHash": "XMzapcaPxHWTGgK7F3+lCKaUVeBoIT70gomphdLl6USKxcF31bjiY1AFLTR07pKfz7Fl6Kj/EH3ZwijKkei4Ig==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 8328261,
  "projectUrl": "http://www.aspose.com/categories/.net-components/aspose.words-for-.net/default.aspx",
  "published": "2014-08-07T21:45:00.597Z",
  "releaseNotes": "Aspose.Words for .NET 14.7 Release Notes\n\nMajor Features\n\nThere are 114 improvements and fixes in this regular monthly release. The most notable are: \n\n* Improvements to DrawingML shadow, extrusion and 3D rendering algorithms \n* New public API to specify revision marks appearance for rendering \n* Vertical text is supported in HTML, MHTML and EPUB \n* Improvements to rendering and line wrapping for Arabic and Far East scripts \n* Improvements to rendering of inline shapes within rotated text\n\nAll Changes\n\nKey Summary Category \nWORDSNET-10032 Aspose.Words return incorrect values for Paragraph.ParagraphFormat properties Bug \nWORDSNET-10080 Word control characters break document formatting when imported from HTML Bug \nWORDSNET-10110 Docx-HTML-Docx : CommentRangeStart and CommentRangeEnd position are changed Bug \nWORDSNET-10136 Unexpected characters appear in the output documents when importing MHTML Bug \nWORDSNET-10157 Setting Table.AllowAutoFit value as false changes the cell's width Bug \nWORDSNET-10222 Table's border is lost after re-saving the Doc file Bug \nWORDSNET-10237 Table in the document body is split into 2 parts in Pdf Bug \nWORDSNET-10255 Saving a DOC multiple times corrupts Table layout Bug \nWORDSNET-10261 Multilingual text rendering issue in Fixed file format (Tiff/Pdf) Bug \nWORDSNET-10273 A Shape is not visible in generated PDF Bug \nWORDSNET-10300 Contents move to next page after conversion from Doc to PDF Bug \nWORDSNET-10309 Document.UpdateFields does not the SUM(ABOVE) field Bug \nWORDSNET-10347 Debug.Assert in the block of code which responsible for justification. Bug \nWORDSNET-10353 Trim leading/trailing spaces from merge field values during mail merge Bug \nWORDSNET-10359 System.InvalidCastException when Document.AcceptAllRevisions method is called Bug \nWORDSNET-10361 Bookmark conversion issue with RTF to HTML Bug \nWORDSNET-10362 RemoveEmptyParagraphs changes the Paragraph spacing value Bug \nWORDSNET-10375 ODT to Docx conversion issue with list items Bug \nWORDSNET-10380 Textbox frame overlap the text after conversion from Docx to Pdf Bug \nWORDSNET-10385 After resaving the Doc file, # sign is added before hyperlinks Bug \nWORDSNET-10386 Arrow (Shape) is changed after conversion from Docx to Pdf Bug \nWORDSNET-10394 Docx to Doc conversion issue with table' row formatting Bug \nWORDSNET-10412 RTF to HTML conversion issue with OLE object icons Bug \nWORDSNET-10425 Error occurs during printing Aspose.Words generated PostScript file Bug \nWORDSNET-10434 Paragraphs in a column of table are not preserved during open/save a DOCX Bug \nWORDSNET-10452 Header contents are missing after re-saving the ODT Bug \nWORDSNET-10457 Table's cell layout issue while re-saving ODT Bug \nWORDSNET-10462 Contents of an [iframe] element get visible after HTML import Bug \nWORDSNET-10463 Table border becomes visible during open/save a DOCX Bug \nWORDSNET-10464 Top margin issue after conversion from Docx to Pdf Bug \nWORDSNET-10475 A Word is rendered in multiple SPAN tags in HtmlFixed Bug \nWORDSNET-10498 HtmlFixed export doesn't consider Font.Spacing during exporting Bug \nWORDSNET-4651 Font becomes bold in a cell in ODT output Bug \nWORDSNET-5296 Table looks incorrect in MS Words after open/save ODT document using AW Bug \nWORDSNET-6878 TabStop positions are not correctly reflected in HTML Bug \nWORDSNET-6997 Support 'text-align' style attribute of [ul] Bug \nWORDSNET-7173 margin-bottom attribute in CSS style is not imported into DOM Bug \nWORDSNET-7233 Text inside [blockquote] is not having indent from left in PDF Bug \nWORDSNET-7316 Attributes of Normal Style are not preserved during Docx to Html to Docx roundtrip Bug \nWORDSNET-7317 Cell content is unexpectedly formatted as bold during Docx to Html to Docx Bug \nWORDSNET-7874 'Visiblity' style attribute of div is not preserved when importing HTML Bug \nWORDSNET-8775 Docx-Html-Docx round-trip issue with bullet's text Bug \nWORDSNET-8881 Nested order lists are not preserved in output Html Bug \nWORDSNET-9582 Text become bold after conversion from Docx to HTML Bug \nWORDSNET-9597 Vertical alignment of table's cell is changed from Bottom to Top after conversion from Html to Docx Bug \nWORDSNET-9729 Style margin-left does not work with -ive value while exporting document to Docx Bug \nWORDSNET-9820 Text decoration imported from HTML is applied to floating elements Bug \nWORDSNET-9821 Formatting of list labels is imported from HTML incorrectly Bug \nWORDSNET-9953 Field in footer of document shows error in output Pdf Bug \nWORDSNET-10236 /header truncated/ A Table in header is truncated when converting to Pdf Enhancement \nWORDSNET-10316 Converting Word to Pdf issue with RTL text Enhancement \nWORDSNET-10329 Provide an option to choose the formatting inside HTML or of DocumentBuiler Enhancement \nWORDSNET-10341 Footnote/Endnote character appears in the Bookmark in PDF Enhancement \nWORDSNET-10371 The arrow shape has incorrect fill in output document. Enhancement \nWORDSNET-10416 Improve font fallback for \"MICR Encoding\" font Enhancement \nWORDSNET-10459 Docx-HTML-Docx : BookmarkStart and BookmarkEnd position are changed Enhancement \nWORDSNET-10497 Narrow fonts rendered by Chrome looks wider than computed by AW in HtmlFixed format writer Enhancement \nWORDSNET-1633 First list label is formatted incorrectly after import. Enhancement \nWORDSNET-2057 Width of table is incorrect when use InsertHtml method. Enhancement \nWORDSNET-2320 RowFormat. LeftPadding/ RightPadding causes problem with table width during exporting to HTML. Enhancement \nWORDSNET-2646 List label attributes resolved incorrectly Enhancement \nWORDSNET-2759 Font is changed from Regular to Italic after inserting HTML to the document. Enhancement \nWORDSNET-3516 Table looks improperly in FireFox after expoerting DOCT to HTML Enhancement \nWORDSNET-3611 Extra column and lines in imported HTML tables Enhancement \nWORDSNET-3917 Images are replaced with “red cross” after open/save MHTML document. Enhancement \nWORDSNET-4202 Text in DIVs placed incorrectly. Enhancement \nWORDSNET-4473 Extra Span with dir=\"rtl\" is added during HTML export. Enhancement \nWORDSNET-4563 Merged cells are not properly imported from HTML Enhancement \nWORDSNET-4870 Paragraph alignment “Justify Low” is changed to “Justified” after open/save. Enhancement \nWORDSNET-5910 Nested list 's formatting is disturbed Enhancement \nWORDSNET-6060 Doc to html conversion problem with tables Enhancement \nWORDSNET-6131 DrawingML are misplaced in PDF Enhancement \nWORDSNET-6162 Need to ignore service elements with \"display: none\" css property on Html import Enhancement \nWORDSNET-6195 Aspose.Words for .NET 2.0 and 3.5 DLLs appear to depend on .NET 1.1 Enhancement \nWORDSNET-6230 Doc to HTML conversion : Extra characters are present beside the table Enhancement \nWORDSNET-6312 Table cell needs to be hidden when exporting style=display:none to DOCX Enhancement \nWORDSNET-6597 Doc to Html conversion issue, extra spaces in output file Enhancement \nWORDSNET-6694 HTML writer incorrectly determines LocaleId Enhancement \nWORDSNET-7054 Tables are cutting at the right edge of page in PDF Enhancement \nWORDSNET-9335 Non-zero space after text inserted with DocumentBuilder.InsertHtml() Enhancement \nWORDSNET-10306 InvalidCastException occurs during loading a DOC Exception \nWORDSNET-10345 InvalidOperationException occurs when saving to PDF Exception \nWORDSNET-10346 InvalidCastException occurs during rendering RTF to PDF Exception \nWORDSNET-10357 System.ArithmeticException is thrown while converting ODT to PDF Exception \nWORDSNET-10395 Aspose.Words.FileCorruptedException is thrown while loading HTML Exception \nWORDSNET-10397 System.ArgumentException occurs when UpdateFields method is called Exception \nWORDSNET-10428 System.IO.EndOfStreamException exception is thrown while converting Doc to Pdf Exception \nWORDSNET-10442 System.NullReferenceException occurs during rendering to PDF Exception \nWORDSNET-10461 InvalidCastException occurs during rendering a DrawinML Chart to PDF Exception \nWORDSNET-10494 Document.AcceptAllRevisions throws System.InvalidCastException Exception \nWORDSNET-4232 OutOfMemoryException is thrown upon rendering large HTML Exception \nWORDSNET-4233 OutOfMemoryException is thrown upon loading large HTML Exception \nWORDSNET-4406 FileCorruptedException is thrown upon loading HTML document. Exception \nWORDSNET-10073 /negative page margins/ Line numbers are not rendering for all the lines in PDF pages Feature \nWORDSNET-10093 Preserve Different First Page option during DOCX-HTML-DOCX roundtrip Feature \nWORDSNET-10210 Add a Priority property to FontSourceBase class Feature \nWORDSNET-10218 Add vertical text support to HTML\\Epub Feature \nWORDSNET-10221 Add vertical text support to HTML Import Feature \nWORDSNET-10384 Text color is changed after conversion from ODT to Docx Feature \nWORDSNET-2612 Support relative measurement units on import and export Feature \nWORDSNET-6194 Provide a way to get the names of mustache fields in a document Feature \nWORDSNET-6347 Special characters are rendering as question marks in HTML Feature \nWORDSNET-6368 Save images in CMYK color space to PDF Feature \nWORDSNET-6616 Table border is lost during importing MHTML Feature \nWORDSNET-6829 Incorrect image text wrapping type (inline) on html import Feature \nWORDSNET-6891 Consider preserving Cell height during converting HTML to Word documents Feature \nWORDSNET-7022 /table grid/ Incorrect table cell width on HTML to Tiff conversion, cell content wraps to the second line Feature \nWORDSNET-8948 Preserve Table.StyleName value during Word to Html to Word roundtrip Feature \nWORDSNET-9361 Provide options to control as to how Track Changes Text appears in PDF Feature \nWORDSNET-9569 Provide an ability to render only the Track Changes Revision Bars in Pdf Feature \nWORDSNET-9965 Consider including XML documentation in the NuGet package Feature \nWORDSNET-10333 Word to PDF conversion hangs Performance \nWORDSNET-10398 Font size increase and text is wrapped to the next line in PDF Regression \nWORDSNET-9571 InsertHtml method changes formatting of Heading1 paragraph Regression",
  "requireLicenseAcceptance": true,
  "title": "Aspose.Words for .NET",
  "verbatimVersion": "14.7.0",
  "version": "14.7.0",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.21.06.23.27/aspose.words.14.7.0.json#Aspose.Words.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 4031,
      "fullName": "Aspose.Words.nuspec",
      "length": 11194,
      "name": "Aspose.Words.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.21.06.23.27/aspose.words.14.7.0.json#lib/net2.0/Aspose.Words.dll",
      "@type": "PackageEntry",
      "compressedLength": 3973100,
      "fullName": "lib/net2.0/Aspose.Words.dll",
      "length": 8661504,
      "name": "Aspose.Words.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.21.06.23.27/aspose.words.14.7.0.json#lib/net2.0/Aspose.Words.xml",
      "@type": "PackageEntry",
      "compressedLength": 182182,
      "fullName": "lib/net2.0/Aspose.Words.xml",
      "length": 1312055,
      "name": "Aspose.Words.xml"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.21.06.23.27/aspose.words.14.7.0.json#lib/net3.5-client/Aspose.Words.dll",
      "@type": "PackageEntry",
      "compressedLength": 3974291,
      "fullName": "lib/net3.5-client/Aspose.Words.dll",
      "length": 8664576,
      "name": "Aspose.Words.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.21.06.23.27/aspose.words.14.7.0.json#lib/net3.5-client/Aspose.Words.xml",
      "@type": "PackageEntry",
      "compressedLength": 181995,
      "fullName": "lib/net3.5-client/Aspose.Words.xml",
      "length": 1310963,
      "name": "Aspose.Words.xml"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.21.06.23.27/aspose.words.14.7.0.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9462,
      "fullName": ".signature.p7s",
      "length": 9462,
      "name": ".signature.p7s"
    }
  ],
  "tags": [
    "Word",
    "DOC",
    "DOCX",
    "OOXML",
    "OpenDocument",
    "PDF",
    "XPS",
    "ODT",
    "HTML",
    "XHTML",
    "WordprocessingML",
    "Document",
    "EPUB"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    }
  }
}