{
  "@id": "https://api.nuget.org/v3/catalog0/data/2015.02.07.07.25.47/aspose.words.14.11.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "Aspose",
  "catalog:commitId": "a36b5eb8-cbf3-4aec-9200-76a329684dc9",
  "catalog:commitTimeStamp": "2015-02-07T07:25:47.4968852Z",
  "copyright": "(C) Aspose 2002-2014. All Rights Reserved.",
  "created": "2014-12-08T00:09:16.703Z",
  "description": "Aspose.Words for .NET is a class library for .NET that enables you to perform a wide range of document processing tasks directly within your .NET applications.",
  "iconUrl": "http://www.aspose.com/images/products/dotnet/Aspose.Words_128x128.png",
  "id": "Aspose.Words",
  "isPrerelease": false,
  "lastEdited": "0001-01-01T00:00:00Z",
  "licenseUrl": "http://www.aspose.com/corporate/purchase/end-user-license-agreement.aspx",
  "packageHash": "fIzoBfFtV9Jl1KiMGbFI6yxGzkEQ+dLebyu6FffEKdMwlnQg9m0gIqon7daMy+CiuiGieqhr8lWFFxbDqxdt7A==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 9760856,
  "projectUrl": "http://www.aspose.com/categories/.net-components/aspose.words-for-.net/default.aspx",
  "published": "2014-12-08T00:09:16.703Z",
  "releaseNotes": "Aspose.Words for .NET 14.11 Release Notes\n\n\nMajor Features\n\nThere are 96 improvements and fixes in this regular monthly release. The most notable are: \n\n* Improved clipping of text frames and computation of text wrapping bounds \n* Public API for controlling colors of Move revisions for rendering to fixed formats \n* DrawingML textboxes supported \n* Improvements to exporting of numbered and nested lists to HTML \n* Improved rendering of inline Office Math equations objects \n* DrawingML image rotation is now preserved while rendering to fixed page formats\n\n\nAll Changes\n\nKey Summary Category \nWORDSNET-10024 Styles.AddCopy does not copy ParagraphFormat.SpaceAfter value Bug \nWORDSNET-10027 Styles.AddCopy does not copy Font Name/Size Bug \nWORDSNET-10219 ListLevel.Font return incorrect values for font name/size Bug \nWORDSNET-10244 Font color of shape's text is changed after re-saving the Docx Bug \nWORDSNET-10303 Rotation settings of a DML are discarded when converting to DOCX/PDF Bug \nWORDSNET-10517 UpdateFields generates error in TOC page number against a Heading1 containing a STYLEREF field Bug \nWORDSNET-10575 Revisions timestamps issue with RTF document Bug \nWORDSNET-10586 TextBox's Vertical TextDirection is not preserved when print or converted to Pdf Bug \nWORDSNET-10596 OfficeMath node gets corrupted after resaving Docx Bug \nWORDSNET-10625 Text of paragraphs is changed after conversion from Doc to RTF Bug \nWORDSNET-10734 Rotation value of a DrawingML text box is not preserved during open/save a DOCX Bug \nWORDSNET-10830 Line spacing rule value changes from 'Exactly' to 'At Least' during open/save and appending documents Bug \nWORDSNET-10884 GroupShape issue with textboxes on re-saving Docx Bug \nWORDSNET-10885 Shape's content lose text formatting on Docx re-save Bug \nWORDSNET-10899 Document.UpdateFields does not update the formula field Bug \nWORDSNET-10908 DocumentBuilder.InsertHtml does not stop Bug \nWORDSNET-10917 Bullet number are missing after conversion from Doc to PDF/HTML Bug \nWORDSNET-10918 Aspose.Words hangs while loading MHTML file Bug \nWORDSNET-10925 Weird shadow appears behind picture in PDF Bug \nWORDSNET-10945 Sub and Sup html insertion results in the wrong font size Bug \nWORDSNET-10954 Problem with rendering of table cell bottom alignment Bug \nWORDSNET-10955 Document.JoinRunsWithSameFormatting loses formatting Bug \nWORDSNET-10959 Page content overlaps Header area/content in PDF Bug \nWORDSNET-10960 Docx to Pdf conversion issue with Equation position Bug \nWORDSNET-10971 Conversion throws exception 'Index was outside the bounds of the array.' Bug \nWORDSNET-10981 Font of document is changed after re-saving docx Bug \nWORDSNET-10995 Table's merge cell issue while converting Docx to Docx/Pdf Bug \nWORDSNET-10997 MailMerge.Execute throws System.InvalidCastException Bug \nWORDSNET-11013 Aspose.Words 14.8: the new precise positioning slows down the conversion to HTML Bug \nWORDSNET-11024 Bookmarks are not preserved during open/save a DOCX Bug \nWORDSNET-11033 Document constructor hangs while loading RTF document Bug \nWORDSNET-11034 Run.Font.Color return incorrect value Bug \nWORDSNET-11050 Table's border formatting is lost after re-saving Doc file Bug \nWORDSNET-11058 Word to pdf conversion issue with nested table Bug \nWORDSNET-11068 Run.Font.Name return incorrect value Bug \nWORDSNET-11073 Document.BuiltInDocumentProperties.Words returns incorrect value for Asian and math text. Bug \nWORDSNET-11081 Wrong font size of child HTML elements Bug \nWORDSNET-8284 SpaceAfter value specified in Style is not applied to imported nodes Bug \nWORDSNET-8941 Tables inside text box overlap each other Bug \nWORDSNET-9493 Text alignment of a TextBox Shape is not preserved on conversion to Pdf and docx Bug \nWORDSNET-9574 Shape is rotated after conversion from Docx to Doc/Docx/Pdf Bug \nWORDSNET-9632 The shape's text is rotated after re-saving the Docx Bug \nWORDSNET-9952 The position of autotext field (ORACLE) is changed in output Pdf file Bug \nWORDSNET-9984 Section field does not update after conversion from FlatOpc to PDF Bug \nWORDSNET-9985 Values of TIME fields varry across pages in big documents Bug \nWORDSNET-10414 Multiline value of custom document property does not work Enhancement \nWORDSNET-10430 MS Word 2010 displays ∉ symbol as square box in Aspose.Words generated output Enhancement \nWORDSNET-10566 Text wrapped differently around a floating table in doc output Enhancement \nWORDSNET-10567 Text wrapped differently around a floating table after doc roundtrip Enhancement \nWORDSNET-10568 Test wrapped differently around a floating table after docx roundtrip Enhancement \nWORDSNET-10676 Use latest Product Icon and graphics in Aspose.Words for .NET MSI Enhancement \nWORDSNET-11028 Debug.Assert in SpanInserter Enhancement \nWORDSNET-11062 Save options are not properly synchronized into the layout options Enhancement \nWORDSNET-8252 [DML] Image rotation is getting lost during rendering to fixed page formats Enhancement \nWORDSNET-9042 GetShapeRenderer().Save method does not work with rotated text within shapes Enhancement \nWORDSNET-10604 InvalidOperationException occurs when merge field value contains a double quote Exception \nWORDSNET-10916 Document.PageCount throws System.ArgumentOutOfRangeException Exception \nWORDSNET-10936 Aspose.Words.FileCorruptedException occurs when loading a DOCX file Exception \nWORDSNET-10937 System.NullReferenceException occurs when calling MailMerge.Execute Exception \nWORDSNET-10951 Document.PageCount throws System.OutOfMemoryException Exception \nWORDSNET-10957 /printer metrics/ System.SystemException is thrown while converting Docx to Pdf. Exception \nWORDSNET-10979 System.ArgumentException is thrown while saving document Png Exception \nWORDSNET-11026 System.ArgumentOutOfRangeException occurs during exporting to MHTML Exception \nWORDSNET-11046 Aspose.Words.FileCorruptedException is thronw while loading Doc file Exception \nWORDSNET-11054 Aspose.Words.FileCorruptedException occurs when loading a DOC file Exception \nWORDSNET-11084 Aspose.Words.FileCorruptedException occurs when loading a RTF file Exception \nWORDSNET-8169 ArgumentException while converting DOCX to fixed formats Exception \nWORDSNET-10087 Docx to Pdf conversion issue with OutlineOptions.HeadingsOutlineLevels Feature \nWORDSNET-10836 Word to PDF, track changes rendered incorrectly (RevisionType.Moving) Feature \nWORDSNET-10872 Provide Style.Aliases property Feature \nWORDSNET-8464 Provide a property to get/set Style alias Feature \nWORDSNET-10296 Shape Wrap Text property is not preserved during open save RTF Regression \nWORDSNET-10934 Document does not inserted after using MailMerge.Execute method Regression \nWORDSNET-11031 Merge field is not be merged in nested if field in footer or header Regression \nWORDSNET-11042 Bookmark.Text removes bookmark inside Shape node Regression \nWORDSNET-8124 Text Frame overlap the other contents of document after converting Doc to Pdf Bug \nWORDSNET-8043 [DML] Shapes with blur shadows are rendered incorrectly Bug \nWORDSNET-7662 Support counter, counter-reset and counter-increment css properties Feature \nWORDSNET-7622 The text within a rotated text box isn't rotated when converted to PDF (Word 2010) Feature \nWORDSNET-7482 Document.Styles return Alias Style as separate style Feature \nWORDSNET-7481 Support of Style Aliases Feature \nWORDSNET-6814 /compatibility 2007vs2010/ Consider rendering Text direction according to MS WORD 2010 specifications Enhancement \nWORDSNET-6489 Doc to PDF conversion issue with text rendering Enhancement \nWORDSNET-5609 Paragraph underline is lost upon rendering. Bug \nWORDSNET-5031 Part of content is moved to the next pages upon rendering. Bug \nWORDSNET-4825 Shapes with \"Optimal page wrap\" overlaps text after converting ODT to other formats Enhancement \nWORDSNET-4557 Visual formatting of a frame is displaced after mailmerge.  \nWORDSNET-4289 Bottom borders of the table disappear during rendering. Enhancement \nWORDSNET-4200 Content is moved from the last page to previous after rendering. Enhancement \nWORDSNET-4157 Bottom borders of the table disappear during rendering. Enhancement \nWORDSNET-3309 HasRevisions property returns False for ODT document which has revisions. Feature \nWORDSNET-2909 After convertion xls to odt by Excel2Word font colors is changed. Bug \nWORDSNET-2908 Table is converted incorrectly to from xls to odt by means of Excel2Word Bug \nWORDSNET-2571 /\"Don't add space between paragraphs of the same style\" option for text inside cells:4/ Spacing between paragraphs is larger than desired. Feature \nWORDSNET-2149 Highlighted and justified string has white holes between words. Rendering/Converting to PDF. Enhancement \nWORDSNET-2062 Import of a picture wrap is incorrect when it is shown in MSO Bug",
  "requireLicenseAcceptance": true,
  "title": "Aspose.Words for .NET",
  "version": "14.11.0",
  "tags": [
    "Word",
    "DOC",
    "DOCX",
    "OOXML",
    "OpenDocument",
    "PDF",
    "XPS",
    "ODT",
    "HTML",
    "XHTML",
    "WordprocessingML",
    "Document",
    "EPUB"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    }
  }
}