{
  "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.22.23.20.55/aspose.pdf.10.2.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "Aspose",
  "catalog:commitId": "731c6ca2-7297-4e75-b4e0-2dbb09cd2f55",
  "catalog:commitTimeStamp": "2018-10-22T23:20:55.4791749Z",
  "copyright": "©Aspose 2002-2014. All Rights Reserved.",
  "created": "2015-03-06T18:09:47.15Z",
  "description": "Aspose.Pdf for .NET is a PDF document creation and manipulation component that enables your .NET applications to read, write and manipulate existing PDF documents without using Adobe Acrobat. It also allows you to create forms and manage form fields embedded in a PDF document. This component is written in managed C# and it allows developers to add PDF creation and manipulation functionality to their Microsoft .NET applications (WinForms, ASP.NET and .NET Compact Framework).\n        Aspose.Pdf for .NET is affordable and offers an incredible wealth of features including PDF compression options; table creation and manipulation; support for graph objects; extensive hyperlink functionality; extended security controls; custom font handling; integration with data sources; add or remove bookmarks; create table of contents; add, update, delete attachments and annotations; import or export PDF form data; add, replace or remove text and images; split, concatenate, extract or inset pages; transform pages to image; print PDF documents and much more.",
  "iconUrl": "http://www.aspose.com/blogs/wp-content/uploads/2013/06/aspose-Pdf-for-net_100.png",
  "id": "Aspose.Pdf",
  "isPrerelease": false,
  "lastEdited": "2018-10-22T23:20:51.183Z",
  "licenseUrl": "http://www.aspose.com/corporate/purchase/end-user-license-agreement.aspx",
  "listed": true,
  "packageHash": "t1DYKRfYWPpnZl95XHsRm+M0eM2O+nSuPq1klsjynLNZNO6t+bVnsnGQKnf7+bm0uqJAueGVOknT7DvyCAWzeA==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 29102696,
  "projectUrl": "http://www.aspose.com/categories/.net-components/aspose.pdf-for-.net/default.aspx",
  "published": "2015-03-06T18:09:47.15Z",
  "releaseNotes": "This release introduces the features, enhancements and bug fixes as detailed below:\n\nFeatures\nPDFNEWNET-38089 Support for PDF contents Redaction is required\nPDFNEWNET-38224 Support LinkPageNumber property for TextFragment object\nPDFNEWNET-33783 HTML to PDF conversion - Line break issue\nPDFNEWNET-33871 HTML to PDF conversion - Formatting Issues\n\nEnhancements\nPDFNEWNET-37589 Hyperlink feature in TextSegment\nPDFNEWNET-35260 While converting TIFF to PDF, resultant file is much larger\nPDFNEWNET-34690 HTML to PDF: Suppress unsupported html tags exception\nPDFNEWNET-37779 Support of relative path in HTML to PDF conversion\nPDFNEWNET-38117 TextSegment should support hyperlink property\nPDFNEWNET-37422 HTML to PDF: support of absolute value of CSS position property\nPDFNEWNET-38195 To get rectangle of Cell Text\n\nExceptions\nPDFNEWNET-36243 NotImplementedException during XFA to Standard Acro form conversion\nPDFNEWNET-37793 PDF to HTML - IndexOutOfRangeException during conversion\nPDFNEWNET-35674 PDF to PDFA_2B conversion issue\nPDFNEWNET-33639 Parameter is not valid exception is being generated during HTML to PDF conversion\nPDFNEWNET-37656 PDF to HTML - IndexOutOfRangeException during conversion\nPDFNEWNET-34063 PDF to JPEG Conversion: Corrupt content. Could not recognize illegal characters Exception\n\nBugs\nPDFNEWNET-38053 Wrong Text Extraction from XPS Document\nPDFNEWNET-37836 PDF to PDF/A-2A compliance fails\nPDFNEWNET-38081 PDF to HTML - Text is Displaced in resultant HTML\nPDFNEWNET-37556 PDF to DOC: text is misplaced\nPDFNEWNET-37559 PDF to HTML - text is overlapping in resultant file\nPDFNEWNET-38120 CircleAnnotation disappears when flattening the document\nPDFNEWNET-38119 SquareAnnotation missing from flattened document\nPDFNEWNET-38106 LineAnnotations missing from flattened document\nPDFNEWNET-32407 hangs up\nPDFNEWNET-34782 Font embedded became true after save\nPDFNEWNET-33855 Multipage TIFF to PDF conversion - Images size issue\nPDFNEWNET-38073 Incorrect page count being returned\nPDFNEWNET-35342 When using SetPageSize(..), the page gets cropped\nPDFNEWNET-34076 Text formatting is lost when converting HTML file to PDF\nPDFNEWNET-34109 HTML to PDF conversion formatting issues.\nPDFNEWNET-34178 Formatting issues during HTML to PDF conversion\nPDFNEWNET-34464 HTML to PDF conversion problem\nPDFNEWNET-34680 Problem loading/formatting pdf via html and css inline\nPDFNEWNET-34691 HTML to PDF: Resultant PDF is 0KB\nPDFNEWNET-37994 PDF to HTML - Contents in resultant file are upside down\nPDFNEWNET-34954 HTML to PDF: Page contents go beyond right page margin\nPDFNEWNET-34111 Convert HTML to PDF not respecting CSS/ IsFitToPage\nPDFNEWNET-34684 HTML to PDF: Single table is split into multiple tables\nPDFNEWNET-34685 HTML to PDF: Table cell data is splitting over two pages\nPDFNEWNET-34682 HTML to PDF: Bottom border is missing in last row of table\nPDFNEWNET-34683 HTML to PDF: Top border is missing in first row of table in subsequent pages\nPDFNEWNET-35430 HTML to PDF - Dotted Underline in HTML not visible in PDF\nPDFNEWNET-35438 HTML to PDF rendering issue, text goes off the page\nPDFNEWNET-32723 Text Fragments Not Being Fully Replaced\nPDFNEWNET-36447 HTML to PDF - Some objects are not appearing on correct location\nPDFNEWNET-35417 PDF Read Out Loud is not working properly when PDF is Creating with PdfConformance.PdfA1A\nPDFNEWNET-35585 Text replace feature is not working when Regional settings are Turkish\nPDFNEWNET-38260 TextFragmentAbsorber gets wrong coordinates of seached Text\nPDFNEWNET-32136 Strange output when converting html to pdf\nPDFNEWNET-36466 Replace text changes space between characters\nPDFNEWNET-38188 Text Replace is not working\nPDFNEWNET-38168 CPU usage rises to 100% while using TextAbsorber in Multi-threaded envoirnment\nPDFNEWNET-38278 Incorrect page count in TOC\nPDFNEWNET-30397 Printed output is not good quality\nPDFNEWNET-38196 ProcessParagraphs() method does not update table cell contents\nPDFNEWNET-38128 Unexpected behavior of GetHashCode() method of CommandParameterCache class\nPDFNEWNET-34572 Bug Converting PDF to PNG (Some Characters are missing)\nPDFNEWNET-32039 Thai text get lost and scrambbled when converting PDF pages as images\nPDFNEWNET-32318 Text replace and add image feature increases the PDF file size\nPDFNEWNET-35507 Watermark not showing on resultant PDF",
  "requireLicenseAcceptance": true,
  "summary": "Aspose.Pdf for .NET is an amazing component which provides the feature to create and manipulate PDF documents.",
  "title": "Aspose.Pdf for .NET",
  "verbatimVersion": "10.2.0",
  "version": "10.2.0",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.22.23.20.55/aspose.pdf.10.2.0.json#Aspose.Pdf.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 2687,
      "fullName": "Aspose.Pdf.nuspec",
      "length": 6437,
      "name": "Aspose.Pdf.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.22.23.20.55/aspose.pdf.10.2.0.json#lib/net2.0/Aspose.Pdf.dll",
      "@type": "PackageEntry",
      "compressedLength": 14547093,
      "fullName": "lib/net2.0/Aspose.Pdf.dll",
      "length": 32301376,
      "name": "Aspose.Pdf.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.22.23.20.55/aspose.pdf.10.2.0.json#lib/net40-client/Aspose.Pdf.dll",
      "@type": "PackageEntry",
      "compressedLength": 14539795,
      "fullName": "lib/net40-client/Aspose.Pdf.dll",
      "length": 32290112,
      "name": "Aspose.Pdf.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.22.23.20.55/aspose.pdf.10.2.0.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9462,
      "fullName": ".signature.p7s",
      "length": 9462,
      "name": ".signature.p7s"
    }
  ],
  "tags": [
    "Aspose.Pdf",
    "PDF",
    "XFA",
    "XPS",
    "TIFF",
    "PCL",
    "SVG",
    "HTML",
    "XML",
    "XSL-FO",
    "FDF",
    "XFDF",
    "PDF/A",
    "form",
    "Portfolio",
    "EPUB",
    "PSD",
    "to",
    "XLS",
    "DOC"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    }
  }
}