{
  "@id": "https://api.nuget.org/v3/catalog0/data/2019.09.24.15.52.34/xtremedocumentstudio.netwpf.17.5.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "Gnostice Information Technologies",
  "catalog:commitId": "9803bb22-5693-4446-96a1-1864fd870135",
  "catalog:commitTimeStamp": "2019-09-24T15:52:34.5360779Z",
  "copyright": "© 2002-2017 Gnostice Information Technologies Private Limited. All rights reserved.",
  "created": "2017-12-26T10:01:27.913Z",
  "description": "Gnostice XtremeDocumentStudio .NET is the next-generation multi-format document-processing component suite for .NET developers. Currently, XtremeDocumentStudio .NET WPF Viewer control supports viewing and converting PDF, DOCX, DOC, BMP, JPEG, PNG, WMF, EMF, TIFF and MTIFF. More formats will be introduced in future. It can also convert document from one format to another, such as DOCX-to-PDF or PDF to images without requiring any other external software or libraries. It can also intelligently reconstruct page elements when converting PDF to DOCX.\n\n\t\tXtremeDocumentStudio .NET is 100% managed code. It can natively process supported formats without requiring external software such as Microsoft Word, Open XML SDK, Word Automation Services, Adobe PDF library or GhostScript.",
  "iconUrl": "http://www.gnostice.com/images/ICON_xtremedocumentstudio_dot_net.png",
  "id": "XtremeDocumentStudio.NETWPF",
  "isPrerelease": false,
  "lastEdited": "2019-09-24T15:52:19.067Z",
  "licenseUrl": "http://www.gnostice.com/XtremeDocumentStudio_dot_NET.asp?show=licenses",
  "listed": false,
  "packageHash": "7IeRnpJ20mi+dVpC9RPHMQ8RKnuXbvAtlgxt0xl5qHzjUE5T2xmhKWAlcERq0VPXFGjgQOjU42VPSP8E7pWlLw==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 3335976,
  "projectUrl": "http://www.gnostice.com/XtremeDocumentStudio_dot_NET.asp",
  "published": "1900-01-01T00:00:00Z",
  "releaseNotes": "Version 2017 R5 - December 26th, 2017\n=============================\nEnhanced\n~~~~~~~~\n- HTML5 Document Viewer\n\t- Added support for form field input validation and calculations.\n\t- Added support for form field push button JS actions for form submit/reset.\n\t- Grouped checkboxes now behave like radio buttons where only one item in the group can be checked.\n\t- Added setting “FormFields.readonlyColor” to specify background color for read- only form fields.\n\t- Added setting “FormFields.focusColor” to specify background color for form field which has focus.\n\t- Added API “View.showNavigationPane” and “View.hideNavigationPane” to show/hide navigation pane after the viewer is displayed.\n- Word Engine\n\t- Added RTF as an output format for document conversions.\n- Framework\n\t- Added setting “Framework.LoadUnsupportedFormatAsTXT” to specify whether unsupported and corrupted files should be loaded as TXT files. The default value is set to True so behaviour of existing code is unchanged.\nFixed\n~~~~~\n- HTML5 Document Viewer\n\t- Viewer settings refactoring\n\t- Renamed “colorInversionEnabled” to “colorInversionApplied”.\n\t- Renamed “viewSettings” to “ViewSettings”.\n\t- Viewer API refactoring\n\t- Renamed public API group “forms” to “Forms”.\n\t- Renamed event “onFieldClick” to “onFieldClicked”.\n\t- Renamed event “onFieldChange” to “onFieldChanged”.\n\t- Safari browser issue where during form filling text entered in text edit box is not visible till the text input lost focus.\n\t- Safari browser issue where printing a single page document having a page size of “US letter” is causing an extra empty page to be printed.\n\t- Safari browser issue (on iPad) where scrolling is causing form fields to disappear.\n\t- Form filling issue where focusing on to a combo box control is incorrectly showing field highlight color even when it is read- only.\n\t- Search dialog is not automatically dismissed when a new document is loaded.\n\t- Selected zoom value in the zoom drop- down is not updated when the zoom is changed using the +/-  buttons.\n\t- Internet Explorer browser issue where in full- screen view the background color of navigation pane and comment pane is black.\n\t- Viewer is not redrawing the view correctly when the viewer size is changed.\n\t- Form filling issue where export value of a combo box being null is not being handled correctly.\n\t- Watermark drawn on thumbnail image disappears if navigation pane is closed and reopened.\n\t- Rotating a page to 90 degrees or 270 degrees and then performing zoom is causing page width to not fit to page correctly.\n\t- Print progress animation is being shown on whole page rather than just the viewer frame.\n\t- Form filling issue where when no radio buttons are selected and  isRadioNoToggleToOff property is true then we were selecting the first radio by default. This is now fixed to match Adobe Reader’s behaviour which does not select any radio button.\n\t- Form filling issue where text entry is being limited due to width limitation of text boxes. This is now fixed to allow a buffer of 10% in input text width calculation when trying to limit the text width.\n\t- Printing issue where certain PDF files with a list box is failing to print.\n\t- Form fields events issue where form field events are not being dispatched for handlers registered for a specific form field (using the field name). \n\t- Modified behaviour to raise focus- in/focus- out events for read- only form fields.\n\t- Form fields events issue where onFieldClick event is being incorrectly dispatched on mouse down.\n\t- Form fields events issue where beforeFormSubmit event is not being triggered.\n\t- Form fields issue where the reset API is deleting fields.\n\t- API “getAllFormFields” fails if called on PDF files having pages without any form fields on them.\n\t- File lock (on server) is not being released even after closing the document on the viewer.\n\t- XML parsing error (no root element found) being logged in Firefox brower console.\n- WinForms Viewer\n\t- Scrolling issue when page layout is single- page non- continuous.\n- WPF Viewer\n\t- Scrolling issue where the page is not scrolling to the end when the page layout mode is set to non- continuous.\n- Document Converter\n\t- Input files with dots in the name is causing an incorrect default output file name to be generated.\n\t- Conversion from images of smaller size and higher Dpi to searchable PDF is not adding the searchable text to the output PDF.\n\t- Conversion from images of 72 Dpi to searchable PDF is adding the searchable text at incorrect position.\n\t- The stream position of returned Stream values from DocumentConverter.ConvertToStream method are not reset to position '0'.\n- Word Engine\n\t- DOC file parsing issue where a table cell’s first item not being text is not handled correctly.\n\t- DOC parsing issue where compressed WMF images are not handled.\n\t- DOC parsing issue where an image with missing data entry in OLESS root is not being read.\n\t- DOC parsing issue where tables with missing style definitions are not being read.\n\t- DOC files larger than 6.875 MB cause parsing error.\n\t- Corrupted DOC file not causing “FormatNotSupported” exception to be thrown.\n\t- Corrupted DOC file freezes the engine when loading.\n\t- DOCX files fail to parse when a duplicate style definition is present.\n\t- DOCX files fail to parse when header/footer contains a textbox and a text run in it.\n\t- Tabs parsing issue where custom tabs to be ignored are not parsed properly.\n\t- DOCX rendering issue where content is overlapping in merged cells.\n\t- Many issues in tabs handling.\n\t- Thread race condition issue in HTML parser.\n\t- Spaces in text run which are present outside the page region are ignored.\n\t- Rendering issue where tabs present before images are being ignored.\n\t- Rendering issue where a text box with text wrap of type “top and bottom” is not being handled correctly.\n- Spreadsheet Engine\n\t- Styling issue when a built- in style with a non standard name is encountered.\n- PDF Engine\n\t- Layouting issue where the spacing mentioned for an empty content Xposition is not calculated properly.\n\t- Rendering issue where inline images are not rendered correctly when inline image stream is decoded using PDF encoding.\n\t- Annotations with 180 degree angle rotation is not handled properly.\n\t- PDF action parameter of annotations is not handled correctly.\n\t- Image rendering issue where processing of SMaskStream is incorrect when SMask image BPC is 1. Also the image stream is not read when its length is 1 and it’s not a newline.\n\t- Image rendering issue where 1BPC grayscale inline images are not being rendered correctly.\n\t- Image rendering issue where ARGB values are not read correctly for color- key masked images.\n\t- Image rendering issue where transparency is not handled for inverted gray scale images.\n\t- API “MakeTransparent” incorrectly making the image blank.\n\t- Saving a PDF file having multiple checkbox fields under one parent field is creating a corrupted file.\n\t- Fetching all form fields and saving the file is creating a corrupted file.\n\t- White- spaces present in encrypted streams are not being skipped.\n\t- Field name, mapping name and fully qualified name of form fields are not being decoded correctly.\n\t- Default value of form field is not being decoded correctly when the value contained only the Byte Order Marker.\n\t- Radio- in- unison property of a radio button group form field is not being decoded correctly.\n\t- Read- only property and maximum length property of a comb form field is not being decoded correctly.\n\t- Form fields marked as hidden are being rendered when viewing and printing. \n\t- Form fields marked as no- view are being rendered when viewing.\n\t- Form fields marked as no- print are being rendered when printing.\n\t- Checkboxes and radio buttons are not checked correctly when printing. This issue is happening only when the form field values are edited after loading the document.\n\t- Page contents of certain PDF files are being offset due to MediaBox/CropBox interaction.\n\t- Text was overlapping due to character width not being set correctly.\n\t- CMap stream is not being read correctly.\n\t- “PDFException” is thrown while loading some PDF documents when the PDF file contains numerous 'NUL' bytes at the end of file.",
  "requireLicenseAcceptance": true,
  "summary": "View and convert PDF, DOCX, DOC, BMP, JPEG, PNG, WMF, EMF, and single-page and multi-page TIFF. Provides WPF Document Viewer control.",
  "title": "Gnostice XtremeDocumentStudio .NET WPF Viewer",
  "verbatimVersion": "17.5.0",
  "version": "17.5.0",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2019.09.24.15.52.34/xtremedocumentstudio.netwpf.17.5.0.json#XtremeDocumentStudio.NETWPF.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 3848,
      "fullName": "XtremeDocumentStudio.NETWPF.nuspec",
      "length": 10377,
      "name": "XtremeDocumentStudio.NETWPF.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2019.09.24.15.52.34/xtremedocumentstudio.netwpf.17.5.0.json#lib/net40/Gnostice.Core.dll",
      "@type": "PackageEntry",
      "compressedLength": 63110,
      "fullName": "lib/net40/Gnostice.Core.dll",
      "length": 147456,
      "name": "Gnostice.Core.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2019.09.24.15.52.34/xtremedocumentstudio.netwpf.17.5.0.json#lib/net40/Gnostice.Documents.Controls.WPF.dll",
      "@type": "PackageEntry",
      "compressedLength": 97326,
      "fullName": "lib/net40/Gnostice.Documents.Controls.WPF.dll",
      "length": 206336,
      "name": "Gnostice.Documents.Controls.WPF.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2019.09.24.15.52.34/xtremedocumentstudio.netwpf.17.5.0.json#lib/net40/Gnostice.Documents.dll",
      "@type": "PackageEntry",
      "compressedLength": 2577012,
      "fullName": "lib/net40/Gnostice.Documents.dll",
      "length": 8089088,
      "name": "Gnostice.Documents.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2019.09.24.15.52.34/xtremedocumentstudio.netwpf.17.5.0.json#lib/net40/Gnostice.XtremeFontEngine.4.0.dll",
      "@type": "PackageEntry",
      "compressedLength": 216072,
      "fullName": "lib/net40/Gnostice.XtremeFontEngine.4.0.dll",
      "length": 712704,
      "name": "Gnostice.XtremeFontEngine.4.0.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2019.09.24.15.52.34/xtremedocumentstudio.netwpf.17.5.0.json#lib/net40/Gnostice.XtremeImageEngine.dll",
      "@type": "PackageEntry",
      "compressedLength": 251999,
      "fullName": "lib/net40/Gnostice.XtremeImageEngine.dll",
      "length": 594944,
      "name": "Gnostice.XtremeImageEngine.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2019.09.24.15.52.34/xtremedocumentstudio.netwpf.17.5.0.json#lib/net40/Ionic.Zlib.dll",
      "@type": "PackageEntry",
      "compressedLength": 34342,
      "fullName": "lib/net40/Ionic.Zlib.dll",
      "length": 102400,
      "name": "Ionic.Zlib.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2019.09.24.15.52.34/xtremedocumentstudio.netwpf.17.5.0.json#lib/net40/Ionic.Zip.Reduced.dll",
      "@type": "PackageEntry",
      "compressedLength": 79278,
      "fullName": "lib/net40/Ionic.Zip.Reduced.dll",
      "length": 199680,
      "name": "Ionic.Zip.Reduced.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2019.09.24.15.52.34/xtremedocumentstudio.netwpf.17.5.0.json#lib/net40/Gnostice.Documents.Framework.lic",
      "@type": "PackageEntry",
      "compressedLength": 39,
      "fullName": "lib/net40/Gnostice.Documents.Framework.lic",
      "length": 39,
      "name": "Gnostice.Documents.Framework.lic"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2019.09.24.15.52.34/xtremedocumentstudio.netwpf.17.5.0.json#Content/Properties/Gnostice.Documents.Framework.licx",
      "@type": "PackageEntry",
      "compressedLength": 89,
      "fullName": "Content/Properties/Gnostice.Documents.Framework.licx",
      "length": 104,
      "name": "Gnostice.Documents.Framework.licx"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2019.09.24.15.52.34/xtremedocumentstudio.netwpf.17.5.0.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9480,
      "fullName": ".signature.p7s",
      "length": 9480,
      "name": ".signature.p7s"
    }
  ],
  "tags": [
    "WPF",
    "Document",
    "Viewer",
    "PDF",
    "DOCX",
    "DOC",
    "TIFF",
    "JPG",
    "BMP",
    "PNG",
    "viewer",
    "Converter"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}