{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.25.19.35.57/poker-heat-cheats.2.1.2.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "Thomas",
  "catalog:commitId": "947d7de1-a572-4dae-b433-bbb2b67d3a22",
  "catalog:commitTimeStamp": "2022-01-25T19:35:57.2116046Z",
  "created": "2022-01-25T19:32:18.11Z",
  "description": "Poker Heat Hack Mod APK Get Unlimited Chips Cheats Generator IOS Android\n\nPoker Heat Hack [2021 WORKING] Unlimited Chips Android | iOS ! 100% Work Today, we got the Poker Heat Hack at your service. This really is an Poker Heat ONLINE Hack, which could generate Unlimited number of Chips to your game account. This is the sole place online to get working cheats for Poker Heat and became the most effective player in this great game. If you wish to take your game to a different level and improve your odds for winning, you need to use free of charge now our amazing Poker Heat Hack Online Cheat Tool. Poker Heat Cheat Tool can be acquired for your Android or iOS device, it features a user-friendly interface and is simple manageable.\n\n➡ ➡ ➡ GET IT HERE: https://help4play2.win/PokerHeat/\n\nThis Poker Heat hack online generator is undetectable because of proxy connection and our safety system. It's 128-bit SSL, to produce your account as safe as you are able to so don't bother about bans. Our Poker Heat Hack has very simply interface to produce it simple to use. Our hacks are always up to date and they are made for every one of iOS and Android devices.By having Unlimited Chips, you'll dominate the Poker Heat game and win all challenges.This really is the key reason why many top players in the overall game uses our tool. Poker Heat Hack Generator Screenshot!!! Use Poker Heat Hack cheats online generator for players to get Chips Poker Heat Hack Tool available for Browser, Android and IOS, it will allow you to Get unlimited Chips, easy to use and without downloading. This Generator Poker Heat Cheat was set up by the Famous Team \"UNV Cheat Games\" and will allow you to add as many Chips as you want without connecting and remotely directly on the web, because our Generator sends processed data to get information from the official game servers. So if you're stuck somewhere, or just for fun, or to go beyond a level where you're struggling or to become one of the best players use our Generator and get what ever you want. Our Generator Encrypt Data to ensure maximum protection and minimal risk. Did you prefer not to buy Chips just get them for free? Or you need an updated Poker Heat Hack that worked on their current version? Well, it is so easy even a 10-year-old child can do it! And it’s true hack for Chips can get you ahead in this game . But there are few problems that most people encountered, outdated Poker Heat Hack cheats are one of them. This new version of our Poker Heat Hack Tool will never make you run out of Chips anymore. our developers made sure that our Poker Heat cheats will let you enjoy the potential of this top action game in Poker Heat fans know that each player wants a better equipe or players.\n\n➡ ➡ ➡ GET IT HERE: https://help4play2.win/PokerHeat/",
  "id": "Poker-heat-cheats",
  "isPrerelease": false,
  "lastEdited": "2022-01-25T19:35:40.353Z",
  "listed": false,
  "packageHash": "apRVlhA6NHDrvIL7k+MbCeTIody54tfYd0Zx7A/UK46AOjVB6QP4rxOKKKsEdYsV9pt8z89R2DsYKh6dWwG+rA==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 13948,
  "published": "1900-01-01T00:00:00Z",
  "requireLicenseAcceptance": false,
  "title": "Poker Heat cheats",
  "verbatimVersion": "2.1.2",
  "version": "2.1.2",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.25.19.35.57/poker-heat-cheats.2.1.2.json#Poker-heat-cheats.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1531,
      "fullName": "Poker-heat-cheats.nuspec",
      "length": 3233,
      "name": "Poker-heat-cheats.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.25.19.35.57/poker-heat-cheats.2.1.2.json#lib/_._",
      "@type": "PackageEntry",
      "compressedLength": 0,
      "fullName": "lib/_._",
      "length": 0,
      "name": "_._"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.25.19.35.57/poker-heat-cheats.2.1.2.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9471,
      "fullName": ".signature.p7s",
      "length": 9471,
      "name": ".signature.p7s"
    }
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}