{
  "@id": "https://api.nuget.org/v3/catalog0/data/2015.02.01.22.59.34/cuemon.1.0.2012.1680.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "Michael Mortensen",
  "catalog:commitId": "a1780d81-45e5-4c77-8e76-4a86fd396f45",
  "catalog:commitTimeStamp": "2015-02-01T22:59:34.030849Z",
  "copyright": "Copyright © MuchMore 2009-2012. All rights reserved.",
  "created": "2012-06-18T01:54:51.453Z",
  "description": "If you like the structure of the .NET platform, then the Cuemon .NET Framework Additions might just be that extra solution you have been looking for! With these assemblies I have aimed to accomplish at least two things; simplify the tedious work that is always present when coding towards a generic framework, and implementing some core- and utility classes for you to enjoy.",
  "iconUrl": "http://cdn.cuemon.net/themes/cuemon/images/nuget.png",
  "id": "Cuemon",
  "isPrerelease": false,
  "language": "en-US",
  "lastEdited": "0001-01-01T00:00:00Z",
  "licenseUrl": "http://creativecommons.org/licenses/by/3.0/",
  "packageHash": "oi1zXnMlH+K621VHMJ5iBh3PtjIALH3zlId963vJXmYlbFKThxkf9nc7bk2q0gKVimiRV8tdX/2lKk2UdiYClg==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 397000,
  "projectUrl": "http://www.cuemon.net/",
  "published": "2012-06-18T01:54:51.453Z",
  "releaseNotes": "This release contains a lot of new features, a brand new family member and lastly a few bug fixes has been neutralized. The primary focus for this release was to mature the assemblies for cloud development, hence making them more compatible/attractive for WCF developers. Let's get on with the release.\n\nIn the Cuemon assembly, the core assembly of the family, several new classes and interfaces has been introduced, starting with INotifyMethodEntered, INotifyMethodExited, MethodEnteredEventArgs and MethodExitedEventArgs in the Cuemon.ComponentModel namespace. Moving on to the Cuemon.Diagnostics namespace, IMethodPerformanceTiming, IPropertyPerformanceTiming, TimeMeasure, TimeMeasureCompletedEventArgs, TimeMeasureRunningEventArgs and Instrumentation was added. In the Cuemon.Net namespace ServicePointManagerUtility was born to support self-signed SSL/TSL certificates. Lastly, in this assembly, IReadOnlyCollection<T>, IReadOnlyDictionary<TKey, TValue>, ReadOnlyCollection<T> and ReadOnlyDictionary<TKey, TValue> was added to the Cuemon.Collections.Generic namespace along with a few new members on the Cuemon.StringUtility class.\n\nNext in line for a more modest change is the Cuemon.Data.Entity assembly. Here the BusinessEntityDataAdapter received a little tuning kit for the data binding processing.\n\nOur brand new assembly, Cuemon.ServiceModel, is thought to be your shortcut to fast and easy service implementation through WCF. Since WCF is from .NET 3 and forward, my focus is to support the WCF with new functionality that spreads from .NET 2 SP1 and forward. So far only one class made it out to public; the ServiceInstrumentation base class, which will provide a way of monitoring and measuring performance in your services - easy!\n\nNext to last is the Cuemon.Web assembly. Here we start with the new HttpResponseFilter base class, which is ideal for Filter implementations. Besides this (and implementing it on existing filters) the GlobalModule has been matured to support WCF in a manner I did not foresee. With a few switches you can now achieve compression, exception to XML interception and friendly REST FAULT XML parsing.\n\nLast, but not least, the Cuemon.Xml assembly received a new method on the XmlUtility class; SanitizeElementName. This method help mature the XML serialization process, which will now correctly result in a correctly resolved XML root name. That should be about it - oh yeah - the XsltUtility class can now support self-signed SSL/TSL certificates as well.\n\nDo enjoy this release - I am proud to have brought it to you!\n\nDocumentation: http://library.cuemon.net/",
  "requireLicenseAcceptance": false,
  "summary": "Simple,  logical and every-day usage additions to the Microsoft .NET Framework 2.0 and forward. Follows the established namespace structure already found in the .NET Framework.",
  "title": "Cuemon .NET Framework Additions",
  "version": "1.0.2012.1680",
  "tags": [
    "cuemon",
    "xml",
    "xslt",
    "json",
    ".net",
    "framework",
    "additions",
    "businessentity",
    "caching",
    "manager",
    "datespan",
    "depedency",
    "watcher",
    "dataadapter",
    "datamanager",
    "sqlceclient",
    "sqlclient",
    "datadepedency",
    "netdepedency",
    "securitytoken",
    "hash",
    "aes",
    "utility",
    "classes",
    "xsltpage",
    "xsltmaterpage",
    "globalmodule",
    "ihttpmodule",
    "cloud",
    "security",
    "wcf"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    }
  }
}