{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.20.06.59.58/township.cheats.deutsch.android.kostenlos.hack.ohne.verifizierung.8.7.6.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "sybetan",
  "catalog:commitId": "dc78fe03-2a88-4dea-9428-f86223f22d00",
  "catalog:commitTimeStamp": "2022-01-20T06:59:58.4047162Z",
  "created": "2022-01-18T13:45:11.843Z",
  "description": "TOWNSHIP CHEATS DEUTSCH ANDROID KOSTENLOS HACK OHNE VERIFIZIERUNG\nTownship Hack Mod APK Holen Sie sich unbegrenzte Münzen Cheats Generator IOS Android\n\n➡ ➡ ➡ HIER ERHALTEN: https://gemtoon.com/ddc025b\n\nTownship-Cheat-Codes - Township cheats deutsch android kostenlos Bargeld hacken [2021 ARBEITET] Unbegrenzte Münzen Android | iOS! 100 % Arbeit Heute haben wir den Township Hack  ohne verifizierung zu Ihren Diensten. Dies ist wirklich ein Township ONLINE-Hack, der eine unbegrenzte Anzahl von Münzen für Ihr Spielkonto generieren kann. Dies ist der einzige Online-Ort, an dem Sie funktionierende Cheats für Township erhalten und der effektivste Spieler in diesem großartigen Spiel geworden sind. Wenn Sie Ihr Spiel auf eine andere Ebene bringen und Ihre Gewinnchancen verbessern möchten, müssen Sie jetzt kostenlos unser erstaunliches Township Hack Online Cheat Tool verwenden. Township Cheat Tool kann für Ihr Android- oder iOS-Gerät erworben werden, es verfügt über eine benutzerfreundliche Oberfläche und ist einfach zu verwalten.\n\n➡ ➡ ➡ HIER ERHALTEN: https://gemtoon.com/ddc025b\n\nDieser Township-Hack-Online-Generator ist aufgrund der Proxy-Verbindung und unseres Sicherheitssystems nicht erkennbar. Es ist 128-Bit-SSL, um Ihr Konto so sicher wie möglich zu machen, also kümmern Sie sich nicht um Sperren. Unser Township Hack hat eine sehr einfache Schnittstelle, um es einfach zu bedienen. Unsere Hacks sind immer auf dem neuesten Stand und für alle iOS- und Android-Geräte geeignet. Mit unbegrenzten Münzen dominieren Sie das Township-Spiel und gewinnen alle Herausforderungen. Dies ist wirklich der Hauptgrund, warum viele Top-Spieler insgesamt dabei sind Spiel verwendet unser Tool. Screenshot des Township-Hack-Generators!!! Verwenden Sie den Online-Generator für Township Hack Cheats für Spieler, um das Coins Township Hack Tool für Browser, Android und IOS verfügbar zu machen. Es ermöglicht Ihnen, unbegrenzt Münzen zu erhalten, einfach zu bedienen und ohne Download. Dieser Generator Township Cheat wurde vom berühmten Team „UNV Cheat Games“ erstellt und ermöglicht es Ihnen, ohne Verbindung und aus der Ferne direkt im Internet so viele Münzen hinzuzufügen, wie Sie möchten, da unser Generator verarbeitete Daten sendet, um Informationen aus dem offiziellen Spiel zu erhalten Server. Wenn du also irgendwo feststeckst, oder nur zum Spaß, oder um über ein Level hinauszugehen, auf dem du Probleme hast, oder um einer der besten Spieler zu werden, benutze unseren Generator und hol dir, was immer du willst. Unser Generator verschlüsselt Daten, um maximalen Schutz und minimales Risiko zu gewährleisten. Hast du es vorgezogen, Coins nicht zu kaufen, sondern sie kostenlos zu bekommen? Oder benötigen Sie einen aktualisierten Township-Hack, der in der aktuellen Version funktioniert? Nun, es ist so einfach, dass sogar ein 10-jähriges Kind es tun kann! Und es ist ein wahrer Hack für Münzen, der Sie in diesem Spiel voranbringen kann. Aber es gibt nur wenige Probleme, auf die die meisten Menschen gestoßen sind, veraltete Township-Hack-Cheats sind eines davon. Diese neue Version unseres Township-Hack-Tools wird Ihnen nie mehr die Münzen ausgehen lassen. Unsere Entwickler haben dafür gesorgt, dass Sie mit unseren Township-Cheats das Potenzial dieses Top-Actionspiels genießen können. Township-Fans wissen, dass jeder Spieler eine bessere Ausrüstung oder bessere Spieler haben möchte.",
  "id": "TOWNSHIP.CHEATS.DEUTSCH.ANDROID.KOSTENLOS.HACK.OHNE.VERIFIZIERUNG",
  "isPrerelease": false,
  "lastEdited": "2022-01-20T06:43:45.903Z",
  "listed": false,
  "packageHash": "AcLV5Cqf22ZjHFs8VdiqluR+IlpjUQFAnfn6kuaKrN3eJqQONb3Ck2KbGb4V/vNisfX2HYqdD3QC7NXG50lCnA==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 19985,
  "published": "1900-01-01T00:00:00Z",
  "verbatimVersion": "8.7.6",
  "version": "8.7.6",
  "dependencyGroups": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.20.06.59.58/township.cheats.deutsch.android.kostenlos.hack.ohne.verifizierung.8.7.6.json#dependencygroup/net5.0",
      "@type": "PackageDependencyGroup",
      "targetFramework": "net5.0"
    }
  ],
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.20.06.59.58/township.cheats.deutsch.android.kostenlos.hack.ohne.verifizierung.8.7.6.json#TOWNSHIP.CHEATS.DEUTSCH.ANDROID.KOSTENLOS.HACK.OHNE.VERIFIZIERUNG.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1890,
      "fullName": "TOWNSHIP.CHEATS.DEUTSCH.ANDROID.KOSTENLOS.HACK.OHNE.VERIFIZIERUNG.nuspec",
      "length": 3886,
      "name": "TOWNSHIP.CHEATS.DEUTSCH.ANDROID.KOSTENLOS.HACK.OHNE.VERIFIZIERUNG.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.20.06.59.58/township.cheats.deutsch.android.kostenlos.hack.ohne.verifizierung.8.7.6.json#lib/net5.0/to.dll",
      "@type": "PackageEntry",
      "compressedLength": 5126,
      "fullName": "lib/net5.0/to.dll",
      "length": 14336,
      "name": "to.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.20.06.59.58/township.cheats.deutsch.android.kostenlos.hack.ohne.verifizierung.8.7.6.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9463,
      "fullName": ".signature.p7s",
      "length": 9463,
      "name": ".signature.p7s"
    }
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}