{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.29.00.06.06/_mafia-city-hack-working-2022-version-dvm.5.8.80.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "SharpCrafters s.r.o.",
  "catalog:commitId": "da99e20d-dbc0-46b0-ad58-e0f17f4c6990",
  "catalog:commitTimeStamp": "2022-01-29T00:06:06.7757891Z",
  "created": "2022-01-26T08:42:55.907Z",
  "description": "# _Mafia City Hack Working 2022 Version dvm\n\n\nCLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; [http://bltadwin.ru/hack.php](http://bltadwin.ru/hack.php)\n\n\nAlthough it is an online game, somehow we managed to hack it. And we are going to share the hacked version. It is. Enjoy playing this strategy game Mafia City Mod Apk. With our mod, Using a hack in the game will make the gameplay more entertaining. Download Apk Latest Version of Mafia City MOD, The Strategy Game of Android, Mafia City Mod in your Android Device today you're able to Hack that Game.\n\n## [CLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; http://bltadwin.ru/hack.php](http://bltadwin.ru/hack.php)\n\n · Mafia city hack download. Moreover, the game uses a friendly. The mafia city bot for pc bot version comes with a % free trial that runs for hours per day. Bot servers are set up on purchase, so they do not come with a free trial. Wait for a few seconds, the mafia city hack will be installed.  · Easest Way To Install Mafia City Hack Apk: If you are having difficulty installing gangster city mod apk then follow this simple step-by-step process. 1. Download the files from the given Button. 2. Make sure to enable the Unknown Sources option if it is disabled on your device. Go to Setting turn on Unknown Sources. install it from there. /5. Mafia City Generate Free Online Resources CLICK HERE TO GENERATE Get tons of free gold with the new Mafia City hack tool. Mafia City cheats. Aug Faith Mastronardi. Aug Mafia City Generator Free Gold CLICK HERE TO GENERATE Get tons of free gold with the new Mafia City hack tool.\n\nmafia city hacks, mafia city hack 2021, mafia city hack mod apk, mafia city hack apk, mafia city hack generator, mafia city hacks ios, mafia city hack download, mafia city hack version download, mafia city hack tool, mafia city hack reddit, mafia city hack android, mafia city hack apk free download, mafia city hack apk ios, mafia city hack app, mafia city hack apk mod, mafia city hack apk android, mafia city hack apk mediafıre 2021, mafia city babe hack, can mafia city be hacked, big city mafia hack mod apk, big city mafia hack apk, mafia city hack codes, mafia city casino hack, mafia city hacks and cheats, cara hack mafia city, how to enter cheat codes in mafia city, mafia city hack deutsch, mafia city hack apk download, mafia city hack ios download, mafia city hack game download, hack de mafia city, mafia city hack deutsch 2020, mafia city hack erfahrungen, mafia city hack forum, mafia city hack mod apk free download, mafia city free gold hack, hack for mafia city, mafia city hack apk full, mafia city unlimited resources, mafia city hack gold, mafia city gold hack without human verification, mafia city gold hack 2021, mafia city gold hack 2020, mafia city gold hack apk, mafia city game hacks, mafia city h5 hack, mafia city hack no human verification, mafia city hack without human verification, start mafia city gold hack = https //tinyurl.com/, mafia city hack jailbreak, mafia city hack lucky patcher, mafia city unlimited everything, mafia city hack mod apk download, mafia city hack mod download, mafia city map hack, mafia city hack apk mediafıre, mafia city apk mod hack 2021, mafia city hack no verification, mafia city hack no survey, mafia city gold hack no verification, mafia city hack online, mafia city hack oro ilimitado, mafia city hack oro, mafia city hack pro, mafia city power hack, mafia city purchase hack, mafia city pc hack, hack para mafia city, hack para mafia city 2020, hack para mafia city android, mafia city resources hack, mafia city hacks 2021, mafia city hacks 2020, mafia city hacks that work, mafia city hack script, mafia city server hack, is mafia city free, is mafia city down, is mafia city good, is mafia city a real game, mafia city hack tool apk, mafia city online hack tool, tải mafia city hack, télécharger mafia city hack, tải game mafia city hack, mafia city unlimited gold hack, how to get unlimited gold in mafia city, how to get f",
  "id": "_Mafia-City-Hack-Working-2022-Version-dvm",
  "isPrerelease": false,
  "language": "en-US",
  "lastEdited": "2022-01-28T23:46:35.38Z",
  "listed": false,
  "packageHash": "zyqr3SkVxytNXwX7C7fFJoUOI4GMArsbozkHBurQEuhfMyK+Sxus2FKVsHuWFaUq5RA7jtWyPejSbkGmmPOlzg==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 11610,
  "published": "1900-01-01T00:00:00Z",
  "requireLicenseAcceptance": false,
  "title": "_Mafia-City-Hack-Working-2022-Version-dvm",
  "verbatimVersion": "5.8.80",
  "version": "5.8.80",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.29.00.06.06/_mafia-city-hack-working-2022-version-dvm.5.8.80.json#wasmebkfjp.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1488,
      "fullName": "wasmebkfjp.nuspec",
      "length": 4463,
      "name": "wasmebkfjp.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.29.00.06.06/_mafia-city-hack-working-2022-version-dvm.5.8.80.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9462,
      "fullName": ".signature.p7s",
      "length": 9462,
      "name": ".signature.p7s"
    }
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}