{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.13.02.43.04/8-ball-pool-coins-and-cash-generator-b6.1.0.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "8-ball-pool-coins-and-cash-generator-b6",
  "catalog:commitId": "ab1bd51f-b8b9-46e2-b9d2-47efe0488330",
  "catalog:commitTimeStamp": "2022-01-13T02:43:04.0426522Z",
  "created": "2022-01-13T02:40:58.09Z",
  "description": "We are going to talk about the 8 Ball Pool Coins and Cash Generator later in the article, but for the moment, let's stick to the numerous techniques you can generate Coins and Cash just by playing. Our Coins and Cash generator online will now stuff and hook up to the 8 Ball Pool servers to come up with the no cost Coins and Cash of yours, it will do a few determines to make sure you are real human. And you could get a great deal more fun with this particular game if you had infinite online resources, such as Coins and Cash.\n\nAcess ONLINE GENERATOR http://tnpps.xyz/8f0cded\n\nYou may have read about 8 Ball Pool Coins and Cash Generator from someone and will be interested to find out more about it. If you over make use of the hack Coins and Cash free, other players might discover it and it may lead to your out from the game. The main objective for the team of ours of professionals is the security in addition to being security of this specific device throughout the creation of its. Anything else that you'd like to mention to us, shoot through the comment below. Expecting to listen to from you folks before long. You can get free of charge Coins and Cash after day without human verification plans. We've to tell you that within this guidebook you are going to learn a number of things concerning the game and when that we'll offer you an awareness over how this cheat code apk works for you to elevate your game knowledge.\n\n\n\n8 Ball Pool Coins and Cash Generator is going to play a crucial part in playing the 8 Ball Pool game effectively. Among the most significant stuff in 8 Ball Pool is to complete your daily activities. The innovative resources generator apk development technology helps ensure all users undetectable resource generation function with most time totally free of cost access. 8 Ball Pool Coins and Cash can't be hacked. This particular thing about the hack for free is a verification method which is going to tell our system that you're not really a bot though you are able to bypass the verification approach so long as the country of yours and email is valid. In case you got lots of features in an internet tool, what reason do you really haven't to utilize it?\n\n\n\n8 Ball Pool Coins and Cash Generator is a free of charge on-line tool that will help the gamer to produce some amount of Coins and Cash. When we mention online cloud based hack file download, it may be assumed to be most efficient and safest. A lot of sites on the internet attract the players by guaranteeing them to offer limitless resources, and in case you strive to make use of such online resources, they will ask for the game details of yours.\n\n\n\nWe support you to take use from this 8 Ball Pool Coins and Cash Generator too since it works effectively on just about any ios and also on your android device you have. The AI based strategy allows you as well as your teammates to be strong in the game as well as aids you as well. Different mods & generators are available to increase the Coins and Cash of yours. This particular game is beautifully built.\n\n\n\n8 Ball Pool Coins and Cash Generator for android and ios the way to get unlimited free Coins and Cash without any survey no person verification no password no download certainly no root no jailbreak. You do not have to open up various mod hacks for Coins and Cash with this particular hack direct download. It requires a couple of mins to increase Coins and Cash. Several avid gamers as well as builders  don't love using one more hack online for creating Coins and Cash. All those sites that claim you to offer limitless Coins and Cash with the assistance of hack for ipads which includes 8 Ball Pool Coins and Cash hack full version no survey download or perhaps surveys however, you are going to end up having almost nothing with the fake tools so never ever go for them.\n\nSeveral of us came at the same time and started to create a 8 Ball Pool Coins and Cash Generator, that may produce absolutely free",
  "id": "8-ball-pool-coins-and-cash-generator-b6",
  "isPrerelease": false,
  "lastEdited": "2022-01-13T02:43:00.093Z",
  "listed": true,
  "packageHash": "BdkfulQtLQ8dLX7jNMYAQ1KGm7d8fykj5trNzYcj0QtuaEVLAdvzt0s60KlujI2RjC79cBTV19yTizkSNbB4xQ==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 16784,
  "published": "2022-01-13T02:40:58.09Z",
  "verbatimVersion": "1.0.0",
  "version": "1.0.0",
  "dependencyGroups": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.13.02.43.04/8-ball-pool-coins-and-cash-generator-b6.1.0.0.json#dependencygroup/net6.0",
      "@type": "PackageDependencyGroup",
      "targetFramework": "net6.0"
    }
  ],
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.13.02.43.04/8-ball-pool-coins-and-cash-generator-b6.1.0.0.json#8-ball-pool-coins-and-cash-generator-b6.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1999,
      "fullName": "8-ball-pool-coins-and-cash-generator-b6.nuspec",
      "length": 4631,
      "name": "8-ball-pool-coins-and-cash-generator-b6.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.13.02.43.04/8-ball-pool-coins-and-cash-generator-b6.1.0.0.json#lib%5Cnet6.0%5CAppLogger.dll",
      "@type": "PackageEntry",
      "compressedLength": 1786,
      "fullName": "lib\\net6.0\\AppLogger.dll",
      "length": 4608,
      "name": "AppLogger.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.13.02.43.04/8-ball-pool-coins-and-cash-generator-b6.1.0.0.json#_rels%5C.rels",
      "@type": "PackageEntry",
      "compressedLength": 303,
      "fullName": "_rels\\.rels",
      "length": 533,
      "name": ".rels"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.13.02.43.04/8-ball-pool-coins-and-cash-generator-b6.1.0.0.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9469,
      "fullName": ".signature.p7s",
      "length": 9469,
      "name": ".signature.p7s"
    }
  ],
  "tags": [
    "8",
    "Ball",
    "Pool",
    "Coins",
    "and",
    "Cash",
    "Generator",
    "can",
    "be",
    "hacked",
    "is",
    "there",
    "any",
    "hack",
    "are",
    "hacks",
    "real",
    "a"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}