{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.13.02.43.04/hit-it-rich-coins-generator-j0.1.0.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "hit-it-rich-coins-generator-j0",
  "catalog:commitId": "ab1bd51f-b8b9-46e2-b9d2-47efe0488330",
  "catalog:commitTimeStamp": "2022-01-13T02:43:04.0426522Z",
  "created": "2022-01-13T02:40:28.937Z",
  "description": "This new Hit It Rich Coins Generator is out and you also are able to utilize it instantly. In the browser of yours, click on the link, log in with your account details and enjoy. It is developed by game buffs who would not want to do any harm. In order to understand ways to online generator activation code Hit It Rich Coins and also all that you have to accomplish is follow a few basic guidelines. Thanks to the newest anti ban characteristic, all your personal and private info is likely to be screened and this implies that all that you need to do can be focusing on the game. Yet another trouble with theese hack generator is connectivity. Players commonly buy shut off in between the game which causes chaos.\n\nAcess ONLINE GENERATOR http://tnpps.xyz/8f0cded\n\nHit It Rich Coins Generator is hundred % free to work with. So, this specific hack apk mod makes it quick for you personally by not needing you to earn any modifications to the device of yours. You are able to open the levels or even set all resources to limitless using cheats, generator no human verification can easily finish the game faster.\n\n\n\nYou should first off know that this new Hit It Rich Coins Generator will no doubt include every last bit of needed Coins you'd be interested. You are able to hack game apk free download Coins in the same in merely just click. Instead of doing this, they have paid their moment concentrating on on their volume of sales. You would be the perfect with the gaming generator no survey Coins of ours. It just produces a diversion between the game's data source as well as the player's account.\n\n\n\nHit It Rich Coins Generator is a totally free on-line program which will help the gamer to produce some amount of Coins. An incredible number of players play the game online daily, and there's a lot of details which is flowing every day using the servers. It is going to help you to have incredible experience while enjoying absolutely no cost currency collection services.\n\n\n\nSome of us came together and started to develop a Hit It Rich Coins Generator, which could create totally free Coins on any ios and android smartphone as well as tablet. If you're searching for a quicker process, then simply don't choose this specific. This specific thing about the hack 2022 is a verification method which is going to tell the system of ours which you're not really a bot however, you are able to ignore the verification process as long as your country and email is valid. The time has changed now. This online generator ios offers you total protection from such connectivity problems too. Well, nearly all almost all of the players will be the game challenging and boring in the intermediate amounts as they've to generate hard efforts to collect Coins in the game.\n\n\n\nAnd so in case you want to get permission to access a limitless quantity of Coins immediately, now you are able to make the usage of the Hit It Rich Coins Generator for the job. Having believed, it's nevertheless a lot really worth logging within daily to gain a handful of free funds. With our hack Coins app, the account of yours is protected plus it's very out of the question your account will likely be banished as different hacks have unknowingly and blindly led the users of theirs to within the past Use our Hit It Rich Coins hack download pc to add limitless no-cost Coins to your Hit It Rich account! If we did it will make this piece of writing far too long and we don't wish to waste your time.\n\nThis latest Hit It Rich Coins Generator is all set for you and you will be in a position to gain all the Coins you will be needing. You've to adopt some of the skilful hack apk download no root when you attain to the specific degree in this game. The private proxy support causes it to be 100 % undetectable and also 100 % safe and sound. Hit It Rich does not permit us to use these mods. It really works for android and also ios phones, but could also be run from your pc or laptop with mac os or",
  "id": "hit-it-rich-coins-generator-j0",
  "isPrerelease": false,
  "lastEdited": "2022-01-13T02:43:00.91Z",
  "listed": true,
  "packageHash": "DPiL+EldASPx2nuqf8XyucdcuvNBd0WNVxlWVJezpPEEjiN60A9xSbZXKzkFcfYy8xP0pkGF/SkE1gWtxZay7Q==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 16950,
  "published": "2022-01-13T02:40:28.937Z",
  "verbatimVersion": "1.0.0",
  "version": "1.0.0",
  "dependencyGroups": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.13.02.43.04/hit-it-rich-coins-generator-j0.1.0.0.json#dependencygroup/net6.0",
      "@type": "PackageDependencyGroup",
      "targetFramework": "net6.0"
    }
  ],
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.13.02.43.04/hit-it-rich-coins-generator-j0.1.0.0.json#hit-it-rich-coins-generator-j0.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 2093,
      "fullName": "hit-it-rich-coins-generator-j0.nuspec",
      "length": 4661,
      "name": "hit-it-rich-coins-generator-j0.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.13.02.43.04/hit-it-rich-coins-generator-j0.1.0.0.json#lib%5Cnet6.0%5CAppLogger.dll",
      "@type": "PackageEntry",
      "compressedLength": 1786,
      "fullName": "lib\\net6.0\\AppLogger.dll",
      "length": 4608,
      "name": "AppLogger.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.13.02.43.04/hit-it-rich-coins-generator-j0.1.0.0.json#_rels%5C.rels",
      "@type": "PackageEntry",
      "compressedLength": 297,
      "fullName": "_rels\\.rels",
      "length": 524,
      "name": ".rels"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.13.02.43.04/hit-it-rich-coins-generator-j0.1.0.0.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9468,
      "fullName": ".signature.p7s",
      "length": 9468,
      "name": ".signature.p7s"
    }
  ],
  "tags": [
    "Hit",
    "It",
    "Rich",
    "Coins",
    "Generator",
    "how",
    "to",
    "hack",
    "game",
    "without",
    "verification",
    "can",
    "do",
    "you",
    "i"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}