{
  "@id": "https://api.nuget.org/v3/catalog0/data/2015.02.02.03.31.14/aspose.words.11.7.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "Aspose",
  "catalog:commitId": "6b3245b6-c004-45c3-aa6c-20c640b8b7e7",
  "catalog:commitTimeStamp": "2015-02-02T03:31:14.3242141Z",
  "copyright": "© Aspose 2002-2011. All Rights Reserved.",
  "created": "2012-09-03T11:33:41.59Z",
  "description": "Aspose.Words for .NET class library supports DOC, DOCX, RTF, HTML, OpenDocument, PDF, XPS, EPUB and other formats. With Aspose.Words you can generate, modify, convert, render and print documents without utilizing Microsoft Word®",
  "iconUrl": "http://www.aspose.com/images/products/dotnet/Aspose.Words_128x128.png",
  "id": "Aspose.Words",
  "isPrerelease": false,
  "lastEdited": "0001-01-01T00:00:00Z",
  "licenseUrl": "http://www.aspose.com/corporate/purchase/end-user-license-agreement.aspx",
  "packageHash": "rCi9PYcpW+9lrEuHLsyaaDZtII/IhHwmi+Rs3qo2CZRZ1VKwpjV6KB/dnmkSPAXo4/Koakbr9A6MW2Nj/Th+Zg==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 14142871,
  "projectUrl": "http://www.aspose.com/categories/.net-components/aspose.words-for-.net/default.aspx",
  "published": "2012-09-03T11:33:41.59Z",
  "releaseNotes": "There are 212 improvements and fixes in this regular monthly release. This release introduces the new features, enhancements and fixes to the excptions, bugs and regressions as detailed below:\n\n• New features\n\nWORDSNET-1980\t/rtl/ Support RTL layout and rendering\nWORDSNET-2041\tConsider adding LoadOptions to control how HTML is imported\nWORDSNET-2054\tSupport loading special symbols for dates, times, numbers etc in DOC\nWORDSNET-3820\tSupport extraction of the caption from an embedded object displaying as an icon\nWORDSNET-3848\tPage border is missing or wrong\nWORDSNET-3928\tAdd possibility to insert complex (RTL and LTR) text during mailmerge.\nWORDSNET-3956\tINCLUDEPICTURE is not properly loaded during layout or rendering\nWORDSNET-4112\tINCLUDEPICTURE field updates incorrectly after UpdateField.\nWORDSNET-4122\tFullscale calculation of bounding box of a shape canvas\nWORDSNET-4352\tPicture shapes are not retained upon rendering.\nWORDSNET-4433\t/:5/ Decimal TabStops within Cell are ignored upon rendering.\nWORDSNET-4564\tINCLUDEPICTURE Field does not show up in out document.\nWORDSNET-5372\tCreate a video which shows how to build a table from scratch\nWORDSNET-5550\t/hidden/ Support hidden table rows and cells in Layout\nWORDSNET-5769\tSupport horizontal alignment on image when exporting to HTML\nWORDSNET-6050\tImplement Load and Save warnings for DOC format\nWORDSNET-6140\tINCLUDEPICTURE field cannot be inserted and updated\nWORDSNET-6424\tConsider exposing original filenames of OLE1 objects in the API\nWORDSNET-6428\tFloating table causes duplicate on next page\nWORDSNET-6447\tInsertField(\"INCLUDEPICTURE...\") is not working\nWORDSNET-6536\tConsider retaining duplicate Bookmarks during saving\nWORDSNET-6656\tMERGEFIELD inside INCLUDEPICTURE does not work\nWORDSNET-6661\tSupport numeral configuration\n\n• Enhancements\n\nWORDSJAVA-381\tCompound lines are not rendered to graphics in Java\nWORDSJAVA-435\tWordArt with italic style has inexact angle.\nWORDSJAVA-481\tWORDSJAVA-478 Generate Manifest from the build script\nWORDSJAVA-564\tImage doesn't stretch to shape size\nWORDSJAVA-569\tBetter support of pictures with BufferedImage.TYPE_USHORT_555_RGB type.\nWORDSJAVA-612\tGdiRenderer refactory\nWORDSJAVA-613\tManual lifting of AsposeWordsPrintDocument and TestPrint\nWORDSNET-1803\tRemove \"LayoutAdapter\" and convert Aspose.Layout to APS directly\nWORDSNET-2274\t/table grid/ Hidden content is visible in output PDF/Image.\nWORDSNET-2606\tVertical alignment of text in one row is incorrect\nWORDSNET-2915\tPart of content was moved to the next page during rendering\nWORDSNET-3192\t/later/ Inline tables overlap each other upon rendering.\nWORDSNET-3284\t/wrap/ Frame overlaps part of content during rendering.\nWORDSNET-3733\tHidden table row becomes visible when open/save the document in DOCX format.\nWORDSNET-3837\tLayout selects wrong font name based on character class\nWORDSNET-3842\tIncorrect text box internal clipping\nWORDSNET-3843\tRow height is wrong\nWORDSNET-3853\tPictures are improperly scaled\nWORDSNET-3856\tSection properties are wrong\nWORDSNET-3947\tThe output PDF has less pages than the input document.\nWORDSNET-3992\tinvisible character is visible after convertign to PDF or XPS.\nWORDSNET-4029\tpdf conversion replace Helvetica font with TimesNewRoman one instead of Arial\nWORDSNET-4501\tPart of content was moved to the next page upon rendering.\nWORDSNET-4594\tTable inside TextBox is cut off during rendering.\nWORDSNET-4747\tEndnote is lost during rendering.\nWORDSNET-4767\tExtra pages are added during rendering.\nWORDSNET-4953\tImage is moved to previous page and truncated upon rendering.\nWORDSNET-5320\tFix locale reading\nWORDSNET-5432\tThere are fewer pages in the document after rendering.\nWORDSNET-5443\tText box is rendered at incorrect page location.\nWORDSNET-5454\tText box is placed incorrectly on page while rendering.\nWORDSNET-5456\tText is shifted down while rendering.\nWORDSNET-5469\tTable inside textbox is cut-off during rendering.\nWORDSNET-5502\tOdd and even footers are interchanged upon rendering.\nWORDSNET-5635\tRowFormat.AllowBreakAcrossPages is not working on rendering to PDF\nWORDSNET-5766\tOn DOCX to PDF conversion, Table at the end of page is truncated\nWORDSNET-6008\tWhile converting dot to doc, text layout disturbed.\nWORDSNET-6045\tSupport EMF metafile embedded to WMF metafiles\nWORDSNET-6090\tTOC entries are not clickable in PDF\nWORDSNET-6287\tAlternative text of signature line disappears when document is opened and saved\nWORDSNET-6325\tExtra empty space at the left side of comments\nWORDSNET-6345\tDrawingML is rendering incorrectly in PDF\nWORDSNET-6509\tShape in WordML document becomes invisible when saving to any format\nWORDSNET-6557\tDrawingML inside SDT is crossed when rendering to fixed page formats\nWORDSNET-6634\tMS Word 2010 opens output doc file in protected view.\nWORDSNET-6651\tAspose output Pdf file is not opening correctly in syncfusion PdfViewer\nWORDSNET-6677\tDocx to HTML conversion issue with border line of the autoshape\nWORDSNET-6681\tImprove font substitution according to default registy values.\nWORDSNET-6687\tDoc to Pdf conversion with border line\nWORDSNET-6720\tWORDSNET-6600 Border.LineStyle is set to Solid without 'border-style' CSS attribute on Html reading\nWORDSNET-6727\tTextbox with automatic font color text is not being rendered properly\nWORDSNET-6730\t/DrawingML textbox/ Range.Replace do not work for text frame\nWORDSNET-6775\tCode review request\nWORDSNET-6784\tRtf to Doc conversion Page Setup Margin Gutter issue\nWORDSNET-6802\tAW merge format algorithm behaves not like its MS counterpart\nWORDSNET-6816\tBlank pages are lost during rendering to PDF\n\n• Performance\n\nWORDSNET-3798\tConsider trying to speed up printing performance vs automation and VBA macro\n\n• Exceptions\n\nWORDSJAVA-605\tNullReferenceException occurs when rendering Shape to HTML\nWORDSNET-5684\tNullReferenceException: When UpdateFileds is called after UpdatePageLayout\nWORDSNET-5997\tArgumentNullException on MailMerge.Execute on Nested MergeFields\nWORDSNET-6295\tInvalidCastException occurs when calling UpdateFields\nWORDSNET-6394\tNullReferenceException occurs during rendering to fixed page formats\nWORDSNET-6468\tAspose.Words.FileCorruptedException occurs upon loading DOCX\nWORDSNET-6505\tAspose.Words.FileCorruptedException occurs upon loading DOCX\nWORDSNET-6549\tNullReferenceException when rendering DOCX file to a PDF\nWORDSNET-6558\tNullReferenceException occurs when rendering a textbox\nWORDSNET-6621\tAspose.Words.FileCorruptedException occurs while loading DOC document with comments.\nWORDSNET-6640\tException on calling UpdateFields method\nWORDSNET-6671\tException thrown while Doc to Pdf conversion\nWORDSNET-6744\tException while converting Docx to PDF\nWORDSNET-6759\tOutOfMemoryException occurs during loading DOC\nWORDSNET-6779\tException when updating fields in document\nWORDSNET-6793\tNullReferenceException occurs during converting to DOC\n\n• Bugs\n\nWORDSJAVA-410\tImage is sized incorrectly when rendering to graphics\nWORDSJAVA-486\tSome textures disappear\nWORDSJAVA-492\tInexact asian text wrapping inside textboxes.\nWORDSJAVA-493\tCircle Vml shape rendered incorrectly.\nWORDSJAVA-513\tincorrect \"saturation\" of lines and textures\nWORDSJAVA-534\tImprove hatch brushes for Gdi render.\nWORDSJAVA-559\tTiff image is invisible(Aspose.Words for java)\nWORDSJAVA-598\tMetafile texture doesn't stretched to a shape size when Wrap Mode == Clamp\nWORDSJAVA-607\tFind and remove the code that prints any message(s) from production - keep it in test code only.\nWORDSNET-1868\tImages are not displayed after converting WML to DOC.\nWORDSNET-3008\tWinding checkboxes are not recognized upon rendering.\nWORDSNET-3562\tTable disappears after save to PDF.\nWORDSNET-3869\tShape sizes are changed after open/save ODT document.\nWORDSNET-4121\tList formatting shows through in TOC entries after updating\nWORDSNET-4407\tnumbers of items in TOC are bold after updating fields.\nWORDSNET-4438\tLTR text does not look as expected upon main merge RTL merge fields.\nWORDSNET-4476\t\"Unknown file format\" when open zero length file.\nWORDSNET-4508\tDefault field name is used as field result during rendering of fields in the header\nWORDSNET-4573\t/horizontal alignment/ TextBox shapes are rendered as transparent squares and are not visible upon converting to HTML\nWORDSNET-4873\tBuiltInDocumentProperties.CreatedTime and other DateTime properties must return date in UTC.\nWORDSNET-4928\tRtf Reader handles context of table properties incorrectly\nWORDSNET-4939\tTable looks incorrect after converting MHTML to other formats.\nWORDSNET-4971\tSuper-scripted text is not properly underlined upon rendering.\nWORDSNET-4999\tFormat of TOC item is changed after UpdateFields.\nWORDSNET-5162\tFormatting of TOC items is incorrect after updating fields.\nWORDSNET-5185\tAspose.Words eats all memory and hangs upon executing mail merge.\nWORDSNET-5187\tParagraph text color is changed after converting to RTF\nWORDSNET-5307\tWatermark disappears after open/save DOCX document.\nWORDSNET-5403\tStyle of TOC is changed after UpdateFields.\nWORDSNET-5417\tDocument pages are rendered out of order\nWORDSNET-5452\tOdd and even headers are not rendered properly.\nWORDSNET-5483\tPage numbering is incorrect after rendering.\nWORDSNET-5496\tIncorrect page numbering i.e. 97,98,99,101,102; Number 100 is skipped\nWORDSNET-5497\tCode of XE field is shown in TOC after updating fields.\nWORDSNET-5517\tTOC is incorrectly updated by Aspose.Words if it is insertedt in heading paragraph\nWORDSNET-5524\tBlank page is missed upon rendering document.\nWORDSNET-5538\tZ-index on VML shapes isn't preserved during docx->docx conversion.\nWORDSNET-5552\tTable disappears during rendering\nWORDSNET-5592\tTextBox incorrectly positioned upon DOCX to HTML conversion\nWORDSNET-5601\tFont is changed during MailMerge.\nWORDSNET-5666\tSetting Table style margin-left does not change table indent from left in DOC/DOCX\nWORDSNET-5672\tList numbering color/style for TOC entries was changed on UpdateFields\nWORDSNET-5829\tBidi not working when document save to PDF\nWORDSNET-5860\tEmf+ Dual // OfficeMath equation in Word Ole object is corrupted in PDF\nWORDSNET-5891\t/horizontal alignment/ DOCX to HTML conversion issues with textboxes\nWORDSNET-5941\tMail Merge Font problem\nWORDSNET-5949\tunexplainable tabstop (occurs in doc and docx).\nWORDSNET-5950\twrong format in TOC (occurs only in docx)\nWORDSNET-5958\tUnicode characters LTR and RTL are ignored on HTML export\nWORDSNET-5964\tWhile converting odt to pdf format, each section rendered on individual page.\nWORDSNET-6000\tWhile converting doc to rtf, improper font charset to RTF.\nWORDSNET-6012\tDocument.Print skips printing the second page\nWORDSNET-6025\t/hideMark/ Output PDF has one more page than the input DOCX\nWORDSNET-6069\tCalling UpdateFields after DocumentBuilder.InsertTableOfContents generates incorrect TOC\nWORDSNET-6088\tTOC sub heading text aligned incorrectly after Open/Save in DOC format.\nWORDSNET-6092\tDocx to PDF conversion issue\nWORDSNET-6109\tWindings Symbol is lost during rendering to fixed formats\nWORDSNET-6132\tUpdateFields calculates TOC page numbers incorrectly\nWORDSNET-6150\tCalling UpdateFields twice corrupts TOС/SEQ fields\nWORDSNET-6152\tText Alignment issue while convering html to docx\nWORDSNET-6166\tAspose.Words generates 20 pages when rendering a 2 page DOCX to fixed formats\nWORDSNET-6182\tIncorrect parameter is passed to IMailMergeDataSource when using new Object.Attribute sytnax\nWORDSNET-6183\tShape borders are rendering incorrectly in HTML\nWORDSNET-6184\tTable in DOC is rendering many times in PDF/Tiff\nWORDSNET-6223\tMergeFields inside header don't show values in PDF\nWORDSNET-6270\tHorizontally Flipped DrawingML image is rendering incorrectly in PDF\nWORDSNET-6275\tExtra blank page problem occurs while converting doc to Pdf Format.\nWORDSNET-6311\tREF field with CardText or Number formatting switches is updated incorrectly\nWORDSNET-6352\tA table with too many columns cannot be opened when saving to Word formats\nWORDSNET-6399\tExtra empty page is added to the PDF document after conversion from Doc file\nWORDSNET-6401\tWordArt shape fill is distorted while rendering path gradient shape.\nWORDSNET-6467\tAppending documents into empty (new Document()) stretches the contents of one page into multiple pages\nWORDSNET-6478\tUICompat97To2003 is not set for rtf files\nWORDSNET-6518\tLoadOptions object shouldn't be changed during opening\nWORDSNET-6525\tUnable to access PRINT field in the Doc file\nWORDSNET-6530\tTransparency of PNG image is disturbed when rendering to PDF\nWORDSNET-6551\tIncorrect Page numbering in the TOC when calling UpdateFields\nWORDSNET-6580\tCustom style in RTF document resulting formatting issue\nWORDSNET-6587\tDocx to Pdf conversion issue with page break\nWORDSNET-6601\tMHTML document loses table background color while rendering to PDF\nWORDSNET-6632\tProblem with Image size when covert from DOC, DOCX, WML to RTF\nWORDSNET-6644\tImage flips upon rendering DOCX document to PDF\nWORDSNET-6649\tRun.Font.Bidi is lost when converting to ODT format\nWORDSNET-6657\tShape is displaying at the wrong page side in ODT\nWORDSNET-6658\tParagraph alignment is reversed during converting doc to odt\nWORDSNET-6674\tMergefield value splits into two Runs with different Fonts\nWORDSNET-6676\tCompatibly options \"Don't add leading (extra space) between rows of text\" processed incorrectly\nWORDSNET-6678\tAdd support for \"Don't expand character spaces on a line that ends with SHIFT-RETURN\" option\nWORDSNET-6698\tLeft/Right cellpadding of RTF dcoument are changed after conversion\nWORDSNET-6699\tRTF document loses table format upon conversion\nWORDSNET-6702\tTOC is updating incorrectly\nWORDSNET-6714\tSetting the font hidden doesn't hide Row in DOCX\nWORDSNET-6722\tBullet style is not being rendered correctly\nWORDSNET-6723\tParagraphFormat.SpaceAfter is not preserved during loading ODT\nWORDSNET-6724\tShape is overlapping the Table content\nWORDSNET-6728\tShape is rendering as red cross symbol in PDF\nWORDSNET-6729\tSetting the font hidden doesn't hide DrawingML in DOCX\nWORDSNET-6732\tDocx to Pdf conversion issue while mail merge\nWORDSNET-6733\tDocument is rendered out of page bounds during printing\nWORDSNET-6734\tDocx to Pdf conversion issue, images are rotated in output pdf file\nWORDSNET-6735\tContent is clipped because of incorrect column height calculation.\nWORDSNET-6737\tTables and shapes are shifted while rendering.\nWORDSNET-6738\tTextbox in DOCX converted to HTML as empty image\nWORDSNET-6740\tInvestigate why mail merge regions' data is not visible in PDF\nWORDSNET-6742\tTable background color fades while converting DOC to HTML\nWORDSNET-6754\tBug with ExtractContent code can't extract text in table cell\nWORDSNET-6755\tShape wrap type is lost during loading OTT into DOM\nWORDSNET-6769\tRTF to Doc conversion issue with line spacing value\nWORDSNET-6806\tCalling UpdateFields after InsertTableOfContents calculates Cell's width incorrectly\n\n• Regressions\n\nWORDSJAVA-611\tFont Substitution is broken by UnicodeString refactory\nWORDSNET-5321\tAspose.Words treats numbers as string upon mail merge.\nWORDSNET-6564\t\\html autodetect\\ \"table\" tag causes Aspose.Words not to detect HTML\nWORDSNET-6689\tNullReferenceException occurs when rendering GroupShape to HTML\nWORDSNET-6701\tNullReferenceException occurs during exporting Shape to HTML\nWORDSNET-6710\t/DrawingML textbox/ Unable to access SDT nodes from inside DrawingML\nWORDSNET-6739\tPrinting speed has slowed down in Aspose.Words for .NET 11.5 and higher",
  "requireLicenseAcceptance": true,
  "title": "Aspose.Words for .Net",
  "version": "11.7.0",
  "tags": [
    "Aspose.Words",
    "DOC",
    "DOCX",
    "RTF",
    "HTML",
    "OpenDocument",
    "XPS",
    "EPUB",
    "Word",
    "Document",
    "Processing"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    }
  }
}