{
  "@id": "https://api.nuget.org/v3/catalog0/data/2015.02.07.09.45.27/jqwidgets_library.3.6.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "jQWidgets",
  "catalog:commitId": "1cc01d14-6257-4af4-a920-30ce02bc1476",
  "catalog:commitTimeStamp": "2015-02-07T09:45:27.2594393Z",
  "created": "2014-12-19T08:51:13.093Z",
  "description": "jQWidgets is an advanced jQuery and HTML5 UI framework.\n\njQWidgets provides a comprehensive solution for building professional web sites and mobile apps. It is built entirely on open standards and technologies like HTML5, CSS, Javascript and jQuery. jQWidgets enables responsive web development and helps you create apps and websites that look beautiful on desktops, tablets and smart phones.\n\njQWidgets is a feature complete framework with professional touch-enabled jQuery widgets, themes, input validation, drag & drop plug-ins, data adapters, built-in WAI-ARIA accessibility, internationalization and MVVM support.",
  "developmentDependency": "true",
  "id": "jQWidgets_Library",
  "isPrerelease": false,
  "lastEdited": "0001-01-01T00:00:00Z",
  "licenseUrl": "http://www.jqwidgets.com/license/",
  "packageHash": "kNcRXA/smnIAnnJ+0cSSCyHbOpSdsvUPwxNBjWlPTzcEzJu8rJdiqQo1g1Azvj2bujzkEt4nPPbyzo2/SmiUvQ==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 1740106,
  "projectUrl": "http://www.jqwidgets.com/",
  "published": "1900-01-01T00:00:00Z",
  "releaseNotes": "jQWidgets v3.6.0 Release, Nov-25-2014\n\nWhat's New:\n\n- jqxChart OHLC series.\n- jqxChart Candlestick series.\n- jqxTreeGrid Three-State checkboxes.\n- jqxTreeGrid new Paging Mode.\n- jqxAngular new AMD module which allows automatic on demand loading of the required jQWidgets javascript files.\n- jqxMenu and jqxDocking keyboard navigation.\n- jqxSlider tooltips.\n- Observable Array function.\nWhat's Improved:\n\n- jqxChart Range selector mouse and touch handling.\n- jqxChart automatic calculation of unit interval in date/time series.\n- jqxChart improvements in spline rendering algorithm.\n- jqxChart improvements in rendering of column series on date/time axis.\n- jqxAngular's jqx-watch attribute now allows watching for changes in multiple members.\nWhat's Fixed:\n\n- Fixed an issue in jqxListBox, jqxComboBox and jqxDropDownList about the events handling when the widget is created from 'select' tag.\n- Fixed an issue in jqxDropDownList regarding the \"getItemByValue\" method.\n- Fixed an issue about the Clipboard operations and Selection in jqxGrid, jqxDataTable, jqxListBox and jqxTreeGrid when the widget is used on Mac OS.\n- Fixed an issue about the Clipboard Copy in jqxGrid when the data is sorted.\n- Fixed an issue in jqxKnockout about the Inputs and their events handling.\n- Fixed an issue in jqxGrid regarding the rendering after dynamically pinning and unpinning columns when the Grid has columns hierarchy.\n- Fixed an issue in jqxTreeGrid regarding the pinned columns feature in IE7.\n- Fixed an issue in jqxTreeGrid regarding the beginCellEdit method.\n- Fixed an issue in jqxDataTable regarding filter's rendering when columns resize and reorder features are enabled.\n- Fixed an issue in jqxCheckBox rendering in some themes when the boxSize is different than the default.\n- Fixed an issue in jqxChart regarding the DateTime series offset calculations.\n- Fixed an issue in jqxChart about Legend items spacing with custom layout.\n- Fixed an issue in jqxChart about Formatting error on xAxis text.\n- Fixed an issue in jqxChart about performance with date/time xAxis and milliseconds unit interval.\n- Fixed an issue in jqxChart about rounding with date/time xAxis and seconds unit interval.\n- Fixed an issue in jqxChart about spline rendering algorithm.\n- Fixed an issue in jqxChart about Range selector rendering bug when the min/max are out of range compared to source data.\n- Fixed an issue in jqxChart about Range selector resizing during series visibility toggle.\nBreaking changes:\n\njqxAngular plugin's jqx-data attribute is removed and is no longer necessary. Replace \"data\" in your code with the scope's member name.",
  "requireLicenseAcceptance": false,
  "title": "jQWidgets",
  "version": "3.6.0",
  "dependencyGroups": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2015.02.07.09.45.27/jqwidgets_library.3.6.0.json#dependencygroup",
      "@type": "PackageDependencyGroup",
      "dependencies": [
        {
          "@id": "https://api.nuget.org/v3/catalog0/data/2015.02.07.09.45.27/jqwidgets_library.3.6.0.json#dependencygroup/jquery",
          "@type": "PackageDependency",
          "id": "jQuery",
          "range": "[1.7.0, )"
        }
      ]
    }
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    }
  }
}