{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.29.00.11.17/_the-sims-freeplay-hack-working-2022-version-ofw.2.8.82.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "SharpCrafters s.r.o.",
  "catalog:commitId": "f79ecbe7-022c-4125-a46b-2da6b9401bc8",
  "catalog:commitTimeStamp": "2022-01-29T00:11:17.1576013Z",
  "created": "2022-01-26T11:28:13.793Z",
  "description": "# _The Sims Freeplay Hack Working 2022 Version ofw\n\n\nCLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; [http://9.bltadwin.ru/hack.php](http://9.bltadwin.ru/hack.php)\n\n\nEnjoy the world most famous life simulation game franchise with The Sim Freeplay. With our mod, you'll have access unlimited contents. The sims freeplay hack game has recognition turned out to be very addictive. Its users are growing all around the world from Australia to. Download The Sims FreePlay Mod APK Latest Version free for Android. Create your own story. Build your own life, job and more aspects in this.\n\n## [CLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; http://9.bltadwin.ru/hack.php](http://9.bltadwin.ru/hack.php)\n\n · Sims Freeplay MOD Hack. Download and install sims Freeplay Hack Apk MOD in your android device and enjoy unlimited money and LP Points. This apk MOD comes with pre-build resources meaning you don’t have to perform and cheat the method. Just download, install and let the fun begins. Download Link:Estimated Reading Time: 3 mins. Jun 4, - The Sims FreePlay Hack and Cheats. See more ideas about sims, sims freeplay cheats, tool hacks. Even though it is easy to earn Simoleons, but it is difficult to accumulate enough amounts and you will require plenty of currencies to purchase upgrades for your Sims. To overcome this, you can use The Sims Freeplay Hack, which gives unlimited quantity of Simoleons and that too in an instant. This denotes that you can upgrade the houses of all your Sims at the same time.\n\nthe sims freeplay hacks, the sims freeplay hacks 2021, the sims freeplay hack ios, the sims freeplay hack download, the sims freeplay hack ios 2021, the sims freeplay hack apk, the sims freeplay hack download ios, the sims freeplay hack money, the sims freeplay hack ipa, the sims freeplay hack mod apk ios, the sims freeplay hack android 2020, the sims freeplay hack apk mod (unlimited money), the sims freeplay hack app, the sims freeplay hack apk obb, the sims freeplay hack apk vip, the sims freeplay hack atualizado, the sims freeplay hack apk ultima version, the sims freeplay hack 2020, the sims freeplay hack 2021, the sims freeplay hack android, the sims freeplay hack bluestacks, the sims freeplay ban hack, baixar the sims freeplay hack, baixar the sims freeplay hack ios, hack the sims freeplay bằng freedom, como baixar the sims freeplay hack no iphone, bản hack the sims freeplay, the sims freeplay hack baixar, the sims freeplay apk hack, the sims freeplay hack cheat, the sims freeplay hack.com, the sims freeplay hack cydia, the sims freeplay hack club, the sims freeplay hack cho ios, sims freeplay hack codes, cach hack the sims freeplay, download the sims freeplay hack ios to get unlimited currency, the sims freeplay hack download android, the sims freeplay hack download pc, the sims freeplay hack dinheiro infinito, the sims freeplay hack descargar, the sims freeplay hack version download, the sims freeplay hack ios 2020 download, the sims freeplay hacked version, the sims freeplay xp hack, hack de simoleones en the sims freeplay, the sims freeplay hack español, sims freeplay hack español, how to get free xp in sims freeplay, sims freeplay hack 2020, sims hack freeplay, the sims freeplay hack for ios, the sims freeplay hack free (simoleons life points), the sims freeplay hack free ios, the sims freeplay hack file, the sims freeplay ipad hack, sims freeplay hack free download, sims freeplay hack free, sims freeplay hack free simoleons, free sims freeplay hack, the sims freeplay hack generator, the sims freeplay hack game download ios, sims freeplay hack game download, sims freeplay hack generator no human verification, sims freeplay hack game, how to get the sims freeplay hack, sims freeplay hack game ios, download game the sims freeplay hack, tải game the sims freeplay hack, tải game the sims freeplay hack cho ios, hack game the sims freeplay, hack game the sims freeplay ios, hack game the sims freeplay cho ios, hack game the sims freep",
  "id": "_The-Sims-Freeplay-Hack-Working-2022-Version-ofw",
  "isPrerelease": false,
  "language": "en-US",
  "lastEdited": "2022-01-28T23:47:57.483Z",
  "listed": false,
  "packageHash": "MocA145fFaWgZfJcVSWUi98aF+vInw6GmBIC7BtkMk3RCRKgxt08zKI425q25BoOHDwVYUtT3jcZxru+7jNXEw==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 11538,
  "published": "1900-01-01T00:00:00Z",
  "requireLicenseAcceptance": false,
  "title": "_The-Sims-Freeplay-Hack-Working-2022-Version-ofw",
  "verbatimVersion": "2.8.82",
  "version": "2.8.82",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.29.00.11.17/_the-sims-freeplay-hack-working-2022-version-ofw.2.8.82.json#nhyybrjtsu.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1410,
      "fullName": "nhyybrjtsu.nuspec",
      "length": 4479,
      "name": "nhyybrjtsu.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.29.00.11.17/_the-sims-freeplay-hack-working-2022-version-ofw.2.8.82.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9468,
      "fullName": ".signature.p7s",
      "length": 9468,
      "name": ".signature.p7s"
    }
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}