{
  "@id": "https://api.nuget.org/v3/catalog0/data/2015.02.06.00.06.00/groupdocs-assembly-dotnet.1.0.4.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "GroupDocs",
  "catalog:commitId": "59cda64e-07c4-4a99-8555-86ad6255a1ee",
  "catalog:commitTimeStamp": "2015-02-06T00:06:00.0704998Z",
  "created": "2014-07-31T13:44:48.027Z",
  "description": "GroupDocs.Assembly for .NET is a flexible library that allows you to generate documents by filling out merge fields in PDF or Word templates with data obtained from a DB or user input. The library can be of great help if you need to generate lots of custom documents that have a standard template, but need to be filled out with unique data. These could be invoices, bills, order quotes, offer letters, NDAs, legal documents, insurance policies, etc.\n\nThe library comes with a web UI which allows end users to prepare templates and get the completed documents without any assistance from developers. Easy to follow wizards guide end users through the document assembly process, which includes the following steps:\n\n1. Upload a template in a PDF, DOC or DOCX format with merge fields that should be populated with data.\n\n2. Compose an online questionnaire associated with the merge fields in the template and publish it on the web.\n\n3. Invite users to complete the questionnaire.\n\nFor each completed questionnaire a new unique document is generated. The document looks exactly like the template but includes data populated into the merge fields.\n\nKey Features & Benefits:\n\n - Templates can be filled in with data obtained from web forms or a DB.\n - Support for different types of form fields: text box, check box, lists and combo, radio buttons, etc.\n - Ability to set default values and rules for questions (for example set value range and limits for respond length).\n - Ability to handle JavaScript events (for example onTemplateCreated, onTemplateMerge, etc.).\n - Documents are generated on-the-fly, each time a questionnaire is completed.\n - Convenient UI allows end users to generate documents without any assistance from developers.\n\nFor more details on the library, please visit GroupDocs website at: \nhttp://groupdocs.com/dot-net/document-assembly-library\n\nNote: this download contains a fully working version of the product, however without a license set it will run in evaluation mode with some limitations. To test the GroupDocs.Assembly for .NET library without limitations, please request a free 30-day temporary license.",
  "iconUrl": "https://photos-3.dropbox.com/t/0/AACgljw_RqMTC74mVPRR2Gz3iXtSYytm34Tcn-dSnbbMWA/12/223712704/png/32x32/3/_/1/2/GD_ASM_NETIcon_100.png/44nu3kjl1eFDd2D4NiMh2rexZdT09BvWRhm1cVO2JHk?size=640x480",
  "id": "groupdocs-assembly-dotnet",
  "isPrerelease": false,
  "lastEdited": "2014-08-04T08:44:55.3Z",
  "packageHash": "NaGGIWU9EXYCNNxbWceCg6zzQziwhWjb7WwkSdQ6C2TLujO5VGAsrB+Wev9RzDy32KzHzuEjJsWilgqzNg7CUw==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 42335878,
  "projectUrl": "http://groupdocs.com/dot-net/document-assembly-library",
  "published": "2014-07-31T13:44:48.823Z",
  "releaseNotes": "Improvements\n\nDA-468 - Ability to merge data between TableStart/TableEnd fields;\nDA-514 - Questionnaire builder: add help text;\nDA-541 - Ability to merge large image (big dimension) in Word template;",
  "requireLicenseAcceptance": false,
  "summary": "GroupDocs.Assembly for .NET is a flexible library that allows you to generate documents by filling out merge fields in PDF or Word templates with data obtained from a DB or user input. The library can be of great help if you need to generate lots of custom documents that have a standard template, but need to be filled out with unique data.",
  "title": "GroupDocs.Assembly for .NET",
  "version": "1.0.4",
  "tags": [
    "assembly",
    "assemble",
    "generation",
    "generate",
    "document",
    "pdf",
    "word",
    "doc",
    "docx",
    "template",
    "mail",
    "merge",
    "fields"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    }
  }
}