{
  "@id": "https://api.nuget.org/v3/catalog0/data/2015.02.02.03.47.58/cuemon.1.0.2012.2500.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "Michael Mortensen",
  "catalog:commitId": "b8f1e379-812f-452e-a3f6-3c423453280a",
  "catalog:commitTimeStamp": "2015-02-02T03:47:58.7078771Z",
  "copyright": "Copyright © MuchMore 2009-2012. All rights reserved.",
  "created": "2012-09-10T02:02:13.12Z",
  "description": "If you like the structure of the .NET platform, then the Cuemon .NET Framework Additions might just be that extra solution you have been looking for! With these assemblies I have aimed to accomplish at least two things; simplify the tedious work that is always present when coding towards a generic framework, and implementing some core- and utility classes for you to enjoy.",
  "iconUrl": "http://cdn.cuemon.net/themes/cuemon/images/nuget.png",
  "id": "Cuemon",
  "isPrerelease": false,
  "language": "en-US",
  "lastEdited": "0001-01-01T00:00:00Z",
  "licenseUrl": "http://creativecommons.org/licenses/by/3.0/",
  "packageHash": "72GfI8cxf+yDO2RZiKEG5d08XDeuBl0YqG5d9K29vvpDcZsmtEwc9hPmBDbM1fzI0xYeuN53uCGxLHJ9dtGRkw==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 355943,
  "projectUrl": "http://www.cuemon.net/",
  "published": "2012-09-10T02:02:13.12Z",
  "releaseNotes": "This release contains several improvements related to the many new exiting features from last release.\n\nThe primary focus for this release was to stabilize, refurbish and improve the functionality of the last grand release.\n\nThe following work has been implemented:\n\n- The CountdownEvent class was stabilized and refurbished in some areas to reduce misunderstanding\n- The Instrumentation class was stabilized and refurbished in some areas to ease usage as well as support time measuring of multi threaded scenarios\n- The NetHttpUtility class was heavily extended and modernized to every day REST usage and beyond. Among other improvements, the most noticeable is now the support for Factory pattern towards WorkItem implementations\n- The EnumerableUtility class was extended with two new methods; the ToArray method as well as a Chunk method ideal for batch task and similar\n- The SqlQueryBuilder class and SqlCeQueryBuilder class both received a bug fix when computing the WHERE clause; it now supports check on IS NULL scenarios\n- The BusinessEntityUtility class received a performance boost in the CreateDescendantOrSelfEntity method when looking for derived entities and a new method; ParseEntityRelation\n- The MethodEnteredEventArgs and MethodExitedEventArgs both received support for a thread referenced identifier\n- The TimeMeasure class was stabilized and refurbished in some areas to ease usage as well as support time measuring of multi threaded scenarios\n- The ReflectionUtility class was extended with a ToString method for MethodBase derived classes to clearly describe the signature of a method or property\n- New EventUtility class to safely Raise, Add and Remove events in a thread safe manner\n- The BusinessEntity class was extended with a shortcut method to CreateDescendantOrSelfEntity\n- The BusinessEntityCollection class was stabilized and extended with two new methods; ParseEntityRelation and CreateDescendantOrSelfEntity\n- The GlobalModule class received a shortcut property to Cache\n- The WorkItem class (used in conjunction with the WorkItemPool class) was heavily extended and modernized to every day WorkItem task. Among other improvements, the most noticeable is support for the Factory pattern using Action and Func delegates\n- The QueryUtility class was refurbished with several new overloads of the GetQueryFragment method\n\nNote: this version has a breaking change from assembly version 1.0.2012.390 to 1.0.1012.2500. This was done as a result of the many improvements since the 1.0.2012.390 version.",
  "requireLicenseAcceptance": false,
  "summary": "Simple,  logical and every-day usage additions to the Microsoft .NET Framework 2.0 and forward. Follows the established namespace structure already found in the .NET Framework.",
  "title": "Cuemon .NET Framework Additions",
  "version": "1.0.2012.2500",
  "tags": [
    "cuemon",
    "xml",
    "xslt",
    "json",
    ".net",
    "framework",
    "additions",
    "businessentity",
    "caching",
    "manager",
    "datespan",
    "depedency",
    "watcher",
    "dataadapter",
    "datamanager",
    "sqlceclient",
    "sqlclient",
    "datadepedency",
    "netdepedency",
    "securitytoken",
    "hash",
    "aes",
    "utility",
    "classes",
    "xsltpage",
    "xsltmaterpage",
    "globalmodule",
    "ihttpmodule",
    "cloud",
    "security",
    "wcf",
    "wmi",
    "threading",
    "async",
    "httppost",
    "httpput",
    "httpget",
    "httpdelete",
    "countdownevent",
    "processinfo",
    "instrumentation",
    "factory",
    "func",
    "action",
    "timemeasure"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    }
  }
}