{
  "@id": "https://api.nuget.org/v3/catalog0/data/2015.04.07.17.15.22/aspose.words.15.2.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "Aspose",
  "catalog:commitId": "4b566964-b327-4cda-9403-f661f87c215b",
  "catalog:commitTimeStamp": "2015-04-07T17:15:22.8384847Z",
  "copyright": "(C) Aspose 2002-2014. All Rights Reserved.",
  "created": "2015-03-06T08:59:15.387Z",
  "description": "Aspose.Words for .NET is a class library for .NET that enables you to perform a wide range of document processing tasks directly within your .NET applications.",
  "iconUrl": "http://www.aspose.com/images/products/dotnet/Aspose.Words_128x128.png",
  "id": "Aspose.Words",
  "isPrerelease": false,
  "lastEdited": "0001-01-01T00:00:00Z",
  "licenseUrl": "http://www.aspose.com/corporate/purchase/end-user-license-agreement.aspx",
  "listed": true,
  "packageHash": "q0IDXp2WY8l/yLjXlpo4vS46YAf6XjuREx05UCPzVl92FZRuphpWy59wUhXgE9FFLu5Ipc4lPObUHeH8kXqCXA==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 9873582,
  "projectUrl": "http://www.aspose.com/categories/.net-components/aspose.words-for-.net/default.aspx",
  "published": "2015-03-06T08:59:15.387Z",
  "releaseNotes": "Aspose.Words for .NET 15.2 Release Notes\n\nMajor Features\n\nThere are 116 improvements and fixes in this regular monthly release. The most notable are: \n\n* Document comparison feature is introduced, see Document.Compare\n* DrawingML API breaking changes (Shape and DrawingML classes merged into Shape)\n* Implemented text justification for multiline WordArt objects\n* Implemented multi line text rendering in DrawingML text boxes, SmartArt and charts\n* Middle East languages are now rendered correctly in SmartArt and charts\n* Improved positioning of comment's balloons during rendering \n* Improved vertical text inside text boxes during rendering\n\nAll Changes\nKey Summary Category \nWORDSNET-10065 Second line of Multi-line text in DrawingML is not visible in fixed page formats Bug \nWORDSNET-10305 LayoutCollector.GetStartPageIndex method incorrectly updates FILENAME value Bug \nWORDSNET-10326 Vertical spacing between lines in DrawingML is not preserved and multi-line text is transformed to single line in PDF Bug \nWORDSNET-10765 DocumentBuilder.Font formatting is incorrectly applied using 14.8.0 Bug \nWORDSNET-10865 Multi-line text in SmartArt objects render on a single line in PDF Bug \nWORDSNET-11060 A PageBreak is not preserved during open/save a WordML document Bug \nWORDSNET-11137 Content removed during open/save a DOCX Bug \nWORDSNET-11204 Merge fields in text boxes lose values after conversion to PDF Bug \nWORDSNET-11205 DrawingML looks incorrect after rendering with DmlRenderingMode.DrawingML set. Bug \nWORDSNET-11206 Hebrew text is reversed after conversion from Docx to Pdf/Png/Docx Bug \nWORDSNET-11214 Image is moving up toward the cell top after the document merge Bug \nWORDSNET-11231 Infinite loop when converting a document with a floating table in a vertically merged cell to pdf Bug \nWORDSNET-11244 Put name of Word document in FILENAME field in PDF Bug \nWORDSNET-11246 Cannot insert a node of this type at this location - for doc with chart and shape Bug \nWORDSNET-11269 Percian words in Chart are broken when rendering to PDF Bug \nWORDSNET-11283 Left indent of table is changed after re-saving RTF Bug \nWORDSNET-11301 Warnings is being generated during open/save a DOC Bug \nWORDSNET-11312 Corrupted pdf is saved by OleFormat.Save Bug \nWORDSNET-11322 Issue with converting Word Textbox to PDF Bug \nWORDSNET-11325 Open/save document Corrupted for Office 2007 Bug \nWORDSNET-11326 Aspose.Words halts during loading a DOCX Bug \nWORDSNET-11364 Load document takes much time (endless loop) Bug \nWORDSNET-11373 AcceptAllRevisions does not accept all tracked changes in the document Bug \nWORDSNET-11378 UpdatePageLayout loses DrawingML text modifications Bug \nWORDSNET-11382 Docx to Ps conversion issue with apostrophe rendering Bug \nWORDSNET-11387 TOC displays \"No table of contents entries found\" message in genereted output Bug \nWORDSNET-11390 Textboxes overlap in generated MHTML Bug \nWORDSNET-11392 COMPARE field return incorrect value if one of expression contain \"*\" Bug \nWORDSNET-11401 Arabic text inside DrawingML node does not render correctly Bug \nWORDSNET-11405 Horizontal Axis Chart Data is truncated in PDF Bug \nWORDSNET-11406 Barchart in the pdf file looks very different to the docx file Bug \nWORDSNET-11407 Document.UpdateFields changes the position of DrawingML Bug \nWORDSNET-11428 MailMerge.Execute does not merge fields inside header Bug \nWORDSNET-11435 Docx to Pdf conversion issue with list number formatting Bug \nWORDSNET-11445 Mail merge field formatting issue with \\# x### Bug \nWORDSNET-11462 Word Quick Parts Are displaying incorrectly in the converted PDF file Bug \nWORDSNET-11476 Html to Doc/Docx conversion issue with base64 images Bug \nWORDSNET-11486 Odt checkbox issue with output Pdf/Docx/Odt Bug \nWORDSNET-11495 Stacked Column Charts are rendering incorrectly Bug \nWORDSNET-4931 Second page is missing during rendering. Bug \nWORDSNET-5079 Do not output borders of empty Runs when export to HTML. Bug \nWORDSNET-5360 Position of Textbox is incorrect during rendering. Bug \nWORDSNET-5461 Headers/Footers are placed on wrong pages Bug \nWORDSNET-5571 Position of frame is changed during rendering. Bug \nWORDSNET-5576 Image is moved to the next page upon rendering. Bug \nWORDSNET-7270 DrawingML.Width is not changing the width of DML Bug \nWORDSNET-9242 Contents of DrawingML are truncated after conversion from Docx to fixed file format Bug \nWORDSNET-9772 SmartArt Text is lost after conversion from Docx to Pdf Bug \nWORDSNET-9835 DrawingML.Height does not work while re saving Docx Bug \nWORDSNET-10669 Invalidate DrawingML fallback upon changing DrawingML. Enhancement \nWORDSNET-10736 Refine detection of Asian typography for RTF format Enhancement \nWORDSNET-10837 Create public common facade class for DrawingMLs and Shapes. Enhancement \nWORDSNET-10977 A Table Row truncates from the end of page in PDF Enhancement \nWORDSNET-11000 Word table data truncated in PDF Enhancement \nWORDSNET-11103 Roll back unneeded (FIX WORDSNET-10998) changes when we're ready to generate fallback dynamically. Enhancement \nWORDSNET-11142 TestJira11120 axis labels are rotated improperly. Enhancement \nWORDSNET-11225 Improve comment balloon positioning on the page Enhancement \nWORDSNET-11236 Improve comment balloon truncation logic Enhancement \nWORDSNET-11348 Text is lost after conversion from Docx to Pdf Enhancement \nWORDSNET-11380 Rtf to Docx issue with comment's date Enhancement \nWORDSNET-11399 Docx to Pdf conversion issue with text rendering Enhancement \nWORDSNET-2607 Some problem with row heights when cell contains an image. Enhancement \nWORDSNET-4165 Updating deeply nested fields takes too long Enhancement \nWORDSNET-5086 Consider inserting images as DrawingML. Enhancement \nWORDSNET-5386 Image is moved to previous page and truncated upon rendering. Enhancement \nWORDSNET-6591 Doc to Html conversion issue with image quality. Enhancement \nWORDSNET-9208 Axis labels are partially visible under user shapes. Enhancement \nWORDSNET-9644 Text outline and other formatting of DrawingML is not preserved during rendering/printing Enhancement \nWORDSNET-9741 OOXML Text Effects // Font color of DrawingML TextBoxes is not preserved in fixed page formats Enhancement \nWORDSNET-9771 Hebrew text in SmartArt is rendered in reverse order after conversion from Docx to Pdf Enhancement \nWORDSNET-9918 Center middle alignment of image in table cell is not preserved in PDF Enhancement \nWORDSNET-10935 Document.UpdatePageLayout throws System.FormatException Exception \nWORDSNET-10941 Corrupted document is generated while using OoxmlCompliance.Ecma376_2006 Exception \nWORDSNET-11114 System.NullReferenceException when saving to PDF Exception \nWORDSNET-11153 System.DivideByZeroException is thrown while converting from Doc to Pdf Exception \nWORDSNET-11242 Infinite loop while converting Doc to Pdf Exception \nWORDSNET-11314 Not able to load MHTML file Exception \nWORDSNET-11336 Aspose.Words.FileCorruptedException is thrown while loading Docx. Exception \nWORDSNET-11343 System.InvalidOperationException is thrown while using multi threading Exception \nWORDSNET-11362 Aspose.Words.FileCorruptedException is thrown while loading RTF Exception \nWORDSNET-11404 Aspose.Words.FileCorruptedException occurs when loading a DOCX file Exception \nWORDSNET-11416 System.ArgumentException is thrown while converting Docx to Doc/Pdf Exception \nWORDSNET-11417 Aspose.Words.FileCorruptedException occurs when loading a DOCX file Exception \nWORDSNET-11434 System.InvalidOperationException is thrown while converting Doc to txt Exception \nWORDSNET-11437 Aspose.Words.FileCorruptedException is thrown while loading Docx file Exception \nWORDSNET-11444 System.ArgumentOutOfRangeException occurs during open save a DOC Exception \nWORDSNET-11454 Aspose.Words.FileCorruptedException is thrown while loading Docx Exception \nWORDSNET-11455 Document.UpdatePageLayout throws System.IndexOutOfRangeException Exception \nWORDSNET-11464 System.OutOfMemoryException is thrown while converting Docx to Pdf Exception \nWORDSNET-11472 System.InvalidOperationException occurs during rendering ODT to PDF Exception \nWORDSNET-11492 System.NullReferenceException is thrown while saving document to Docx Exception \nWORDSNET-7560 Aspose.Words.FileCorruptedException occurs when loading RTF file Exception \nWORDSNET-10009 Docx to Pdf conversion issue with DML text Feature \nWORDSNET-10502 Rework DocumentBuilder.InsertImage to insert DrawingML instead of VML Feature \nWORDSNET-10507 Expose ShapeType property for DrawingML Feature \nWORDSNET-10682 Add feature to get/set Shape height/width when it is in GroupShape Feature \nWORDSNET-10987 Expose Font property for DrawingML same as Shape.Font Feature \nWORDSNET-11151 Add feature to import page-break-before (-after, -inside) for Div tag Feature \nWORDSNET-11309 Shape position is changed after conversion from Doc to Pdf Feature \nWORDSNET-11391 Textboxes are misplaced in PDF Feature \nWORDSNET-11415 Expose Fill, FillColor and Filled properties for DraingML objects Feature \nWORDSNET-217 Add a capability of document comparison Feature \nWORDSNET-2385 Add feature to compare documents Feature \nWORDSNET-5408 Expose shape properties in DrawingML objects Feature \nWORDSNET-6003 Expose border of DrawingML Feature \nWORDSNET-6999 Expose HorizontalAlignment property for DrawingML Feature \nWORDSNET-7034 /vertical text/ TextBox's Vertical TextDirection is not preserved when rendering Feature \nWORDSNET-7717 Position of Straight Connector Line Shape is not preserved in fixed formats Feature \nWORDSNET-8122 Support of Alt Text Title property in DrawingML Feature \nWORDSNET-8570 Expose FillColor/Fill properties for DrawingML Feature \nWORDSNET-9377 Incorrect position of shapes relative to rotated text Feature \nWORDSNET-10426 Slow loading of some ODT documents Performance \nWORDSNET-11344 Range.Replace does not work for text inside DrawingML Regression \nWORDSNET-11367 Image in table becomes small during converting HTML to Word Regression \nWORDSNET-11429 NodeImporter.ImportNode throws System.ArgumentException Regression \nWORDSNET-11449 UpdateFields does not update TOC field values Regression",
  "requireLicenseAcceptance": true,
  "title": "Aspose.Words for .NET",
  "version": "15.2.0",
  "tags": [
    "Word",
    "DOC",
    "DOCX",
    "OOXML",
    "OpenDocument",
    "PDF",
    "XPS",
    "ODT",
    "HTML",
    "XHTML",
    "WordprocessingML",
    "Document",
    "EPUB"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    }
  }
}