{
  "@id": "https://api.nuget.org/v3/catalog0/data/2024.01.08.09.39.51/grapeyard.labs.nuke.launchpad.0.2.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "Steffen Obermueller",
  "catalog:commitId": "ccabd98d-ac3c-4e0f-ae46-658ed17fa44a",
  "catalog:commitTimeStamp": "2024-01-08T09:39:51.6994204Z",
  "copyright": "Copyright (c) Steffen Obermueller",
  "created": "2024-01-08T09:37:43.653Z",
  "description": "Quickstart and extension library for the build automation tool NUKE for C# and .NET.",
  "iconFile": "icon.png",
  "id": "Grapeyard.Labs.Nuke.Launchpad",
  "isPrerelease": false,
  "lastEdited": "2024-01-08T09:39:44.353Z",
  "licenseFile": "LICENSE",
  "licenseUrl": "https://aka.ms/deprecateLicenseUrl",
  "listed": true,
  "packageHash": "YNqf/s1KqIY87XCEhf7oUKOXqaB+/Oh0h0YHyRMgRo49g4+xLsyVHgxOC/qP56uYhzJJErwYSIXpW9AKyNbdnQ==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 28534,
  "published": "2024-01-08T09:37:43.653Z",
  "readmeFile": "README.md",
  "releaseNotes": "• Added several string constants for .NET language properties, Semantic Versioning and the Keep a Changelog format to the Constants class.\n• Added class BadgeProviderExtensions and moved all methods updating static badges from class BadgeProviderTasks to it to make them more concise to use. Additionally, optional Boolean logging parameters have been added to the methods, allowing to enable or disable logging of the utilized badge providers in the update process.\n• Added enumeration class FileSystemItemType.\n• Added method RequiresWhenOtherwise to the ITargetDefinitionExtensions class, that allows checking one of two build target requirements based on a Boolean condition.\n• Added method ConvertAll to the IEnumerableExtensions class, that allows converting a generic enumerable of one type to an array of another type using a Converter.\n• Added method JoinElementsToString and overloaded method JoinElementsToPrettyString to the IEnumerableExtensions class, that act as shortcuts to (pretty) print all elements of enumerables.\n• Added method SecretVerified to the ObjectExtensions class, that verifies values annotated with the SecretAttribute of NUKE.\n• Added overloaded method ToPrettyString to the ObjectExtensions and StringExtensions classes, that allows to pretty print objects of corresponding types.\n• Added class CharExtensions with method IsAnyOf, that checks whether a character corresponds to any element of a character list, and overloaded method ToPrettyString, that allows to pretty print characters.\n• Added method ReformatCodeExpressionToSingleLine to the StringExtensions class, that allows source code expressions spanning multiple lines to be reformatted into a single line.\n• Added method ReplaceTabsWithSpaces to the StringExtensions class, that allows replacing horizontal and vertical tabs in strings with a given number of spaces.\n• Added parameter interface IHasBadges that contains a build parameter for a badge register.\n• Added methods FinalizeCustomItems, GetCustomLicenseModifications, GetCustomMainReadmeModifications and WereThirdPartyLicensesCustomModified to the IFinalizeVersion target base interface, that can be overridden to expand the repository finalization process.\n• Added configuration property AutomatedReleaseNotes to the IPackWithDotNet target surrogate interface, that allows enabling or disabling automated package release notes.\n• Added configuration property VerboseReportLogging to the IIntegrationTestWithDotNet and IUnitTestWithDotNet target surrogate interfaces, that allows verbose logging to be enabled for the generation of test reports at the end of the target run.\n• Added methods CreateTestReportFromLogFilesWithCustomFormats and GetCustomTestTargets to the IUpdateStaticBadges target bundle interface, that can be overridden to expand the process of updating static test result badges.\n• Added configuration property VerboseLogging to the IUpdateStaticBadgesInMainReadmeForBadgeProviders and IUpdateThirdPartyLicensesFromWebLinks target surrogate interfaces, that allows verbose logging to be enabled for the updates of static badges respectively third party licenses during the target run.\n• Modified internals of the KeepAChangelogFormatTasks class, so that its methods also recognize logged changes that use the unordered list characters asterisk or plus instead of a hyphen.\n• Improved most documentation comments and NUKE description texts.\n• Overhauled the repository documentation with a focus on the operating manual.\n• Removed unnecessary nullability modifiers from generic type parameters in the following methods:\n    ◦ Methods ElementsNotNull, NotNull, NotNullOrEmpty and PropertyNotNull of the ExtendedAssert class.\n    ◦ Methods RequiresForEach, RequiresMember and RequiresParameter of the ITargetDefinitionExtensions class.\n    ◦ Method ElementsNotNull of the IEnumerableExtensions class.\n• Renamed parameters of the following methods to be less generic and more type-related:\n    ◦ All methods of the ExtendedAssert class that target integers or strings.\n    ◦ Method UpdateLastPublicationYearOfCopyrightNotices of the LicensingTasks class.\n    ◦ Methods AppendExceptionMessage, IsEmpty, IsValidFileName and IsWhiteSpace of the StringExtensions class.\n• Added optional Boolean logging parameters to the following methods, so that key components of their execution and/or result can be logged:\n    ◦ Method UpdateStaticBadge of the BadgeProvider class.\n    ◦ Overloaded method CreateTestReportFromLogFilesInDirectory of the VisualStudioTestFormatTasks class.\n• Changed visibility of class BadgeProviderTasks to internal.\n• Modified overloaded method ExtractReleaseNotesForNuGet of the KeepAChangelogFormatTasks class to preserve indentation for logged changes and therefore nested lists in release notes intended for NuGet.\n• Generalized the object type of the singular parameter of method InitializeFromRegex of the ThirdPartyWebLink class, making the method more universally usable.\n• Renamed methods GetShortState and HasCleanState of the GitRepositoryExtensions class to GetStatusShort and HasCleanStatus to be closer to the names of the intended Git commands.\n• Modified overloaded method DistinctBy of the ArrayExtensions class, so that it no longer throws an exception if an element of the array passed to it is null.\n• Renamed method AsNonNullBuildParameter of the ObjectExtensions class to RequirementVerified to better reflect its use case of verifying values annotated with the RequiredAttribute of NUKE.\n• Renamed method TrimAndPool of the ObjectExtensions class to PruneWhiteSpaces to better reflect its functionality, which has been shortened to the sole responsibility of pruning white-space characters from a string by eliminating the additional trimming.\n• Renamed method ContainsAny of class StringExtensions to ContainsAnyOf. Additionally, renamed its parameters to be less generic and more type-related.\n• Renamed parameter interface IHasLocalRepositories to IHasLocalPackageRepositories and its build parameter --local-repository-dirs to --local-package-repo-dirs.\n• Renamed parameter interface IHasWebRepository to IHasWebPackageRepository and its build parameters --web-repository-source-url and --web-repository-api-key to --web-package-repo-source-url and --web-package-repo-api-key.\n• Renamed configuration properties of the following target surrogate interfaces for clarity:\n    ◦ Property LogFineGranular of the ICleanForDotNet interface to VerboseLogging.\n    ◦ Property IncludeRepositoryLinks of the ICompileWithDotNet interface to AutomatedVcsProperties.\n    ◦ Properties DraftSectionCaption and RepositoryEndpoint of the IFinalizeChangelogWithKeepAChangelogFormat interface to UnreleasedSectionCaption and VcsComparisonEndpoint.\n    ◦ Properties PreparePublish and Version of the IFinishVersionForGrapeyardLabs interface to CheckOutIntoMasterBranch and TagName.\n    ◦ Properties IncludeRepositoryLinks and RepositoryCommitIdentifier of the IPackWithDotNet interface to AutomatedVcsProperties and VcsCommitIdentifier.\n    ◦ Property TestProjectSettings of the IIntegrationTestWithDotNet and IUnitTestWithDotNet interfaces to DotNetTestSettingsPerProject.\n    ◦ Property LimitToFirstMatch of the IUpdateCopyrightYearsOfRepositoryLicenseToCurrent interface to LimitToFirstCopyrightNotice.\n    ◦ Properties FileNamePrefix and FileNameSuffix of the IUpdateThirdPartyFrameworksFromWebLinks to LicenseFileNamePrefix and LicenseFileNameSuffix.\n• Withdrew the nullability of configuration properties ReleaseVersion of the IFinalizeChangelogWithKeepAChangelogFormat target surrogate interface and Version of the IFinalizeVersionForGrapeyardLabs target surrogate interface.\n• Renamed target base interface IPublishToLocalRepositories to IPublishToLocalPackageRepositories. Renamed the associated target surrogate interface and build targets accordingly.\n• Renamed target base interface IPublishToWebRepositoy to IPublishToWebPackageRepository. Renamed the associated target surrogate interface and build targets accordingly.\n• Changed the default value of configuration property CompleteOnFailure of the IPublishToWebPackageRepositoryWithDotNet target surrogate interface to false.\n• Renamed target bundle interface IUpdateReadmeBadges to IUpdateStaticBadges. Renamed the associated build target accordingly.\n• Renamed target base interface IUpdateStaticReadmeBadges to IUpdateStaticBadgesInMainReadme. Renamed the associated target surrogate interface and build targets accordingly.\n• Renamed target bundle interface IUpdateProjectLicense to IUpdateCopyrightYearsOfLicenses. Renamed the associated build target accordingly.\n• Renamed target base interface IUpdateCopyrightYearOfProjectLicense to IUpdateCopyrightYearsOfRepositoryLicense. Renamed the associated target surrogate interface and build targets accordingly.\n• Updated NuGet package Nuke.Common from version 7.0.5 to 7.0.6.\n• Removed the unnecessary class NetworkTasks.\n• Fixed a bug where the overloaded method ExtractReleaseNotesForNuGet of the KeepAChangelogFormatTasks class did not replace quotation marks in release notes intended for NuGet with their ASCII counterparts, resulting in them not appearing in the \"Release Notes\" section of the central NuGet repository.\n• Fixed some pre-generated internal regular expressions in the Constants class that matched unintended characters.\n• Fixed a bug in methods OnlyWhenAllDynamic and OnlyWhenExactlyDynamic of the ITargetDefinitionExtensions class that resulted in the log output of a finished NUKE build process missing the reason why a build target was actually skipped.\n• Fixed a bug in the ITargetDefinitionExtensions class that caused code expressions used for exception messages to contain unwanted white-space characters near reformatted line breaks.\n• Fixed a bug in method UpdateStaticBadges of the BadgenTasks and ShieldTasks classes that caused tooltips to be deleted from Markdown images of static badges.\n\nFull changelog at https://gitlab.com/grapeyard-labs/libs/nuke-launchpad/-/blob/0.2.0/CHANGELOG.md",
  "repository": "",
  "title": "Grapeyard.Labs.Nuke.Launchpad",
  "verbatimVersion": "0.2.0",
  "version": "0.2.0",
  "dependencyGroups": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2024.01.08.09.39.51/grapeyard.labs.nuke.launchpad.0.2.0.json#dependencygroup/net7.0",
      "@type": "PackageDependencyGroup",
      "dependencies": [
        {
          "@id": "https://api.nuget.org/v3/catalog0/data/2024.01.08.09.39.51/grapeyard.labs.nuke.launchpad.0.2.0.json#dependencygroup/net7.0/grapeyard.labs.nuke.launchpad.common",
          "@type": "PackageDependency",
          "id": "Grapeyard.Labs.Nuke.Launchpad.Common",
          "range": "[0.2.0, )"
        },
        {
          "@id": "https://api.nuget.org/v3/catalog0/data/2024.01.08.09.39.51/grapeyard.labs.nuke.launchpad.0.2.0.json#dependencygroup/net7.0/grapeyard.labs.nuke.launchpad.parameters",
          "@type": "PackageDependency",
          "id": "Grapeyard.Labs.Nuke.Launchpad.Parameters",
          "range": "[0.2.0, )"
        },
        {
          "@id": "https://api.nuget.org/v3/catalog0/data/2024.01.08.09.39.51/grapeyard.labs.nuke.launchpad.0.2.0.json#dependencygroup/net7.0/grapeyard.labs.nuke.launchpad.targets",
          "@type": "PackageDependency",
          "id": "Grapeyard.Labs.Nuke.Launchpad.Targets",
          "range": "[0.2.0, )"
        }
      ],
      "targetFramework": "net7.0"
    }
  ],
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2024.01.08.09.39.51/grapeyard.labs.nuke.launchpad.0.2.0.json#Grapeyard.Labs.Nuke.Launchpad.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 3839,
      "fullName": "Grapeyard.Labs.Nuke.Launchpad.nuspec",
      "length": 11627,
      "name": "Grapeyard.Labs.Nuke.Launchpad.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2024.01.08.09.39.51/grapeyard.labs.nuke.launchpad.0.2.0.json#lib/net7.0/Grapeyard.Labs.Nuke.Launchpad.dll",
      "@type": "PackageEntry",
      "compressedLength": 1712,
      "fullName": "lib/net7.0/Grapeyard.Labs.Nuke.Launchpad.dll",
      "length": 4608,
      "name": "Grapeyard.Labs.Nuke.Launchpad.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2024.01.08.09.39.51/grapeyard.labs.nuke.launchpad.0.2.0.json#lib/net7.0/Grapeyard.Labs.Nuke.Launchpad.xml",
      "@type": "PackageEntry",
      "compressedLength": 101,
      "fullName": "lib/net7.0/Grapeyard.Labs.Nuke.Launchpad.xml",
      "length": 154,
      "name": "Grapeyard.Labs.Nuke.Launchpad.xml"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2024.01.08.09.39.51/grapeyard.labs.nuke.launchpad.0.2.0.json#icon.png",
      "@type": "PackageEntry",
      "compressedLength": 6712,
      "fullName": "icon.png",
      "length": 6711,
      "name": "icon.png"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2024.01.08.09.39.51/grapeyard.labs.nuke.launchpad.0.2.0.json#LICENSE",
      "@type": "PackageEntry",
      "compressedLength": 634,
      "fullName": "LICENSE",
      "length": 1070,
      "name": "LICENSE"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2024.01.08.09.39.51/grapeyard.labs.nuke.launchpad.0.2.0.json#README.md",
      "@type": "PackageEntry",
      "compressedLength": 1663,
      "fullName": "README.md",
      "length": 4553,
      "name": "README.md"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2024.01.08.09.39.51/grapeyard.labs.nuke.launchpad.0.2.0.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 11514,
      "fullName": ".signature.p7s",
      "length": 11514,
      "name": ".signature.p7s"
    }
  ],
  "tags": [
    "build",
    "automation",
    "continuous-integration",
    "tools",
    "orchestration",
    "nuke",
    "launchpad",
    "extensions",
    "quickstart"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}