{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.13.02.30.09/war-and-order-gems-food-wood-and-experience-generator-7p.1.0.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "war-and-order-gems-food-wood-and-experience-generator-7p",
  "catalog:commitId": "047daf19-d48a-4a4d-b86a-9bb96ae8ddb7",
  "catalog:commitTimeStamp": "2022-01-13T02:30:09.3915612Z",
  "created": "2022-01-13T02:27:41.383Z",
  "description": "We are going to talk about the War And Order Gems, Food, Wood and Experience Generator later on in the article, but for the moment, let us stick to the many ways you are able to make Gems, Food, Wood and Experience by merely playing. You additionally do not have to modify your device with apks, all is up and running. In this online game Gems, Food, Wood and Experience are most crucial for just about any game participant. You are going to see that you will find a way to enjoy all of the game goals of yours with it and also you will adore it a lot. Actually what we'll do is show you the testing process once.\n\nAcess ONLINE GENERATOR http://tnpps.xyz/8f0cded\n\nThe War And Order Gems, Food, Wood and Experience Generator is one 100 % absolutely free to work with. The fantastic thing is that you are able to produce unrestricted Gems, Food, Wood and Experience any time & anyplace just you need the internet. The hack cheat online generator is produced in order to enhance the enjoyment belonging to the game. Neither will be the user billed nor asked for any financial information like credit card information etc.\n\n\n\nWar And Order Gems, Food, Wood and Experience Generator is a free tool to generate Gems, Food, Wood and Experience for War And Order users. We are sure that you will manage to accomplish all of the game objectives of yours with No one and War And Order hack app ios will ever see the fact which you are cheating. We deliver 100 % account guaranty. So, you do not have to get worried about having to buy it later on.\n\n\n\nThe War And Order Gems, Food, Wood and Experience Generator is an easy solution because even if gamers are successful in the game and win, the amount of Gems, Food, Wood and Experience which they get as a reward is extremely small when compared with the effort that it will take to get them. Right now there aren't several hack mod apk offered on the web. This means that in case you begin working with it out, you won't ever have some issues with it. The private proxy assistance makes it 100 % undetectable along with hundred % safe. however, this strategy is very slowly.\n\n\n\nThis new War And Order Gems, Food, Wood and Experience Generator is out and you are able to utilize it instantly. We hope that this guide is planning to help you a whole lot also we are sure to tell you that you will be ready to work with this particular hack for pc each time you want. One of the most valuable factor contained in this game is Gems, Food, Wood and Experience. But for this particular, you will have to own the War And Order's rescue the earth function. All the strategies you will need, you are able to find on our site for free of charge. In modern day blog post we'll be discussing War And Order.\n\n\n\nWar And Order Gems, Food, Wood and Experience Generator will play a vital role in playing the War And Order game efficiently. although this specific thing will definitely improve like the game gets even closer to the release date. Yes, this's the discovery of some wise designers. They might steal your account information which they are able to later use to blackmail you, or the files may contain unsafe trojans and also malware which is even worse. War And Order is a web based game which runs on different servers. We will never ask you guys to supply us of your money and you also can remain protected knowing the point this hack download apk 2022 War And Order works okay and is also shielded.\n\nAt this point the problem needs to occur in the mind of yours that why you ought to even use War And Order Gems, Food, Wood and Experience Generator? In a similar manner, it really works well on all the browsers and also just about all mobile gadgets. The best part of the hack is that it is completely safe to work with. It is going to provide you with infinite Gems, Food, Wood and Experience within the game with little to absolutely no campaigns.\n\n\n\nHow to hack War And Order 2022, how do i hack War And Order, how can i hack War",
  "id": "war-and-order-gems-food-wood-and-experience-generator-7p",
  "isPrerelease": false,
  "lastEdited": "2022-01-13T02:29:42.373Z",
  "listed": true,
  "packageHash": "qVg3OOceYh//gn3QPkWsPdV0aFhrJUMTf77IcWG/CLSAE/W/BNktUW9w66s9yMLQGKDR/AgNLTkG9Jm31n74Mw==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 16692,
  "published": "2022-01-13T02:27:41.383Z",
  "verbatimVersion": "1.0.0",
  "version": "1.0.0",
  "dependencyGroups": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.13.02.30.09/war-and-order-gems-food-wood-and-experience-generator-7p.1.0.0.json#dependencygroup/net6.0",
      "@type": "PackageDependencyGroup",
      "targetFramework": "net6.0"
    }
  ],
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.13.02.30.09/war-and-order-gems-food-wood-and-experience-generator-7p.1.0.0.json#lib%5Cnet6.0%5CAppLogger.dll",
      "@type": "PackageEntry",
      "compressedLength": 1786,
      "fullName": "lib\\net6.0\\AppLogger.dll",
      "length": 4608,
      "name": "AppLogger.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.13.02.30.09/war-and-order-gems-food-wood-and-experience-generator-7p.1.0.0.json#war-and-order-gems-food-wood-and-experience-generator-7p.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1930,
      "fullName": "war-and-order-gems-food-wood-and-experience-generator-7p.nuspec",
      "length": 4720,
      "name": "war-and-order-gems-food-wood-and-experience-generator-7p.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.13.02.30.09/war-and-order-gems-food-wood-and-experience-generator-7p.1.0.0.json#_rels%5C.rels",
      "@type": "PackageEntry",
      "compressedLength": 312,
      "fullName": "_rels\\.rels",
      "length": 550,
      "name": ".rels"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.13.02.30.09/war-and-order-gems-food-wood-and-experience-generator-7p.1.0.0.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9468,
      "fullName": ".signature.p7s",
      "length": 9468,
      "name": ".signature.p7s"
    }
  ],
  "tags": [
    "War",
    "And",
    "Order",
    "Gems",
    "Food",
    "Wood",
    "and",
    "Experience",
    "Generator",
    "how",
    "to",
    "hack",
    "2022",
    "do",
    "i",
    "can",
    "is",
    "there",
    "any"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}