{
  "@id": "https://api.nuget.org/v3/catalog0/data/2015.12.11.06.55.53/spire.pdf.3.6.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "Administrator",
  "catalog:commitId": "d44a626e-ccad-4088-9697-a72ac9bc742d",
  "catalog:commitTimeStamp": "2015-12-11T06:55:53.7386363Z",
  "copyright": "Copyright © 2015 e-iceblue. All Rights Reserved.",
  "created": "2015-12-11T06:55:48.283Z",
  "description": "Spire.PDF for .NET is a versatile PDF library that enables software developers to generate, edit, read and manipulate PDF files within their own .NET applications. As a standalone PDF component, Spire.PDF for .NET provides users an incredible wealth of features without installing Adobe Acrobat. This component is completely written in C#, but also supports VB.NET, Windows Forms and ASP.NET. \nWith the Spire.PDF for .NET API, you can get the ability to read PDF text and image even attachments with high efficiency. Even the special content such as language written from right to left can be extracted such as Herbrew and Arabic. Other basic features such as text, image, table, shapes, hyperlinks, bookmark, headings, footnotes, lists, form fields, pagination, booklet barcode, attachments, transparency, annotations, actions, overlay etc all work great for users. As for security, Spire.PDF for .NET enables you to protect your PDF files by passwords and digital signature.",
  "iconUrl": "http://www.e-iceblue.com/images/product_logo/product_buy/pdfnet.png",
  "id": "Spire.PDF",
  "isPrerelease": false,
  "language": "en-US",
  "lastEdited": "0001-01-01T00:00:00Z",
  "licenseUrl": "http://www.e-iceblue.com/Knowledgebase/Licensing/License-Agreement.html",
  "listed": true,
  "packageHash": "roR9nm1q+LrANZNzwvbzTxhSUEJRw5L6B4uk/z1udvM+Wc82r8gJ9GKgtqOGaPe2Quo1B2+fSEVc2i8Xv5F8Lg==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 21796679,
  "projectUrl": "http://www.e-iceblue.com/Introduce/pdf-for-net-introduce.html",
  "published": "2015-12-11T06:55:48.283Z",
  "releaseNotes": "Spire.PDF 3.6\nAdd the VerifyDocModified method to verify if the document is modified after sign.\nAdd new type for ConfiguerGraphicType to set the picture is on the left of the signature.\n\nFixes the issue that caused the grey line in the background when print.\n Fixes the issue where some pdf documents can't be converted to pdf.\nOptimizes the performance to convert XPS to DPF.\nResolves the issue that caused the exception when load a pdf document.\nFixes the issue that caused the exception that value cannot be null when set Conformance property.\nFixes the issue that caused the exception when use the insertPageRange method.\nFixes the issue that caused the exception when convert PDF to image.\nResolves the issue that caused the border lost when convert PDF to image.\n    Resolves the issue that caused content incorrect when convert pdf to image.\n Fixes the issues where the blank page can't be deleted when call Remove or RemoveAt method.\nFixes the issue that caused an ArgumentOutOfRange Exception when call the FindText method.\n    Add the PngDirectToJpg property to avoid the outofmemory when call DrawImage method.\nFixes the issue where the filled filed text did not print.\n\nSpire.PDF 3.5.143\nImprove the XPS to PDF conversion speed.\nOptimizes the PDF size while converting XPS to PDF.\nReduces the PDF size while converting tiff image to PDF.\nFixes the issue where most of the fields became unfillable after filling fields.\nFixes the issue that caused the exception \"namespaceprefix ‚x' not defined\" when load document.\nFixes the issue that caused the exception \"Badly formed dictionary\" when merge documents.\nImproves time performance of the merged document.\nFixes the issue that caused the content lost when merge PDF files\nResolves the issue that caused the background template lost when print.\nFixes the issue where the text Colors vanished when printing PDF. \nFixes the issue where the euro signs in the document were printed as small squares.\nFixes the issue that caused some contents invisible when convert html to PDF.\nAddresses the issue that caused the text garbled when extract text from PDF.\nFixes the issue that caused the content lost and incorrect when convert PDF to image.\nFixes the issue that caused the NullReferenceException when searching for text in some document.\nFixes the issue where some PDF documents cannot be loaded or merged.\nFixes the issue that caused the exception \"There are other characters at the end of the string cannot be analyzed\" when convert PDF to image.\nAdds new property \"IsConfiguerGraphicFilledBounds\" for PdfSignature class to adjust the large image when creating a visual digital signature.\n\nSpire.PDF 3.5.80\nAdd new method to delete the image via the index of image in pdf.\nFixes the issue that caused the exception that No FunctionType specified in function when convert pdf to image.\nFixes the issue where the shape lost when convert PDF to PDF/A.\nFixes the issue that caused some contents lost while adding the watermark.\nFixes the issue where the character \"€\" wasn't printed correctly. \nFixes the issue where the extract text was garbled.\nSpire.PDF 3.5.51\n    Fixes the issue where spaces in text are being replaced with the letter \"|\" When print.\n    Optimizes the PDF size when convert XPS to PDF.\n    Fixes the issue that caused the PdfPageBase.ReplaceImage() method not work.\n    Fixes the issue that caused the font color for all instances of the field inconsistent.\n\n\nSpire.PDF 3.5.34\n\nAdd new method to manipulate the custom properties in PDF document.\nFixes the issue that caused the position of PdfTextMarkupAnnotation incorrect.\nFixes the issue where the embedded font can't be displayed.\nResolves the issue that caused the exception when save PDF to XPS.\nProvides a property to make the orientation setting work when printing.\nFixes the issue that caused the PDF document information not changed.\nResolves the issue that caused the Format Exception when extract text.\nFixes the issue that caused the Index was outside the array range exception when create a digital signature for a certificate-file.\nResolves the issue that caused null value when read value of a XfaForm field.\n\n\n\n\nSpire.PDF 3.5\n\nFixes the issue that caused the multiple threads unsafe.\nFixes the issue where there is only \"black\" word in the result PDF when convert html to PDF.\nFixes the issue where the header is being left out when printing a PDF. \nAddresses the issue where there are space characters randomly scatter throughout the text when extract text from a page.\nResolves the issue that caused \"insufficient data for an image\" exception when open the merged PDF with adobe reader.\nFixes the issue that caused the content lost when convert PDF to Image.\n\n\nSpire.PDF 3.4.27\nFixes the issue that caused the image blurred when convert pdf to image.\nFixes the issue where the gradient color lost when convert pdf to image.\nFixes the issue where the page content was incorrect when merge pdf files. \nResolves the issue where the header template was not printed when print pdf.\nFixes the issue where blank page was printed when print pdf.\nFixes the issue where the text includes bracket can't be found when use FindText method to find text.\nFixes the issue that caused the \"division by zero\" exception when use loadfromxps method in COM library.\n\nSpire.PDF 3.4\nFix the issue that caused the garbled contents when convert RTF to html.\nFix the issue where some sentences weren't aligned when convert .docx to PDF.\nFix the issue that caused incorrect indent when convert RTF to RTF.\nFix the issue where some documents couldn't be saved to PDF format.\nFix the issue that caused redundant blank line when save to PDF more than one time.\nFix the issue that caused some contents dislocation when convert .dotx to PDF.\nFix the issue where some doc documents can't be saved to .docx document.\n\nSpire.PDF 3.3\nAdd new feature to convert PDF to Doc.\nFix the issue that caused some XPS files to be loaded failure.\n\nSpire.PDF 3.2.178\nFixes the issue that causes the wrong lineSpacing when convert XPS to PDF.\nFixes the issue where the Author and Keywords failed to add.\nFixes the issue where the baseline of characters is not aligned when convert XPS to PDF.\nFixes the issue that causes some XPS documents failed to load.\n\n\nSpire.PDF 3.2.165\nAdd the feature to change PDF page size.\nAdd the feature to add form fields to an existing PDF.\nFixes the issue that caused tick in checkbox to be changed to 4 when convert PDF to Image.\nFixes the issue where some special characters lost when convert PDF to Image.\nFixes the issue where some special characters lost when print PDF files.\nFixes the issue that caused some PDFs is printed as blank.\nFixes the issue that caused PDF failed to convert to Image.\nFixes the issue where some XPS documents failed to load.\n\nSpire.PDF 3.2.151\nAdd the feature to manipulate the XFA form fields in PDF.\nFixes the issue where the image is blank when converted PDF to Image.\nFixes the issue that caused the checkbox in image to be changed to Chinese when convert PDF to Image.\nFixes the issue where the link failed to displayed in PDF when convert XPS to PDF.\nFixes the issue where some attachments in PDF can't be opened when added attachments to PDF.\nFixes the issue where the TrueType Font can't be embedded into PDF.\nFixes the issue that caused signature failed to verified.\nFixes the issue where the link displayed position was not correct when add link to PDF.\nFixes the issue that caused certificate failed to extract.\nFixes the issue that caused PDF failed to convert to Image.\nAdds a new method to resolve the issue that caused only \"black\" word displays on the PDF when convert HTML to PDF.\n\n\nSpire.PDF 3.2.102\nFix the issue that \"Invalid/Unknown/Unsupported format\" when loading a Pdf document.\nFix the issue that the font is not bold when convert PDF to image.\nFix the issue that the font is not bold when convert PDF to XPS and convert PDF to Image in WPF.\n\nSpire.PDF 3.2.82\nFix the issue that the content displays incorrectly when convert XPS to PDF.\nFix the issue that some characters were lost when convert XPS to PDF.\nFix the issue that the font displays incorrect when convert XPS to PDF.\nFix the issue that 'There is an error in XML document (513, 278)/(32, 428)' convert XPS to PDF.\nFix the issue that the text was lost when printing PDF document.\nFix the issue that the bookmark in pdf doesn't work.\n\nSpire.PDF 3.2.60\nAdd new feature that the text in pdfgrid cell can be wrapped.\nImprove the speed and reduce the consumption of memory when convert PDF to XPS in .NET.\nFix the issue that the result is incorrect when convert XPS to PDF.\nFix the issue that the generated document is invalid pdf/a1b document after merging two pdf/a1b documents.\nFix the issue that the generated PDFA document conformance verification failed after convert PDF to PDFA.\nFix the issue that the field data lost when merging two PDF documents.\nFix the issue that the 'Can't access a closed file' when getting the length of the Stream after loading a PDF document from FileStream.\nFix the issue that the text color and background color reversal when convert PDF to Image.\nFix the issue that 'Parameter is not valid' when convert PDF to Image.\nFix the issue that the image is incorrect when convert PDF to Image.\nFix the issue that 'Length cannot be less than zero' when extracting the text from a PDF document.\nFix the issue that the text is extracted repeatedly when extracting the text from a PDF document.\nFix the issue that the alignment of inner grid in a grid cannot be set.\n\nSpire.PDF 3.2.31\nAdd the feature to collapse or expand the bookmark.\nFix the issue that the saved file doesn't have the keyword in its properties after adding a keyword.\nFix the issue that the result is blank when print some pdf documents.\nFix the issue that the data in form field is lost when split pdf document.\nFix the issue that the Thai's font displays incorrectly when convert pdf to image.\nFix the issue that 'Object reference not set to an instance of an object' when convert pdf to image.\nFix the issue that 'Glyph name required for Type3 font!Source character: 13' when convert pdf to image.\nFix the issue that someone page inclined to right when convert pdf to image.\nFix the issue that the generated image is unreadable when convert pdf to image.\nFix the issue that 'Index was outside the bounds of array' when convert pdf to image.\nFix the issue that 'WE_HAVE_AN_X_AND_Y_SCALE flag not set' when convert pdf to image.\nFix the issue that some Korea's text is filled when convert pdf to image.\n\nSpire.PDF 3.1.53\nImprove the performance of converting PDF to images in WPF.\nFix the issue that the color is incorrect when converting pdf to images.\nFix the issue that some text has background color is missing when converting pdf to images.\nFix the issue that graphics are missing when converting pdf to images.\nFix the issue that unicode in pdf table doesn't work when drawing data into pdf.\nFix the issue that the color is changed when printing PDF.\nFix the issue that some characters are bold when printing PDF.\nFix the issue that the font is garbled when printing PDF.\nFix the issue that the region of content is changed when printing PDF.\nFix the error\"System.OutOfMemoryException\" when loading html.\n\n\nSpire.PDF 3.1.24\nImprove RAM consuming performance on converting XPS to PDF.\nImprove time taking performance on converting PDF to Image.\nFix the error \"Invalid contents array\" when saving to pdf file after adding background image into pdf.\nFix the issue that some text was lost when printing PDF.\nFix the issue that the content was twisted when printing PDF.\nFix the issue that some characters were overlapping each other when printing PDF.\nFix the issue that red boxes were missing when converting PDF to Image.\nFix finding text issue in PDF was converted from DOCX by spire.doc.\nFix the error \"An item with the same key has already been added\" when extracting text from PDF.\n\nSpire.PDF 3.1.9\nFix the issue that the picture was incorrect when the image was converted from the PDF file by using the SaveAsImage method.\nFix the issue that the header of table was incorrect in converted image from PDF by using the SaveAsImage method.\nFix the issue that SaveAsDrawingImage method drew a redundant page border around the image.\nFix the error \"A generic error occurred in GDI+.\" occurred when converting PDF to XPS in WPF.\n\n\nSpire.PDF 3.0.59\nBug solutions:\nFix the issue that the red boxes and text were lost in converted Image from PDF.\nFix the issue that the data was cut in converted PDF from HTML.\nFix the error \"The index cannot be less than zero or greater than Count\" occurred when merging pdf files.\nFix the issue that the footer of the page was not printed.\nFix the error \"Arithmetic operation resulted in an overflow.\" occurred when drawing image in page.\n\n\nSpire.PDF 3.0.43\nNew features:\nAdd new feature to draw multiple string formats in a single grid cell.\nAdd a property Page.ActualSize to get actual size of page.\nAdd new method IsBlank() to detect if the content of page is blank.\n\nBug Solutions:\nFix the incorrect data issue in image converted from PDF \nFix the issue that column name is incorrect in image converted from PDF.\nImprove the time performance for converting HTML to PDF.\nFix the issue that PdfPageSize.A4 is not actual A4 size.\nFix the error \"Object reference not set to an instance of an object.\" caused in merging pdf files.\nFix the issue that the page is added to the end of the existing pdf when adding a blank page to the beginning of an existing PDF\nFix the issue that it adds additional horizontal scroll bar in HTML converted from PDF",
  "requireLicenseAcceptance": false,
  "summary": "This package is designed to introduce developers a .NET PDF application Spire.PDF for .NET. This PDF application enables users to create, read, edit and maniplate PDF files with high efficiency.",
  "title": "Spire.PDF for .NET",
  "version": "3.6.0",
  "frameworkAssemblyGroup": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2015.12.11.06.55.53/spire.pdf.3.6.0.json#frameworkassemblygroup/.netframework2.0",
      "assembly": "Spire.PDF",
      "targetFramework": ".NETFramework2.0"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2015.12.11.06.55.53/spire.pdf.3.6.0.json#frameworkassemblygroup/.netframework3.5",
      "assembly": "Spire.PDF",
      "targetFramework": ".NETFramework3.5"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2015.12.11.06.55.53/spire.pdf.3.6.0.json#frameworkassemblygroup/.netframework4.0",
      "assembly": "Spire.PDF",
      "targetFramework": ".NETFramework4.0"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2015.12.11.06.55.53/spire.pdf.3.6.0.json#frameworkassemblygroup/.netframework4.0-client",
      "assembly": "Spire.PDF",
      "targetFramework": ".NETFramework4.0-Client"
    }
  ],
  "tags": [
    "PDF",
    "application",
    "library",
    "component",
    "control",
    "to",
    "XPS",
    "Image",
    "HTML",
    "PDF/A"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    }
  }
}