{
  "@id": "https://api.nuget.org/v3/catalog0/data/2015.02.04.08.17.29/aspose.words.13.11.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "Aspose",
  "catalog:commitId": "9f3f1845-1718-4737-9797-74de988c13c5",
  "catalog:commitTimeStamp": "2015-02-04T08:17:29.2303538Z",
  "copyright": "© Aspose 2002-2013. All Rights Reserved.",
  "created": "2013-12-10T05:32:50.203Z",
  "description": "Aspose.Words for .NET class library supports DOC, DOCX, RTF, HTML, OpenDocument, PDF, XPS, EPUB and other formats. With Aspose.Words you can generate, modify, convert, render and print documents without utilizing Microsoft Word®",
  "iconUrl": "http://www.aspose.com/images/products/dotnet/Aspose.Words_128x128.png",
  "id": "Aspose.Words",
  "isPrerelease": false,
  "lastEdited": "0001-01-01T00:00:00Z",
  "licenseUrl": "http://www.aspose.com/corporate/purchase/end-user-license-agreement.aspx",
  "packageHash": "/K4dWs+xaczHWIlBjTXg4xlcBwGo6gxBIlkLgAkc/mFbbIGb8Nh782Bxwog3OparMvSCqWtbBXGkKrEH5zBPag==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 11132171,
  "projectUrl": "http://www.aspose.com/categories/.net-components/aspose.words-for-.net/default.aspx",
  "published": "2013-12-10T05:32:50.203Z",
  "releaseNotes": "There are 93 improvements and fixes in this regular monthly release. The most notable are:\n\n• Revision bars are displayed in rendered documents\n• Proper support for SDT repeating section \n• Chinese list bullet numbers supported \n• Field update engine performance improved\n• Better support for TIFF image compression CCIT3/CCIT4\n• Improved automatic color resolution in DrawingML Charts rendering\n\nThis release introduces the new features, enhancements and fixes to the excptions/bugs as detailed below:\n\n• New features\nWORDSNET-3774\tRed text in picture becomes white when rendering to TIFF\nWORDSNET-6236\tLogo textures are not prominent when saving to TIFF\nWORDSNET-7279\tConsider providing a JoinRunsWithSameFormatting method that works on Paragraph level\nWORDSNET-7309\tDoc to Tiff conversion issue with image rendering\nWORDSNET-7921\tSupport page-break-inside style attribute for tr\nWORDSNET-8224\tTrack Changes Options - Support of changed lines (bars) upon rendering/converting to PDF.\nWORDSNET-8226\tSupport inserting the text marked by a Bookmark in Bookmark field\nWORDSNET-8517\tSupport of Gradient color rendering in Tiff when TiffCompression.Ccitt3/Ccitt4 is used\nWORDSNET-8770\tSupport revision bars\nWORDSNET-8888\tSDT repeatingSection is not converted properly.\nWORDSNET-9117\tConsider exporting to fonts in .ttf format during rendering to HtmlFixed format\nWORDSNET-9178\tImprove auto color mechanism for data points.\nWORDSNET-9196\tAdd feature to remove Office 2003 Routing Slip meta data\n\n• Enhancements\nWORDSJAVA-382\tArrow ends are not rendered to graphics on Java\nWORDSJAVA-815\tUpdate EULA to 22 Oct 2013\nWORDSNET-3149\tJoinRunsWithSameFormatting does not work.\tEnhancement\nWORDSNET-3736\tPart of content is moved to the previous page during rendering.\tEnhancement\nWORDSNET-3924\tAspose.Words returns incorrect word count.\tEnhancement\nWORDSNET-3954\tListItem name is changed during rendering.\tEnhancement\nWORDSNET-4115\tList numbering is lost after open/save document using AW.\tEnhancement\nWORDSNET-4295\tThe position of FormFields is incorrect during converting to PDF with PreserveFormFields set.\tEnhancement\nWORDSNET-7242\tDocument.Save take much time on saving Fixed Page Formats\tEnhancement\nWORDSNET-8381\tSupport display: none; attribute in DIV style\tEnhancement\nWORDSNET-8410\tImport the 'float' CSS property of HTML tables\tEnhancement\nWORDSNET-8795\tChange year to 2013 in evaluation message\tEnhancement\nWORDSNET-8814\tTable cell elements are pushed twice to DocumentStyleResolver\tEnhancement\nWORDSNET-8960\tCommon paragraph border is lost during DOCX-HTML-DOCX round trip\tEnhancement\nWORDSNET-9031\t\"display:none\" css style is not applied to table's head in HTML import.\tEnhancement\nWORDSNET-9183\tChart with date axis is rendered improperly.\tEnhancement\nWORDSNET-9186\tHorizontal labels are not rotated properly.\tEnhancement\nWORDSNET-9187\tData labels are not rendered.\tEnhancement\nWORDSNET-9194\tDeploy TeamCity 8.0 on new Windows 8 server\tEnhancement\nWORDSNET-9203\tList in table's cell in not properly imported from HTML\tEnhancement\nWORDSNET-9230\tVertical space between Rows is not preserved in fixed page formats\tEnhancement\nWORDSNET-9286\tUpdate EULA to 22 Oct 2013 version\tEnhancement\n\n• Exceptions\nWORDSJAVA-779\tDocument.save method throws java.lang.StackOverflowError\nWORDSJAVA-795\tMailMergeCleanupOptions.REMOVE_CONTAINING_FIELDS causes java.lang.NullPointerException\nWORDSNET-8946\tSpecifying MailMergeCleanupOptions.RemoveContainingFields before mail merge causes ArgumentException\nWORDSNET-9080\tInvalidCastException occurs during rendering/exporting DOCX to PDF\nWORDSNET-9113\tAspose.Words.FileCorruptedException is thrown while loading Docx file\nWORDSNET-9131\tNullReferenceException occurs during rendering to fixed page formats\nWORDSNET-9167\tSystem.OverflowException occurs during rendering to PDF or printing\nWORDSNET-9173\tDocument.Save method throws System.ArgumentException while saving Docx to Pdf\nWORDSNET-9181\tOfficeMath equation causes ArgumentNullException during rendering to PDF\nWORDSNET-9202\tNullReferenceException occurs during rendering to fixed page formats\nWORDSNET-9221\tAppendDocument method throws System.ArgumentException\n\n• Bugs\nWORDSJAVA-658\tEnlarged fonts while rendering emf+ metafile to pdf.\nWORDSJAVA-787\tNull generator name during save to PostScript\nWORDSJAVA-796\tDoc to image conversion issue with mathematical formulas rendering\nWORDSJAVA-798\tSmall scale improperly applied to line pattern in metafile.\nWORDSJAVA-804\tMicrosoft Equation problem under Linux while converting .docx to .pdf\nWORDSJAVA-809\tAxis title formatted as double instead of integer.\nWORDSJAVA-810\tError in PostScript test\nWORDSNET-5627\tTwo words separated by Column Break gets counted once\nWORDSNET-6440\tList numbering of Bullets is incorrect when converting to fixed page formats\nWORDSNET-7877\tImport TR CSS from HTML\nWORDSNET-8457\tDocument.UpdateFields do not work where the table of contents is in two-column layout\nWORDSNET-8557\tDocument footer is not rendered correctly in output Pdf\nWORDSNET-8669\tHTML styles do not import correctly\nWORDSNET-8716\tExtra contents are rendered in output Pdf file after conversion from HTML\nWORDSNET-8749\tCSS styles do not work while importing HTML into Aspose.Words DOM\nWORDSNET-8790\tCell borders become invisible when viewing output ePub with iBooks for iPad\nWORDSNET-8922\tHTML documents with zero-size frames look incorrectly in browsers\nWORDSNET-8937\tUndefined Bookmark issue in output document after doing Mail Merge.\nWORDSNET-9032\tHTML to Pdf conversion issue with image rendering\nWORDSNET-9065\tDocx to Pdf conversion issue with list numbering\nWORDSNET-9070\t\"Track moves\" track changes option is not preserved during open/save a DOCX\nWORDSNET-9116\tWhite spacing between some words is getting lost during saving to HtmlFixed\nWORDSNET-9138\tPageSetup.PaperSize property does not change paper size to Letter (8.5 x 11 inches)\nWORDSNET-9139\tDocuments are not appearing on same page after appending even after specifying SectionStart.Continuous\nWORDSNET-9141\tRowFormat.HeadingFormat does not repeat table header row on every page\nWORDSNET-9150\tDoc to Pdf conversion issue with Chinese bullet numbers\nWORDSNET-9152\tShapes overlap the other content of Document in PDF\nWORDSNET-9154\tSome table rows are not rendering in fixed page formats\nWORDSNET-9158\tDoc to Pdf conversion issue with content rendering\nWORDSNET-9163\tImport contents of <noscript> elements\nWORDSNET-9169\tDocument.Save looses formatting/information of first column the table\nWORDSNET-9179\tBuiltInDocumentProperties.Words return incorrect value\nWORDSNET-9206\tFormFields are vertically shifted down in PDF\nWORDSNET-9214\tHighlight color of checkboxes is not preserved in fixed page formats\nWORDSNET-9218\tIncorrect font rendering issue while conversion from Docx to PNG\nWORDSNET-9223\tText rendering issue with font attributes (bold, normal) while inserting SVG into document\nWORDSNET-9232\tHTML to Pdf conversion issue with empty row reading\nWORDSNET-9235\tFont fallback issue with Telugu, Tamil, and Chinese characters\nWORDSNET-9237\tImported from CSS table style defines extra paragraph borders\nWORDSNET-9252\tCommon paragraph border looks incorrectly during export to HTML\n\n• Performance\nWORDSJAVA-811\tToo much memory is consumed during rendering\nWORDSNET-9034\tWord to PDF conversion takes several minutes to complete\nWORDSNET-9180\tFind and replace text feature is too slow and resource consuming\n\n• Regressions\nWORDSJAVA-801\tNullPointerException is thrown when exporting a Doc to Html under OpenJDK+Ubuntu\nWORDSJAVA-802\tNullPointerException is thrown when exporting a Doc to Html under OpenJDK+Ubuntu\nWORDSNET-9190\tMailMerge.GetFieldNames method throws NullReferenceException\nWORDSNET-9234\tAspose.Words.FileCorruptedException is thrown while loading HTML file",
  "requireLicenseAcceptance": true,
  "title": "Aspose.Words for .Net",
  "version": "13.11.0",
  "tags": [
    "Aspose.Words",
    "DOC",
    "DOCX",
    "RTF",
    "HTML",
    "OpenDocument",
    "XPS",
    "EPUB",
    "Word",
    "Document",
    "Processing"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    }
  }
}