{
  "@id": "https://api.nuget.org/v3/catalog0/data/2015.02.03.17.32.49/richtexteditor.8.0.1.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "CuteSoft",
  "catalog:commitId": "62988812-5930-402f-b9e7-1b9f2e50af63",
  "catalog:commitTimeStamp": "2015-02-03T17:32:49.6619369Z",
  "copyright": "2013 richtexteditor.com. All rights reserved.",
  "created": "2013-08-16T23:44:24.077Z",
  "description": "The next-generation online html editor is now available! Rich Text Editor for asp.net is by far the fastest, cleanest, most powerful online wysiwyg content editor. It's also available for PHP and ASP. \n\nIt enables asp.net web developers to replace any textbox/textarea with an intuitive word-like wysiwyg editor. \n\nRich Text Editor toolbar is completely configurable and it is also effortless to implement. You just need a couple lines of code to add this editor to .NET and MVC applications.\n\nWhy Rich Text Editor?\n\nRich Text Editor is the industry-leading online html editor and we are proud that Rich Text Editor always serves as an inspiration for other editors. Now version 8.0 is designed from a different point of view from old versions and most editors.\n\n\n#1 cross-browser support\n\nMost available RTEs fail to support the full spectrum of A-Grade web browsers. Following 9 year old tradition of industry #1 cross-browser support, Rich Text Editor continues to offer even better quality and compatibility by supporting all major browsers: IE 6.0+, Firefox 2.0+, Mozilla 1.3+, Netscape 7+, Safari (1.3+), Opera 9.0, IE 9 and Chrome.\n\n\nCleanest html code\n\nMost WYSIWYG editors are just JavaScript wrappers around the editing control built into browsers such as MSHTML control found in IE. They generate bad markups and then run code clean-up routines against it. By contrast, Rich Text Editor is built from the ground up to be a true XHTML editor in its own right.\n\nExtremely small and fast\n\nMost feature-rich WYSIWYG editors suffer long loading times due to large javascript files. Rich Text Editor only loads the necessaery scripts to client browsers. Numerous optimization methods have been applied. It's clean, compact, extremely fast-loading, but still powerful and efficient.\n\n\nCutting-edge features\n\nFrom powerful online image management, easy to use file manager, to multiple image uploading, to online image editing, to PDF conversation.",
  "iconUrl": "http://richtexteditor.com/images/rich-text-editor.png",
  "id": "RichTextEditor",
  "isPrerelease": false,
  "lastEdited": "0001-01-01T00:00:00Z",
  "licenseUrl": "http://richtexteditor.com/end-user-license-agreement.aspx",
  "packageHash": "q6WsybTootoQAn/hK0VNLlSEZbl7uZWDMa+beZjL9x60TZ7XdK+xAeNIlrQbRewEGBxBJ6owonzNOOU6o21oFg==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 6554963,
  "projectUrl": "http://richtexteditor.com/",
  "published": "2013-08-16T23:44:24.717Z",
  "releaseNotes": "What's New in Rich Text Editor 8.0!?\n\n\nBetter organized interface\n\nThis version comes with fully reworked Ribbon interface. It mimics the look and feel of popular text processor applications such as Microsoft Word. From the new word-like toolbars and contextual menus to the more subtle changes in labels and tooltips, Rich Text Editor aims to make you feel comfortable editing online content\n\n\nCopying Formatting using Format Painter\n\nThe Format Painter feature lets you quickly and easily \"copy\" all the formatting characteristics from one group of selected text to another. This is handy when you have a combination of formats on something, like a size, color and style, and want to apply them to another item, without having to apply them individually.\n\n\nHTML5 Support\n\nHTML5 will be the new standard for HTML. Major browsers support many of the new HTML5 elements and APIs. Rich Text Editor is providing support for various HTML5 elements, attributes, and values.\n\n\nUse rulers for guidance\n\nIn Rich Text Editor, you can use rulers guide your page layout in Design view. Rulers appear across the top and down the left side of the editing window.\n\n\nPowerful image editor\n\nOne of the revolutionary features of Rich Text Editor 8 is the new image editor. With online image editor, you can now edit image file with no image editing software to download or install! Easy drag and drop familiar interface. Resize, change dimensions, scale, crop, add text, optimize, rotate, flip, mirror and add watermark.\n\n\nQuick Property Editor\n\nThe new Quick Property Editor functionality in Rich Text Editor 8 enables you to view and modify object properties for selected objects. The simplified list makes it easier for you to locate the property you want to edit. Also, the Quick Property Editor is displayed right at the cursor when you select an object. Quick Property Editor shows only the most common attributes, but provides a richer set of controls for changing those attributes's values.\n\n\nPowerful File Manager\n\nA powerful file manager in Rich Text Editor 8 helps you to easily manage images, document, videos and template files. This full featured file manager helps you copy, delete, move, search, and organize your files on the server.\n\nImproved CSS Style Dropdown\n\nThe CSS Style Dropdown functionality in Rich Text Editor 8 has been significant improved. You can create a cascading style sheet file in which to define all the styles you need when editing content, and then use the file within the editor. Its content (styles) will be displayed in the Style drop-down menu. Unlike the previous version, both styles and classes are rendered in the drop-down menu as they will look in page so that you can easily pick the correct one.\n\n\nFiltering HTML code\n\nThe new Filter HTML code functionality in Rich Text Editor 8 allows you to accept HTML input from your users, filter it to make sure it contains only an allowed set of tags, attributes and values.\n\n\nBBCode output\n\nBBCode output is supported in Rich Text Editor 8. BBCode is a set of tags based on the HTML language that you may already be familiar with. They allow you to add formatting to your messages in the same way as HTML does, but have a simpler syntax and will never break the layout of the pages you are viewing.",
  "requireLicenseAcceptance": false,
  "summary": "The next-generation online html editor is now available! Rich Text Editor for asp.net is by far the fastest, cleanest, most powerful online wysiwyg content editor. It's also available for PHP and ASP.",
  "title": "Rich Text Editor for ASP.NET and MVC",
  "version": "8.0.1",
  "tags": [
    "Rich",
    "Text",
    "Editor",
    "wysiwyg",
    "editor",
    "RTE",
    "RichText",
    "RichTextBox",
    "RichTextEditor",
    "html",
    "code"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    }
  }
}