{
  "@id": "https://api.nuget.org/v3/catalog0/data/2015.02.02.17.16.52/aspose.words.11.8.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "Aspose",
  "catalog:commitId": "f7c6c96d-fa87-4694-8645-f32f27ec0a56",
  "catalog:commitTimeStamp": "2015-02-02T17:16:52.390746Z",
  "copyright": "© Aspose 2002-2011. All Rights Reserved.",
  "created": "2012-10-07T04:31:16.487Z",
  "description": "Aspose.Words for .NET class library supports DOC, DOCX, RTF, HTML, OpenDocument, PDF, XPS, EPUB and other formats. With Aspose.Words you can generate, modify, convert, render and print documents without utilizing Microsoft Word®",
  "iconUrl": "http://www.aspose.com/images/products/dotnet/Aspose.Words_128x128.png",
  "id": "Aspose.Words",
  "isPrerelease": false,
  "lastEdited": "0001-01-01T00:00:00Z",
  "licenseUrl": "http://www.aspose.com/corporate/purchase/end-user-license-agreement.aspx",
  "packageHash": "qXIPj3kvUL5OHmbD7FtkXgGEdQ5viEa3WFNf8U51xvv9hLvWJV9zIWkaqRI5aM1ombmLIJx7d4rRm7cDkKYusQ==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 14521587,
  "projectUrl": "http://www.aspose.com/categories/.net-components/aspose.words-for-.net/default.aspx",
  "published": "2012-10-07T04:31:16.487Z",
  "releaseNotes": "There are 164 improvements and fixes in this regular monthly release. The most notable are:\n\n• Improved EMF+ rendering (Embedded Metafiles, Curve Drawing Records)\n• Metafile rendering speed optimized\n• Supported RTL text during mail merge\n• Supported rendering OOXML Charts\n\nThis release introduces the new features, enhancements and fixes to the excptions, bugs and regressions as detailed below:\n\n• New features\n\nWORDSJAVA-622\tWORDSJAVA-608 Manually port DateTime.Parse related code to java.\nWORDSNET-170\tRight to left is not exported to PDF well\nWORDSNET-927\tAdd the possibility of authenticate to a proxy before opening the Word document.\nWORDSNET-1268\tAdd possibility to copy styles between documents.\nWORDSNET-3605\tSupport PageBorderArt in rendering.\nWORDSNET-3860\tOOXML Charts // Support rendering OOXML Charts\nWORDSNET-4494\tOOXML Charts // DrawingML chart disappears while rendering.\nWORDSNET-5080\tConsider exporting XAML as XamlPackage\nWORDSNET-5233\tImplement Unified methods for Load and Save warnings across all Conversions formats\nWORDSNET-5383\tSupport TXT document in INCLUDETEXT fields.\nWORDSNET-5600\tExtend IResourceLoading for all load formats\nWORDSNET-5714\tSupport PageBorderArt in export PDF\nWORDSNET-5935\tOOXML Charts // Shape is missed during rendering in Pdf/WordML format.\nWORDSNET-6063\tSupport warnings in DocumentValidator.\nWORDSNET-6163\tPage border is invisible when saving to fixed page formats\nWORDSNET-6344\tOOXML Charts // While docx to Pdf, DrawingML does not get redered.\nWORDSNET-6491\tConsider extending ResourceLoadingCallback to work with all formats\nWORDSNET-6520\tCreate working prototype of a Example Dashboard application\nWORDSNET-6529\tOption to ban network access\nWORDSNET-6717\tField code is rendered instead of field result if field is inside OfficeMath.\nWORDSNET-6803\tSupport of extrusion effect rendering (wireframe)\nWORDSNET-6830\tPreserve MS Word 2010 compatibility section on docx roundtrip\nWORDSNET-6854\tSupport numeral configuration\nWORDSNET-6879\tDrawingML is not rendering to fixed page formats\n\n• Enhancements\n\nWORDSJAVA-42\tWORDSJAVA-608 DateTime.ToString and DateTime.Parse should do all work for PalFormatter.\nWORDSNET-2428\tDachCap is not shown as expected in XPS.\nWORDSNET-3358\tTransform fonts from regular to given font style\nWORDSNET-3782\tRework TTC full embedding\nWORDSNET-4541\t\"Enable Usage Rights in Adobe Reader\"\nWORDSNET-5430\tAdd a method to Node to convert to HTML\nWORDSNET-5761\tIncorrect floating shape position\nWORDSNET-6033\tIncorrect floating image position\nWORDSNET-6543\tIncorrect floating table position\nWORDSNET-6602\tConsider adding a switch to select EMF+ dual rendering mode\nWORDSNET-6731\tText in table cell is rendered in a wrong vertical position\nWORDSNET-6747\tWORDSNET-3860 Support rendering of stacked charts.\nWORDSNET-6752\tWORDSNET-3860 Render chart legend.\nWORDSNET-6758\tWORDSNET-3860 Improve combining of different types of charts.\nWORDSNET-6798\tJoin line spacing and line spacing rule into one attribute.\nWORDSNET-6807\tImplement Save warnings for DOC.\nWORDSNET-6808\tException on loading document.\nWORDSNET-6815\tWORDSNET-3860 Make sure Axis.Delete option is taken in account\nWORDSNET-6817\tWORDSNET-6803 Implement extrusion effect rendering (wireframe) without perspective and transformations\nWORDSNET-6818\tWORDSNET-6803 Implement perspective view for extrusion effect rendering (wireframe)\nWORDSNET-6819\tWORDSNET-6803 Implement transformations for extrusion effect rendering (wireframe)\nWORDSNET-6824\tWORDSNET-3860 Rework Marker rendering.\nWORDSNET-6825\tRefactor live node collections\nWORDSNET-6867\tSupport EMF+ embedded WMF metafiles\nWORDSNET-6890\tSupport EMF+ curve drawing records\nWORDSNET-6902\tStructuredDocumentTag.SdtType issue with RichText\nWORDSNET-6924\tWORDSNET-3860 Render chart title with default options.\nWORDSNET-6952\tSort out metafile tests\nWORDSNET-6953\tPass Roman's additional review.\nWORDSNET-6978\tWORDSNET-6450 Add spacing before and after math operators.\nWORDSNET-6979\tWORDSNET-6450 Add spacing between function and argument.\n\n• Exceptions\n\nWORDSJAVA-600\tImage loading issue under OpenJDK6.\nWORDSNET-6625\tNullReferenceException occurs during executing simple MailMerge\nWORDSNET-6660\tNullReferenceException occurs during rendering to PDF\nWORDSNET-6705\tException while converting Docx to Pdf\nWORDSNET-6709\tException while converting Doc to Pdf, Parameter is not valid\nWORDSNET-6763\tSystem.InvalidOperationException thrown while converting DOC to EPUB\nWORDSNET-6772\tException while loading Docx\nWORDSNET-6800\tNullReferenceException occurs during rendering to fixed page formats\nWORDSNET-6835\tFileCorruptedException occurs upon loading DOCX.\nWORDSNET-6863\tInvalidOperationException occurs during executing MailMerge with MailMergeRtlCleanupMode.RemoveForLtrText option specified\nWORDSNET-6880\tAspose.Words.FileCorruptedException occurs when loading a DOC into DOM\nWORDSNET-6884\tNullReferenceException occurs when calling JoinRunsWithSameFormatting method\nWORDSNET-6889\tNullReferenceException occurs during rendering to fixed page formats\nWORDSNET-6916\tAspose.Words.FileCorruptedException occurs when loading a DOC into DOM\nWORDSNET-6923\tMulti-threaded print operations fail intermittently\nWORDSNET-6967\tNullReferenceException occurs during rendering to PDF\nWORDSNET-6977\tSystem.Xml.XmlException occurs during importing a DOCX file\n\n• Bugs\n\nWORDSJAVA-522\tWORDSJAVA-608 Comment.getDateTime returns incorrect time component\nWORDSJAVA-573\tException while converting Docx to Pdf\nWORDSJAVA-579\tMHtml to Pdf conversion issue, Error message displays on Pdf file\nWORDSJAVA-585\tInsertImage throws java.lang.IllegalStateException for a TIFF\nWORDSJAVA-591\tException while convert docx to pdf\nWORDSJAVA-601\tDoc to Tiff conversion produced differently sized tiff files at Windwos and Solaris.\nWORDSJAVA-603\tImage crop lost when save Docx to Pdf\nWORDSJAVA-617\tCreate Digitally Signed PDF Documents throws exception\nWORDSJAVA-618\tPrint spool size is much bigger than source docx.\nWORDSJAVA-619\tConsider removing the dependency on the JAI package from Sun\nWORDSJAVA-620\tWORDSJAVA-614 Image inside brush is not cropped.\nWORDSNET-2068\tSupport RTL in XAML\nWORDSNET-3029\tRTL does not work as expected upon main merge.\nWORDSNET-3867\tField value of LINK field is not retained after open/save.\nWORDSNET-4408\tFootnote is lost after open/save document.\nWORDSNET-4748\tMerge fields in IF field in header and footer are not filled with data.\nWORDSNET-4872\tINCLUDETEXT field shows error during rendering.\nWORDSNET-4906\tPage numbers are lost after converting RTF to DOC.\nWORDSNET-5033\t/image list labels:5/ Bullets are partially invisible after rendering.\nWORDSNET-5626\t{PAGE} field in IF expression in first header does not get evaluated\nWORDSNET-5743\tWPF host throws XamlParseException upon loading XAMLflow file i.e. generated by Aspose.Words\nWORDSNET-5783\tNested mail merge doesn't populate fields inside INCLUDETEXT\nWORDSNET-6143\tTables in .docx document are in the wrong position when converted to .pdf document\nWORDSNET-6201\tMail merge doesn't populate fields inside INCLUDETEXT\nWORDSNET-6400\tException while updating INCLUDETEXT field\nWORDSNET-6404\tConversion issue with Docx to Docx\nWORDSNET-6423\tSystem halts when loading HTML with too deep levels of nested tables\nWORDSNET-6450\tSpace Issue in MathML Equation with output Doc/PDF format\nWORDSNET-6578\t/list line spacing/ Line spacing is wrong for empty list paragraphs\nWORDSNET-6639\tRTF to PDF issue with image rendering\nWORDSNET-6650\tSupport hidden row in RTF.\nWORDSNET-6667\t/rtl/ Runs with RTL text but without rtl property are rendered incorrectly\nWORDSNET-6707\tFont is rendering incorrectly in PDF\nWORDSNET-6770\tPage orientation changed while converting RTF document to DOC\nWORDSNET-6777\tSome wmf pictures disappear during converting from docx to pdf\nWORDSNET-6780\tHeader Top margin and spacing is lost when saving OTT to ODT\nWORDSNET-6781\tPage styles are lost when saving OTT to ODT\nWORDSNET-6782\tBlue HighlightColor appears behind Bullet List Symbols in Fixed page formats\nWORDSNET-6785\tRtf to Doc conversion; the page number issue\nWORDSNET-6786\tRtf to Doc conversion; table border line issue\nWORDSNET-6787\tException while loading Docx file\nWORDSNET-6789\tAppendDocument do not import styles correctly\nWORDSNET-6790\tDocx to PDF conversion issue with image\nWORDSNET-6796\tFloating Table is rendering incorrectly in PDF\nWORDSNET-6797\tShape becomes visible after rendering to PDF\nWORDSNET-6805\tA Paragraph gets duplicated twice when rendering to fixed page formats\nWORDSNET-6810\tBullet Lists have too much left indent in fixed page formats\nWORDSNET-6812\tExecuteWithRegions do not work while merging data into table surrounded with IF condition\nWORDSNET-6813\tRTL text when inserted into merge fields is rendered incorrectly.\nWORDSNET-6820\tDoc to RTF conversion, the output RTF do not render correctly in richTextBox windows control\nWORDSNET-6822\tException on converting doc to Pdf\nWORDSNET-6828\tRTF to Docx conversion issue with image visibility\nWORDSNET-6831\tBookmark name, containing more than 40 characters, is truncated during loading\nWORDSNET-6836\tShape.AlternativeText do not work with Docx/ODT\nWORDSNET-6838\tThe document appears to be corrupted and cannot be loaded.\nWORDSNET-6842\tStyle is imported incorrectly in destination document during appending documents\nWORDSNET-6844\tUnable to Load Doc file\nWORDSNET-6846\tContent controls are getting lost when rendering to fixed page formats\nWORDSNET-6852\tIncorrect conversion of LeftIndentUnits into LeftIndent by DocumentValidator\nWORDSNET-6853\tDocument.Print method issue with ODT file\nWORDSNET-6855\tThe document appears to be corrupted and cannot be loaded\nWORDSNET-6859\tTemplate path is lost when loading DOTX into DOM\nWORDSNET-6861\tRTL text inserted in MERGEFIELD is not preserved\nWORDSNET-6862\tLTR text is reversed when inserting into a MERGEFIELD\nWORDSNET-6864\tPage margins and header spacing are not preserved during open/save ODT\nWORDSNET-6865\tDocx to PDF conversion issue with INCLUDETEXT\nWORDSNET-6869\tShape from second Section is overlapping the content in first Section\nWORDSNET-6870\tBlank pages are produced incorrectly in PDF\nWORDSNET-6883\tException while converting doc to PDF\nWORDSNET-6887\t/rtl/ Runs with RTL text but without rtl property are rendered incorrectly (WORDSNET-6667 followup)\nWORDSNET-6888\tDocx to HTML conversion issue with text rendering of HTML\nWORDSNET-6910\tRTL layout and rendering issue; Doc to PDF conversion\nWORDSNET-6912\tAppend one document to another issue with line space/Extra Lines\nWORDSNET-6921\tnumber formatting switch \\# ,0.00 do not work\nWORDSNET-6922\tObfuscator issue for NumeralFormat property\nWORDSNET-6927\tMail Merge with Regions freezes when used inside (IF MERGEFIELD)\nWORDSNET-6928\txml:space=\"preserve\" attribute is not preserved during open/save\nWORDSNET-6929\tTables with merged cells are rendered incorrectly in PDF\nWORDSNET-6931\tException while converting Doc to Image with ImageSaveOptions\nWORDSNET-6934\t\"html\" extension is missing for a file in EPUB package\nWORDSNET-6947\tShape becomes hidden after converting RTF to DOC\nWORDSNET-6948\tDoc to PNG conversion issue with table position\nWORDSNET-6955\tVisio.Drawing.11 object is invisible when printing PDF produced by Aspose.Words\nWORDSNET-6960\tIndexOutOfRangeException is thrown upon rendering chart.\nWORDSNET-6962\tNullReferenceException is thrown upon rendering chart.\nWORDSNET-6963\tAxis labels are rendered improperly\nWORDSNET-6964\tNullReferenceException is thrown upon rendering chart\nWORDSNET-6965\tNullReferenceException is thrown upon rendering chart.\nWORDSNET-6966\tNullReferenceException is thrown upon rendering chart.\nWORDSNET-6971\tComplex IF field fails to evaluate properly\nWORDSNET-6974\tText in RFFlow chart object is laid out incorrectly in PDF\n\n• Regressions\n\nWORDSNET-6832\tRTL text inserted in MERGEFIELD is no longer preserved when converting to TIFF\nWORDSNET-6881\tNullReferenceException occurs during rendering to fixed page formats",
  "requireLicenseAcceptance": true,
  "title": "Aspose.Words for .Net",
  "version": "11.8.0",
  "tags": [
    "Aspose.Words",
    "DOC",
    "DOCX",
    "RTF",
    "HTML",
    "OpenDocument",
    "XPS",
    "EPUB",
    "Word",
    "Document",
    "Processing"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    }
  }
}