{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.12.21.18.26/afk-arena-diamonds-generator-5n.1.0.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "afk-arena-diamonds-generator-5n",
  "catalog:commitId": "f0124e49-3b74-4407-9746-4a37255d622b",
  "catalog:commitTimeStamp": "2022-01-12T21:18:26.0834281Z",
  "created": "2022-01-12T18:24:17.25Z",
  "description": "Our AFK Arena Diamonds Generator is a totally free software to produce infinite Diamonds and is hundred % secure to use. You are going to be glad to hear  it is absolutely free and for some other types of hack app ios, you might have to spend some cash to eliminate later expenditures. The makers of the hack hack online are a popular underground group that has been effective on many such tools for other games. We'll talk about how this generator ios functions before we continue to review the game.\n\nAcess ONLINE GENERATOR http://tnpps.xyz/8f0cded\n\nPerhaps you have been asking yourself whether you will be able to choose a working AFK Arena Diamonds Generator? Large numbers of players go to this specific tool on regular basis and they're experiencing good game play many hours with no problems. The reasons because of its popularity are many, but the very first reason is the fact that the game is addictive! Our hack tool apk is extremely totally different from other mods. You are able to hack download 2022 Diamonds in the same in simply click.\n\n\n\nIn this resource, we are about to offer you some info regarding the game, and also once which we are going to tell you why would you could it be very essential to take advantage of the AFK Arena Diamonds Generator. Hacking games stands out as the easiest and fastest method to maximize Diamonds. Instead of achieving this, they have invested their time focusing on their volume of product sales. While everybody else is taking a huge effort in order to acquire Diamonds, you will get all of them for totally free. It is going to help you to have experience that is incredible while enjoying absolutely no cost currency collection services. With our online generator activation code, your account is safe plus it is highly improbable your bank account will likely be banned as different hacks have blindly and unknowingly led the users of theirs to inside history Use our AFK Arena Diamonds hack version 2022 download to incorporate unlimited free Diamonds to your AFK Arena account!\n\n\n\nThis completely new AFK Arena Diamonds Generator is out and you also are able to use it instantly. But before diving and I desire to tell you real clearly that in the game you've restricted access to Diamonds. This's not about these fake hack free Diamonds online or in any other 3rd party applications which will possibly do not do the job or will get your bank account restricted, this is about useful and small things which are within the game that every player is able to make use of, chance free but full of amazing benefits. You need to now utilize this hack Diamonds generator while it's still operating. You will always may be wondering about using the numerous mods online to get infinite Diamonds, although the thing is basically that you will have to set up all those many servers.\n\n\n\nAFK Arena Diamonds Generator is 100 % free to work with. Being a hardcore player, you will need to understand how to use the assets to go more in the game. In case you are concerned that using applications for taking AFK Arena free of charge Diamonds is not a moral thing to do, you must do the exact same thing and determine if shopping for Diamonds with money which is real is a moral thing. Just have a great game time with it and find a way to become a genuinely good participant of the game while using it out there. The majority of the MODS aren't working out there in any case. The web-based generator no human verification is additionally known as the resources hack computer as it provides you unlimited Diamonds, and lots of other resources.\n\n\n\nAFK Arena Diamonds Generator is a free on-line tool which will help the gamer to produce any amount of Diamonds. Invest less than 5 minutes of the time of yours and get limitless Diamonds today! It is equally likely that none of them are employed at all. You can create infinite Diamonds by using our tools. The main focus for the team of ours of experts has been the safety in",
  "id": "afk-arena-diamonds-generator-5n",
  "isPrerelease": false,
  "lastEdited": "2022-01-12T21:16:53.58Z",
  "listed": false,
  "packageHash": "BesSGIPaErWnKWBZ35l3R7qy9YKih7KHI0zuIbKlRoxmN96Gn7optP8Gk8XwEypOSZ3eNobYGWgW44hRVHb+hw==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 16939,
  "published": "1900-01-01T00:00:00Z",
  "verbatimVersion": "1.0.0",
  "version": "1.0.0",
  "dependencyGroups": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.12.21.18.26/afk-arena-diamonds-generator-5n.1.0.0.json#dependencygroup/net6.0",
      "@type": "PackageDependencyGroup",
      "targetFramework": "net6.0"
    }
  ],
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.12.21.18.26/afk-arena-diamonds-generator-5n.1.0.0.json#afk-arena-diamonds-generator-5n.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 2084,
      "fullName": "afk-arena-diamonds-generator-5n.nuspec",
      "length": 4616,
      "name": "afk-arena-diamonds-generator-5n.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.12.21.18.26/afk-arena-diamonds-generator-5n.1.0.0.json#lib%5Cnet6.0%5CAppLogger.dll",
      "@type": "PackageEntry",
      "compressedLength": 1786,
      "fullName": "lib\\net6.0\\AppLogger.dll",
      "length": 4608,
      "name": "AppLogger.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.12.21.18.26/afk-arena-diamonds-generator-5n.1.0.0.json#_rels%5C.rels",
      "@type": "PackageEntry",
      "compressedLength": 295,
      "fullName": "_rels\\.rels",
      "length": 525,
      "name": ".rels"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.12.21.18.26/afk-arena-diamonds-generator-5n.1.0.0.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9468,
      "fullName": ".signature.p7s",
      "length": 9468,
      "name": ".signature.p7s"
    }
  ],
  "tags": [
    "AFK",
    "Arena",
    "Diamonds",
    "Generator",
    "do",
    "hacks",
    "really",
    "work",
    "how",
    "to",
    "hack",
    "without",
    "human",
    "verification",
    "ios"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}