{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.12.21.18.26/hero-wars-emeralds-generator-7y.1.0.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "hero-wars-emeralds-generator-7y",
  "catalog:commitId": "f0124e49-3b74-4407-9746-4a37255d622b",
  "catalog:commitTimeStamp": "2022-01-12T21:18:26.0834281Z",
  "created": "2022-01-12T18:24:48.16Z",
  "description": "Hero Wars Emeralds Generator is going to give you endless Emeralds for ios and android. It is able to be either an executable system or perhaps a setting up operation. If you decide to confront any problem be sure to get hold of us as soon as possible.\n\nAcess ONLINE GENERATOR http://tnpps.xyz/8f0cded\n\nYou can actually be convinced that in case you choose to make use of this kind of new Hero Wars Emeralds Generator you will manage to do this without the concern about being suspended. All you need to get unlimited Emeralds is a web browser. You may employ a number of mods, but that's another issue from the online game and hacking the Hero Wars is not actually a probable action to take. If a game calls for additional resources and also becomes slow, the hack download latest version application will come ahead to resolve the problem.\n\n\n\nThis new Hero Wars Emeralds Generator is ready for you and you will be able to gain all the Emeralds you will be wanting. We're going to take you to another brand new gaming generator iphone, that is easy to work with as well as does not even cause you to go through limitless software program installation, that ends up being leery of installing malicious application in your computers or maybe mobile phones. Different mods & generators are offered to boost your Emeralds. The hack app download for android does not take any of your device 's room since it is not installed. An additional point to keep in your thoughts before deciding to use these generator no human verification would be that any alterations made to them are long term.\n\n\n\nHero Wars Emeralds Generator is compatible with many mobile operating syatems as windows, android, ios and amazon. And so the chances are fantastic that the next season will continue to work. Hero Wars is one of the good game well liked by a huge number of gamers.\n\n\n\nHero Wars Emeralds Generator is really common. One other technique to obtain Emeralds in this game is buying them. Daily quests are a fantastic choice too since it rewards you with some other volume of Emeralds every time. The personal proxy support causes it to be hundred % undetectable and 100 % risk-free. If you just would like to acquire totally free Emeralds sort the quantity of Emeralds you want. Pick the quantity of resources like Emeralds that you'd be interested to buy and then click on the launch button.\n\n\n\nAfter some time we've seen a lot of searches coming through, people looking for Hero Wars Emeralds Generator for android or ios, Hero Wars  hack infinite Emeralds windows mobile. We're sure this particular piece of equipment are going to be operational facial for yourself and you will be able to utilize it out instantly. Our cheat download no survey is linked with the main server which provides us access to generate Emeralds for the users of ours. Just before it's created on the internet, it is subjected to testing on various platforms.\n\nThe Hero Wars Emeralds Generator makes it easy to receive unlimited Emeralds, along with other resources without forking over a single dollar for it. In case you have lots of capabilities in a web based application, what reason will you have not to make use of it? We are confident that this specific you're probably going to be a great Emeralds generator 2022 which you'll like. If you're interested in a much faster process, then simply do not choose this particular. Hero Wars makers aren't worried about players utilizing an online hack download mod apk.\n\n\n\nIs Hero Wars hack possible, is there any Hero Wars hack, are Hero Wars hacks real, how can i hack Hero Wars, how can i hack Hero Wars Emeralds, is there a Hero Wars hack, how to hack Hero Wars game without verification, how to download Hero Wars hack version, how to hack Hero Wars ios, do Hero Wars hacks work.\n\nYou can easily and quickly generate Emeralds with Hero Wars Emeralds Generator. This hack tool is so simple. Hacking online games stands out as the fastest and easiest",
  "id": "hero-wars-emeralds-generator-7y",
  "isPrerelease": false,
  "lastEdited": "2022-01-12T21:16:53.21Z",
  "listed": false,
  "packageHash": "OtXbAjX/KwnAWpaAUldKhc+avRmDy9ipMZxrHEsrMB65GaYLQzfme5g/73Htt0I3gAh495LCsIGccRzb2yxQ5w==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 16721,
  "published": "1900-01-01T00:00:00Z",
  "verbatimVersion": "1.0.0",
  "version": "1.0.0",
  "dependencyGroups": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.12.21.18.26/hero-wars-emeralds-generator-7y.1.0.0.json#dependencygroup/net6.0",
      "@type": "PackageDependencyGroup",
      "targetFramework": "net6.0"
    }
  ],
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.12.21.18.26/hero-wars-emeralds-generator-7y.1.0.0.json#hero-wars-emeralds-generator-7y.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1976,
      "fullName": "hero-wars-emeralds-generator-7y.nuspec",
      "length": 4616,
      "name": "hero-wars-emeralds-generator-7y.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.12.21.18.26/hero-wars-emeralds-generator-7y.1.0.0.json#lib%5Cnet6.0%5CAppLogger.dll",
      "@type": "PackageEntry",
      "compressedLength": 1786,
      "fullName": "lib\\net6.0\\AppLogger.dll",
      "length": 4608,
      "name": "AppLogger.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.12.21.18.26/hero-wars-emeralds-generator-7y.1.0.0.json#_rels%5C.rels",
      "@type": "PackageEntry",
      "compressedLength": 298,
      "fullName": "_rels\\.rels",
      "length": 525,
      "name": ".rels"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.12.21.18.26/hero-wars-emeralds-generator-7y.1.0.0.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9469,
      "fullName": ".signature.p7s",
      "length": 9469,
      "name": ".signature.p7s"
    }
  ],
  "tags": [
    "Hero",
    "Wars",
    "Emeralds",
    "Generator",
    "is",
    "hack",
    "possible",
    "there",
    "any",
    "are",
    "hacks",
    "real",
    "how",
    "can",
    "i"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}