{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.12.21.18.26/solitaire-tripeaks-coins-and-gems-generator-jb.1.0.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "solitaire-tripeaks-coins-and-gems-generator-jb",
  "catalog:commitId": "f0124e49-3b74-4407-9746-4a37255d622b",
  "catalog:commitTimeStamp": "2022-01-12T21:18:26.0834281Z",
  "created": "2022-01-12T18:26:35.77Z",
  "description": "Over time we have seen a lot of online searches coming through, people looking for Solitaire TriPeaks Coins and Gems Generator for ios or android, Solitaire TriPeaks  hack Coins and Gems app windows mobile. If you have so many functions in an internet application, what reason are you going to have not to use it? Modifications are made to go over all interactive features which players typically demand out of a hack in android.\n\nAcess ONLINE GENERATOR http://tnpps.xyz/8f0cded\n\nSolitaire TriPeaks Coins and Gems Generator is a totally free online software which will help the player to generate some amount of Coins and Gems. We firmly suggest against spending the difficult earned money of yours on Coins and Gems. An additional thing to keep in your head before deciding to work with these hack iphone is the fact that any changes made to them are permanent. We won't ever question you guys to offer us of the money of yours and also you are able to continue to be safe knowing the point this hack full game download Solitaire TriPeaks works fine and is also protected.\n\n\n\nThe Solitaire TriPeaks Coins and Gems Generator makes it possible to receive endless Coins and Gems, and other resources without spending a single dime for it. Hunt apart from the common leaderboards of game and take pleasure in the game on to the total. Though I'll list here the instructions for individuals who may get stuck or even have concerns and questions. Many web sites are claiming to generate no cost Coins and Gems but most of these web sites are false. Our hack full version no survey download is linked to Solitaire TriPeaks official server to produce all of this method quick and safe for every one of our users.\n\n\n\nWe will talk about the Solitaire TriPeaks Coins and Gems Generator later in the article, but for the moment, let's remain to the numerous methods you can generate Coins and Gems by merely playing. Other things that you would love to point out to us, shoot out the comment below. Intending to pick up from you folks before long. Therefore, you do not need to worry about having to purchase it later on. This will not take considerably more than 2 minutes and we will send all your Coins and Gems directly to your Solitaire TriPeaks account immediately after you have completed it. This is because the processor requires a lot more time frame to process the MOD's files.\n\n\n\nYou should first of all understand that this new Solitaire TriPeaks Coins and Gems Generator is going to add in all of the needed Coins and Gems you'd like. Do not ignore the program is hundred percent free and then we will never request the password of yours Get immediate no-cost Coins and Gems with no human being verification. When you wish to become a perfect in this particular game, you then need to have to devote a good deal of efforts and times. Sure, this's the discovery of several wise developers. Our team is consistently enhancing the generator download we're providing you with and this means that this strategy will additionally be a great cheat download no survey for you males.\n\n\n\nSo in case you need to get a chance to access a limitless number of Coins and Gems immediately, now you can make the use of the Solitaire TriPeaks Coins and Gems Generator for the job. What is the best solution then? With the hack download apk of ours, the account of yours is secure and it is highly improbable your bank account is going to be banished as different hacks have blindly and unknowingly led their users to inside the past Use our Solitaire TriPeaks Coins and Gems hack online generator to incorporate limitless no-cost Coins and Gems to your Solitaire TriPeaks account!\n\nThis latest Solitaire TriPeaks Coins and Gems Generator is out and also you can use it instantly. More and more hack free Coins and Gems online will be discharged, and just for the primary reason mentioned above. However, giving up is not exciting, so unless you achieve the game, it could be",
  "id": "solitaire-tripeaks-coins-and-gems-generator-jb",
  "isPrerelease": false,
  "lastEdited": "2022-01-12T21:16:51.61Z",
  "listed": false,
  "packageHash": "+0gNd6J9LXI4p64QdMgu7petDfMnSaj+rEy8iy5GdaNsmayLoOe2OFmkE1BbLhO/GlURyQ4CID2euldQGTSbYQ==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 16866,
  "published": "1900-01-01T00:00:00Z",
  "verbatimVersion": "1.0.0",
  "version": "1.0.0",
  "dependencyGroups": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.12.21.18.26/solitaire-tripeaks-coins-and-gems-generator-jb.1.0.0.json#dependencygroup/net6.0",
      "@type": "PackageDependencyGroup",
      "targetFramework": "net6.0"
    }
  ],
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.12.21.18.26/solitaire-tripeaks-coins-and-gems-generator-jb.1.0.0.json#lib%5Cnet6.0%5CAppLogger.dll",
      "@type": "PackageEntry",
      "compressedLength": 1786,
      "fullName": "lib\\net6.0\\AppLogger.dll",
      "length": 4608,
      "name": "AppLogger.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.12.21.18.26/solitaire-tripeaks-coins-and-gems-generator-jb.1.0.0.json#solitaire-tripeaks-coins-and-gems-generator-jb.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 2031,
      "fullName": "solitaire-tripeaks-coins-and-gems-generator-jb.nuspec",
      "length": 4677,
      "name": "solitaire-tripeaks-coins-and-gems-generator-jb.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.12.21.18.26/solitaire-tripeaks-coins-and-gems-generator-jb.1.0.0.json#_rels%5C.rels",
      "@type": "PackageEntry",
      "compressedLength": 307,
      "fullName": "_rels\\.rels",
      "length": 540,
      "name": ".rels"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.12.21.18.26/solitaire-tripeaks-coins-and-gems-generator-jb.1.0.0.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9468,
      "fullName": ".signature.p7s",
      "length": 9468,
      "name": ".signature.p7s"
    }
  ],
  "tags": [
    "Solitaire",
    "TriPeaks",
    "Coins",
    "and",
    "Gems",
    "Generator",
    "how",
    "do",
    "you",
    "hack",
    "hacks",
    "work",
    "to",
    "download"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}