{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.12.21.18.26/toon-blast-coins-lives-and-moves-generator-tz.1.0.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "toon-blast-coins-lives-and-moves-generator-tz",
  "catalog:commitId": "f0124e49-3b74-4407-9746-4a37255d622b",
  "catalog:commitTimeStamp": "2022-01-12T21:18:26.0834281Z",
  "created": "2022-01-12T18:23:22.413Z",
  "description": "Toon Blast Coins, Lives and Moves Generator will give you unlimited Coins, Lives and Moves for ios and android. The simple fact is, there is no rocket science behind it, and anyone can get it done. Large numbers of players check out this specific tool on daily basis and they are enjoying good game play hours without any problems. Overall, you are able to declare that all positives are available for free, therefore the reality that we become free Coins, Lives and Moves so quickly bears testimony to it. The hack ios download isn't manufactured with any malicious applications in it. This means that in case you start making use of it out, you won't ever have some complications with it.\n\nAcess ONLINE GENERATOR http://tnpps.xyz/8f0cded\n\nWorking with any kind of outsource to boost Toon Blast Coins, Lives and Moves is generally known as Toon Blast Coins, Lives and Moves Generator. If you merely would like to get totally free Coins, Lives and Moves choice the range of Coins, Lives and Moves you desire. Our generator download is associated with the main server which provides us access to generate Coins, Lives and Moves for the users of ours.\n\n\n\nUsing Toon Blast Coins, Lives and Moves Generator is stable since it doesn't hack the Toon Blast's game but it connects with the Toon Blast database and sends Coins, Lives and Moves thru the Toon Blast database. While taking part in a game, if you actually run into a player who's much more classy and appealing  you, then simply realize that they are surely spending Coins, Lives and Moves. Coins, Lives and Moves are just a feature of Toon Blast which provides a virtual currency.\n\n\n\nWe encourage you to take use of this Toon Blast Coins, Lives and Moves Generator also as it does the job properly on any ios and also on your android device that you posses. In case you are concerned that utilizing applications for taking Toon Blast free of charge Coins, Lives and Moves isn't a moral thing to do, you should do the same thing and ask yourself if shopping for Coins, Lives and Moves with money that is real is a moral idea. When you need to become a perfect in this particular game, then you need to have to devote a lot of efforts and times.\n\n\n\nYou could possibly have read about Toon Blast Coins, Lives and Moves Generator from another person and will be interested to know more about it. Another problem which might happen by using regular mods is that the designer of Toon Blast are often trying to detect the MODS and so they ban you when you are caught. Lots of internet pastimes which may be played for free, provide their virtual currencies that can be utilized to uncover several objects of the game. This will not take up more in comparasion to two mins and we are going to send all your Coins, Lives and Moves directly to the Toon Blast bank account of yours immediately after you've finished it.\n\n\n\nUse Toon Blast Coins, Lives and Moves Generator and take advantage of the game. Hence, ask yourself if you truly desire to take advantage of all the advantages that this provides you with, simply because that will transform the gaming experience of yours. Effectively, most of the players are going to be the game challenging and boring in the intermediate levels as they have to create difficult efforts to collect Coins, Lives and Moves in the game. Indeed, this is the finding of some smart designers. With the hack download latest version of ours, the account of yours is safe plus it's extremely out of the question your account will be banished as other hacks have blindly and unknowingly led their users to in history Use our Toon Blast Coins, Lives and Moves resources generator apk to include limitless free Coins, Lives and Moves to your Toon Blast account!\n\nWe have under no circumstances at any time received any complaint related to this online resources and Toon Blast Coins, Lives and Moves Generator generated from this particular tool can't be tracked. A lot of internet sites on the net",
  "id": "toon-blast-coins-lives-and-moves-generator-tz",
  "isPrerelease": false,
  "lastEdited": "2022-01-12T21:16:54.13Z",
  "listed": false,
  "packageHash": "YcbuICr/kGpY0sjZnCWBfsMSblYCocstrE0G7EOKpVzjG5bbQRypwdjkb8MZXmf4PbG+m5voctdc0cag1sxNrQ==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 16663,
  "published": "1900-01-01T00:00:00Z",
  "verbatimVersion": "1.0.0",
  "version": "1.0.0",
  "dependencyGroups": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.12.21.18.26/toon-blast-coins-lives-and-moves-generator-tz.1.0.0.json#dependencygroup/net6.0",
      "@type": "PackageDependencyGroup",
      "targetFramework": "net6.0"
    }
  ],
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.12.21.18.26/toon-blast-coins-lives-and-moves-generator-tz.1.0.0.json#lib%5Cnet6.0%5CAppLogger.dll",
      "@type": "PackageEntry",
      "compressedLength": 1786,
      "fullName": "lib\\net6.0\\AppLogger.dll",
      "length": 4608,
      "name": "AppLogger.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.12.21.18.26/toon-blast-coins-lives-and-moves-generator-tz.1.0.0.json#toon-blast-coins-lives-and-moves-generator-tz.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1929,
      "fullName": "toon-blast-coins-lives-and-moves-generator-tz.nuspec",
      "length": 4650,
      "name": "toon-blast-coins-lives-and-moves-generator-tz.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.12.21.18.26/toon-blast-coins-lives-and-moves-generator-tz.1.0.0.json#_rels%5C.rels",
      "@type": "PackageEntry",
      "compressedLength": 306,
      "fullName": "_rels\\.rels",
      "length": 539,
      "name": ".rels"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.12.21.18.26/toon-blast-coins-lives-and-moves-generator-tz.1.0.0.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9469,
      "fullName": ".signature.p7s",
      "length": 9469,
      "name": ".signature.p7s"
    }
  ],
  "tags": [
    "Toon",
    "Blast",
    "Coins",
    "Lives",
    "and",
    "Moves",
    "Generator",
    "how",
    "to",
    "hack",
    "2022",
    "is",
    "there",
    "a",
    "ios",
    "any"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}