{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.12.21.18.26/township-coins-and-cash-generator-u5.1.0.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "township-coins-and-cash-generator-u5",
  "catalog:commitId": "f0124e49-3b74-4407-9746-4a37255d622b",
  "catalog:commitTimeStamp": "2022-01-12T21:18:26.0834281Z",
  "created": "2022-01-12T18:25:19Z",
  "description": "Our Township Coins and Cash Generator is the latest and up-to-date release and is 100 % secure. The truth is, there is simply no rocket science behind it, and everyone is able to get it done. You need the Township hack mod apk in order to get Coins and Cash. It will provide you with limitless Coins and Cash in the game with very little to not any campaigns. We hope you will like this guide a whole lot. So, the main element is the fact that the generators of ours typically are not like others, this means you are able to purchase cost-free Coins and Cash without having a survey or perhaps verifications.\n\nAcess ONLINE GENERATOR http://tnpps.xyz/8f0cded\n\nUsing Township Coins and Cash Generator is compatible since it doesn't hack the Township's online game but it connects with the Township database and sends Coins and Cash through the Township database. Therefore, you do not have to get worried about being forced to buy it in the future. Coins and Cash do not supply some competitive benefit, therefore there is simply no reason for taking the digital dollar of yours, thinking otherwise. Large numbers of players click on this specific resource on regular basis and they are having good game play many hours without the need for difficulty.\n\n\n\nTownship Coins and Cash Generator for android and ios the right way to get unlimited free Coins and Cash with no survey no person verification no password no download absolutely no root no jailbreak. What's the perfect solution then? This is because the processor requires more and more time to process the MOD's files.\n\n\n\nAnd so in case you would like to get permission to access a limitless number of Coins and Cash instantly, then you can make the usage of the Township Coins and Cash Generator for the job. The game can be obtained for both iphone and android equipment. Not just this, but this specific cheat download for ipad will even continue to remain free to use later on too.\n\n\n\nTownship Coins and Cash Generator is hundred % free to use. It will provide you with limitless Coins and Cash within the game with minimal to absolutely no campaigns. Though you don't wish to spend the true money of yours on the game constantly? The terrific thing is that you can create unrestricted Coins and Cash each time & anyplace only you want the web. If you over make use of the cheat bot, many other players could notice it and it may lead to your out from the game.\n\n\n\nOur Township Coins and Cash Generator is a totally free program to create unrestricted Coins and Cash and is 100 % secure to use. So to obtain closer to the best players in Township, you need to invest an a considerable amount of time and money. Free Coins and Cash cheat download pc hardly any human verification very little survey! The key reason why these younger people need Township to hack download latest version since they would like to get quickly and they want to get to the advanced level in a very short period thus in that instance, just about all they require is the Township hack Coins and Cash cheats which truly functions for them. We constantly be sure to provide the users of ours the best.\n\nYou had been most likely searching for this new Township Coins and Cash Generator and beginning from today, you can make use of it. Township is a free web based game. Thanks to the new anti-ban characteristic, all of your private and personal information is gon na be screened and this also means that all you have to accomplish is going to be focusing on the game. Township is famous as entertaining oriented multi player game that sends a great deal of new challenges face gamers inside every gaming hour. The ones which are working are not worth the chance of getting the main account of yours blacklisted. The free Coins and Cash hack Coins and Cash online of ours utilize a bit of hack apk 2022 to help you use generate Township Coins and Cash for free with only just one or even two real human verification.\n\n\n\nHow do you hack",
  "id": "township-coins-and-cash-generator-u5",
  "isPrerelease": false,
  "lastEdited": "2022-01-12T21:16:52.783Z",
  "listed": false,
  "packageHash": "SaTps65H4hqzWethCjMTmbTD5iI4VL+uLBx06V9XMrzzaowLOWHWAkw/3CPKEFk7THiD8rC5naOQWrhfRpH0vA==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 16707,
  "published": "1900-01-01T00:00:00Z",
  "verbatimVersion": "1.0.0",
  "version": "1.0.0",
  "dependencyGroups": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.12.21.18.26/township-coins-and-cash-generator-u5.1.0.0.json#dependencygroup/net6.0",
      "@type": "PackageDependencyGroup",
      "targetFramework": "net6.0"
    }
  ],
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.12.21.18.26/township-coins-and-cash-generator-u5.1.0.0.json#lib%5Cnet6.0%5CAppLogger.dll",
      "@type": "PackageEntry",
      "compressedLength": 1786,
      "fullName": "lib\\net6.0\\AppLogger.dll",
      "length": 4608,
      "name": "AppLogger.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.12.21.18.26/township-coins-and-cash-generator-u5.1.0.0.json#township-coins-and-cash-generator-u5.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1966,
      "fullName": "township-coins-and-cash-generator-u5.nuspec",
      "length": 4621,
      "name": "township-coins-and-cash-generator-u5.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.12.21.18.26/township-coins-and-cash-generator-u5.1.0.0.json#_rels%5C.rels",
      "@type": "PackageEntry",
      "compressedLength": 298,
      "fullName": "_rels\\.rels",
      "length": 530,
      "name": ".rels"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.12.21.18.26/township-coins-and-cash-generator-u5.1.0.0.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9468,
      "fullName": ".signature.p7s",
      "length": 9468,
      "name": ".signature.p7s"
    }
  ],
  "tags": [
    "Township",
    "Coins",
    "and",
    "Cash",
    "Generator",
    "how",
    "do",
    "you",
    "hack",
    "can",
    "be",
    "hacked",
    "i",
    "are",
    "hacks",
    "real"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}