{
  "@id": "https://api.nuget.org/v3/catalog0/data/2015.02.03.04.24.10/symbiotic_x64.3.1.0.2.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "Frozen Elephant Inc.,Eric Schneider",
  "catalog:commitId": "8ca31bbd-8acd-470b-a7b2-4d39a6a569b1",
  "catalog:commitTimeStamp": "2015-02-03T04:24:10.0277111Z",
  "copyright": "Copyright © 2011-2013 Frozen Elephant Inc.",
  "created": "2013-03-06T07:09:30.303Z",
  "description": "The main goal of this library is the simplify data access for Object Oriented programmers. This library provides a simple way to perform CRUD operations. It is not expected to work for everyone or every application. Currently works with SQL Server, Sqlite, My Sql and Oracle.\nI wanted something that would be simple to use, understand, and have very little impact on the code. With this library, you can have basic object CRUD working in less than three lines of code, and should require less than an hour to understand the library usage.\n\nI also wanted something that could easily be integrated into an existing project.\n\nThe basic concept is that you add a few attributes to your objects which explains the mapping to a database results column/s. You can also implement IDatabaseDefineSupport to provide the mapping details.\n\nThere a two main objects used to work with the database. ObjectLoader and ObjectWriter.",
  "iconUrl": "http://www.frozenelephant.com/Soda/Soda.ico",
  "id": "Symbiotic_x64",
  "isPrerelease": false,
  "language": "en-US",
  "lastEdited": "0001-01-01T00:00:00Z",
  "packageHash": "WO7jwHPiAE/dPodPCppZmqFf4seJ4whyT+eS5TwRsTDXq6ip6SMcbqIEx/7pkbil58ZT44w9L/M91eL8ks1mMw==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 4204984,
  "projectUrl": "http://www.frozenelephant.com/symbiotic.html",
  "published": "2013-03-06T07:09:30.303Z",
  "releaseNotes": "14-Feb-2013\nFix a bug in delete child. In cases where the child item is a list, Symbiotic was only deleting the first item. \nImproved the Unit test to confirm deletes.\n\nAdded EditHelper class, which can be used to track changes of objects, and also provides undo functionality. \nIntended to be used for user edits of objects.\n\n15-Feb-2013\nAdded more API comments.\nRefactored unit tests to use IDatabaseTypesFactory for IObjectLoader and IObjectWriter interfaces.\n\n16-Feb-2013\nAdded more API comments.\nSome code refactoring.\nAdded some new object diagrams.\n\n16-Feb-2013\nSome code refactoring.\nAdded more API comments.\n\n21-Feb-2013\nAdd boolean support to DatabaseTypesFactoryXXX classes.\n\n25-Feb-2013\nAdded support debug trace for all sql text and parameters values. \nCurrently only traces info when a debugger is attached and IDatabaseTypesFactory.ShouldDebugTraceSql = true\n\n26-Feb-2013\nWas thinking you should be able to trace in production also. Will probably chenge this tonight. \nRename property to IDatabaseTypesFactory.ShouldTraceSql, and maybe adjust trace method called; Trace.TraceInfo()\n\n27-Feb-2013\nWhile working on another project using Symbiotic, I ran into another new requirement Entity which has a Relationship with it's own type.\nThis causes a problem because a relation table cannot have two columns with the same name. \nTherefore I need to be able to specify the relation columns instead of using the parent and child id columns currently specified in the attribute.\nMy first thought is an overload on DatabaseRelationAttribute to provide the column names.\nAnother idea is to have logic which checks if parent column and child column match and automaticly adds a \"2\" to the end of the child column name.\n\n27-Feb-2013\nAdded overload on DatabaseRelationAttribute to provide the column names.\nChanged relation sql builders to suppor override.",
  "requireLicenseAcceptance": false,
  "summary": "The main goal of this library is to simplify data access for Object Oriented programmers. This library provides a simple way to perform CRUD operations.",
  "title": "Symbiotic ORM x64",
  "version": "3.1.0.2",
  "tags": [
    "SODA",
    "Symbiotic",
    "ORM",
    "Micro-ORM",
    "Sql",
    "Server",
    "MySql",
    "Sqlite",
    "Oracle",
    "Frozen",
    "Elephant"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    }
  }
}