{
  "@id": "https://api.nuget.org/v3/catalog0/data/2015.04.24.20.20.50/aspose.barcode.6.9.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "Aspose",
  "catalog:commitId": "673bdabb-04cf-42d1-bfdb-de11422f2008",
  "catalog:commitTimeStamp": "2015-04-24T20:20:50.4670935Z",
  "copyright": "© Aspose 2002-2015. All Rights Reserved.",
  "created": "2015-04-24T20:20:00.47Z",
  "description": "Aspose.BarCode for .NET is a robust and reliable barcode generation and recognition component, written in managed C#, it allows developers to quickly and easily add barcode generation and recognition functionality to their Microsoft .NET applications (WinForms, ASP.NET and .NET Compact Framework). \n\nAspose.BarCode for .NET supports most established barcode standards and barcode specifications. It has the ability to export to multiple image formats including: BMP, EMF, GIF, JPEG, PNG, TIFF and WMF.",
  "iconUrl": "http://www.aspose.com/images/products/dotnet/Aspose.BarCode_128x128.png",
  "id": "Aspose.BarCode",
  "isPrerelease": false,
  "lastEdited": "0001-01-01T00:00:00Z",
  "licenseUrl": "http://www.aspose.com/corporate/purchase/end-user-license-agreement.aspx",
  "listed": true,
  "packageHash": "asLFkcq4ZllHs/t6tsmlwZoDocK2BeK80eRKYEt8HqsmQWNmXLm+PAZJwzW402LGGMdtin1n57G1kthcqhYqbw==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 9307762,
  "projectUrl": "http://www.aspose.com/categories/.net-components/aspose.barcode-for-.net/default.aspx",
  "published": "2015-04-24T20:20:00.47Z",
  "releaseNotes": "The following is a list of improvements and improvements and changes in this release of Aspose.BarCode.\n\nNew features:\nBARCODENET-33954 Implement recognition rotated DataMatrix\nBARCODENET-34054 Add support of Micro PDF417 code\nBARCODENET-34060 Add decoding support of Micro QR code\nBARCODENET-34124 Implement restructuring filters API\nBARCODENET-34154 Add .NET 3.5 Client Profile version\nBARCODENET-25063 Is it possible to generate a barcode like the attached image?\n\nEnhancements:\nBARCODENET-34077 QR/Micro QR - encode/decode improvements\nBARCODENET-22846 Code39 barcode could not be recognized from a scanned image\nBARCODENET-33657 Unable to recognize Datamatrix bar codes from PNG files\nBARCODENET-33810 Can't recognize DataMatrix code from png image\nBARCODENET-33830 Can't recognize Code128 and DataMatrix codes in a single way\nBARCODENET-33831 Can't recognize DataMatric code from a tif file\nBARCODENET-33836 Can't recognize all DataMatrix codes from a tif file\nBARCODENET-33839 Can't recognize all DataMatrix codes from a tif file\nBARCODENET-33840 Can't recognize any DataMatrix code from a tif file\nBARCODENET-33844 Can't recognize all DataMatrix codes from a tif file \nBARCODENET-33846 Can't recognize QR code from jpg image\nBARCODENET-33855 Can't recognize QR code from jpg image without orientation angle\nBARCODENET-33857 Incorrect recognition of the QR code from PNG image\nBARCODENET-33919 Can't create Code128 barcode with standard 'f' character\nBARCODENET-33984 Can't recognize QR code from the TIF image\nBARCODENET-34003 Can't recognize all QR codes from the JPG image\nBARCODENET-34017 Recognizing two Code128 codes instead of one\nBARCODENET-34045 Add support of GS1 Databar coupon code generation\nBARCODENET-34063 Spell mistake in XML of Aspose.BarCode API\nBARCODENET-34068 Incorrect recognition of Pdf417 code from the tif image\nBARCODENET-34070 Can't recognize QR code without Orientation Hints settings\nBARCODENET-34080 Can't recognize DataMatrix code from the TIF file\nBARCODENET-34084 Incorrect recognition of Code128 code from the tif image\nBARCODENET-34092 Can't recognize a QR code from PDF document\nBARCODENET-34096 Optimize the speed of recognition from the multipage tiff file format\nBARCODENET-34099 Incorrect encoding punctuaion in PDF417 and MicroPDF417 barcodes\nBARCODENET-34104 Incorrect recognition of Code128 code from the tif image\nBARCODENET-34105 Incorrect recognition of Code128 code from the tif image\nBARCODENET-34106 Incorrect recognition of Code128 code from the tif image\nBARCODENET-34107 Incorrect recognition of Code128 code from the tif image\nBARCODENET-34108 Incorrect recognition of Code128 code from the tif image\nBARCODENET-34109 Can't recognize Ean13 code from the JPG image\nBARCODENET-34112 Can't recognize Code39 code form the PDF document\nBARCODENET-34113 Can't recognize PDF417 codeS from the PDF document\nBARCODENET-34115 Can't recognize QR codes using error correction level\nBARCODENET-34121 Сode128 recognizer confuses f and \"FNC1\".\nBARCODENET-34122 Can't recognize QR code from a JPG file\nBARCODENET-34136 Public API changes with new QR/MicroQR decoder\nBARCODENET-34137 Fake recognition of MicroPdf417\nBARCODENET-34153 Extra letters in codetext when checksum off\n\nExceptions:\nBARCODENET-33990 Index out of range error message while generating a Code128 symbology\nBARCODENET-34149 Stack overflow error while reading Code128 code from the tif image",
  "requireLicenseAcceptance": true,
  "summary": "Aspose.BarCode for .NET is a robust and reliable barcode generation and recognition component",
  "title": "Aspose.BarCode for .NET",
  "version": "6.9.0",
  "tags": [
    "Aspose.Barcode",
    "barcode",
    "generation",
    "recongnition",
    "EAN13",
    "EAN8",
    "UPCA",
    "UPCE",
    "ISSN",
    "ISBN",
    "ISMN",
    "Interleaved2of5",
    "Standard2of5",
    "MSI",
    "Code11",
    "Codabar",
    "Postnet",
    "Planet",
    "EAN14",
    "SCC14",
    "SSCC18",
    "ITF14",
    "IATA2of5",
    "Alpha-Numeric",
    "Code128",
    "EAN128",
    "Code39Extended",
    "Code39Standard",
    "Code93Extended",
    "Code93Standard",
    "Australia-Post",
    "Italian-Post25",
    "Matrix2of5",
    "2D",
    "PDF417",
    "DataMatrix",
    "Aztec",
    "QR",
    "SwissPostParcel"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    }
  }
}