{
  "@id": "https://api.nuget.org/v3/catalog0/data/2015.10.13.05.19.32/jqwidgets_framework.3.9.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "jQWidgets",
  "catalog:commitId": "5062486d-660b-4804-bc92-e7ac23745b5c",
  "catalog:commitTimeStamp": "2015-10-13T05:19:32.2005781Z",
  "created": "2015-10-13T05:19:08.93Z",
  "description": "jQWidgets is an advanced jQuery and HTML5 UI framework.\n\njQWidgets provides a comprehensive solution for building professional web sites and mobile apps. It is built entirely on open standards and technologies like HTML5, CSS, Javascript and jQuery. jQWidgets enables responsive web development and helps you create apps and websites that look beautiful on desktops, tablets and smart phones.\n\njQWidgets is a feature complete framework with professional touch-enabled jQuery widgets, themes, input validation, drag & drop plug-ins, data adapters, built-in WAI-ARIA accessibility, internationalization and MVVM support.",
  "developmentDependency": "true",
  "id": "jQWidgets_Framework",
  "isPrerelease": false,
  "lastEdited": "0001-01-01T00:00:00Z",
  "licenseNames": "",
  "licenseReportUrl": "",
  "licenseUrl": "http://www.jqwidgets.com/license/",
  "listed": true,
  "packageHash": "0Ap2axrKo/rv84WtN9dr1FUqBOci/zgVYF3ont2uqsU0t5AwaBvqQpS4upjKGqgpuiuMFvV4yScQS2X7l0V0xA==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 2209363,
  "projectUrl": "http://www.jqwidgets.com/",
  "published": "2015-10-13T05:19:08.977Z",
  "releaseNotes": "jQWidgets v3.9.0 Release, Oct-09-2015\n\nWhat's New:\n\n- jqxScheduler, jqxDockingLayout, jqxLayout, jqxTextArea, jqxTagCloud, jqxResponsivePanel, jqxPopover, jqxLoader widgets.\n- jqxGrid best fit columns resizing. End-users now can auto-resize columns by double clicking on the column header's right border.\n- jqxChart Pie and Donut slices expansion on selection.\n- jqxCalendar Restricted dates feature.\n- jqxRibbon Tabs reorder functionality.\nWhat's Improved:\n\n- jqxChart's labels positioning in Pie and Donut series.\n- jqxChart's default value axis number formatting.\n- jqxFormattedInput Select All with Ctrl+A.\n- jqxFormattedInput radix can now be changed through the dropdown even when the input is empty.\nWhat's Fixed:\n\n- Fixed an issue in jqxTreeGrid regarding the hierarchical checkboxes when Sorting is applied.\n- Fixed an issue in jqxGrid regarding the ever present row rendering when a column is pinned.\n- Fixed an issue in jqxGrid regarding the multiple cells advanced selection when columns width is in percentages.\n- Fixed an issue in jqxGrid regarding the excel filter for filtering date column.\n- Fixed an issue in jqxGrid regarding the initial column filter functionality when the filter is applied to numeric column and filter row is turned on.\n- Fixed an issue in jqxGrid regarding the save/load state of Date filter.\n- Fixed an issue in jqxGrid regarding the DateTimeInput editor's localization.\n- Fixed an issue in jqxDateTimeInput regarding the Tab key navigation in Firefox.\n- Fixed an issue in jqxDateTimeInput regarding date selection when closing the popup calendar by clicking on the calendar button.\n- Fixed an issue in jqxDateTimeInput regarding the rendering of the time popup after navigation through the calendar popup.\n- Fixed an issue in jqxChart value axis range display when all values are 0s.\n- Fixed an issue in jqxChart range selector layout issues.\n- Fixed an issue in jqxChart range selector mouseup outside of area event handling bug.\n- Fixed an issue in jqxChart range selector refresh issue when used with 'basic' type xAxis.\n- Fixed an issue in jqxChart about export to image with rangeselector.\n- Fixed an issue in jqxScrollBar about small scroll ranges layout.\n- Fixed an issue in jqxFileUpload regarding an \"Access is denied\" error in Internet Explorer 10.\n- Fixed an issue in jqxFormattedInput regarding the entering of numbers through the numeric keypad.\n- Fixed an issue in jqxComplexInput regarding the entering of numbers through the numeric keypad.\n- Fixed an issue in jqxRibbon when header items contain images or other non-text HTML elements.",
  "requireLicenseAcceptance": false,
  "title": "jQWidgets",
  "verbatimVersion": "3.9.0",
  "version": "3.9.0",
  "dependencyGroups": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2015.10.13.05.19.32/jqwidgets_framework.3.9.0.json#dependencygroup",
      "@type": "PackageDependencyGroup",
      "dependencies": [
        {
          "@id": "https://api.nuget.org/v3/catalog0/data/2015.10.13.05.19.32/jqwidgets_framework.3.9.0.json#dependencygroup/jquery",
          "@type": "PackageDependency",
          "id": "jQuery",
          "range": "[1.7.0, )"
        }
      ]
    }
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    }
  }
}