{
  "@id": "https://api.nuget.org/v3/catalog0/data/2015.06.04.18.31.25/aspose.pdf.10.5.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "Aspose",
  "catalog:commitId": "f235ce9e-89b6-4bfc-ac95-fb497a4f8288",
  "catalog:commitTimeStamp": "2015-06-04T18:31:25.3464745Z",
  "copyright": "©Aspose 2002-2014. All Rights Reserved.",
  "created": "2015-06-04T18:30:38.41Z",
  "description": "Aspose.Pdf for .NET is a PDF document creation and manipulation component that enables your .NET applications to read, write and manipulate existing PDF documents without using Adobe Acrobat. It also allows you to create forms and manage form fields embedded in a PDF document. This component is written in managed C# and it allows developers to add PDF creation and manipulation functionality to their Microsoft .NET applications (WinForms, ASP.NET and .NET Compact Framework).\n        Aspose.Pdf for .NET is affordable and offers an incredible wealth of features including PDF compression options; table creation and manipulation; support for graph objects; extensive hyperlink functionality; extended security controls; custom font handling; integration with data sources; add or remove bookmarks; create table of contents; add, update, delete attachments and annotations; import or export PDF form data; add, replace or remove text and images; split, concatenate, extract or inset pages; transform pages to image; print PDF documents and much more.",
  "iconUrl": "http://www.aspose.com/blogs/wp-content/uploads/2013/06/aspose-Pdf-for-net_100.png",
  "id": "Aspose.Pdf",
  "isPrerelease": false,
  "lastEdited": "0001-01-01T00:00:00Z",
  "licenseUrl": "http://www.aspose.com/corporate/purchase/end-user-license-agreement.aspx",
  "packageHash": "UMTbtw5BKWgoqBAK0Ad2f35FkgIBvkt0xTdHL3pW0mRvTYm1DfSno2IKJD6UWFdiUKSF/sIlGhTjxlNO0JLL4w==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 29444220,
  "projectUrl": "http://www.aspose.com/categories/.net-components/aspose.pdf-for-.net/default.aspx",
  "published": "2015-06-04T18:30:38.41Z",
  "releaseNotes": "This release introduces the features, enhancements and bug fixes as detailed below:\n\nEnhancements\nPDFNEWNET-37422 HTML to PDF: support of absolute value of CSS position property\nPDFNEWNET-37501 Support of DefaultFontName property in new generator\nPDFNEWNET-38166 Adding Radio Button without page number parameter\n\nExceptions\nPDFNEWNET-38634 Exception while loading PDF document\nPDFNEWNET-38682 Exception when trying to enable Fast web over PDF file\n\nBugs\nPDFNEWNET-37948 PDF to HTML conversion takes too much time\nPDFNEWNET-37395 PDF to PDFA: text is missing in output file\nPDFNEWNET-31395 Some of the Form Fields disappear once XML data is imported\nPDFNEWNET-33504 Convert HTML to PDF layout issues\nPDFNEWNET-33829 Contents of table cell are missing when using IsHtmlTagSupported\nPDFNEWNET-33886 Convert FO to PDF - System hangs\nPDFNEWNET-34940 HTML to PDF: Formatting issues in resultant file\nPDFNEWNET-35278 While converting HTM to PDF, an empty PDF file is being generated.\nPDFNEWNET-35739 HTML to PDF: table formatting lost\nPDFNEWNET-37066 HTML to PDF: Form fields are being rendered incorrectly.\nPDFNEWNET-38085 PDF to DOC: Table/fields renders incorreclty\nPDFNEWNET-38127 PDF to PDF/A - Resultant file is not compliant\nPDFNEWNET-38291 PDF to PDFA loses fields data\nPDFNEWNET-38295 PDF to HTML: Arabic words are being broken(split)\nPDFNEWNET-38563 PDF to HTML conversion loses spaces between text in output HTML\nPDFNEWNET-38600 PDF to HTML: Text is being positioned incorrect in header part of HTML\nPDFNEWNET-38612 PDF to APS conversion of a bit invalid PDF throws exception.\nPDFNEWNET-38627 PDF to PDF/A - Data is lost in resultant file\nPDFNEWNET-38664 PDF to HTML - Black Rectangles instead of images",
  "requireLicenseAcceptance": true,
  "summary": "Aspose.Pdf for .NET is an amazing component which provides the feature to create and manipulate PDF documents.",
  "title": "Aspose.Pdf for .NET",
  "version": "10.5.0",
  "tags": [
    "Aspose.Pdf",
    "PDF",
    "XFA",
    "XPS",
    "TIFF",
    "PCL",
    "SVG",
    "HTML",
    "XML",
    "XSL-FO",
    "FDF",
    "XFDF",
    "PDF/A",
    "form",
    "Portfolio",
    "EPUB",
    "PSD",
    "to",
    "XLS",
    "DOC"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    }
  }
}