{
  "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.22.23.22.25/aspose.pdf.9.4.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "Aspose",
  "catalog:commitId": "656f8ff1-0853-4939-875b-86524ff0e1bd",
  "catalog:commitTimeStamp": "2018-10-22T23:22:25.6230459Z",
  "copyright": "©Aspose 2002-2013. All Rights Reserved.",
  "created": "2014-07-08T17:33:19.387Z",
  "description": "Aspose.Pdf for .NET is a PDF document creation and manipulation component that enables your .NET applications to read, write and manipulate existing PDF documents without using Adobe Acrobat. It also allows you to create forms and manage form fields embedded in a PDF document. This component is written in managed C# and it allows developers to add PDF creation and manipulation functionality to their Microsoft .NET applications (WinForms, ASP.NET and .NET Compact Framework).\n        Aspose.Pdf for .NET is affordable and offers an incredible wealth of features including PDF compression options; table creation and manipulation; support for graph objects; extensive hyperlink functionality; extended security controls; custom font handling; integration with data sources; add or remove bookmarks; create table of contents; add, update, delete attachments and annotations; import or export PDF form data; add, replace or remove text and images; split, concatenate, extract or inset pages; transform pages to image; print PDF documents and much more.",
  "iconUrl": "http://www.aspose.com/blogs/wp-content/uploads/2013/06/aspose-Pdf-for-net_100.png",
  "id": "Aspose.Pdf",
  "isPrerelease": false,
  "lastEdited": "2018-10-22T23:21:54.747Z",
  "licenseUrl": "http://www.aspose.com/corporate/purchase/end-user-license-agreement.aspx",
  "listed": true,
  "packageHash": "qZaI7sd5mBkAKIQDbUoFVeThpe7acr9cFvWq9ItCliRTn2i1MQSrPDgcUohaQsRgDPXTSShUi9rfsaIFQck/rw==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 30495407,
  "projectUrl": "http://www.aspose.com/categories/.net-components/aspose.pdf-for-.net/default.aspx",
  "published": "2014-07-08T17:33:19.387Z",
  "releaseNotes": "This release introduces the features, enhancements and bug fixes as detailed below:\n\nNew Features\n\nPDFNEWNET-36882 PDF to HTML - Extract fonts independently\nPDFNEWNET-36883 PDF to HTML - Extract fonts only once for each page\n\nEnhancements\n\nPDFNEWNET-34396 Problem while using Aspose.Pdf for .NET via COM Interop in C++\nPDFNEWNET-35870 SVG to PDF conversion: Online image resource support.\nPDFNEWNET-36009 PDF to HTML conversion: To specify image format for image export\nPDFNEWNET-36228 Show note on clicking or onmouseover of Image in PDF\nPDFNEWNET-36333 PDF to DOC - Contents appear as image in resultant file\nPDFNEWNET-36912 ColumnAdjustment property is missing in Aspose.Pdf.Table class\nPDFNEWNET-36916 Setting column width as per column contents\nPDFNEWNET-37003 PDF to Excel - Export all pages to single sheet\nPDFNEWNET-37049 Add Default value to PageLayout enumeration\nPDFNEWNET-37071 Ends of InkAnnotation cannot be rounded\n\nExceptions\n\nPDFNEWNET-33545 Unable to convert XPS document to PDF\nPDFNEWNET-33658 Unable to load XPS document\nPDFNEWNET-33877 XPS to PDF conversion - Exception\nPDFNEWNET-33884 Convert XPS to PDF - Exception found\nPDFNEWNET-34144 StackOverflowException after calling Optimize() and Save() on a PDF\nPDFNEWNET-35046 XPS to PDF - Exception during conversion process\nPDFNEWNET-36294 HTMl to PDF - ArgumentNullException during conversion\nPDFNEWNET-36648 DivideByZero Execption when printing the document\nPDFNEWNET-36743 PDF to XPS throwing EndofStreamException\nPDFNEWNET-36982 Concatenation(New Generator) throws NullReferenceException\nPDFNEWNET-37019 Exception when adding TOC to PDF where it spans multiple pages\nPDFNEWNET-37069 Saving document results in NullReferenceException\nPDFNEWNET-37077 IndexOutOfRangeException when merging a DataTable into PDF form\nPDFNEWNET-37101 Exception while trying to set inherit zoom for Bookmark\nPDFNEWNET-37117 NullReferenceException when setting font size and font style for table row\n\nBugs\n\nPDFNEWNET-30613 HTML tags with CSS are not rendered properly\nPDFNEWNET-31019 Formatting issue during PDF to DOC conversion\nPDFNEWNET-31666 PDF to DOC conversion is not correct\nPDFNEWNET-32579 when PDF is converted to XPS, the underline formatting is missed\nPDFNEWNET-32642 PDF2XPS Conversion Issue\nPDFNEWNET-33194 PDF to DOC conversion problem\nPDFNEWNET-33333 HTML to PDF conversion problem\nPDFNEWNET-33565 PDF to XPS coversion issue\nPDFNEWNET-33577 HTML to PDF conversion problem\nPDFNEWNET-33757 Convert PDF to Doc: spaces inserted randomly\nPDFNEWNET-33838 PDF to XPS conversion issue\nPDFNEWNET-34128 XPS to PDF Line Path Curve Error\nPDFNEWNET-34415 Create Rectangle directly on PDF canvas (not as annotation) with PDF operators.\nPDFNEWNET-34564 Images are not shown (due to transperancy) in XPS to PDF conversion\nPDFNEWNET-34574 PDF to HTML Conversion Alignment issue in the generated HTML file\nPDFNEWNET-35009 PDF to BMP:- Resultant BMP is not correct\nPDFNEWNET-35010 PDF to DOC - Formatting issues in resultant files\nPDFNEWNET-35025 Formatting issue upon converting Pdf document to Doc\nPDFNEWNET-35239 Changing the Text ForegroundColor, removes page contents.\nPDFNEWNET-35614 Background image behind SVG object is not appearing in PDF\nPDFNEWNET-35730 SVG to PDF - contents are not properly appearing in resultant PDF\nPDFNEWNET-35738 SVG to PDF - Contents are overlapping in resultant file\nPDFNEWNET-35840 PDF to XPS: Conversion is changing invoice total\nPDFNEWNET-35954 Special Character Getting Truncated while HTML to PDF Conversion\nPDFNEWNET-36032 Text formatting is not working when using IsHtmlTagSupported property\nPDFNEWNET-36098 TextFragment showing wrong rectangle values\nPDFNEWNET-36167 HTML to PDF - Line Height is not working properly\nPDFNEWNET-36291 HTML to PDF - Table contents formatting issues in resultant file\nPDFNEWNET-36292 PageInfo.IsLandscape is not working\nPDFNEWNET-36355 PDF to JPEG - Color problem in resultant image\nPDFNEWNET-36379 Not able to convert a PDF to PDF/A\nPDFNEWNET-36406 Color are missing / incorrect when converting PDF to JPEG\nPDFNEWNET-36497 HTML to PDF - External resources images/css/fonts are not being honored\nPDFNEWNET-36544 PDF to PNG - Incorrect colors in resultant image\nPDFNEWNET-36548 Regular expression pattern text search is not working\nPDFNEWNET-36563 PDF to XPS - Missing background in XPS\nPDFNEWNET-36577 PDF to TIFF - Conversion is not correct\nPDFNEWNET-36698 Center Alignment issue\nPDFNEWNET-36719 Aps to PDF conversion problem: parts of linear charts are absent\nPDFNEWNET-36720 Aps to PDF conversion problem : picture created from collection of Path-objects shifted or scaled in incorrect way\nPDFNEWNET-36733 TextFragmentAbsorber returns incorrect text occurrence\nPDFNEWNET-36815 Accented Characters are not proeprly appearing in PDF File\nPDFNEWNET-36844 PDF to XLS - Extra column appearing in resultant file\nPDFNEWNET-36864 HTML to PDF - Formatting issues in resultant PDF\nPDFNEWNET-36879 Text extracted using TextAbsorber is messed\nPDFNEWNET-36898 Adding image in Header/Footer of PDF document\nPDFNEWNET-36906 PDF to HTML conversion processing time\nPDFNEWNET-36909 ColumnAdjustmentType.AutoFitToContent property is not working properly\nPDFNEWNET-36922 Adding table in header and page simultaneously loses page foramatting\nPDFNEWNET-36945 HTML to PDF: Columns alignment issue\nPDFNEWNET-36948 PDF to XLS: A blank XLS file is being rendered\nPDFNEWNET-36958 Encrypting Document using AES256 takes unusually long\nPDFNEWNET-37020 CGM to PDF - Unable to set page dimensions during conversion\nPDFNEWNET-37046 Unable to find Helvetica Neue LT font when using FreeTextAnnotation\nPDFNEWNET-37047 FreeTextAnnotation: Text is being wrapped incorrectly\nPDFNEWNET-37053 File is not readable after converting to PDF format 1.3.\nPDFNEWNET-37061 Aps to PDF conversion problem : text not clipped as it should\nPDFNEWNET-37064 Unable to set inherit zoom for Link created by aspose\nPDFNEWNET-37091 PDF to PNG: Width parameter is not being honored\nPDFNEWNET-37092 PDF to JPEG - The square annotations are not filled in resultant Image\nPDFNEWNET-37093 FreeTextAnnotation: setting background color does not work, it remains transparent\nPDFNEWNET-37111 FreeTextAnnotation.Color doues not work correctly for transparent color.",
  "requireLicenseAcceptance": true,
  "summary": "Aspose.Pdf for .NET is an amazing component which provides the feature to create and manipulate PDF documents.",
  "title": "Aspose.Pdf for .NET",
  "verbatimVersion": "9.4.0",
  "version": "9.4.0",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.22.23.22.25/aspose.pdf.9.4.0.json#Aspose.Pdf.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 3237,
      "fullName": "Aspose.Pdf.nuspec",
      "length": 8343,
      "name": "Aspose.Pdf.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.22.23.22.25/aspose.pdf.9.4.0.json#lib/net2.0/Aspose.Pdf.dll",
      "@type": "PackageEntry",
      "compressedLength": 15245127,
      "fullName": "lib/net2.0/Aspose.Pdf.dll",
      "length": 22347208,
      "name": "Aspose.Pdf.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.22.23.22.25/aspose.pdf.9.4.0.json#lib/net40-client/Aspose.Pdf.dll",
      "@type": "PackageEntry",
      "compressedLength": 15233922,
      "fullName": "lib/net40-client/Aspose.Pdf.dll",
      "length": 22334920,
      "name": "Aspose.Pdf.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.22.23.22.25/aspose.pdf.9.4.0.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9463,
      "fullName": ".signature.p7s",
      "length": 9463,
      "name": ".signature.p7s"
    }
  ],
  "tags": [
    "Aspose.Pdf",
    "PDF",
    "XFA",
    "XPS",
    "TIFF",
    "PCL",
    "SVG",
    "HTML",
    "XML",
    "XSL-FO",
    "FDF",
    "XFDF",
    "PDF/A",
    "form",
    "Portfolio",
    "EPUB",
    "PSD",
    "to",
    "XLS",
    "DOC"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    }
  }
}