{
  "@id": "https://api.nuget.org/v3/catalog0/data/2018.12.06.20.51.47/gepsio.2.1.0.6.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "Jeff Ferguson",
  "catalog:commitId": "66150e81-4356-4032-b1a6-e1cc66dd765a",
  "catalog:commitTimeStamp": "2018-12-06T20:51:47.9724912Z",
  "created": "2012-09-10T02:43:54.06Z",
  "description": "Gepsio is a .NET-based document object model for XBRL documents. Load your XBRL document with the XbrlDocument class and work with your XBRL document exposed as a set of .NET classes with a variety of properties and methods. Loaded XBRL documents are automatically validated against the information against the XBRL specification, and exceptions are thrown when invalid XBRL documents are loaded. The Gepsio code base is unit tested using the XBRL-CONF-CR3-2007-03-05 unit tests designed by the XBRL organization.",
  "id": "Gepsio",
  "isPrerelease": false,
  "lastEdited": "2018-12-06T20:51:37.47Z",
  "licenseUrl": "http://gepsio.codeplex.com/license",
  "listed": true,
  "packageHash": "qcpMRj4HP4hUliLw9sVzKWekMWTit55vlG81KDDJaMrQIQOX/Rem3rU9qynPsbjjH4fdz6yrY14w5zeE8hlhYg==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 53823,
  "projectUrl": "http://gepsio.codeplex.com",
  "published": "2012-09-10T02:43:54.53Z",
  "releaseNotes": "What's New\n\nRole Types\nRole types found in schemas are now available from within Gepsio. The XbrlSchema class now contains a property called RoleTypes. This property is a collection of objects of a new class called RoleType. Objects of the RoleType class expose any role types defined in the schema. \nHTTP-Based Schema Linkbase References\nGepsio now supports HTTP-based schema linkbase references. Previous releases assumed that all schema linkbase references were based on local filesystem paths. \nCalculationLink.Linkbase Property\nThe CalculationLink class contains a new property called Linkbase, which references the LinkbaseDocument object containing the calculation link. \nLinkbaseDocument.Schema Property\nThe LinkbaseDocument class contains a new property called Schema, which references the XbrlSchema class referencing the linkbase document. \nSummationConcept.Link Property\nThe SummationConcept class contains a new property called Link, which references the CalculationLink object containing the summation concept. \nResolved Issues\n\nWork Item 9401: Valid XBRL Doc Failing To Be Loaded\nThe latest Amazon quarterly XBRL filing passes other validation tests I used, however attempting to Load the doc in Gepsio throws an error. Since it is an Object Ref Not Set to Instance error, it is not entirely clear what caused it although the final line in the stack trace is JeffFerguson.Gepsio.QualifiedName.Equals(Object obj). I attach the filing for your ref. Any ideas on how to get around this?\n\nA bug in the QualifiedName equality testing code failed to detect various null conditions. This has been fixed.\n\nWork Item 7843: The given path's format is not supported\nFixed bug that allowed paths of the form \"file:///C:/blah/blah/http://blah/blah.org\" to be created in GetFullLinkbasePath when filings that reference remote documents are stored locally. This caused a NotSupportedException to be thrown. Supplied as a patch from Codeplex user matthewschrager.\n\nWork Item 9465: WebException Objects Thrown During XbrlSchema Creation Are Not Wrapped in XbrlException Objects\nThe XbrlSchema constructor uses an XmlTextReader to read an XBRL schema. If the URI for the XBRL schema to be read is an HTTP-based URI, then the XmlTextReader will use the .NET Web stack to read the schema using HTTP. If something fails during that process, the .NET Web stack will throw a WebException. Thrown WebException objects were not wrapped in an XbrlException object and were consequently thrown back to the client as a WebException object.\n\nTo be clear that the issue is an XBRL issue caused by an HTTP failure, the XBRL schema creation code now creates an XbrlException object, stores the caught WebException as an inner exception to the XbrlException, and throws the XbrlException object back up to the client.\n\nWork Item 9571: No Support for Taxonomy Role Types\nRole types found in schemas are now available from within the object model. The XbrlSchema class now contains a property called RoleTypes. This property is a collection of objects of a new class called RoleType. Objects of the RoleType class expose any role types defined in the schema.",
  "requireLicenseAcceptance": false,
  "title": "Gepsio",
  "verbatimVersion": "2.1.0.6",
  "version": "2.1.0.6",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.12.06.20.51.47/gepsio.2.1.0.6.json#Gepsio.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 2086,
      "fullName": "Gepsio.nuspec",
      "length": 8578,
      "name": "Gepsio.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.12.06.20.51.47/gepsio.2.1.0.6.json#JeffFerguson.Gepsio.dll",
      "@type": "PackageEntry",
      "compressedLength": 39359,
      "fullName": "JeffFerguson.Gepsio.dll",
      "length": 105472,
      "name": "JeffFerguson.Gepsio.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.12.06.20.51.47/gepsio.2.1.0.6.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9472,
      "fullName": ".signature.p7s",
      "length": 9472,
      "name": ".signature.p7s"
    }
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    }
  }
}