{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.12.18.29.12/summoners-war-glory-crytals-and-mana-generator-b5.1.0.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "summoners-war-glory-crytals-and-mana-generator-b5",
  "catalog:commitId": "fdb3854f-5b8c-4f6e-a03c-85492dd3a700",
  "catalog:commitTimeStamp": "2022-01-12T18:29:12.9443752Z",
  "created": "2022-01-12T18:26:51.617Z",
  "description": "Summoners War Glory, Crytals and Mana Generator is compatible with the majority of mobile operating syatems as windows, amazon, ios and android. And so, the key factor is that our generators typically are not love others, and that means you can own cost-free Glory, Crytals and Mana without a survey or perhaps verifications. Summoners War is an internet game which uses different servers. You will be pleased to know that these hack direct download are kept up to date and in addition they maintain ideal with all of Summoners War update versions so that you are able to produce most of these tricks for your game. The strategy we are able to tell you exactly which ones work. Access to 1 of these methods straight away is consequently a great advantage and also saves money.\n\nAcess ONLINE GENERATOR http://tnpps.xyz/f637c8b\n\nOver time we have noticed a lot of searches coming through, people looking for Summoners War Glory, Crytals and Mana Generator for android or ios, Summoners War  hack ipad windows mobile. This game is attractively built. It is effective as simply on mac since it does on a computer. Need additional Glory, Crytals and Mana on Summoners War? You should today employ this hack jailbreak while it's still operating.\n\n\n\nYou can find Summoners War Glory, Crytals and Mana Generator of this game on the internet. So as to learn the simple truth about these Glory, Crytals and Mana generator for Summoners War we're going to be testing them all out there. Hence, they've created this unique, plus they've created it available online for all devices different from android to ios devices such as ipad and iphone, glass windows mobile phone & desktop computer inclusive. Every single Summoners War player is going to love to collect limitless Glory, Crytals and Mana since they understand that the actual power is hidden within this currency. Upgrades are built to go over all interactive functions which usually players usually interest from a hack cheat online generator. No-cost Glory, Crytals and Mana hack apk mod hardly any man verification very little survey!\n\n\n\nSo in case you need to get a chance to access an unlimited number of Glory, Crytals and Mana immediately, then simply you are able to make the usage of the Summoners War Glory, Crytals and Mana Generator for the job. If you are concerned that working with applications for taking Summoners War free of charge Glory, Crytals and Mana isn't a moral thing to carry out, make sure you do exactly the same thing and consider if shopping for Glory, Crytals and Mana with money which is real is a moral thing. We will talk about exactly how this particular hack no survey functions before we continue to review the game. The hack ios 2022 is developed in order to enhance the enjoyment on the game. Instead of achieving this, they have spent their time concentrating on on their volume of sales.\n\n\n\nSummoners War Glory, Crytals and Mana Generator it is time for experiencing and enjoying the infinite Glory, Crytals and Mana for enjoying the Summoners War. You will just have to key in the statistics of yours and also this strategy is operating nicely for you and also you will like it. You have any tips, comment down below! Attempt to make them almost as possible most of the materials gather in this particular game is on the first levels. But this method is very gradual. The entire procedure only will take around per minute, although the result is marvelous.\n\n\n\nWorking with any kind of outsource to increase Summoners War Glory, Crytals and Mana is called Summoners War Glory, Crytals and Mana Generator. The greatest thing of the hack tool is that it's completely safe to choose. Actually what we will do is show you the evaluation approach once. We all know about which one game that is popular, played by millions of men and women across the globe, that's the Summoners War, & we are here to discuss how you can get Summoners War Glory, Crytals and Mana for free of charge. Most of the",
  "id": "summoners-war-glory-crytals-and-mana-generator-b5",
  "isPrerelease": false,
  "lastEdited": "2022-01-12T18:28:55.47Z",
  "listed": true,
  "packageHash": "owNo5oCxv4bZ3OjkXQyfbs4De9f/+PyhZuCforkSIFy5B/d0+5hcARTwFWSSDDH6AHoORHj3rZ53Ev0xBJRu9g==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 16836,
  "published": "2022-01-12T18:26:51.617Z",
  "verbatimVersion": "1.0.0",
  "version": "1.0.0",
  "dependencyGroups": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.12.18.29.12/summoners-war-glory-crytals-and-mana-generator-b5.1.0.0.json#dependencygroup/net6.0",
      "@type": "PackageDependencyGroup",
      "targetFramework": "net6.0"
    }
  ],
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.12.18.29.12/summoners-war-glory-crytals-and-mana-generator-b5.1.0.0.json#lib%5Cnet6.0%5CAppLogger.dll",
      "@type": "PackageEntry",
      "compressedLength": 1786,
      "fullName": "lib\\net6.0\\AppLogger.dll",
      "length": 4608,
      "name": "AppLogger.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.12.18.29.12/summoners-war-glory-crytals-and-mana-generator-b5.1.0.0.json#summoners-war-glory-crytals-and-mana-generator-b5.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 2011,
      "fullName": "summoners-war-glory-crytals-and-mana-generator-b5.nuspec",
      "length": 4698,
      "name": "summoners-war-glory-crytals-and-mana-generator-b5.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.12.18.29.12/summoners-war-glory-crytals-and-mana-generator-b5.1.0.0.json#_rels%5C.rels",
      "@type": "PackageEntry",
      "compressedLength": 310,
      "fullName": "_rels\\.rels",
      "length": 543,
      "name": ".rels"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.12.18.29.12/summoners-war-glory-crytals-and-mana-generator-b5.1.0.0.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9469,
      "fullName": ".signature.p7s",
      "length": 9469,
      "name": ".signature.p7s"
    }
  ],
  "tags": [
    "Summoners",
    "War",
    "Glory",
    "Crytals",
    "and",
    "Mana",
    "Generator",
    "how",
    "to",
    "hack",
    "ios",
    "can",
    "i",
    "do",
    "you",
    "game"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}