{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.29.00.00.58/_dan-the-man-hack-working-2022-version-syk.3.5.38.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "SharpCrafters s.r.o.",
  "catalog:commitId": "9c3cdedd-ff9f-4b5b-9213-d9fef2286e0c",
  "catalog:commitTimeStamp": "2022-01-29T00:00:58.5650118Z",
  "created": "2022-01-26T08:34:44.39Z",
  "description": "# _Dan The Man Hack Working 2022 Version syk\n\n\nCLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; [http://bltadwin.ru/hack.php](http://bltadwin.ru/hack.php)\n\n\nDan The Man Mod Apk Unlimited Money – is a super cute game with arcade-style addictive gameplay from Halfbrick Studios. The creator of the popular Ninja Fruit. The gameplay has a lot of fun gameplay. Dan the Man hack. Enemies are. free download Dan The Man Mod Apk Hack(Unlimited Money) for android. Featuring a Mario like hero, weapons that go boom and action that.\n\n## [CLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; http://bltadwin.ru/hack.php](http://bltadwin.ru/hack.php)\n\nDan the man hackIf you like the work then please support my channel by subscribing,and I will make more content like this. Your one sub means a lot to me💓.?. Dan the Man (MOD Unlimited Money) is developed according to the classic stage-by-screen combat gameplay. You will be the control of the main character of the fighting game, increasing your strength to be able to overcome different rounds with many challenges. A platform game with completely accessible gameplay and various modes that can easily. Dan The Man Game Hack Download In Original Version Dan The Man Game Hack Download In Original Game Punch, kick, and blast your way through 12 action-packed levels in this nail-biting platformer based on the hilarious web series by Studio JOHO.\n\ndan the man hacks, dan the man hack premium apk, dan the man hack ios, dan the man hack mod apk, dan the man hacked apk, dan the man hack barry, dan the man hack version free download, dan the man hack apk 2020, dan the man hack apk todo desbloqueado, dan the man hackeado, dan the man hack bất tử, dan the man barry hack apk, tải dan the man hack phiên bản mới nhất, tải bản hack dan the man, bản hack game dan the man, dan the man bản hack, dan the man coin hack, cách hack dan the man, cách hack game dan the man, cách hack dan the man ios, dan the man mod apk unlimited coins, dan the man hack for ios, tai game dan the man hack full, dan the man hack full, dan the man hack full tiền, game dan the man hack, tải game dan the man hack, hack game dan the man action platformer, hack game dan the man ios, dan the man hack happymod, how to hack dan the man with lucky patcher, how to hack dan the man, dan the man hack apk hile, dan the man hack para chile, dan the man hack iosgod, dan the man hack iphone, dan the man hack dinheiro infinito, hack version of dan the man, dan the man hack pc, dan the man action platformer hack apk, dan the man hack apk 2021 premium, dan the man hack apk 2020 premium, dan the man roblox, dan the man hack son sürüm, dan the man hack apk 2020 todo desbloqueado, tải dan the man hack, tải dan the man hack appvn, dan the man mod apk ios, dan the man mod ios, dan the man hack yeuapk, dan the man hack 1.8.05, dan the man hack 1.10.12, dan the man hack android 1, dan the man 1.2.6 apk mod hack, dan the man hack apk 1.9.32, dan the man hack apk 1.9.10, hack dan the man 1.9.47, dan the man hack 2021, dan the man hack 2020, dan the man 2 hack, dan the man hack 2019, dan the man codes",
  "id": "_Dan-The-Man-Hack-Working-2022-Version-syk",
  "isPrerelease": false,
  "language": "en-US",
  "lastEdited": "2022-01-28T23:45:43.383Z",
  "listed": false,
  "packageHash": "nLsxjZyNBubCANlQPS01FCc8Tk8+eFhxB1fCVKONl8C0NwERA1JGC0FCscFo+YFUNtSwDHbvrHHF99hM/Zisag==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 11454,
  "published": "1900-01-01T00:00:00Z",
  "requireLicenseAcceptance": false,
  "title": "_Dan-The-Man-Hack-Working-2022-Version-syk",
  "verbatimVersion": "3.5.38",
  "version": "3.5.38",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.29.00.00.58/_dan-the-man-hack-working-2022-version-syk.3.5.38.json#jiujhztyii.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1332,
      "fullName": "jiujhztyii.nuspec",
      "length": 3604,
      "name": "jiujhztyii.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.29.00.00.58/_dan-the-man-hack-working-2022-version-syk.3.5.38.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9462,
      "fullName": ".signature.p7s",
      "length": 9462,
      "name": ".signature.p7s"
    }
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}