{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.29.00.00.58/_diggys-adventure-hack-working-2022-version-sca.6.6.6.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "SharpCrafters s.r.o.",
  "catalog:commitId": "9c3cdedd-ff9f-4b5b-9213-d9fef2286e0c",
  "catalog:commitTimeStamp": "2022-01-29T00:00:58.5650118Z",
  "created": "2022-01-26T08:35:37.743Z",
  "description": "# _Diggys Adventure Hack Working 2022 Version sca\n\n\nCLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; [http://bltadwin.ru/hack.php](http://bltadwin.ru/hack.php)\n\n\n[c*ju2] Infinite energy for diggy's adventure hack - kimbermariakhal/diggys-adventure Wiki The Diggy's Adventure consist a little hard gameplay. Dec 1, - Here we are giving diggy's adventure cheats for unlimited energy, gems and download you will get hacks for free gold, diamonds and special. Languages – Diggy's Adventure game is available in 17 different languages so language would not be a barrier. Diggy's Adventure hack mod. Also, to keep in mind.\n\n## [CLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; http://bltadwin.ru/hack.php](http://bltadwin.ru/hack.php)\n\n\ndiggy's adventure hack, diggy's adventure hack ios, diggy's adventure hack mod apk, diggy's adventure hack no survey, diggy's adventure cheats, diggy's adventure cheats unlimited energy, diggy's adventure cheats for android, diggy's adventure cheats path of the 5 elements, diggy's adventure hack 2020, diggy's adventure hack apk, diggy's adventure hack android energia infinita, diggy's adventure hack deutsch, diggy's adventure hack 2021, diggy's adventure cheats android, diggy's adventure cheats abu simbel, diggy's adventure cheats abandoned battlefield, diggy's adventure cheats all star hotel, diggy's adventure cheats ancient sewers, diggy's adventure cheats abandoned gold mine, diggy's adventure cheats busy airport, diggy's adventure cheats fjordheim bank, diggy's adventure hack com, diggy's adventure cheat codes, diggy's adventure cheat codes ios, diggy's adventure cheats sky chariot stables, diggy's adventure cheats roskilde cathedral, diggy's adventure cheats diggerius camp, diggy's adventure cheats unlimited energy hack, hack diggy's adventure cheat engine, diggy's adventure hack download, diggy's adventure cheats deutsch, diggy's adventure cheats deutsch android, diggy's adventure energy hack deutsch, diggy's adventure tips and tricks, diggy's adventure cheats to get more energy, diggy's adventure free energy hack, diggy's adventure energy hack android, diggy's adventure cheats energy, diggy's adventure iphone energy hack, diggy's adventure cheat engine, diggy's adventure energy hack pc, diggy's adventure facebook hack, diggy's adventure cheats for ipad, diggy's adventure cheats old funeral home, diggy's adventure gems hack, diggy's adventure cheats ghost town, diggy's adventure game cheats, hack game diggy's adventure, gehe zu diggy's adventure hack, diggy's adventure cheats hall of singing swords, diggy's adventure cheats hidden pyramid, diggy's adventure cheats shanghai harbour, diggy's adventure cheats saga hall, how to hack diggy's adventure, diggy's adventure cheats ios, diggy's adventure ipad cheats, diggy's adventure energy cheat iphone, hack diggy's adventure energía infinita android, diggy's adventure secrets, diggy's adventure cheats kronborg tombs, diggy's adventure cheats level 1, diggy's adventure mobile cheats, diggy's adventure cheats terracotta mausoleum, diggy's adventure cheats new photo studio, diggy's adventure cheats village of designers, diggy's adventure cheats village of backwater, on diggy's adventure cheats, diggy's adventure pc hack, diggy's adventures cheats dinosaur park, hack para diggy's adventure, diggy's adventure cheats riddle vault of isis, diggy's adventure cheats riddle vault of horus, diggy's adventure cheats riddle vault of anubis, diggy's adventures cheats ruler's treasury, diggy's adventure cheat sheet, diggy's adventure cheats sewers, how do you get more energy in diggy's adventure, diggy's adventure energy cheats, how to get unlimited life in diggy's adventure, diggy's adventure junglanji, diggy's adventures cheats, diggy's adventure hack android",
  "id": "_Diggys-Adventure-Hack-Working-2022-Version-sca",
  "isPrerelease": false,
  "language": "en-US",
  "lastEdited": "2022-01-28T23:45:43.523Z",
  "listed": false,
  "packageHash": "WgSY5vxLcL+rgJGi6gr/0uTWUSDh1+4NuJzzjCQgR69wWA6cbNtgfW1WQsCh59Kw7j5IBN7rJxbSn66DrfrsxA==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 11326,
  "published": "1900-01-01T00:00:00Z",
  "requireLicenseAcceptance": false,
  "title": "_Diggys-Adventure-Hack-Working-2022-Version-sca",
  "verbatimVersion": "6.6.6",
  "version": "6.6.6",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.29.00.00.58/_diggys-adventure-hack-working-2022-version-sca.6.6.6.json#sqdyvhovnq.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1240,
      "fullName": "sqdyvhovnq.nuspec",
      "length": 4253,
      "name": "sqdyvhovnq.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.29.00.00.58/_diggys-adventure-hack-working-2022-version-sca.6.6.6.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9462,
      "fullName": ".signature.p7s",
      "length": 9462,
      "name": ".signature.p7s"
    }
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}