{
  "@id": "https://api.nuget.org/v3/catalog0/data/2024.11.07.21.10.51/keyoti.rapidspellweb.asp.net.core.6.4.241108.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "Keyoti Inc.",
  "catalog:commitId": "83047b7c-cf7f-426c-80c7-220a47c582aa",
  "catalog:commitTimeStamp": "2024-11-07T21:10:51.9330653Z",
  "copyright": "Keyoti Inc. 2018-2024",
  "created": "2024-11-07T21:07:55.833Z",
  "description": "Spell checker for ASP.NET Core, requires JS client files not included in the Nuget package, please download the MSI at https://keyoti.com/products/rapidspell/dotNetWeb/evaluation-download.html",
  "id": "Keyoti.RapidSpellWeb.ASP.NET.Core",
  "isPrerelease": false,
  "lastEdited": "2024-11-07T21:10:34.03Z",
  "licenseFile": "license.txt",
  "licenseUrl": "https://aka.ms/deprecateLicenseUrl",
  "listed": true,
  "packageHash": "WMO7JjTZiMniSfsypITCbCyQXQ1JFBo4KxbtEpEX8cNGiCW+gH++FHfUwh7iz7wv68KnQzDXNJPF++U/19Nk1Q==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 107108,
  "projectUrl": "https://keyoti.com/products/rapidspell/dotNetWeb/spell-checker.html",
  "published": "2024-11-07T21:07:55.833Z",
  "readmeFile": "readme.md",
  "releaseNotes": "6.4.0\n\n\nImprovements\n-Fix resize gripper not appearing in as-you-type textboxes\n-Fix overflow issue in as-you-type in Chrome\n-Correct padding applied to as-you-type textboxes so that it is inside of scrollpane \n-Fix tab key in as-you-type, Chrome\n-Fix handling of % width/height in as-you-type enabled textboxes\n-Fix bug in RapidSpellWInlineTextBox (older Server Control usage)\n-Fix issue where cookies are added twice\n\n\n6.3.0\n\n\nBreaking Changes:\nDict Files must be named with the \".dict\" file extension - this is probably already the case but if you have renamed it to a different extension it will no longer be used. This is to prevent a security issue where the presence of system files can be probed. \nImprovements\n-Fix as you type not working in Safari 15\n-Fix issue with .NET Core/5+ dictionaries\n-Fix Firefox AYT rendering issue\n-Update dictionaries\n-Fix bug with undefined IDs\n\n6.2.0\n\nBreaking Changes:\nNone. \nImprovements\n-Fix problem when Undo button is not visible.\n-English dictionary update.\n\n6.1.0\n\n\nBreaking Changes:\nUser dictionary files must have the file extension txt, dic or dict - if they do not then an ApplicationException is thrown, this change is for security. \nImprovements\n-Cookies used by RapidSpell to hold user option selections now have the Secure attribute set when run on HTTPS.\n -IgnorePatternMaximumWordLength property added to RapidSpellChecker so that ignore patterns can be restricted in length.\n -LookForAnagrams property added so that anagram suggestions can be disabled.\n -ASP.NET Core assembly, add ability to specify a custom UserDictionary subclass for use in the API, via DI.\n -Remove inclusion of stack trace in JS error logs, for security.\n\n6.0.0\n-Add ASP.NET Core support with new DLL.\n-Update Dict Manager.\n-Added ability to set field labels for the dialog checker with JS mode usage, see Dialog page in the help.\n-Fixed issue with IE11 running in IE9 mode causing browser crash.\n-Added event hook ups for keypress and input.\n-Support change events in AngularJS.\n-Fix bug in dialog check where words could be incorrectly ignored\n\n5.3.0\nBreaking Changes:\nSee 5.0.0 release notes below if you are upgrading from v4 or older. Otherwise no breaking changes\n\nImprovements\n-IE7 Fix browser contextmenu being shown when right clicking on error word. \n-Chrome v57 introduced an issue with INPUT (single line) text boxes being wrongly sized in height, which has been fixed.\n-Fixed issue with cursor not being visible (when first clicked) in single line text boxes in Chrome.\n-Russian translation correction.\n\n5.2.0\nBreaking Changes:\nSee 5.0.0 release notes below if you are upgrading from v4 or older. Otherwise no breaking changes\n\nImprovements\n-Added Polish and Russian UI texts\n-Added support for jQuery Combobox\n-Added support for jQuery autosize - please email support@keyoti.com for info\n-Added documentation on using with KendoUI rich text box, see 3rd party text box section of the help\n-Improved handling of textboxes made invisible and then visible again\n-Added rsw_unregisterTextBox(textBoxId) function to remove textbox from spell checker\n-Added preventDefaultCurrentEvent function to allow event cancellation (eg key events), see the Client Scripting section of the help\n-Added double click event mapping to original textbox with as you type mode\n-Addressed nodeValue being deprecated\n-Fixed Firefox issue with newlines\n-Fixed bug with textboxes marked to be ignored being picked up under certain conditions\n-Prevent suggestions context menu being hidden as textboxes are initialized\n-Fix bug in text reconciliation (for text changes occurring after a spell request was sent)\n-Map double click events to source textbox handler (for AYT)\n-Added submitOnEnterForSingleLine property to TBS objects to allow Enter to trigger form submit - please email support@keyoti.com for info\n-Fix placeholder bug\n-Added rapidSpell.ayt_forceNoScrollBars to allow complete override of scroll bars in AYT textboxes (false by default), useful with older browsers in certain document modes\n5.1.0\nBreaking Changes:\nSee 5.0.0 release notes below if you are upgrading from v4 or older. Otherwise no breaking changes\n\nImprovements\n-The Javascript files now contain no lines over 3000 characters long (this is to help certain other developer tools that might not handle long lines)\n-Moved demo projects to user's \"Documents\" folder to prevent UAC challenges when opening a solution in VS.\n-Updated documentation.\n-Fix certain capitalized suggestions being duplicated\n5.0.0\nBreaking Changes:\nThere are 4 breaking change sections below, please check them for their applicability to your project (if you need help just email support@keyoti.com). The changes relate to .NET 1 support, user options, popup window javascript function/variable naming and a new CSS block that must be added to your popup.aspx.\n\n.NET 1 support dropped\nThe .NET 1 built DLLs are no longer distributed.\n\nUser options\nA new feature is user options in the dialog spell checker, which give the user the ability to enable/disable spell check options such as ignore words with numbers, ignore uppercase, ignore improper case and ignore internet addresses. These options are stored in the user's cookie and will override any same setting made in code (such as with rapidSpell.setParameterValue(...)).\n\nTo disable this functionality call (for Javascript based usage):\n\nrapidSpell.setParameterValue('default', 'EnableOptions', 'false');\nor (for Server Control based usage), set EnableOptions to false in the RapidSpellWebLauncher controls.\n\nPopup window variable and function names (small possibility you are affected)\nTo implement the new jQuery based dialog it was necessary to incorporate the popup window scripts on the main page. This necessitated renaming of some Javascript variables and functions, and HTML elements. Therefore if your code is reliant on the elements in our popup.aspx being named a certain way (eg. you have Javascript that references HTML elements from our RapidSpellWeb Control, or you have Javascript that calls our functions) then you will need to update references to the new names (in most cases the names have been prepended with \"rsw_\". If you are unsure, please send your ASPX page that holds the RapidSpellWeb control to support@keyoti.com and we will advise.\n\nExample, you have a customized popup UI, with this code:\n\n<FinishButton BorderWidth=\"\" Font-Size=\"9pt\" Font-Names=\"Verdana\" Font-Bold=\"True\" BorderColor=\"\"\n\t\t\t\t\t\tForeColor=\"\" BackColor=\"SkyBlue\" Height=\"\" Width=\"100px\" CssClass=\"\" type=\"button\" value=\"Finish\"\n\t\t\t\t\t\tonclick=\"finish(true);\" style=\"width:100px;font-family:Verdana;font-size:9pt;font-weight:bold;background-color:#87ceeb;\"\n\t\t\t\t\t\tID=\"cancelButton\"></FinishButton>\nThe ID of the cancel button has changed and should be updated to:\n\nID=\"rsw_cancelButton\"\nOther changes are:\n\nchangeSuggestions() => rsw_changeSuggestions()\nignoreCurrent() => rsw_ignoreCurrent()\nignoreAll() => rsw_ignoreAllInstances\nchange() => rsw_change()\nchangeAll() => rsw_changeAll()\naddCurrent() => rsw_addCurrent()\nundoChange() => rsw_undoChange()\nOther function and variable names have changed, but it is expected that they have not been used publically. It is recommended that you retest any popup scripts that have been added, or send to us for our guidance.\n\nPopup window requires new CSS block\nTo support the user options, a CSS style block must be added to the popup.aspx page (note that your popup page may be named a different name, it will be the ASPX page holding the <RapidSpellWeb> Server Control). Please add the following to the head tags.\n\n<style type=\"text/css\">\n\n\t\tbody{overflow:hidden;\n\t\t\t font-family: sans-serif, arial, helvetica;\n\n\t\t}\n\t\tdiv{height:100%;}\n\n\t\t#rsw_documentTextPanel\n\t\t{\n\t\t\tborder: 1px solid #aaa;\n\t\t\tborder-radius: 3px;\n\t\t}\n\t\t#rsw_word, #suggestions\n\t\t{\n\t\t\tborder: 1px solid #aaa;\n\t\t\tborder-top-color: #a0a0a0;\n\t\t}\n\t\t#rsw_optionsDialog\n\t\t{\n\t\t\tfont-size:.80em;\n\t\t\tdisplay: none;\n\t\t\tposition: absolute;\n\t\t\tmargin-left: auto;\n\t\t\tmargin-right: auto;\n\t\t\tmargin-top: auto;\n\t\t\tmargin-bottom: auto;\n\t\t\tleft: 0;\n\t\t\tright: 0;\n\t\t\ttop: 0;\n\t\t\tbottom: 0;\n\t\t\twidth: 295px;\n\t\t\theight: 230px;\n\t\t\tz-index: 101;\n\t\t\tbackground-color: white;\n\t\t\tborder: 1px solid #444;\n\t\t\tborder-radius: 5px;\n\t\t\tpadding: 8px;\n\t\t}\n\t\t#rsw_optionsDialog_Backing\n\t\t{\n\t\t\tdisplay: none;\n\t\t\tposition: absolute;\n\t\t\tmargin-left: auto;\n\t\t\tmargin-right: auto;\n\t\t\tmargin-top: auto;\n\t\t\tmargin-bottom: auto;\n\t\t\tleft: 0;\n\t\t\tright: 0;\n\t\t\ttop: 0;\n\t\t\tbottom: 0;\n\t\t\twidth: 100%;\n\t\t\theight: 100%;\n\t\t\tbackground-color: rgba(100,100,100,.60);\n\t\t\tz-index: 100;\n\t\t}\n\t\t#rsw_optionsDialog > label\n\t\t{\n\t\t\tdisplay: block;\n\t\t\tpadding-bottom: 12px;\n\n\t\t}\n\t\t#rsw_optionsDialog > input\n\t\t{\n\t\t\tmargin-right: 9px;\n\t\t\tmargin-top:12px;\n\t\t}\n\t\t#rsw_optionsHeader\n\t\t{\n\t\t\tfont-size: 1.2em;\n\t\t\tborder-bottom: 1px solid #aaa;\n\t\t}\n\t</style>\nImprovements\n-Added WCF and ASMX Web Services for backend server calls. For MVC users this means there is now no dependence on ASPX Web Forms. It is also more lightweight.\n-Spell check options dialog added.\n-Added support for the context menu key on the keyboard, and enabled selection of suggestion menu items with keyboard.\n-Edge browser support added.\n-jQuery UI based dialog mode added (for Javascript based usage only).\n-Modal mode improvement to use jQuery UI dialog (must enable with rapidSpell.dialog_setUseDivDialog(true);) (for Javascript based usage only)\n-Smaller bug fixes\n4.5.0\nImprovements\n-IE11 fix issue where clicking off of the top line would not focus cursor.\n-Improve performance with certain larger text contents.\n-Fix XSS issue with popup URL manipulation.\n-Fix tabbing between fields in recent versions of Chrome.\n-Support 'placeholder' HTML attribute in text boxes\n-Images in rich HTML editors will now be hidden by default in the dialog spell checker text window, to allow them to be shown call rapidSpell.setParameterValue('default', 'HideImages', false);\n-Added WCF support http://keyoti.com/support/default.aspx?g=posts&m=12809&#post12809\n-Added ability to set textbox ids to check for inline, use rapidSpell.ayt_setupTextBoxes(false, idsToCheck);\n-Smaller bug fixes\n4.4.0\nImprovements\n-Spell checker can now look for elements to check by their class rsw_spellable. This allows textboxes to be checked by inclusively specifying them rather than excluding them.\n-Address some XSS issues with dialog spell checker.\n-Fix IE11 not tabbing to other textboxes.\n-Small bug fixes\n4.3.2\nFor rich editors (like TinyMCE, CKEditor etc) you may find that custom CSS styling that you may have used for the overlay is no longer required, as we have improved how the existing styling is copied in to the overlay.\nImprovements\n-Improve static overlay styling.\n-Small bug fixes\n4.3.1\nImprovements\n-Use web fonts within as-you-type text area, when specified in a CSS file\n-Fix placement issue with static overlay\n4.3.0\nImprovements\n-Added support for IE 11\n4.2.1\nImprovements\n-Fix cursor problem in Chrome/FF\n4.2.0\nThe static-mode (inline) overlay has changed from being absolutely positioned to temporarily setting the target textbox to display:none and inserting the overlay in the DOM before the target textbox - we recommend checking that this does not have detrimental effects on layout in your apps. Call rsw_absolutePositionStaticOverlay = true; in Javascript on the page to revert to old behavior.\nImprovements\n-Fix % width/height handling in as you type textboxes.\n-Tablet browsers (Android etc) will switch to left click for context menu suggestions, to support touch.\n-Fix bug in dialog with too many errors crashing popup\n-Small bug fixes.\n4.1.0\nImprovements\n-Make dictionary cache reload newer versions of a dictionary.\n-Enable cross subdomain usage for dialog spell checker (see docs).\n-Fix Chrome & Safari issue with textbox postback losing data.\n-Small bug fixes.\n4.0.0\nUp until v4 everything was Server Control based (ie. ASP.NET server tags), nothing was Javascript based. During this period of time other technologies have been released, such as ASP.NET AJAX, JQuery, MVC, and MVC Razor - the trend has been for ASP.NET developers to be more Javascript aware. With multiple 'form factors' in use, it makes sense for RapidSpell Web v4 to become Javascript based, which has advantages; \n-Usable with technologies that don't support runat='server' (MVC, straight HTML, ASP etc) \n-Simpler usage, 99% automatic \n-Smaller footprint on your application\n-Simpler product development (less mirroring of properties) \nWe are including the Server Controls for developers who are not comfortable with Javascript and for backwards compatibility. As you develop new pages we urge you to try using the Javascript based methodology as we're sure you'll find it better.\n\n\nBackwards Compatibility\n-Is backwards compatible, no code changes required. To transition away from the control based usage please remove the controls and follow the Help instructions on JS based usage.\n-\"ShareDictionary\" code from prior versions is ignored as it has been superseded by automatic caching.\nImprovements\n-As you type support added for Chrome and Safari browsers\n-Inclusion of simpler, more flexible automatic setup scripts, which will spell check all textboxes unless otherwise indicated (see docs).\n-Automatic dictionary caching, supports multiple dictionaries per app.\n-Sentence capitalization correction added [IgnoreIncorrectSentenceCapitalization]\n-Lowercase i correction (in English) [IgnoreInEnglishLowerCaseI]\n-Filter suggestions that would make text longer than 'maxlength'\n-Inline ignore all removes underlines in all text boxes and not just current\n-Prevent pasting beyond 'maxlength'\n3.8.0\nImprovements\n-Internet Explorer 9 support added\n-Firefox 4 support added\n-Autoclose popup window when user navigates away from main page.\nMaintenance\n-Fix cursor issues in RapidSpellWInlineTextBox\nBackwards Compatibility\nAs v3.7.0\n\n3.7.0\nImprovements\n-.NET 4 DLLs and VS 2010 demos included\nMaintenance\n-Fix issue with ALT code characters disappearing in RapidSpellWInlineTextBox with as-you-type if they were the last character entered.\n-Fix for AJAX usage, properly deactivates any inline overlays on AJAX postbacks\nBackwards Compatibility\nAs v3.6.0\n\n3.6.0\nImprovements\n-Faster performance with large texts\nMaintenance\n-Fix occasional loss of characters in inline textbox in as-you-type mode\n-Fix issue with image buttons in popup dialog\n-Fix issue with certain characters copied from Word to the inline textbox\n-Workaround Safari bug with multiple launchers\nBackwards Compatibility\nAs v3.5.1\n\n3.5.1\nMaintenance\n-Firefox 3 support with multiple RapidSpellWebLauncher controls\n-Scrolling issue with as-you-type fix\n-Performance issue with split word suggestions for long URLs\nBackwards Compatibility\nAs v3.5.0\n\n3.5.0\nNew Features\n-Ignore All & Change All operations are now global (affect all textboxes during a check) in dialog spell checker. To revert to old behavior (local) please set GlobalIgnoreAll=\"false\" and GlobalChangeAll=\"false\" in the RapidSpellWeb control (popup page).\n-Added consistent ClientSideObject interface for downlevel browsers rendering RapidSpellWInlineTextBox\n-RapidSpellWInlineTextBox client side events can now also be hooked up using HTML attributes, \"onblur\", \"oncontextmenu\", \"oncorrection\", \"onfocus\", \"onkeydown\", \"onkeypress\", \"onkeyup\", \"onmousedown\", \"onmouseup\", \"onpaste\"\nFixes\n-Various minor issues\nBackwards Compatibility\nAs v3.4.2\n\n3.4.2\nNew Features\n-The as-you-type spell checker can now be set to not automatically check the text on page load, see RapidSpellWInline.CheckAsYouTypeOnPageLoad.\n-English dictionaries updated.\nFixes\n-Fixed minor issues with RapidSpellWInlineTextBox (as-you-type) controls relating to glitches under certain conditions.\nBackwards Compatibility\nAs v3.4.1\n\n3.4.1\nNew Features\n-Improved as-you-type spell checking behavior under slow network conditions (text change reconciliation)\n-Use of multiple RapidSpellWebMultiple controls on a page is now supported.\nFixes\n-Fixed issue with IE and rich/html text boxes when spell checking text which is invalid HTML.\n-Fixed compatibility issue with 'right click' suggestions and Mac Safari.\n-Modified RapidSpellWInlineTextBox style handling so that setting Height/Width=\"\" would allow a stylesheet to set these properties.\n-Fixed ASP.NET AJAX issue with as-you-type and hidden textboxes\nBackwards Compatibility\nAs v3.4.0\n\n3.4.0\nNew Features\n-Added new RapidSpellCheckerClient control, which provides AJAX based programmatic Javascript spell checking.\n-Added RightClickForMenu property to RapidSpellWInline to switch context menu from left to right click (default = false / left).\n-Added TextComponentInterface.Automatic which simplifies usage with rich/html textboxes.\n-Added support for \"ASP.NET AJAX\" RTM 1.0.\n-Added built-in support for GridView usage.\n-Improved/simplified client side API usage of RapidSpellWebLauncher, RapidSpellWInlineTextBox and RapidSpellWInline (see userguide)\n-Added RapidSpellWInline.ValidatorNeedsText event to allow validator usage with rich/html textboxes.\n-Added properties for \"No suggestions\" and \"Remove duplicate word\" text.\n-Allow .NET 2 users to use external stylesheets in addition to internal ones.\nFixes\n-Corrected behavior of RapidSpellWInlineTextBox controls.\n-Fixed design-time issue with RapidSpellWebMultiple control.\n-Fixed rich/html text box issue with html entities in certain positions.\n-Fixed RequiredFieldValidator usage with RapidSpellWInlineTextBox.\n-Fixed Safari issue with .NET 2 web-sites.\nBackwards Compatibility\nv3.4.0 is designed to be backwardly compatible with v3.3.0, see 3.3.0 release below if upgrading from earlier versions.\n\n** Due to broad changes to the client script registration procedure to accommodate ASP.NET AJAX it is highly recommended that applications using this control are checked for proper behavior after upgrading.\n\n3.3.0\nNew Features\n-Added ability to specify custom style-sheets for RapidSpellWInlineTextBox and RapidSpellWInline\n-Added ShowAddButtonAlways property to RapidSpellWInline to override Add button hiding when UserDictionaryFile is not spec'd\n-Enabled property in RapidSpellWInline/RapidSpellWebLauncher now automatically effects the button\n-XML/HTML parser speed improved\n-RapidSpellWeb and RapidSpellWebLauncher common code moved to JS files (.NET 1) and embedded scripts (.NET 2)\n-Multiple text box 'as you type' style demo added\nFixes\n-Strict mode browser rendering issue fixed\n-RapidSpellWebMultiple & HTML display mode issue fixed\n-Browser window resize during spell check issue fixed\nBackwards Compatibility\nIMPORTANT! .NET 1.x CLIENT FILES CHANGE:\nUp until this release, client side script for RapidSpellWebLauncher and RapidSpellWeb controls was embedded into the HTML page. To improve performance the majority of this code has moved to Javascript files (.js) under the /Keyoti_RapidSpell_Web_Common directory. This virtual directory is setup by default when installing the control with the installer, however if you manually deploy the controls to a server by copying the DLLs etc. then you MUST do the following to avoid Javascript errors.\n1. A virtual directory (eg. a directory under wwwroot) must exist called /Keyoti_RapidSpell_Web_Common. You can do this by simply creating a directory under your web-site root, so that URLs like http://yourURL/Keyoti_RapidSpell_Web_Common will map to this directory.\n\n2. The contents of /Keyoti_RapidSpell_Web_Common from our install must be copied to the server, this includes a few .js files and HTML files.\n\nThe above is covered in the deployment section of the user guide PDF as well.\n\nSharePoint (under .NET 1.x) users:\nDue to the movement of client script to external files, you could experience issues with their new locations. If you have successfully been using RapidSpellWebLauncher (and therefore RapidSpellWeb) controls with SharePoint running under .NET 1.x you will need to do the following when deploying version 3.3.\ni) Place the contents of the Keyoti_RapidSpell_Web_Common directory (located under our install folder) outside of SharePoint's control, so that it won't map their URLs.\nii) In RapidSpellWebLauncher and RapidSpellWeb set the new ClientFilesFolder property to the URL of the directory holding the Keyoti_RapidSpell_Web_Common files. Eg. if the client files are now located under http://machine/someDir/ then set this property to /someDir/\niii) Test - if it's setup wrong, you will see Javascript errors as soon as you run the page with RapidSpellWebLauncher in it.\nv3.3.0 is designed to be backwardly compatible with v3.0.0, see 3.0.0 release below for more info.\n3.2.0\nNew Features\n-Retro-fit XmlHttpRequest server access for capable browsers\n-Added 'Change All' functionality in RapidSpellWInline, see ShowChangeAllItem property\n-Added support for HTML/Rich text boxes (including Dart's PowerWEB TextBox)\nFixes\n-Worked around drop down menu shine-through browser bug with RapidSpellWInline\n-Improved inline menu positioning around browser edges\nBackwards Compatibility\nv3.2.0 is designed to be backwardly compatible with v3.0.0, see 3.0.0 release below for more info.\n3.1.0 - 3.1.1\nNew Features\n-Support for Visual Studio 2005 / ASP.NET 2.0 added\nFixes\n-Corrected RapidSpellWInline overlay positioning issue\n-Corrected multiple text box & dialog checking error (3.1.1)\nBackwards Compatibility\nv3.1.0 is designed to be backwardly compatible with v3.0.0, see 3.0.0 release below for more info.\n3.0.0\nMajor New Features\n-RapidSpellWInline control added, which provides a new 'inline' highlighting interface.\n-RapidSpellWInlineTextBox control added providing in-document highlighting in modern browsers.\n-Validator behavior added, allowing text boxes to be validated for spelling before saving.\n-Undo functionality added to traditional spell checker.\n-Smooth multiple text box checking added to RapidSpellWebMultiple.\n-Simpler license key usage.\n-'Field being checked' text added (useful for multiple text boxes).\n-Simpler multiple text box checking with grids and lists.\n-Simple access to dictionary caching added.\n-Added ability to ignore URLs and emails, as well as custom regex patterns.\nFixes In 3.0.0\n-Setting IgnoreAll button to invisible now works.\nBackwards Compatibility\nWe have made every effort to make v3.0.0 as compatible as possible with v2. \nV3.0.0 is approximately 99% backwards compatible with v2.8.3 without any code changes required.\nHowever, we urge all v2 users to consult the file 'V2-3 Upgrade Notes.html' for important information.\nFixes In 2.8.3\n-Fixed bug related to IgnoreWordsWithDigits = false and suggestions (default value for IgnoreWordsWithDigits is true).\n2.8.2\nNew Features\n-Improved suggestions for short (<=3 char) words.\nFixes\n-Updated Spanish translations.\n-Fixed accented characters issue with Firefox\n-*\n*Use of RapidSpellWebMultiple with Safari browser (Mac). If you are using RapidSpellWebMultiple to check multiple text boxes (with one button) and you expect any of your users to use the Safari browser please read the following:\n\nDue to a bug in Safari, we had to design a work-around to enable support for RapidSpellWebMultiple, to use this work-around, please place the file 'RapidSpellSafariHelper.html' in the same directory(s) where you have used RapidSpellWebLauncher. This work-around will only come into effect if you have specified the RSMultipleID property in RapidSpellWebLauncher (this is done automatically if you use the designer). This work-around does not affect performance or functionality.\n\nBackwards Compatibility\nv2.8.2 is designed to be backwardly compatible with v2.8.1.\n2.8.1\nNew Features\n-Firefox v1 browser support.\nFixes\n-Fixed case-sensitivity bug that allowed dontSuggest words to be suggested.\nBackwards Compatibility\nv2.8.0 is designed to be backwardly compatible with v2.7.0.\n2.8.0\nNew Features\n-Portuguese LanguageType added, includes Portuguese GUI text.\n-SSLFriendlyPage property added so that path to 'blank' html page is settable.\n-AllowMixedCase property sets whether words in mixed case that do not appear exactly as such in dictionary will be reported as an error.\nFixes\n-Under certain circumstances removing duplicate words causes incorrect word index offset for following words.\nBackwards Compatibility\nv2.8.0 is designed to be backwardly compatible with v2.7.0.\n2.7.0\nNew Features\n-Ignoring words with numbers is optional through new IgnoreWordsWithDigits property\n\n-Addition of client side event listeners \"StartedOnTextBoxListener\" and \"FinishedOnTextBoxListener\" to RapidSpellWebMultiple make features such text box highlighting possible (see updated DynamicList.aspx demo)\n\n-New server-side event \"Finish\" added to RapidSpellWebLauncher and RapidSpellWebMultiple controls, use with PostBackOnFinish=true to run server-side code when spell check is complete\n\n-New demos added for the Repeater control and hiding/showing text boxes\nFixes\n-Duplicate numbers are not reported as a duplicate error\n-Problem fixed where overflow exceptions could occur when checking text with hundreds of XML tags unseparated by words\nBackwards Compatibility\nv2.7.0 is designed to be backwardly compatible with v2.6.1. Changes to default settings; RapidSpellWebLauncher.FinishListenerInformState now defaults to true - this should not have adverse effects on any existing Javascript functions. Eg; if FinishListener was \"OnFinish\" and the function was declared as \"function OnFinish(){\" the control will now (by default) call that function as \"OnFinish(boolComplete)\".\n2.6.1\nBackwards Compatibility\nv2.6.1 is designed to be backwardly compatible with version 2.5 of RapidSpell Web. We have made changes to fundamental functionality (such as the way TextComponentName can be set). We recommend you retest your apps. with the new DLL, to ensure there are no problems, before deployment.\nNew Features In 2.6.0 & 2.6.1\n-Filters added to remove scripting into preview pane\n\n-Empty text boxes are ignored for efficiency\n\n-Multiple text box in DataList example source added to demos\n\n-Improved ease of use, setting text control to spell check is simpler, especially for situations involving data grids, lists, and user controls.\n\n-New RapidSpellWebMultiple control makes checking multiple text boxes simple.\n\n-Duplicate word detection; such as \"this is is duplicated\".\n\n-Support for Opera and Safari browsers.\n\n-Design Time improvements; more properties for setting style and text.\n\n-'Preview Pane' now set-able to X%, allowing it to resize with pop-up window size (useful for users who wish to pull the popup bigger).\n\n-Improved dictionaries; the UK, US & Combined English dictionaries have been increased to 110K words, Canadian and Australian dictionaries are now available, free of charge.\nFixes\n-Minor bug in duplicate word detection caused duplicate words around misspellings to be reported incorrectly \n-US dictionary missing in MSI installer package version\nOlder Versions\nRapidSpell v2.5.0 features the following improvements over v2.4.0:\nThe popup window position is now set-able in RapidSpellWebLauncher.WindowX & RapidSpellWebLauncher.WindowY properties (set these to -1 if you want them not set).\nTroubleshooting section added to user guide, covers common user dictionary problems and build errors in VisualStudio.\nRapidSpell v2.4.0 features the following improvements over v2.3.0:\nModal dialog support for popup mode.\nFor multiple text box checking there is now the 'FinishClosesWindow' property to set whether the 'Finish' button should close the spell check or move onto the next text box.\nRapidSpell v2.3.0 features the following improvements over v2.2.0:\nImproved suggestions (anagram searching and split word suggestions)\nCompound word support (for German)\nSpell check finished and 'no spelling errors' messages made optional\nText correction Javascript event added (CorrectionNotifyListener property)\nSSL mixed content warning fix\nCertain international characters user dictionary fix\nDocumentation added for User Controls\nDataGrid example added\nSmoother multiple text box checking example added\nRapidSpell v2.2.0 featured the following improvements over v2.1.0:\nBuilt-in UI text for (French, German, Italian and Spanish)\nSuggestions algorithm improvements\nImage button support (in launcher control)\nNew Dict file support for runtime changeable dictionaries and customization\nDecoupled spell checker engine, for parser customization\nHyphenation behavior improvements\nRapidSpell v2.1.0 featured many improvements in the core spell checker over v1, including:\nImprovement in word lookup check speed\nImprovement in phonetic suggestions speed\nNew alternative 'hashing' suggestions method added, runs up to 40x faster than phonetic suggestions\nNew methods for behavior customization\nMore accurate dictionaries\n3rd Party component support\nHTML/XML compatibility\nMultiple text box support\nImproved design time support",
  "repository": "",
  "requireLicenseAcceptance": true,
  "verbatimVersion": "6.4.241108",
  "version": "6.4.241108",
  "dependencyGroups": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2024.11.07.21.10.51/keyoti.rapidspellweb.asp.net.core.6.4.241108.json#dependencygroup/net5.0",
      "@type": "PackageDependencyGroup",
      "dependencies": [
        {
          "@id": "https://api.nuget.org/v3/catalog0/data/2024.11.07.21.10.51/keyoti.rapidspellweb.asp.net.core.6.4.241108.json#dependencygroup/net5.0/keyoti.rapidspellmdict.us.english",
          "@type": "PackageDependency",
          "id": "Keyoti.RapidSpellMDict.US.English",
          "range": "[3.0.7, )"
        },
        {
          "@id": "https://api.nuget.org/v3/catalog0/data/2024.11.07.21.10.51/keyoti.rapidspellweb.asp.net.core.6.4.241108.json#dependencygroup/net5.0/microsoft.aspnetcore",
          "@type": "PackageDependency",
          "id": "Microsoft.AspNetCore",
          "range": "[2.0.0, )"
        },
        {
          "@id": "https://api.nuget.org/v3/catalog0/data/2024.11.07.21.10.51/keyoti.rapidspellweb.asp.net.core.6.4.241108.json#dependencygroup/net5.0/microsoft.aspnetcore.mvc",
          "@type": "PackageDependency",
          "id": "Microsoft.AspNetCore.Mvc",
          "range": "[2.0.0, )"
        }
      ],
      "targetFramework": "net5.0"
    }
  ],
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2024.11.07.21.10.51/keyoti.rapidspellweb.asp.net.core.6.4.241108.json#Keyoti.RapidSpellWeb.ASP.NET.Core.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 10942,
      "fullName": "Keyoti.RapidSpellWeb.ASP.NET.Core.nuspec",
      "length": 30827,
      "name": "Keyoti.RapidSpellWeb.ASP.NET.Core.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2024.11.07.21.10.51/keyoti.rapidspellweb.asp.net.core.6.4.241108.json#lib/net5.0/Keyoti.RapidSpellWeb.ASP.NET.Core.dll",
      "@type": "PackageEntry",
      "compressedLength": 78145,
      "fullName": "lib/net5.0/Keyoti.RapidSpellWeb.ASP.NET.Core.dll",
      "length": 193536,
      "name": "Keyoti.RapidSpellWeb.ASP.NET.Core.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2024.11.07.21.10.51/keyoti.rapidspellweb.asp.net.core.6.4.241108.json#readme.md",
      "@type": "PackageEntry",
      "compressedLength": 241,
      "fullName": "readme.md",
      "length": 434,
      "name": "readme.md"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2024.11.07.21.10.51/keyoti.rapidspellweb.asp.net.core.6.4.241108.json#license.txt",
      "@type": "PackageEntry",
      "compressedLength": 2712,
      "fullName": "license.txt",
      "length": 6542,
      "name": "license.txt"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2024.11.07.21.10.51/keyoti.rapidspellweb.asp.net.core.6.4.241108.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 12920,
      "fullName": ".signature.p7s",
      "length": 12920,
      "name": ".signature.p7s"
    }
  ],
  "tags": [
    "spell",
    "checker",
    "spelling",
    "proofing",
    "checking"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}