{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.21.06.25.13/curse-of-strahd-pdf.1.3.1.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "tony",
  "catalog:commitId": "77e821d5-20ca-4abd-9db6-3f6bc8cdb6f2",
  "catalog:commitTimeStamp": "2022-01-21T06:25:13.1045529Z",
  "created": "2022-01-18T15:33:14.317Z",
  "description": "Curse of strahd pdf\n\nJourney with Captain Kirk and the crew of the USS Enterprise on their five-year mission of exploration through the uncharted reaches of outer space. Encounter strange new worlds and civilizations, and boldly go where no man has gone before.\n\nClick Here to Download >>>>>>> https://za.uy/uSPd2yCH\n\nCurse of strahd pdf Download\n\nCreated in 1966 by Gene Rodenberry, Star Trek is an iconic science fiction series that has since spawned five spin-off series and thirteen movies, with a new addition to the franchise set for release in 2017.\n\nThe Curse of Strahd is a novel written by Tui T. Sutherland and published on August 13, 2013. It is the first book in the \"Seeker: The Dark Is Rising\" series and is about a young boy named Will Stanton who must step up to fulfill his new role as the last of the Old Ones and fight against the rising Dark.\n\nThe Lands of Barovia. An outline of the wild regions on the fundamental guide of Barovia makes up the greater part of this section, yet it likewise gives the overall legend of the area and its kin (Barovians and Vistani), adjustments to different supernatural spells and impacts because of the fogs and Strahd's command over the land, the irregular experiences that can be set off both daytime and evening time, and a couple of valuable sidebars: Barovian Names (60+ male and female first names just as family names), and Barovian Calendar, which is a basic schedule that follows lunar cycles.\n\nCurse of strahd pdf google drive\n\nThe Curse of Strahd is the first book in the series The Wilderking Trilogy. It tells the story of a young boy named Tarkon, who finds out that he is the lost prince of a magical land called Wilderking. He must go on a journey to find out how to become king and save his land from destruction. \n\nRevile of Strahd is a re-track of the first plot of I6 Ravenloft (later updated for AD&D second version as RM4 House of Strahd, and once more, yet more intensely in this way, for the reconsidered 3.5 release as Expedition to Castle Ravenloft), however with a metric boatload of added content.\n\nThe Curse of Strahd is a novel written by Adam-Troy Castro, and is the sequel to the book, A Mind for Trade. The book follows the protagonist, Alex Racine, as he continues his adventures in Strahd space.\nThe book is written by J.C. Cervantes and published by Omnibus Press.\nCurse of strahd pdf online\nThe book is written by J.C. Cervantes and published by Omnibus Press.\nThe players can attempt to free Barovia of zombies and witches, take on werewolves, and break into Castle Ravenloft just to confront their demises… or they can play it brilliant and venture to every part of the grounds of Barovia, gathering sorcery things, partners, and legend that will assist with making the battle against Strahd significantly more liable to be a triumph.\n\nCurse of strahd pdf free download\n\nIn this installment, Alex encounters a new alien race known as the Inscrutables. He also makes use of a new technology which allows him to communicate with other humans in real time from anywhere in the galaxy.\n\nWhile the mass is about the vampire Strahd von Zarovich and his severe rulership over the Village of Barovia, just as his timeless distress and fury showing in actual structure all through his sanctuary — Castle Ravenloft, obviously — there's a huge load of different plots straightforwardly and in a roundabout way attached to Strahd.",
  "id": "curse-of-strahd-pdf",
  "isPrerelease": false,
  "lastEdited": "2022-01-21T06:21:13.733Z",
  "listed": false,
  "packageHash": "hf5S+ssotG/0M2J+0bVoC3escfScqe8PlxiAL4QfkOmoz1Bgsdmrv6fjxdfiiZF2v851Yv+nnnvXd54szE/oeQ==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 20155,
  "published": "1900-01-01T00:00:00Z",
  "releaseNotes": "curse-of-strahd-pdf",
  "verbatimVersion": "1.3.1",
  "version": "1.3.1",
  "dependencyGroups": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.21.06.25.13/curse-of-strahd-pdf.1.3.1.json#dependencygroup/net6.0",
      "@type": "PackageDependencyGroup",
      "targetFramework": "net6.0"
    }
  ],
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.21.06.25.13/curse-of-strahd-pdf.1.3.1.json#curse-of-strahd-pdf.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1938,
      "fullName": "curse-of-strahd-pdf.nuspec",
      "length": 3934,
      "name": "curse-of-strahd-pdf.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.21.06.25.13/curse-of-strahd-pdf.1.3.1.json#lib/net6.0/ClassLibrary2.dll",
      "@type": "PackageEntry",
      "compressedLength": 5351,
      "fullName": "lib/net6.0/ClassLibrary2.dll",
      "length": 14848,
      "name": "ClassLibrary2.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.21.06.25.13/curse-of-strahd-pdf.1.3.1.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9468,
      "fullName": ".signature.p7s",
      "length": 9468,
      "name": ".signature.p7s"
    }
  ],
  "tags": [
    "curse-of-strahd-pdf"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}