{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.21.06.25.13/players-handbook-5e-pdf.1.0.1.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "tony",
  "catalog:commitId": "77e821d5-20ca-4abd-9db6-3f6bc8cdb6f2",
  "catalog:commitTimeStamp": "2022-01-21T06:25:13.1045529Z",
  "created": "2022-01-18T15:19:29.717Z",
  "description": "Player's Handbook 5e pdf\n\nThe Player’s Handbook is a comprehensive guide for players of Dungeons & Dragons 5th Edition. It contains information about how to create a player character, as well as the rules and systems governing the game.\n\nI will attempt to not copy the data given in the greater part of the other 5 star audits since I concur with by far most of them.\n\nClick Here to Download >>>>>>>>>> https://za.uy/Npj8F\n\nI'm an oldster, have played each version of D&D there has been, the vast majority of them being delivered when I was of lawful drinking age, and IMO this is the best release of all time. I have not been this amped up for a form of D&D since the second version was delivered. It appears to me to have taken the very best, according to a game plan perspective, and most well-known parts of before releases and put them in one book.\n\nOne more way of considering it is that this version is the most consistent with the game standards set out in the previous releases, particularly AD&D first and second versions, while simultaneously conveying the more present-day and famous standards from 3.5 and surprisingly the much defamed 4.0.It also comes with a pre-generated character sheet that can be used immediately.\n\nI'm enjoyably amazed to say that I was 100% off-base with regards to the viability of the playtest process and the completed item. In opposition to the conclusions in a portion of the lower star audits, what I am grasping and have perused cover to cover is an extremely \"close,\" exhaustive, rich, and fun arrangement of rules.\n\nPlayer's Handbook 5e pdf online\n\nThe Player’s Handbook is a book that contains all the information needed for a player to create their character in the Dungeons and Dragons Fifth Edition. The Player’s Handbook provides all the rules of the game, advice for players and Dungeon Masters, as well as all the information needed to play.\n\nPlayer's Handbook 5e pdf free download\n\nI will attempt to not copy the data gave in the greater part of the other 5 star audits since I concur with by far most of them. I'm an oldster, have played each version of D&D there has been, the greater part of them being delivered when I was of lawful drinking age, and IMO this is the best release of all time. I have not been this amped up for a form of D&D since second version was delivered.\n\nThis book is essential for new players and provides everything that you need to begin your journey into the world of Dungeons & Dragons.\n\nGlancing through different audits of the Player's Handbook, yet in addition to the Dungeon Master's Guide, and the Monster Manual, obviously this is a typical issue with 5e books. Pages are twisted, restricting is askew, and on account of the DM guide, many individuals are getting duplicates that have the cover connected topsy turvy\n\nI'd love to give this a higher rating, since I love 5e, however until they can fix whatever is making these books be trash quality, I just can't.\n\nWhile D&D 5e is an awesome game, there are some significant issues with the printing/stockpiling/development of the books. Two companions and I all got this book, and every one of the three of us had pages that were twisted. It nearly looked water harmed, yet I don't believe that is the situation. \n\nPlayer's Handbook 5e pdf download\n\nI need to concede that I totally avoided the previous playtest forms, and was quite incredulous of the methodology taken in getting criticism from so many play analyzers. I was concerned that we would wind up with \"an excessive number of cooks ruin the stew\" circumstance; a game that was a tangled hodgepodge of everybody's \"most loved standards\" making an incomprehensible and generally unplayable wreck.\n\nWhile D&D 5e is an awesome game, there are some difficult issues with the printing/stockpiling/development of the books. Two companions and I all got this book, and each of the three of us had pages that were twisted. It nearly looked water harmed, however I don't feel that is the situation.",
  "id": "players-handbook-5e-pdf",
  "isPrerelease": false,
  "lastEdited": "2022-01-21T06:21:13.323Z",
  "listed": false,
  "packageHash": "ghhL3z8SyVmSQt31Fvw0pT2xho38wXWlR8vMZpoHVtMHzO2TGunuetEMpbs1lYpIrNt/KNXktSuLw4qqolw9wg==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 19972,
  "published": "1900-01-01T00:00:00Z",
  "releaseNotes": "players-handbook-5e-pdf",
  "verbatimVersion": "1.0.1",
  "version": "1.0.1",
  "dependencyGroups": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.21.06.25.13/players-handbook-5e-pdf.1.0.1.json#dependencygroup/net6.0",
      "@type": "PackageDependencyGroup",
      "targetFramework": "net6.0"
    }
  ],
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.21.06.25.13/players-handbook-5e-pdf.1.0.1.json#players-handbook-5e-pdf.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1885,
      "fullName": "players-handbook-5e-pdf.nuspec",
      "length": 4572,
      "name": "players-handbook-5e-pdf.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.21.06.25.13/players-handbook-5e-pdf.1.0.1.json#lib/net6.0/ClassLibrary2.dll",
      "@type": "PackageEntry",
      "compressedLength": 5256,
      "fullName": "lib/net6.0/ClassLibrary2.dll",
      "length": 16384,
      "name": "ClassLibrary2.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.21.06.25.13/players-handbook-5e-pdf.1.0.1.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9468,
      "fullName": ".signature.p7s",
      "length": 9468,
      "name": ".signature.p7s"
    }
  ],
  "tags": [
    "players-handbook-5e-pdf"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}