{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.21.06.25.13/sword-coast-adventurers-guide-pdf.1.0.1.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "tony",
  "catalog:commitId": "77e821d5-20ca-4abd-9db6-3f6bc8cdb6f2",
  "catalog:commitTimeStamp": "2022-01-21T06:25:13.1045529Z",
  "created": "2022-01-18T15:12:11.677Z",
  "description": "Sword Coast adventurer's guide pdf\n\nThe Sword Coast Adventurer's Guide is a supplement for the 5th edition of Dungeons & Dragons. It was released on November 3rd, 2015. Within this book are maps of the Sword Coast, descriptions of various settlements and dungeons, new character options such as new fighting styles and backgrounds, and an in-depth look at various factions such as the Harpers and Zhentarim.\n\nClick to Download>>>>> https://za.uy/pnyR\n\nI was reluctant to purchase this delivery dependent on a portion of the audits however at last chose to pull the trigger. Being another DM, and furthermore new to the 5E guidelines, I wanted some foundation legend to fill my current and future missions. Not being comfortable at all with Faerun or the Sword Coast when I started a couple of months prior, this book seemed like the main authority distribution that.\n\nSword coast adventurer's guide pdf download\n\nThe Sword Coast is a region in the North of Faerûn, which is the continent that forms the primary setting for many Dungeons & Dragons (D&D) stories. The area consists of the northern portions of the Sea of Swords, an inlet of the western ocean, and is considered part of Amn, Tethyr, and Calimshan. The Sword Coast stretches from Waterdeep in the west to Luskan in the east, with Neverwinter lying between them.\n\nThe Sword Coast is a region in the fictional Forgotten Realms campaign setting of Dungeons and Dragons. It is a coastal region in the north-east Faerûn, and its name is derived from the geographic location on the continent of Faerûn. The Sword Coast stretches from Waterdeep in the south to the city-state of Neverwinter in the north, and from Amn in the west to Luskan in the east.\n\nNot exactly as point by point true to form and considering the last book of this nature I bought was back in 3.5 days, this book is a lot more modest with much less data (and the 3.5 mission setting book was double the size of this one). \n\nIt's with regards to a large portion of the size as the PHB and surely not even close as great incentive for cash. \n\nI don't lament the buy, and yet it surely wasn't an extraordinary incentive for cash and I view as the majority of the player choices exceptionally dull, best case scenario.\n\nFeels like you're generally paying for the hardback and full-shading pages than genuine substance. Assuming you're fine with that, that is fine, if not I'd propose potential purchasers attempt to get it second hand for around £12-15, instead of the $40 RRP.\n\nYou're a player searching for custom classes. The class choices are just new ways for existing classes, but some of them may cause the class to feel completely unique like the swashbuckler rebel or bladesinger wizard. In any case, they are class choices.\n\nI will endeavor to clarify why this book has gotten incredible surveys from a few and horrible audits from others. The appropriate response is basic: certain individuals are purchasing this book believing it's something that it's not. I'll summarize it, then, at that point, meticulously describe the situation.\n\nSword Coast adventurer's guide pdf google drive\n\nThe bladesinger wizard is the champion here, permitting you to make a scuffle wizard and there are a few new cantrips to oblige it (or the new warlock choice).\nSword Coast adventurer's guide pdf download\nThe Sword Coast is a region in the North of Faerûn, and one of the most popular regions in the Forgotten Realms campaign setting. It is an area steeped in history and contains some of the most well-known locations in Dungeons & Dragons such as Neverwinter and Baldur's Gate.\n\nThe classes don't all get new ways, yet all have a legend treatment and the ones that do have been scrutinized for not being totally new classes. I feel like the playtesting needed for new classes would have deferred this book until the following year at some point, and the legend is something a great deal of DMs needed at this point.",
  "id": "sword-coast-adventurers-guide-pdf",
  "isPrerelease": false,
  "lastEdited": "2022-01-21T06:21:12.913Z",
  "listed": false,
  "packageHash": "kUPw5Q0S2qZnHGz50LtMJr3ovgBH+3Qju+jnuKHh5D+teCNJ9nPGOUte5IJgTP0novNUeEvoIQBTKp74REcpLw==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 20685,
  "published": "1900-01-01T00:00:00Z",
  "releaseNotes": "sword-coast-adventurers-guide-pdf",
  "verbatimVersion": "1.0.1",
  "version": "1.0.1",
  "dependencyGroups": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.21.06.25.13/sword-coast-adventurers-guide-pdf.1.0.1.json#dependencygroup/net6.0",
      "@type": "PackageDependencyGroup",
      "targetFramework": "net6.0"
    }
  ],
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.21.06.25.13/sword-coast-adventurers-guide-pdf.1.0.1.json#sword-coast-adventurers-guide-pdf.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 2055,
      "fullName": "sword-coast-adventurers-guide-pdf.nuspec",
      "length": 4554,
      "name": "sword-coast-adventurers-guide-pdf.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.21.06.25.13/sword-coast-adventurers-guide-pdf.1.0.1.json#lib/net6.0/ClassLibrary2.dll",
      "@type": "PackageEntry",
      "compressedLength": 5600,
      "fullName": "lib/net6.0/ClassLibrary2.dll",
      "length": 16384,
      "name": "ClassLibrary2.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.21.06.25.13/sword-coast-adventurers-guide-pdf.1.0.1.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9468,
      "fullName": ".signature.p7s",
      "length": 9468,
      "name": ".signature.p7s"
    }
  ],
  "tags": [
    "sword-coast-adventurers-guide-pdf",
    "Sword",
    "Coast",
    "adventurer's",
    "guide",
    "pdf",
    "google",
    "drive"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}