{
  "@id": "https://api.nuget.org/v3/catalog0/data/2015.02.01.19.03.23/aspose.pdf.6.9.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "Aspose",
  "catalog:commitId": "fe392804-ea5b-4226-b039-ce3299cb11e3",
  "catalog:commitTimeStamp": "2015-02-01T19:03:23.070745Z",
  "copyright": "©Aspose 2002-2012. All Rights Reserved.",
  "created": "2012-04-13T19:20:29.83Z",
  "description": "Aspose.Pdf for .NET is a PDF document creation and manipulation component that enables your .NET applications to read, write and manipulate existing PDF documents without using Adobe Acrobat. It also allows you to create forms and manage form fields embedded in a PDF document. This component is written in managed C# and it allows developers to add PDF creation and manipulation functionality to their Microsoft .NET applications (WinForms, ASP.NET and .NET Compact Framework).\n\tAspose.Pdf for .NET is affordable and offers an incredible wealth of features including PDF compression options; table creation and manipulation; support for graph objects; extensive hyperlink functionality; extended security controls; custom font handling; integration with data sources; add or remove bookmarks; create table of contents; add, update, delete attachments and annotations; import or export PDF form data; add, replace or remove text and images; split, concatenate, extract or inset pages; transform pages to image; print PDF documents and much more.",
  "iconUrl": "http://sialkot.aspose.com/wiki/download/attachments/1179720/imgLogoPdf128x128.png",
  "id": "Aspose.Pdf",
  "isPrerelease": false,
  "lastEdited": "0001-01-01T00:00:00Z",
  "licenseUrl": "http://www.aspose.com/corporate/purchase/end-user-license-agreement.aspx",
  "packageHash": "sr9RMEmMZxZF2cuPgLttrbTTCy/ao+O3/tArpakoukHHDY5az75X33a/hzz0Denj40IzzpHdJ//ssaJxXRcPQA==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 15163318,
  "projectUrl": "http://www.aspose.com/categories/.net-components/aspose.pdf-for-.net/default.aspx",
  "published": "2012-04-13T19:20:33.907Z",
  "releaseNotes": "This release introduces the features, enhancements and bug fixes as detailed below:\nNew Features\nPDFNEWNET-9261 - Add support of XHTML-formatted rich text fields value\nPDFNEWNET-30404 - Allow to justify the text in the multiline text box while filling the value\nPDFNEWNET-31199 - check if the source PDF is corrupted\nPDFNEWNET-32052 - Add support to Add Image Field type\n\nEnhancements\nPDFNEWNET-30082 - Add support of Stream in CreateFileAttachment (... ) method\nPDFNEWNET-31533 - PDF generation time should be reduced.\nPDFNEWNET-33143 - IIndexBitmapConverter and related SaveAsTIFF methods are not available\nPDFNEWNET-33447 - Checkbox should be display \"X\" in checked state\nPDFNEWNET-33209 - PngDevice memory leak - pins alot of byte[] in memory\nPDFNEWNET-29975 - PdfMend works slow\nPDFNEWNET-31762 - Add support for rendering of XFA forms\n\nExceptions\nPDFNEWNET-29399 - NullReferenceException when converting PDF to PNG\nPDFNEWNET-30078 - Exception in HTML to PDF (Length cannot be less than zero.)\nPDFNEWNET-33190 - NullReferenceException occurs when saving a PDF after Deleting a Page from PDF\nPDFNEWNET-33313 - Can't initialize IPdfStreamAccessor Exception on copying PDF\nPDFNEWNET-33325 - Unsupported annotation type 'Redact' was encountered\nPDFNEWNET-33400 - Input String was not in correct format ( PDF/A conversion)\nPDFNEWNET-33401 - Index was outside the bounds of the array (PDF/A Conversion)\nPDFNEWNET-33407 - ArgumentException when attempting to Sign/Save PDF\nPDFNEWNET-33390 - Incorrect font character encoding\nPDFNEWNET-33397 - Cross reference table or cross reference stream not found (v6.8)\nPDFNEWNET-33329 - Exception occurs while loading PDF document\n\nBugs\nPDFNEWNET-29161 - PdfViewer does not print PDF file\nPDFNEWNET-30179 - Issue in PDF to PNG Conversion\nPDFNEWNET-30292 - PDF to Image conversion is not correct\nPDFNEWNET-30506 - Problem rendering PDF to PNG\nPDFNEWNET-30732 - Table has wrong height when text height is set\nPDFNEWNET-31327 - Image is not added correctly in the PDF file\nPDFNEWNET-31400 - Replacing text over PDF document for more than one time, increases document size\nPDFNEWNET-31748 - Not able to append multiple files\nPDFNEWNET-31925 - Highlight Annotations rendering oddly when converting Pdf Document to PNG Images\nPDFNEWNET-31945 - Page is not rendered properly in 6.3 (and 6.4)\nPDFNEWNET-32306 - FillField crashing on on PDFs created in Adobe LifeCycle\nPDFNEWNET-33123 - PdfConverter problem: Generated images rotate 180 degrees.\nPDFNEWNET-33172 - Unable to apply form field fonts\nPDFNEWNET-33270 - Black boxes instead of letters in image\nPDFNEWNET-33272 - PDF forms filling using a PDF form and a XFDF file does not work correct\nPDFNEWNET-33279 - Application Hangs when converting PDF to JPG using PdfConverter\nPDFNEWNET-33280 - Cut out header when converting PDF to JPEG using PdfConverter\nPDFNEWNET-33290 - Problem whlie filling PDF form\nPDFNEWNET-33293 - Z-Index creating problem in Aspose.Pdf v6.7\nPDFNEWNET-33300 - Read pdf error: Cross Reference Table or Cross Reference Stream not Found\nPDFNEWNET-33304 - Unable to convert attached file into PNG image using PngDevice\nPDFNEWNET-33307 - PDF to Image conversion gives a black and white image\nPDFNEWNET-33306 - Blue tint after converting PDF to image\nPDFNEWNET-33308 - Change orientation to portrait when splitting landscape PDF\nPDFNEWNET-33319 - PDF getting Corrpupted when deleting Annotation\nPDFNEWNET-33320 - PDF to HTML conversion issue\nPDFNEWNET-33323 - Embedded font corrupted when first page removed\nPDFNEWNET-33331 - Output file was not produced\nPDFNEWNET-33341 - PDF to PNG conversion issue\nPDFNEWNET-33354 - Black background when converting PDF to TIFF format\nPDFNEWNET-33358 - Fix postscript function Evaluator\nPDFNEWNET-33378 - Footer problem using HTML\nPDFNEWNET-33382 - When converting HTML page to PDF, the text size becomes large\nPDFNEWNET-33385 - When trying to save the PDF file in LaTex format, I am getting an error message\nPDFNEWNET-33399 - Problem while converting PDF to PDF/A\nPDFNEWNET-33408 - Conversion from PDF to image hang\nPDFNEWNET-33412 - DecorateField() font and font size do not work\nPDFNEWNET-33417 - Error when accessing to document object (Each key should be Pdf Name)\nPDFNEWNET-33418 - Error on document loading\nPDFNEWNET-33419 - Background in PDF file is ignored when converted to XPS format\nPDFNEWNET-33421 - The problem with Japanese characters in bookmarks\nPDFNEWNET-33422 - XPS to PDF conversion issue\nPDFNEWNET-33423 - Adding a stamp to PDF file, produces large size PDF document. \nPDFNEWNET-33424 - ASCII85Decode filter returns wrong output\nPDFNEWNET-33431 - The file size grows with every PdfContentEditor.Save call\nPDFNEWNET-33441 - Object is incorrectly saved with incremental update\nPDFNEWNET-33448 - Aspose.Pdf.InteractiveFeatures.Forms.CheckboxField class has no constructor\nPDFNEWNET-33450 - Resultant PDF huge in size after stamping with PdfFileStamp\nPDFNEWNET-33462 - Inserting FormFields in an existing file hangs\nPDFNEWNET-33179 - Background image not rendering while converting XSL-FO to PDF\nPDFNEWNET-33211 - Difficulty Parsing PDF to Text using Aspose.PDF and Adobe Save as Text\nPDFNEWNET-33191 - Formatting lost after HTML to PDF conversion\nPDFNEWNET-33442 - Page orientation is not being honoured during printing\nPDFNEWNET-33193 - Not able to Merge Large PDF Files",
  "requireLicenseAcceptance": true,
  "summary": "Aspose.Pdf for .NET is an amazing component which provides the feature to create and manipulate PDF documents.",
  "title": "Aspose.Pdf for .NET",
  "version": "6.9.0",
  "tags": [
    "Aspose.Pdf",
    "PDF",
    "XFA",
    "XPS",
    "TIFF",
    "PCL",
    "SVG",
    "HTML",
    "XML",
    "XSL-FO",
    "FDF",
    "XFDF",
    "PDF/A",
    "form"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    }
  }
}