{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.17.42.28/_brawlstars-gems-hack-working-2022-version-ezz.5.8.35.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "SharpCrafters s.r.o.",
  "catalog:commitId": "eac8a8ad-8333-4319-bf51-d68da3072204",
  "catalog:commitTimeStamp": "2022-01-26T17:42:28.8922025Z",
  "created": "2022-01-26T17:40:15.407Z",
  "description": "# _BrawlStars Gems hack Working 2022 Version ezz\n\n\nCLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; [http://14.bltadwin.ru/hack.php](http://14.bltadwin.ru/hack.php)\n\n\nHow to use the Brawl Stars Hack Tool. Using this program is quite simple, and it will help us to unlimited gems, coins and tokens and also, it will not limit. May 4, - Brawl Stars Hack Gems and Coins Generator for Android and iOS Brawl Stars is from the same game developers behind the ever popular and. Probably if you are here it is to improve your gaming experience, you are looking for a Brawl Stars free hack truth? Good.\n\n## [CLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; http://14.bltadwin.ru/hack.php](http://14.bltadwin.ru/hack.php)\n\n · brawl stars hack unlimited gems and coins download, Unlimited gems this is the premium currency what if you could get gems on above. It is a freemium or you will have many advantages if you pay some money to buy some coins and gems to become the best player in the game. Outdated pmt android mods. Brawl Stars Gems Hack | How to get Free Gems in Brawl Stars. Impress your mates with a huge amount of Free Gems generated with this new Brawl Stars Hack. If you are looking for method to get free Gems in Brawl Stars then I´m sure that this new Gems Hack is exactly what you are looking for. You need to know that it will be working very well. After using our Gems Hack you . Access our new Brawl Stars Hack Cheat that offers you all of the Gems and Coins that you are looking for. This Brawl Stars Cheat is free and also safe to use! This Brawl Stars Hack is ideal for the beginner or the pro players who are looking to keep it on download t wait more and become the player you've always dream of.\n\nbrawl stars gems hack, brawl stars gems hack apk, brawl stars gems hack without human verification, brawl stars gems hack download, brawl stars gems hack 2021, brawl stars gems hack generator, brawl stars gems hack ohne verifizierung, brawlstars gems hacken, brawl stars gems hack 2020, brawl stars gems hack free, brawl stars gems hack app, brawl stars hack gems and coins, brawl stars hack gems android 1, brawl stars free gems hack apk, brawl stars unlimited gems hack apk, brawl stars hack gems android, brawl stars hack gems apple, free gems in brawl stars hack, brawl stars hack gems bez weryfikacji, brawl stars hack gems booster, free gems brawl stars hack bez weryfikacji, brawl stars gems generator and brawl stars hack 2020, brawl stars hack gems bez weryfikacji 2021, brawl stars hack gems generator bez weryfikacji, free gems hack in brawl stars, brawl stars gems hack.com, brawl stars hack gems coins, brawl stars hack gems and coins no human verification, brawl stars hack free gems cheats, brawl stars hack unlimited gems  coins, brawl stars hack unlimited gems and coins download, brawl stars gem hack code, brawl stars hack-claim unlimited gems, brawl stars hack download unlimited gems, brawl stars hack unlimited gems apk download, brawl stars hack gems deutsch ohne telefonnummer, brawl stars hack free gems download, brawl stars gems hack deutsch, hack do brawl stars gems, brawl stars hack gems easy, brawl stars gems hack elmas, free gems in brawl stars 2020, brawl stars hack gems free 2020, brawl stars hack free gems no human verification, brawl stars hack free gems no verification, brawl stars hack free gems generator, brawl stars hack free gems ios, free gems hack for brawl stars, free gems brawl stars ios, brawl stars hack gems game guardian, brawl stars hack gems generator no verification, brawl stars hack to get gems, brawl stars hack gems gratuit, brawl stars hack gems generator 2020, brawl stars hack gems generator 2021, gemas gratis brawl stars hack, brawl stars gems hack hilesi, brawl stars hack gems happymod, brawl stars gem hack no human verification 2020, brawl stars gem hack no human verification or survey 2020, brawl stars gem hack no human verification or survey 2021, brawl stars hack gems 2021 without human verification, bra",
  "id": "_BrawlStars-Gems-hack-Working-2022-Version-ezz",
  "isPrerelease": false,
  "language": "en-US",
  "lastEdited": "2022-01-26T17:42:18.16Z",
  "listed": true,
  "packageHash": "VDSbDuZ6B8jm1r0UBkKWUH+6Q81yxij5oAG5237zabQlML/DADhakj/udXOwvaTF66Nkefd36F314l71jfKeTw==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 11504,
  "published": "2022-01-26T17:40:15.407Z",
  "requireLicenseAcceptance": false,
  "title": "_BrawlStars-Gems-hack-Working-2022-Version-ezz",
  "verbatimVersion": "5.8.35",
  "version": "5.8.35",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.17.42.28/_brawlstars-gems-hack-working-2022-version-ezz.5.8.35.json#rveuaolhxr.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1374,
      "fullName": "rveuaolhxr.nuspec",
      "length": 4463,
      "name": "rveuaolhxr.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.17.42.28/_brawlstars-gems-hack-working-2022-version-ezz.5.8.35.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9470,
      "fullName": ".signature.p7s",
      "length": 9470,
      "name": ".signature.p7s"
    }
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}