{
  "@id": "https://api.nuget.org/v3/catalog0/data/2015.02.05.08.44.24/spire.doc.5.1.6.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "E-iceblue",
  "catalog:commitId": "3fc63300-bbc0-4d77-9e3f-94024ec3e0e5",
  "catalog:commitTimeStamp": "2015-02-05T08:44:24.6914912Z",
  "copyright": "Copyright © 2014 e-iceblue. All Rights Reserved.",
  "created": "2014-05-09T09:53:04.137Z",
  "description": "Spire.Doc for .NET, specially designed for developers, enables to fast generate, open, write, edit and save Word document from Word Version 97-2003 to 2013. The featured function conversion enables developers to easily realize conversion between Word and other popular document formats such as Word to PDF/EPub/HTML/RTF/Image/XML etc.\n\nSpire.Doc for .NET is a totally independent .NET Word class library which doesn't require Microsoft Office installed on system. Microsoft Office Automation is proved to be unstable, slow and not scalable to produce MS Word documents. Spire.Doc for .NET is many times faster than Microsoft Word Automation and with much better stability and scalability. \n\nBy using Spire.Doc for .NET, users can save Word Doc/Docx to stream, save as web response and convert Word Doc/Docx to XML, RTF, EMF, TXT, XPS, EPUB, HTML and vice versa. Spire.Doc for .NET also supports to convert Word Doc/Docx to PDF and HTML to image. \n\nA common use of Spire.Doc for .NET is to create Word document dynamically from scratch. Almost all Word document elements are supported. Mainly includes page, sections, headers, footers, footnotes, paragraphs, lists, tables, text, fields, hyperlinks, bookmarks, comments, images, styles, background settings, printing features, document settings and protection. Furthermore, drawing objects including shapes, textboxes, images, OLE objects and controls are supported as well. \n\nSpire.Doc for .NET enables developers to process pre-existing Word documents. It supports search and replace function, alignment, page break, fill field, document concatenate, document copy, print, complex and deeply nested mail merge, etc.",
  "iconUrl": "http://www.e-iceblue.com/images/product_logo/product_buy/docnet.png",
  "id": "Spire.Doc",
  "isPrerelease": false,
  "language": "es-US",
  "lastEdited": "0001-01-01T00:00:00Z",
  "licenseUrl": "http://www.e-iceblue.com/Knowledgebase/Licensing/License-Agreement.html",
  "packageHash": "Yc5uW+hYTA1Joq5eaTkiAE5m2VXwXyUPWALiX69iEmAKmZ1wbaqLueYr+M9PiJYm8UaUqWnj1HR+lJbez4R5Sw==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 30326162,
  "projectUrl": "http://www.e-iceblue.com/Introduce/word-for-net-introduce.html",
  "published": "2014-05-09T09:53:04.137Z",
  "releaseNotes": "Spire.Doc 5.1.6\nFix the issue that the layout of the table after converting .doc document to .docx document is changed.\nFix the issue that the content in the second header is not got by HeadersFooters.Header.\nFix the error \"Index was out of range\" caused when opening a .docx document.\n\n\n\nSpire.Doc 5.1.1 news features and bug solutions:\n• Add new method SplitCell(int colnumNum,int rowNum) to split one cell to multi-cells.\n• Add new method UpdateWordCount(char[] splitchar) to update paragraph count, word count and character count.\n• Fix the error \"Object reference not set to an instance of an object\"\nwhen doing the replacement doc.Replace(\"\",\",\",\"\", true, false);\n\n\nSpire.5.0.41 Bugs solved as below:\n•Fix the image is missing issue and the signature is repeated in PDF from Word.\n•Fix the issue of table settings is missing in PDF from Word.\n•Fix the image in header is missing in Word from HTML.\n•Fix the position of table is changed in .doc file from .docx file.\n•Fix the error \"input string was not in correct format\" when load HTML file.\n\nSpire.5.0.37 Bugs solved as below:\n•Fix the bug that some content is missing in PDF from Word document.\n•Fix the wrong layout content of in PDF from HTML file.\n•Fix the error 'current color is not a valid value for Int32' when converting HTML to Word document.\n•Fix the content is not equal in Word document from RTF.\n\n\nSpire.5.0.34 Bugs solved as below:\n•Fix the issue that the word count is not accurately.\n•Fix the issue that it causes an xml exception when saving a document contains End Notes.\n•Fix the issue that the date format was changed after converting Word document to PDF file.\n•Fix the issue that it causes a NullReference exception when loading an RTF document.\n\nSpire.Doc 5.0.30 focused on fixing bugs of the conversion feature in this new release.\n•Fix the issue that the position of some content is not correct after converting Word to Image.\n•Fix the bug that the header and footer in docx document are not converted when saving as PDF.\n•Fix the bug that changing the style of paragraph in HTML doesn't work after saving as Word document.\n\nSpire.Doc 5.0.26 has been released today. This new release add a new feature to convert word document to PDF/A directly. We have also focused on fixing bugs and function enhancements in this version. Viewing the following full description of its improved functions:\n\nFixes and Other Enhancements\n•Fix the bug that the image disappears after converting word document to PDF document.\n•Fix the bug that the last line of a multi-line string disappears when use MailMerge functionality to merge the MergeFields inside a textbox of DOTX document.\n•Fix the bug that the embedded font is replaced by other font after converting word document to PDF document.",
  "requireLicenseAcceptance": true,
  "summary": "Spire.Doc for .NET is a professional and powerful .NET Word library to process a large range of Word tasks in C# and Visual Basic for .NET (2.0/3.5/4.0/4.0 ClientProfile/4.5)",
  "title": "Spire.Doc for .NET",
  "version": "5.1.6",
  "frameworkAssemblyGroup": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2015.02.05.08.44.24/spire.doc.5.1.6.json#frameworkassemblygroup/.netframework2.0",
      "assembly": "Spire.Doc",
      "targetFramework": ".NETFramework2.0"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2015.02.05.08.44.24/spire.doc.5.1.6.json#frameworkassemblygroup/.netframework3.5",
      "assembly": "Spire.Doc",
      "targetFramework": ".NETFramework3.5"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2015.02.05.08.44.24/spire.doc.5.1.6.json#frameworkassemblygroup/.netframework4.0",
      "assembly": "Spire.Doc",
      "targetFramework": ".NETFramework4.0"
    }
  ],
  "tags": [
    "words",
    "Word",
    "TEXT",
    "RTF",
    "doc",
    "docx",
    "PDF",
    "XPS",
    "HTML",
    "Image",
    "XTML",
    "word",
    "document",
    "EPUB"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    }
  }
}