{
  "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.21.06.24.06/aspose.words.14.6.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "Aspose",
  "catalog:commitId": "4865b94c-043e-451d-99fc-f702b067aab4",
  "catalog:commitTimeStamp": "2018-10-21T06:24:06.1738769Z",
  "copyright": "(C) Aspose 2002-2014. All Rights Reserved.",
  "created": "2014-07-07T22:16:09.29Z",
  "description": "Aspose.Words for .NET is a class library for .NET that enables you to perform a wide range of document processing tasks directly within your .NET applications.",
  "iconUrl": "http://www.aspose.com/images/products/dotnet/Aspose.Words_128x128.png",
  "id": "Aspose.Words",
  "isPrerelease": false,
  "lastEdited": "2018-10-21T06:23:37.093Z",
  "licenseUrl": "http://www.aspose.com/corporate/purchase/end-user-license-agreement.aspx",
  "listed": true,
  "packageHash": "7sxtpWOzpdUg1zUS0fIxV1aZ8q1Q7+Qq5LQEMrKgewlqUc2YvoNwJSKVOTTZanJq3uNnGcVcUPBBrbBennIdpg==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 7950962,
  "projectUrl": "http://www.aspose.com/categories/.net-components/aspose.words-for-.net/default.aspx",
  "published": "2014-07-07T22:16:09.29Z",
  "releaseNotes": "Aspose.Words for .NET 14.6 Release Notes\n\nMajor Features\n\nThere are 104 improvements and fixes in this regular monthly release. The most notable are: \n\n* Support of automatic change tracking on a document \n* Added vertical text support to HTML\\Epub\\MHT \n* Footnote and endnote references now can be rendered as hyperlinks into output PDF \n* CJK (Chinese, Japanese, Korean) text is now properly rendered in multiline DrawingML textboxes \n* Default text AntiAliasing on Java is optimized for Chinese, Japanese and Korean fonts \n* Font substitution feature is added to public API\n\nAll Changes\n\nWORDSNET-10026 DocumentBuilder.InsertHtml changes the paragraph indentation Bug \nWORDSNET-10090 Text Frame position is changed after conversion from Doc to Pdf/Doc/Docx Bug \nWORDSNET-10112 Cell vertical alignment is not preserved during rendering to PDF Bug \nWORDSNET-10147 Hyperlinks do not work after conversion from RTF to Doc Bug \nWORDSNET-10163 Normal style's font size is not applied to text inside Table when importing HTML using InsertHtml method Bug \nWORDSNET-10170 Rendering of Cell's content in two line pushes some content to next page in PDF Bug \nWORDSNET-10171 Text in the shape is hided by gradient fill. Bug \nWORDSNET-10174 Inserting Image in table's cell does not fit according to table's cell Bug \nWORDSNET-10176 DOCX to RTF conversion missing keyword \\ftnbj Bug \nWORDSNET-10196 A paragraph is not Hyphenated during rendering Bug \nWORDSNET-10198 Document.PageCount returns wrong value Bug \nWORDSNET-10199 Background color and dimensions of TextBox Shapes are not preserved in rendered documents Bug \nWORDSNET-10201 /Justification text/ Debug.Assert occurs for document with new justification text. Bug \nWORDSNET-10215 Rendering DrawingML (SmartArt) issue while saving Docx to Doc/Png file format Bug \nWORDSNET-10217 InsertHtml inserts the # sign when document is converted to Doc file format Bug \nWORDSNET-10225 Space between ListLabel and List item is decreased after conversion from Docx to Pdf Bug \nWORDSNET-10230 Contents are missing after conversion from Docx to PNG/XPS/PDF (fixed file format) Bug \nWORDSNET-10240 Conversion of Rtf containing embedded docx to HTML (rendered image incorrect) Bug \nWORDSNET-10254 DocumentBuilder.InsertHyperlink inserts the # sign when document is converted to Doc file format Bug \nWORDSNET-10260 Acrobat Distiller is unable to process Aspose.Words generated PostScript file Bug \nWORDSNET-10265 A DrawingML in HeaderPrimary causes rendering of 129 blank pages in PDF Bug \nWORDSNET-10278 Document.AcceptAllRevisions hide the contents in output Doc/Docx/Pdf Bug \nWORDSNET-10291 Infinite loop detected during saving to PDF after applying Hyphenation Bug \nWORDSNET-10294 Infinite loop detected during saving to PDF after applying Hyphenation Bug \nWORDSNET-10304 CoverPage layout changes when imported to another document Bug \nWORDSNET-10315 Aspose.Words.FileCorruptedException is thrown while loading ODT file Bug \nWORDSNET-10327 Aspose.Words produces 100s of blank pages in PDF Bug \nWORDSNET-3654 Extra space at the top of the page when converted DOC to ODT Bug \nWORDSNET-3844 Field is not properly updated Bug \nWORDSNET-4461 Arrows above text are displaced upon rendering Bug \nWORDSNET-4587 Incorrect header layout Bug \nWORDSNET-4616 Table looks incorrect during rendering. Bug \nWORDSNET-4949 Image is given white background in ODT format Bug \nWORDSNET-5385 formatting of document is broken after rendering. Bug \nWORDSNET-5455 Paragraph shading is rendered shrinked. Bug \nWORDSNET-5493 Position of floating table is incorrect during rendering. Bug \nWORDSNET-5602 Extra pages are added during rendering. Bug \nWORDSNET-6238 H1, H2 tags don't use existing 'Paragraph Space After' value of Heading1 and Heading2 styles correctly Bug \nWORDSNET-6508 Text spacing is lost while rendering DOCX document to PDF Bug \nWORDSNET-6588 Doc to PDF conversion issue with image position Bug \nWORDSNET-6595 DrawingML images are causing incorrect rendering to PDF Bug \nWORDSNET-7434 A background image is incorrectly appeared on 2nd page in Pdf Bug \nWORDSNET-8206 OleFormat.IsLink return false for linked images Bug \nWORDSNET-8949 Spans with bidirectional text are not reordered during HTML import Bug \nWORDSNET-9268 MS Word doesn't wrap line with justify text alignment. Bug \nWORDSNET-9320 InsertHtml method changes formatting of Heading styles Bug \nWORDSNET-9409 DocumentBuilder.InsertHtml change the style of Heading 1 (font name/size) Bug \nWORDSNET-9411 Content of SDT content controls is not preserved in PDF Bug \nWORDSNET-9416 DocumentBuilder.InsertHtml changes the ParagraphFormat.StyleIdentifier Bug \nWORDSNET-9440 InsertHtml resets formatting of the current paragraph in DocumentBuilder Bug \nWORDSNET-9736 DocumentBuilder.InsertHtml loses the table formatting Bug \nWORDSNET-9762 DocumentBuilder.InsertHtml changes the style of Heading 3 (font name/size) Bug \nWORDSNET-9787 Doc to Pdf conversion issue with signature (Shape) rendering Bug \nWORDSNET-9887 Document.Save moves the frame's contents outside of the page Bug \nWORDSNET-9928 Aspose.Words produces a single page PDF Bug \nWORDSNET-9940 Document.AppendDocument issue with CustomXmlPart Bug \nWORDSNET-9944 UpdateFields does not include all items in TOC field Bug \nWORDSNET-9946 \"Repeat as a header row at the top of each page\" option is not working in PDF Bug \nWORDSNET-9947 MacroButton field value does not render in Tif file Bug \nWORDSNET-9986 MACROBUTTON field disappear after conversion from FlatOpc to PDF Bug \nWORDSNET-10083 Shape node does not preserve height/width after re-save the RTF Enhancement \nWORDSNET-10095 \"Page Number Start at\" value does not preserve after conversion from RTF to Docx Enhancement \nWORDSNET-10205 Improve font fallback for Arabic characters Enhancement \nWORDSNET-4257 Content inserted using DocumentBuilder.Write or InsertHTML does not inherit the alignment of the set style Enhancement \nWORDSNET-4692 Style Normal is not applied to paragraph inserted by InsertHtml. Enhancement \nWORDSNET-9370 Incorrect indentation of HTML code generated for fixed-page HTML documents Enhancement \nWORDSNET-10114 System.NullReferenceException is thrown while inserting HTML into Document Exception \nWORDSNET-10141 ArgumentExceptionOutOfRangeException occurs during rendering to PDF Exception \nWORDSNET-10202 Aspose.Words.FileCorruptedException occurs when loading DOCX file Exception \nWORDSNET-10226 System.InvalidOperationException is thrown while using Hyphenation Exception \nWORDSNET-10229 InvalidOperationException occurs during Open/Save a DOCX Exception \nWORDSNET-10245 Aspose.Words hangs while saving DOC as ODT Exception \nWORDSNET-10246 OverFlowException occurs when loading a Document Exception \nWORDSNET-10252 System.NullReferenceException is thrown while converting Doc to Pdf Exception \nWORDSNET-10253 System.IO.EndOfStreamException is thrown while getting size of a JPEG image Exception \nWORDSNET-10259 System.Xml.XmlException occurs during loading Doc into DOM Exception \nWORDSNET-10263 System.NullReferenceException is thrown while converting Docx to Pdf Exception \nWORDSNET-10268 ArgumentException occurs during saving a DOCX to image formats Exception \nWORDSNET-10289 InvalidOperationException occurs when saving to PDF after enabling Hyphenation Exception \nWORDSNET-10290 InvalidOperationException occurs when saving to PDF after enabling Hyphenation Exception \nWORDSNET-10292 InvalidOperationException occurs when saving to PDF after enabling Hyphenation Exception \nWORDSNET-10293 InvalidOperationException occurs when saving to PDF after enabling Hyphenation Exception \nWORDSNET-10297 ArgumentOutOfRangeException occurs when saving to PDF Exception \nWORDSNET-10302 Document.UpdateFields thorws System.NullReferenceException Exception \nWORDSNET-10310 Document.PageCount throws System.NullReferenceException Exception \nWORDSNET-9038 Aspose.Words.FileCorruptedException occurs when loading Docx file Exception \nWORDSNET-10048 Add feature to export custom properties of Word document as custom properties of PDF Feature \nWORDSNET-10106 Add an option in PdfSaveOptions to create Hyperlink for Footnote Feature \nWORDSNET-10155 Add vertical text support to HTML Export Feature \nWORDSNET-10220 Add vertical text support to EPUB Export Feature \nWORDSNET-6104 Add support of enclose characters for import/export. Feature \nWORDSNET-6105 Add support of combine characters for import/export. Feature \nWORDSNET-754 Make it possible to track all changes made programmatically Feature \nWORDSNET-7969 Support extraction of pictures from OLE objects in ODT Feature \nWORDSNET-8492 Detect \"Asian\" fonts e.g (SimSun) for Chinese text Feature \nWORDSNET-9642 Make it possible to manually add revisions Feature \nWORDSNET-10008 System.InvalidOperationException is thrown during MailMerge using IMailMergeDataSource Regression \nWORDSNET-10152 One extra page is rendered because of Font and Table size differences Regression \nWORDSNET-10156 The position of Arabic text is changed after conversion from RTF to Doc Regression \nWORDSNET-10258 Font color is not changed for all Runs visited by DocumentVisitor Regression \nWORDSNET-10313 Fix setting of two RTF default compatibility options: DoNotUseIndentAsNumberingTabStop and UseAnsiKerningPairs Regression \nWORDSNET-6726 Provide an option to choose the formatting inside HTML or of DocumentBuiler Regression \nWORDSNET-9421 InsertHtml method resets paragraph's style to 'Normal' Regression \nWORDSNET-9902 NullReferenceException is thrown while using Document.JoinRunsWithSameFormatting in IReplacingCallback.Replacing Regression",
  "requireLicenseAcceptance": true,
  "title": "Aspose.Words for .NET",
  "verbatimVersion": "14.6.0",
  "version": "14.6.0",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.21.06.24.06/aspose.words.14.6.0.json#Aspose.Words.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 3665,
      "fullName": "Aspose.Words.nuspec",
      "length": 10652,
      "name": "Aspose.Words.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.21.06.24.06/aspose.words.14.6.0.json#lib/net2.0/Aspose.Words.dll",
      "@type": "PackageEntry",
      "compressedLength": 3967916,
      "fullName": "lib/net2.0/Aspose.Words.dll",
      "length": 8643072,
      "name": "Aspose.Words.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.21.06.24.06/aspose.words.14.6.0.json#lib/net3.5-client/Aspose.Words.dll",
      "@type": "PackageEntry",
      "compressedLength": 3967107,
      "fullName": "lib/net3.5-client/Aspose.Words.dll",
      "length": 8637440,
      "name": "Aspose.Words.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.21.06.24.06/aspose.words.14.6.0.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9463,
      "fullName": ".signature.p7s",
      "length": 9463,
      "name": ".signature.p7s"
    }
  ],
  "tags": [
    "Word",
    "DOC",
    "DOCX",
    "OOXML",
    "OpenDocument",
    "PDF",
    "XPS",
    "ODT",
    "HTML",
    "XHTML",
    "WordprocessingML",
    "Document",
    "EPUB"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    }
  }
}