{
  "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.21.06.22.28/aspose.words.15.5.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "Aspose",
  "catalog:commitId": "599ca74d-06e8-4aa1-88a5-bcb01b4b4d99",
  "catalog:commitTimeStamp": "2018-10-21T06:22:28.966658Z",
  "copyright": "(C) Aspose 2002-2015. All Rights Reserved.",
  "created": "2015-06-07T12:07:59.763Z",
  "description": "Aspose.Words for .NET is a class library for .NET that enables you to perform a wide range of document processing tasks directly within your .NET applications.",
  "iconUrl": "http://www.aspose.com/images/products/dotnet/Aspose.Words_128x128.png",
  "id": "Aspose.Words",
  "isPrerelease": false,
  "lastEdited": "2018-10-21T06:22:04.11Z",
  "licenseUrl": "http://www.aspose.com/corporate/purchase/end-user-license-agreement.aspx",
  "listed": true,
  "packageHash": "RevkOP5Db706mlf6GAM6L4VVhBzKuH3382JsqPF/rXH0LORB7y/SvUOvRQEqQXtfT7TvzmSZM/WYljyHvoX/JA==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 10033319,
  "projectUrl": "http://www.aspose.com/categories/.net-components/aspose.words-for-.net/default.aspx",
  "published": "2015-06-07T12:07:59.763Z",
  "releaseNotes": "Aspose.Words for .NET 15.5 Release Notes\n\n\nMajor Features\nThere are 82 improvements and fixes in this regular monthly release. The most notable are: \n\n* CustomXML nodes are removed\n* Support for conditional blocks added to the LINQ Reporting Engine\n* Improved rendering of floating shapes in complex tables\n* Implemented Arabic Abjad list numbering style in the layout\n* Improved performance of importing HTML documents with complex CSS selectors\n* Improved positioning of floating shapes in HTML output\n* A document can now be rendered in a grayscale mode\n* Improved Far-Eastern characters rendering for PDF embedded fonts\n* Significantly improved time and size when rendering PDF documents with DrawingML text effects\n\n\nAll Changes\nKey Summary Category \nWORDSNET-10490 An image overlaps the other content when converting to HTML Bug \nWORDSNET-10764 Table's borders are missing after saving Docx to PDF/Docx/Doc Bug \nWORDSNET-10785 Contents position is changed after re-saving RTF Bug \nWORDSNET-11037 Table's border is changed after re-saving the Doc file Bug \nWORDSNET-11076 Word Online is not able to Edit Aspose.Words generated documents Bug \nWORDSNET-11182 Table borders are missing after re-saving Docx Bug \nWORDSNET-11241 Open/Save corrupts document Bug \nWORDSNET-11267 /footnote balancing/ Text flows to the next page (Doc to Pdf) Bug \nWORDSNET-11268 /footnote balancing/ Footnote position is changed (Doc to Pdf) Bug \nWORDSNET-11271 TabStops, Left and Hanging indent values of TOC items are not preserved by UpdateFields Bug \nWORDSNET-11273 CSS font size for table's content are not applied in output Doc/Docx/HTML Bug \nWORDSNET-11339 Text moves to next page after re-saving RTF Bug \nWORDSNET-11539 Underlines are getting removed in merged document Bug \nWORDSNET-11548 /footnotes/ Paragraph position is changed after conversion from Doc to pdf Bug \nWORDSNET-11678 Shapes do not render in output Pdf Bug \nWORDSNET-11735 UpdateField does not work for DocVariable/DocProperty with vertical tab Bug \nWORDSNET-11795 IF fields in bookmark text not resolving properly Bug \nWORDSNET-11800 Missing Embedding Font when renderring to PDF Bug \nWORDSNET-11809 Table borders become 'nil' during open/save a DOCX Bug \nWORDSNET-11810 Provide way to set id, name values of legacy control Bug \nWORDSNET-11819 Table border: border colour generated incorrect during Html to Word conversion Bug \nWORDSNET-11826 Docx to Pdf conversion issue with footer contents Bug \nWORDSNET-11840 Convert DOCX to PDF - repeat table headers problem Bug \nWORDSNET-11844 Content (Fields) position is changed after conversion from Doc to Pdf Bug \nWORDSNET-11864 Shape fill color is not set correctly using Color.FromArgb Bug \nWORDSNET-11880 Docx to Pdf conversion issue with Arabic Abjad numbering Bug \nWORDSNET-11896 Incorrect default font color of tables when importing an HTML document in Quirks mode Bug \nWORDSNET-11919 Text with shadow effect does not render correctly in Pdf Bug \nWORDSNET-11926 ShapeRenderer.Save messed up the text on the x-coordinate of chart in output Png Bug \nWORDSNET-11927 ShapeRenderer.Save does not save the x-coordinate of chart correctly in output Png Bug \nWORDSNET-5236 /export floating/ Position of floating shape is incorrect Bug \nWORDSNET-5263 Position of shape is incorrect Bug \nWORDSNET-5500 Shapes are removed and misplaced Bug \nWORDSNET-5825 RTF to PDF conversion page number issue Bug \nWORDSNET-6690 Lines rendered on different page Bug \nWORDSNET-6768 TextBoxes are laid out incorrectly in EPUB Bug \nWORDSNET-7998 Exception : Mail merge regions 'x' and 'y' overlap. Two regions cannot start/end in the same paragraph or occupy the same table row. Bug \nWORDSNET-8347 Mail Merge with formula that contain asterisk not working Bug \nWORDSNET-8609 /linked textbox reflow/ A line of text in TextBox is rendering inside another TextBox in PDF Bug \nWORDSNET-9670 Document.UpdateFields does not update the IF field Bug \nWORDSNET-9706 Mail Merge is not working with formatted date field using Mustache syntax Bug \nWORDSNET-10516 Provide a way to render documents with Grayscale effect. Enhancement \nWORDSNET-11543 Improve positioning of floating shapes in HTML output Enhancement \nWORDSNET-11640 Consider adding partial support for the 'min-width' CSS property on empty table cells Enhancement \nWORDSNET-11782 Transparent image backgrounds are displayed as black in HTML Enhancement \nWORDSNET-11805 Add descriptions for -aw properties Enhancement \nWORDSNET-11827 Support creating grayscale PDF Enhancement \nWORDSNET-11860 Shadow effect on a Drawing is incorrect during rendering to PDF Enhancement \nWORDSNET-11903 Docx to Pdf conversion issue with text position Enhancement \nWORDSNET-3306 Consider moving verifications in DocumentValidator to avoid creating zero-weight files. Enhancement \nWORDSNET-4796 Table style cell borders override direct table formatting borders Enhancement \nWORDSNET-10308 System.Security.Cryptography.CryptographicException is thrown while loading docx with digital signature Exception \nWORDSNET-11310 System.Security.Cryptography.CryptographicException is thrown while loading Docx Exception \nWORDSNET-11706 System.Security.Cryptography.CryptographicException is thrown while loading Docx Exception \nWORDSNET-11804 Shape.Fill.Color throws System.NullReferenceException Exception \nWORDSNET-11813 Stroke.Color throws System.InvalidCastException Exception \nWORDSNET-11822 ImportNode method throws System.ArgumentException Exception \nWORDSNET-11823 Aspose.Words.FileCorruptedException occurs when loading Aspose.Words generated DOCX file Exception \nWORDSNET-11834 Document.Print throws System.NullReferenceException Exception \nWORDSNET-11842 System.ArgumentOutOfRangeException is thrown while saving Docx to Pdf Exception \nWORDSNET-11917 Aspose.Words.FileCorruptedException occurs during loading a DOC Exception \nWORDSNET-11920 Fill.Color throws System.NullReferenceException Exception \nWORDSNET-11921 Fill.Color throws System.InvalidCastException Exception \nWORDSNET-10514 Provide code to manually insert watermark at the centre of each page Feature \nWORDSNET-10928 Add feature to change the name of 'Page' class when document is exported to HtmlFixed Feature \nWORDSNET-11496 Support GlossaryDocument features in DOC, DOT Feature \nWORDSNET-11704 FarEast layout should be calculated for each paragraph independently. Feature \nWORDSNET-11923 Support conditional blocks for the new reporting engine Feature \nWORDSNET-3197 Repeat only part of a paragraph instead of repeating whole paragraph durign mail merge with regions Feature \nWORDSNET-3301 Allow specifying \"Text Flow\" through PageSetup. Feature \nWORDSNET-3602 Consider updating invalid IF fields. Feature \nWORDSNET-50 Allow placing more reporting-syntax constructs in the documents Feature \nWORDSNET-6292 Consider adding FootnoteOptions.ExportAsComments property Feature \nWORDSNET-7055 Can not set Date value by using StructuredDocumentTag.FullDate Feature \nWORDSNET-7064 StructuredDocumentTag.DateDisplayLocale Property do not work Feature \nWORDSNET-11497 It takes hours of time and gigabytes of RAM to convert a DOCX to HtmlFixed Performance \nWORDSNET-11828 Process hangs during open save a RTF Performance \nWORDSNET-11832 Improve performance of CSS selector combinators Performance \nWORDSNET-11197 NullReferenceException is thrown while using InsertHtml Regression \nWORDSNET-11386 Bookmark.Text returns extra empty space using v14.12.0 Regression \nWORDSNET-11593 RestartPageNumbering doesnt work anymore in Word Regression \nWORDSNET-11789 Crop of images seems to be broken since 15.2 Regression",
  "requireLicenseAcceptance": true,
  "title": "Aspose.Words for .NET",
  "verbatimVersion": "15.5.0",
  "version": "15.5.0",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.21.06.22.28/aspose.words.15.5.0.json#Aspose.Words.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 3226,
      "fullName": "Aspose.Words.nuspec",
      "length": 8650,
      "name": "Aspose.Words.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.21.06.22.28/aspose.words.15.5.0.json#lib/net2.0/Aspose.Words.dll",
      "@type": "PackageEntry",
      "compressedLength": 4808318,
      "fullName": "lib/net2.0/Aspose.Words.dll",
      "length": 10509312,
      "name": "Aspose.Words.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.21.06.22.28/aspose.words.15.5.0.json#lib/net2.0/Aspose.Words.xml",
      "@type": "PackageEntry",
      "compressedLength": 200535,
      "fullName": "lib/net2.0/Aspose.Words.xml",
      "length": 1448086,
      "name": "Aspose.Words.xml"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.21.06.22.28/aspose.words.15.5.0.json#lib/net3.5-client/Aspose.Words.dll",
      "@type": "PackageEntry",
      "compressedLength": 4808239,
      "fullName": "lib/net3.5-client/Aspose.Words.dll",
      "length": 10514944,
      "name": "Aspose.Words.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.21.06.22.28/aspose.words.15.5.0.json#lib/net3.5-client/Aspose.Words.xml",
      "@type": "PackageEntry",
      "compressedLength": 200338,
      "fullName": "lib/net3.5-client/Aspose.Words.xml",
      "length": 1446994,
      "name": "Aspose.Words.xml"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.21.06.22.28/aspose.words.15.5.0.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9463,
      "fullName": ".signature.p7s",
      "length": 9463,
      "name": ".signature.p7s"
    }
  ],
  "tags": [
    "Word",
    "DOC",
    "DOCX",
    "OOXML",
    "OpenDocument",
    "PDF",
    "XPS",
    "ODT",
    "HTML",
    "XHTML",
    "WordprocessingML",
    "Document",
    "EPUB"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    }
  }
}