{
  "@id": "https://api.nuget.org/v3/catalog0/data/2015.02.08.02.19.52/wix.toolset.3.9.1006.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "Rob Mensching, Bob Arnson",
  "catalog:commitId": "06d93a51-47bc-4b45-a687-81ff0823232a",
  "catalog:commitTimeStamp": "2015-02-08T02:19:52.8783823Z",
  "created": "2014-11-04T14:48:48.727Z",
  "description": "This package contains the binaries needed to compile Windows Installer XML (WiX) setup projects. Just add this NuGet package to your WiX setup projects and you're done (no setup required on build servers etc.). Note that you still need to install WiX Toolset in Visual Studio to get the editor experience.\n\n        File issues with the NuGet package at https://github.com/akoeplinger/WiX.Toolset.NuGet",
  "iconUrl": "http://wixtoolset.org/Content/logo_framed.png",
  "id": "WiX.Toolset",
  "isPrerelease": false,
  "lastEdited": "2014-11-04T14:53:48.223Z",
  "licenseUrl": "https://github.com/akoeplinger/WiX.Toolset.NuGet/blob/v3.9.1006.0/LICENSE.md",
  "minClientVersion": "2.7",
  "packageHash": "Pc26YV7N7NovhjuzRzP6eNasRH2E130y5xk7LfGy3G6bqQPfkeirca13JtYbM/wIgxWPUvO/AOGkZzqWBlIvkw==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 23357661,
  "projectUrl": "https://github.com/akoeplinger/WiX.Toolset.NuGet",
  "published": "2014-11-04T14:48:49.43Z",
  "releaseNotes": "The WiX Toolset v3.9 release is version 3.9.1006.0.\n\nContributors:\n    @robmen\n    @barnson\n    @rseanhall\n    @jchoover\n    @heaths\n    @FernandoNunes\n    @flcdrg\n    @champloo\n    @firegiantco\n    @sryze\n    @gordonmcshane\n    @johnbuuck\n    @mavxg\n    @ericschultz\n\nMajor features:\n    @rseanhall lets you run a post-install configuration tool that requires elevated priveleges after a bundle is installed. #3249\n    @jchoover added update detection to the Burn engine. #4190\n    @jchoover updated the WiX installer to use the new update feature.\n    @rseanhall added support for multiple managed-BA pre-requisite packages. #4161\n    @rseanhall added support for secure string variables in Burn. #4299\n\nMinor features:\n    @heaths added the Windows \"Threshold\" compatibility GUID to Burn.\n    @FernandoNunes contributed localizations for Portuguese for WixSqlExtension.\n    @robmen updated the WiX release feed for the update functionality in the WiX installer. #4501\n    @barnson changed the WiX installer to install the native-code WiX SDK for Visual Studio Express editions.\n    @robmen marked deprecated command-line switches that are removed from WiX v4.0. #4188\n    @barnson added a verbose message that reveals how much time was spent running ICE validation.\n    @barnson made a few updates that made the WiX build faster on many-core machines.\n    @heaths added support for temporary object columns in DTF.\n    @flcdrg added support in DTF custom action builds to include COM interop reference assemblies.\n    @heaths added support for Visual Studio \"Dev14\" in WixVSExtension detection properties.\n    @heaths added support for user creation in WixUtilExtension to be non-vital (i.e., fail without causing rolling back). #4424\n    @rseanhall added a blocker to prevent .NET 4.5.2 from being used as a pre-req package on Windows 7 RTM because .NET 4.5.2 requires Windows 7 SP1. #4416\n    @heaths added policy support to move the Burn package cache to a non-default folder. #4278\n    @rseanhall added the WixBundleExecutePackageCacheFolder bundle variable. #3736\n    @robmen defaulted Burn to using hashes to verify payloads rather than digital signature. #4243\n    @barnson added the ProcessorArchitecture, WixBundleOriginalSourceFolder, and WixBundleFileVersion bundle variables. #4125 #4378\n    @gordonmcshane added .NET 4.5.2 package groups to WixNetFxExtension.\n    @johnbuuck added support for MSBuild v12.0 in project harvesting. #4279\n    @rseanhall added the @Cache=\"always\" value to force a bundle's package to be cached even if the package won't be installed. #3978 #4329\n    @heaths added a number of features and fixes to better support ref-counting and patching in Burn. #4241 #4242\n    @mavxg added User/@LogonAsBatchJob to WixUtilExtension.\n    @barnson added the -sextract switch to Melt.exe to not extract MSI package payloads but still update the .wixpdb. #4239\n\nFixes:\n    @robmen fixed a long-standing bug in WixStdBA that caused a hang when installing as local system on Windows Vista and Server 2008. #4114\n    @robmen fixed a bug dating from WiX v2.0(!) that caused bad modularization when keywords like OR were part of property names. #4513\n    @rseanhall fixed a nitty-gritty bug in DTF tools that created custom action DLLs that didn't exactly follow an arcane spec. #4502\n    @barnson fixed a bug in Burn that caused command lines to replicate like gray goo when a BA called Plan multiple times. #4510\n    @rseanhall added a missing extension to the binaries .zip.\n    @rseanhall made sure that that a bundle's bootstrapper application is the first payload in the UX container so Burn doesn't try to execute an arbitrary file. #4491\n    @jchoover tweaked the WiX installer to skip checking for updates when it doesn't make sense. #4481 #4488\n    @barnson fixed Burn so it resumes after rebooting. #4486\n    @barnson fixed Burn so it didn't ignore a rollback of a related bundle. #4456\n    @jchoover fixed some memory leaks in Burn. Also fixed some memory leaks in Burn.\n    @barnson fixed DTF so that it doesn't exclusively lock icons when reading them. #4466\n    @barnson solved the case of the mysteriously missing native-code SDK files. #4474 #4476\n    @barnson fixed Wix.sln by removing an obsolete file. #4473\n    @rseanhall made sure Burn cleans up a downloaded update when appropriate. #4472\n    @barnson made sure the WiX installer doesn't crash when you don't have a browser installed that knows about .html files. #4460\n    @barnson added a warning to the doc about a limitation with PerfCounterManifest. #4471\n    @rseanhall ensured that you can use LaunchTarget without LaunchArguments. #4470\n    @rseanhall changed DTF so it sets the working directory for a custom action. #4458\n    @rseanhall decided that Burn should decrypt files coming from an encrypted folder. #4459\n    @heaths converted, enhanced, and cleaned up some duplication in the WiX tests.\n    @heaths let you have an unreal table with way too many columns. #4431\n    @heaths optimized away the repair of dependent bundles of uninstalling a bundle is a no-op. #4430\n    @heaths showed progress in Burn when waiting on BITS to download. #4429\n    @heaths supported long command lines after rebooting in a bundle. #4425 #4427\n    @heaths optimized some Burn patch detection. #4366 #4420\n    @barnson validated MsiPackage product versions are legal for Burn (when using .msi packages built with something other than WiX, which apparently sometimes still happens) #4443\n    @barnson fixed a problem with a particular CustomTable definition. #3838\n    @champloo convinced tools to show an error rather than throw an exception when they can't set file attributes. #4097\n    @firegiantco made it possible to use any legal exit code in ExePackage/ExitCode/@Value. #4319\n    @barnson updated the list of tables that prevent patch uninstall. #4442\n    @sryze fixed the layout of a WixUI dialog when localized into Russian.\n    @rseanhall added verification to the VersionVariables for managed BAs. #3951\n    @rseanhall prevented Burn from entering an endless loop with a malformed command line. #3890\n    @robmen made sure error codes are reported during cache checking in Burn. #4288\n    @robmen pointed to new documentation on wixtoolset.org for error 0217. #4208\n    @barnson added a check of file size when determining whether a cabinet needs to be rebuilt in the linker. #3701\n    @barnson fixed the layout of a WixUI dialog for Portuguese. #4134\n    @barnson fixed a crash in Dark.exe. #4192\n    @barnson added some documentation about output type in Votive property pages. #4125\n    @barnson plugged a memory leak in Burn and removed some dead code. #4418\n    @rseanhall fixed Burn to ensure progress isn't above 100 percent. #3835\n    @barnson fixed compression level when set with MediaTemplate. #4410\n    @barnson added some documentation to clarify the things that change \"bitness\" when using the -arch switch. #4215\n    @barnson prevented infinite recursion of include files by enforcing a maximum depth. #4394\n    @rseanhall wielded the red pencil and improved the documentation.\n    @barnson restored MsuPackage's ability to set RemotePayload. #4384\n    @rseanhall supported DTF being installed into the GAC. #4163\n    @barnson clarified an error message about quotes in filenames. #4361\n    @ericschultz ensured that VsizPackage ids that contain spaces are quoted. #4328\n    @barnson fixed a crash in Heat. #4331\n",
  "requireLicenseAcceptance": false,
  "summary": "Windows Installer XML (WiX Toolset) binaries for compiling setup projects.",
  "title": "WiX Toolset (unofficial)",
  "version": "3.9.1006",
  "tags": [
    "WiX",
    "MSI",
    "Installer",
    "XML"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    }
  }
}