{
  "@id": "https://api.nuget.org/v3/catalog0/data/2015.02.02.20.54.22/aspose.words.11.10.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "Aspose",
  "catalog:commitId": "cace322e-0246-48cd-b4c0-cff253c0c370",
  "catalog:commitTimeStamp": "2015-02-02T20:54:22.0765075Z",
  "copyright": "© Aspose 2002-2011. All Rights Reserved.",
  "created": "2012-12-04T04:58:55.34Z",
  "description": "Aspose.Words for .NET class library supports DOC, DOCX, RTF, HTML, OpenDocument, PDF, XPS, EPUB and other formats. With Aspose.Words you can generate, modify, convert, render and print documents without utilizing Microsoft Word®",
  "iconUrl": "http://www.aspose.com/images/products/dotnet/Aspose.Words_128x128.png",
  "id": "Aspose.Words",
  "isPrerelease": false,
  "lastEdited": "0001-01-01T00:00:00Z",
  "licenseUrl": "http://www.aspose.com/corporate/purchase/end-user-license-agreement.aspx",
  "packageHash": "n/eZrSnjLq408mAzyGdagy9szWXS2aWijq4WCBG9CaTiEXnJUM+3TL66kvMjFh6eN4l0ZPPpblM3U70YlkY1+Q==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 14751026,
  "projectUrl": "http://www.aspose.com/categories/.net-components/aspose.words-for-.net/default.aspx",
  "published": "2012-12-04T04:58:55.34Z",
  "releaseNotes": "There are 171 improvements and fixes in this regular monthly release. The most notable are:\n\n• Gradient fills are exported to PDF now.\n• TOC (Table Of Contents) field update performance dramatically improved.\n• Supported the Object.Attr syntax for both merge fields and tags.\n• Shape handling improved. Text wrapping polygon info read/written.\n• SvgSaveOptions.ImageSavingCallback public API member added.\n• Range.ToDocument() public API member added.\n• Added an option to specify image compression to produce smaller output PDF files.\n• Optimized multipage PDF rendering.\n• Multiple enhancements in DrawingML charts rendering.\n• Improved floater object handling in code (performance and stability).\n• Improved performance for .NET 4.0.\n• Supported Asian Typography hanging punctuation.\n• Multiple improvements in RTL layout.\n\nThis release introduces the new features, enhancements and fixes to the excptions, bugs and regressions as detailed below:\n\n• New features\n\nWORDSJAVA-383\tPath gradient fill is not rendered to graphics on Java\nWORDSJAVA-533\tSupport path gradient brush\nWORDSJAVA-653\tExport gradient fills to PDF\nWORDSNET-1170\tAdd an option that controls how to export list labels to HTML\nWORDSNET-3518\tAllow getting Field from FieldChar's descendants\nWORDSNET-5471\tUnsupportedFileFormatException is thrown upon opening ODT document.\nWORDSNET-600\tSupport stuck ending punctuation\nWORDSNET-6696\tLoading DOCX is throwing Aspose.Words.FileCorruptedException\nWORDSNET-6771\t/stuck punctuation/ Doc to PDF conversion issue with page layout\nWORDSNET-6896\tWORDSNET-6804 Implement drawing of filled faces (without influence of light, considering z-coordinate)\nWORDSNET-6897\tWORDSNET-6804 Implement filling of faces with certain color\nWORDSNET-6926\tImplement node.ToDocument() function.\nWORDSNET-6930\tExport Bullet lists as UL and LI tags to HTML\nWORDSNET-6941\tWORDSNET-6968 Render axis title.\nWORDSNET-6942\tWORDSNET-6968 Render data labels\nWORDSNET-6945\tWORDSNET-6968 Render Error Bars.\nWORDSNET-6946\tWORDSNET-6968 Support rendering Pictures, Shapes and Textboxes on Chart Area\nWORDSNET-7007\tAdd Shape compression options\nWORDSNET-7145\tRead wrapping points from .docx file\nWORDSNET-7158\tSvgSaveOptions doesn't contains callback for saving resources\nWORDSNET-7236\tFile size of PDF files generated by Aspose.Words is too big.\nWORDSNET-7249\tRead/Write wrapping points from/to .rtf file.\nWORDSNET-7301\tSupport inline style attribute of anchor tag\n\n• Enhancements\n\nWORDSJAVA-645\tWORDSJAVA-608 Better support of Hebrew and Japanese for DateTime parsing and formatting\nWORDSNET-4606\t/text wrap:5/ Position of shapes is incorrect during rendering\nWORDSNET-4860\t/anchor push:20/ Support floater anchor push algorithm.\nWORDSNET-6094\tList with multiple levels is not converted correctly to HTML\nWORDSNET-6493\tDocx to HTML conversion issue with text position after Bullet symbols\nWORDSNET-6647\tTable cell widths calculation wrong for fixed preferred width tables.\nWORDSNET-6776\tWORDSNET-6968 Support fixed maximum and minimum values of axis\nWORDSNET-6866\tPNG images produced by latest Aspose.Words are all blured\nWORDSNET-6898\tWORDSNET-6804 Implement influence of light on color of face\nWORDSNET-6899\tWORDSNET-6804 Implement drawing of edges\nWORDSNET-6900\tWORDSNET-6804 Implement influence of light on color of edge\nWORDSNET-6986\tMake better support of complex bookmark on HTML export\nWORDSNET-7123\tUse shape's wrap points for building wrapping polygon.\nWORDSNET-7124\tCache wrapping polygon\nWORDSNET-7147\tNodeCollection refactoring\nWORDSNET-7152\ttext:display attribute of Section is not preserved during open/save\nWORDSNET-7154\tRework floater object creation and storage to prepare for tight wrapping and vertical alignment integration\nWORDSNET-7161\tWORDSNET-6804 Adjust shape boundaries during MHT rendering\nWORDSNET-7162\tPdfSaveOptions.NumeralFormat does not function as expected if page layout is already built\nWORDSNET-7163\tUpdate third party licenses list\nWORDSNET-7188\tPage Borders are getting distorted in PDF\nWORDSNET-7206\tInvestigate whether there is the better place to assign FallBack parent.\nWORDSNET-7210\tUpdate ExtractImageToFiles example to include DrawingML\nWORDSNET-7211\tPublish a list of the public API changes in the latest release\nWORDSNET-7228\tRework IsSvg function.\nWORDSNET-7234\tApsBoundingBoxCalculator clipping improvements\nWORDSNET-7238\tNot all the characters inserted in MERGEFIELD have same formatting\nWORDSNET-7241\tShading.ForegroundPatternColor return incorrect value for ODT file\nWORDSNET-7246\tImplement wrapping polygon calculation for a group shape\nWORDSNET-7255\tProblem in MailMergeRegions when remove empty paragraph\nWORDSNET-7261\tChart's data label invisible after Docx to PDF Conversion\nWORDSNET-7281\tImageSaveOptions.TiffCompression changes the color of image\nWORDSNET-7305\tSplitting Pdf into pages results in creation of all resources for every new Pdf\nWORDSNET-7323\tWORDSNET-6804 Fix incorrect projection for turned shape with direction == center.\nWORDSNET-7350\tContents are missing on converting Doc to Fixed file format.\n\n• Exceptions\n\nWORDSJAVA-635\tException on saving the document\nWORDSJAVA-636\tCreate Digitally Signed PDF Documents throws exception\nWORDSJAVA-638\tStyle.setName throws java.lang.ClassCastException\nWORDSNET-2395\t“InvalidCastException” exception occurs when try to save document in MergeField event handler.\nWORDSNET-3944\tOutOfMemoryException is thrown when try saving large docuemnt as RTF or DOC.\nWORDSNET-6144\tSystem.NullReferenceException occurs while moving the cursor to a table cell.\nWORDSNET-6187\tUpdateFields results in exception when a field uses a very specific value\nWORDSNET-6234\tInvalidOperationException occurs when specifying MailMergeCleanupOptions.RemoveEmptyParagraphs\nWORDSNET-6322\tException occur while converting Doc to PDf\nWORDSNET-6496\tUnknown shading texture index / InvalidOperationException occurs during rendering DOC to PDF\nWORDSNET-6619\tException while converting doc to pdf when PreserveFormFields = true\nWORDSNET-6708\tException thrown while appending document.\nWORDSNET-7063\tAspose.Words.FileCorruptedException occurs when loading DOCX file\nWORDSNET-7129\tInvalidOperationException occurs when specifying MailMergeCleanupOptions.RemoveEmptyParagraphs\nWORDSNET-7131\tArgumentOutOfRangeException occurs during rendering to PDF\nWORDSNET-7143\tException on working with Document/DocumentBuilder over IIS Express and IIS\nWORDSNET-7151\tException on loading Docx\nWORDSNET-7169\tshape.GetShapeRenderer() throws exception\nWORDSNET-7175\tException on converting Doc to HTML\nWORDSNET-7250\tNullReferenceException occurs upon Chart rendering.\nWORDSNET-7265\tException on loading ODT file.\nWORDSNET-7267\tException on loading Document\nWORDSNET-7268\tNullReferenceException occurs during rendering to PDF\nWORDSNET-7274\tException on loading TXT file\nWORDSNET-7275\tException on converting Doc to Fixed file format\nWORDSNET-7285\tDocument.Save throws exception on converting Docx to Fixed file format\nWORDSNET-7345\tException on Loading ODT file\nWORDSNET-7373\tInvalidOperationException occurs when specifying MailMergeCleanupOptions.RemoveEmptyParagraphs\n\n• Bugs\n\nWORDSJAVA-602\tImage gets dark when save Doc to Pdf.\nWORDSJAVA-637\tCopying styles doesn't work as expected when using StyleIdentifer\nWORDSJAVA-643\tSmall Jar Hell with Xerces-J\nWORDSJAVA-647\tWORDSJAVA-636 Time zone shift in certificate date\nWORDSJAVA-649\tFile name in hyperlink URL gets corrupted when exporting to PDF by using Aspose.Word for Java\nWORDSJAVA-650\tjava.lang.ArrayIndexOutOfBoundsException occurs during rendering to Pdf\nWORDSNET-5225\tLeft border of RTL table is lost\nWORDSNET-5226\tCentered floating table in RTL context is exported to HTML as left aligned\nWORDSNET-5458\tStyle applied to hyperlink is not imported.\nWORDSNET-5570\tText moves to the next row during rendering.\nWORDSNET-5589\tDOTX to DOT: DrawingML picture is not converting to Shape object\nWORDSNET-5724\tcss drop while converting html to png/tiff\nWORDSNET-5970\tWhile converting doc to mhtml, bullet points behaves like symbol and Times New Roman spaces.\nWORDSNET-6188\tThere should be at least a few pages of content before truncation in evaluation mode\nWORDSNET-6274\tSection break (Continues) in ODT is rendering as a Page Break in PDF\nWORDSNET-6893\tDocx to EPUB conversion issue, bullets displayed as question marks in output EPUB\nWORDSNET-6991\tUpdateFields calculates QUOTE field value incorrectly\nWORDSNET-7015\tParagraphs in Shape are overlapping each other during printing\nWORDSNET-7027\tIncorrect table position when rendering to fixed page formats\nWORDSNET-7033\tExtra Style are created while converting xlsm cell to Aspose.Words.Tables.Table.Cell\nWORDSNET-7067\tMailMergeCleanupOptions.RemoveUnusedRegions remove only top-level regions\nWORDSNET-7068\tDifferent cleanup behaviour for mail merge based on merged fields and templates\nWORDSNET-7070\tDocx to PDF conversion issue with text rendering\nWORDSNET-7080\tX and Y axis have incorrect numbering in DrawingMl charts in PDF\nWORDSNET-7084\tFloating table is rendering outside the Top edge of Page in PDF\nWORDSNET-7085\tDocument.UpdateFields call freezes when License is set\nWORDSNET-7086\tODT to HTML conversion issue with GroupShapes.\nWORDSNET-7087\tNull reference exception occurs when adding a new run to paragraph\nWORDSNET-7090\tNullReferenceException occurs during rendering to PDF\nWORDSNET-7101\tAspose.Words hangs during rendering.\nWORDSNET-7102\tUnexpected character appears during DOC to RTF to PNG conversion\nWORDSNET-7114\tShape in truncated at the bottom in page header on 2nd page in PDF\nWORDSNET-7115\tParagraphs in Shape are overlapping each other in PDF\nWORDSNET-7118\tIncorrect table row height, too small.\nWORDSNET-7119\tMath Type Equations not converted properly Docx to PDF\nWORDSNET-7120\tIncorrect page number alignment in page header\nWORDSNET-7121\tException when saving Doc to EPUB with ExportFontResources option\nWORDSNET-7122\tWord for MAC is unable to merge Aspose.Words generated document\nWORDSNET-7130\tContent is not rendering with correct Fonts in PDF\nWORDSNET-7133\tRegions contained in IF fields are not removed\nWORDSNET-7134\tPdfSaveOptions.ExportCustomPropertiesAsMetadata do not export custom properties\nWORDSNET-7139\tDoc to PDF conversion issue with form controls\nWORDSNET-7142\tObject.Attribute notation does not work when using IMailMergeDataSource\nWORDSNET-7157\tCan't save document as XamlFlow into the stream\nWORDSNET-7160\tODT Invisible field problem\nWORDSNET-7164\tExtra characters in Farsi Language (RTL) is inserted in PDF\nWORDSNET-7165\tDocx to HTML conversion issue with bookmarks\nWORDSNET-7167\tBorder LineStyle set as HairLine do not visible in output Docx/Docm\nWORDSNET-7168\tAlternate background color of Rows is lost during importing HTML\nWORDSNET-7172\tParagraph alignment is incorrect when importing HTML\nWORDSNET-7174\tDocx to Tiff conversion issue with shape\nWORDSNET-7177\tDocx to HTML conversion issue with chart rendering\nWORDSNET-7182\tDocm to PDF conversion issue with NumeralFormat.ArabicIndic\nWORDSNET-7183\tHTML Table Caption spans only first Cell instead of the entire table\nWORDSNET-7191\t<p> inside <li> which is nested in a <OL> is imported incorrectly\nWORDSNET-7199\tAspose.Words freeze on loading docx file\nWORDSNET-7202\tConsider exporting Table Alignment as 'align' instead of 'style:text-align' attribute to <div>\nWORDSNET-7207\tColumn width is imported incorrectly from HTML into Portrait Orientation of DOC\nWORDSNET-7213\tDrawingML is squeezed to occupy smaller space in PDF\nWORDSNET-7215\tBar chart's data point values are not rendering to PDF\nWORDSNET-7218\tThe scale at Y-axis has incorrect values in PDF\nWORDSNET-7220\tMin Max scale value and range of values in between are incorrect in PDF\nWORDSNET-7221\tDocument.UpdateFields call freezes\nWORDSNET-7223\tSection protection is lost when importing it to another Document\nWORDSNET-7224\tAspose.Words hangs during rendering to PDF\nWORDSNET-7230\tCell borders are not preserved when importing Mhtml file\nWORDSNET-7232\tParagraph is incorrectly aligned as Justified when importing MHTML\nWORDSNET-7239\tNot all Cells have correct Paragraph Alignment during Html import\nWORDSNET-7240\tAspose.Words hangs during rendering DOC to fixed page formats\nWORDSNET-7257\tPage numbering restarts at the beginning of the Sections in PDF\nWORDSNET-7271\tAspose.Words adds unwanted space between words\nWORDSNET-7276\tFont name attribute is visible in RTF that is generated by Aspose.Words\nWORDSNET-7288\tStructuredDocumentTag.Id Property return incorrect value\nWORDSNET-7290\tList numbering is not preserved during open/save\nWORDSNET-7307\tFont embedding problems in XPS\nWORDSNET-7322\tImage is misaligned and shifted towards the right page edge in Pdf\nWORDSNET-7325\tTrack Change history lost on converting RTF to Doc\nWORDSNET-7337\tCheckbox FormField is not preserved during rendering to Pdf\nWORDSNET-7346\tFieldChar.IsLocked Property do not work for Doc file format.\n\n• Regressions\n\nWORDSJAVA-490\tWhen Aspose.Words for Java 10.8.0 is used, the Aspose.Words.jdk14.jar is not working with JDK 1.4.2\nWORDSNET-7186\tMailMerge.Execute method throws exception\nWORDSNET-7237\tInvalidCastException occurs during open/save a DOCX\nWORDSNET-6876\tInvestigate why UpdatePageLayout is taking too long to build layout of page\n\n• Performance\n\nWORDSNET-7077\tConcurrent processing degrades Aspose.Words' performance",
  "requireLicenseAcceptance": true,
  "title": "Aspose.Words for .Net",
  "version": "11.10.0",
  "tags": [
    "Aspose.Words",
    "DOC",
    "DOCX",
    "RTF",
    "HTML",
    "OpenDocument",
    "XPS",
    "EPUB",
    "Word",
    "Document",
    "Processing"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    }
  }
}