{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.25.17.48.53/talking-tom-hero-dash-cheats.6.2.6.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "Thomas",
  "catalog:commitId": "afada079-2008-4db8-a824-b930db648699",
  "catalog:commitTimeStamp": "2022-01-25T17:48:53.3913841Z",
  "created": "2022-01-25T17:46:44.703Z",
  "description": "Talking Tom Hero Dash Hack Mod APK Get Unlimited Gems Cheats Generator IOS Android\n\nTalking Tom Hero Dash Hack [2021 WORKING] Unlimited Gems Android | iOS ! 100% Work Today, we got the Talking Tom Hero Dash Hack at your service. This really is an Talking Tom Hero Dash ONLINE Hack, which could generate Unlimited number of Gems to your game account. This is the sole place online to get working cheats for Talking Tom Hero Dash and became the most effective player in this great game. If you wish to take your game to a different level and improve your odds for winning, you need to use free of charge now our amazing Talking Tom Hero Dash Hack Online Cheat Tool. Talking Tom Hero Dash Cheat Tool can be acquired for your Android or iOS device, it features a user-friendly interface and is simple manageable.\n\n➡ ➡ ➡ GET IT HERE: https://help4play2.win/TalkingTomHeroDash/\n\nThis Talking Tom Hero Dash hack online generator is undetectable because of proxy connection and our safety system. It's 128-bit SSL, to produce your account as safe as you are able to so don't bother about bans. Our Talking Tom Hero Dash Hack has very simply interface to produce it simple to use. Our hacks are always up to date and they are made for every one of iOS and Android devices.By having Unlimited Gems, you'll dominate the Talking Tom Hero Dash game and win all challenges.This really is the key reason why many top players in the overall game uses our tool. Talking Tom Hero Dash Hack Generator Screenshot!!! Use Talking Tom Hero Dash Hack cheats online generator for players to get Gems Talking Tom Hero Dash Hack Tool available for Browser, Android and IOS, it will allow you to Get unlimited Gems, easy to use and without downloading. This Generator Talking Tom Hero Dash Cheat was set up by the Famous Team \"UNV Cheat Games\" and will allow you to add as many Gems as you want without connecting and remotely directly on the web, because our Generator sends processed data to get information from the official game servers. So if you're stuck somewhere, or just for fun, or to go beyond a level where you're struggling or to become one of the best players use our Generator and get what ever you want. Our Generator Encrypt Data to ensure maximum protection and minimal risk. Did you prefer not to buy Gems just get them for free? Or you need an updated Talking Tom Hero Dash Hack that worked on their current version? Well, it is so easy even a 10-year-old child can do it! And it’s true hack for Gems can get you ahead in this game . But there are few problems that most people encountered, outdated Talking Tom Hero Dash Hack cheats are one of them. This new version of our Talking Tom Hero Dash Hack Tool will never make you run out of Gems anymore. our developers made sure that our Talking Tom Hero Dash cheats will let you enjoy the potential of this top action game in Talking Tom Hero Dash fans know that each player wants a better equipe or players.\n\n➡ ➡ ➡ GET IT HERE: https://help4play2.win/TalkingTomHeroDash/",
  "id": "Talking-tom-hero-dash-cheats",
  "isPrerelease": false,
  "lastEdited": "2022-01-25T17:48:48.76Z",
  "listed": false,
  "packageHash": "EOAAyI7Q91ptB5LP18WrWA7LpBJ04LQ//B8hvFKvHxPIaFvttmr3ISQUFPLtezTtgYzoIjB6iZZIBJxFVtyyhQ==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 14027,
  "published": "1900-01-01T00:00:00Z",
  "requireLicenseAcceptance": false,
  "title": "Talking Tom Hero Dash cheats",
  "verbatimVersion": "6.2.6",
  "version": "6.2.6",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.25.17.48.53/talking-tom-hero-dash-cheats.6.2.6.json#Talking-tom-hero-dash-cheats.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1559,
      "fullName": "Talking-tom-hero-dash-cheats.nuspec",
      "length": 3472,
      "name": "Talking-tom-hero-dash-cheats.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.25.17.48.53/talking-tom-hero-dash-cheats.6.2.6.json#lib/_._",
      "@type": "PackageEntry",
      "compressedLength": 0,
      "fullName": "lib/_._",
      "length": 0,
      "name": "_._"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.25.17.48.53/talking-tom-hero-dash-cheats.6.2.6.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9471,
      "fullName": ".signature.p7s",
      "length": 9471,
      "name": ".signature.p7s"
    }
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}