{
  "@id": "https://api.nuget.org/v3/catalog0/data/2015.04.02.01.09.04/aspose.words.15.3.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "Aspose",
  "catalog:commitId": "328cc630-a868-482d-aeb0-1faf201a604b",
  "catalog:commitTimeStamp": "2015-04-02T01:09:04.7615589Z",
  "copyright": "(C) Aspose 2002-2015. All Rights Reserved.",
  "created": "2015-04-02T01:08:08.807Z",
  "description": "Aspose.Words for .NET is a class library for .NET that enables you to perform a wide range of document processing tasks directly within your .NET applications.",
  "iconUrl": "http://www.aspose.com/images/products/dotnet/Aspose.Words_128x128.png",
  "id": "Aspose.Words",
  "isPrerelease": false,
  "lastEdited": "0001-01-01T00:00:00Z",
  "licenseUrl": "http://www.aspose.com/corporate/purchase/end-user-license-agreement.aspx",
  "packageHash": "KJg9jqQ4sB+F9cBeeb9W3I9ArClWZV4h42SEywC0toPksMvlE7KafxW/SmXZX9UvWy6QQgwkiqVA8eeiBHvDdg==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 10035747,
  "projectUrl": "http://www.aspose.com/categories/.net-components/aspose.words-for-.net/default.aspx",
  "published": "2015-04-02T01:08:08.807Z",
  "releaseNotes": "Aspose.Words for .NET 15.3 Release Notes\n\nMajor Features\n\nThere are 131 improvements and fixes in this regular monthly release. The most notable are: \n\n* Improvements in the layout engine for handling RTL text, text boxes, cell vertical alignment and others.\n* Improvements in import/export for all file formats.\n* Optimized output size of PDF documents for some cases.\n* Document.WarningCallback property can now send you loss of formatting warnings at anytime during document lifetime, not only during saving.\n* Fields are now updated inside DrawingML shapes.\n* ShapeRenderer.OpaqueBoundsInPoints returns the \"real\" shape bounds.\n* Improvements in rendering of fills, 3D text effects and others.\n* The BARCODE field is supported now so you can add a custom barcode generator.\n\nAll Changes\n\nKey Summary Category \nWORDSNET-10007 Fields in shapes // Aspose.Words does not update SECTIONPAGES fields automatically Bug \nWORDSNET-10356 DocumentBuilder.InsertImage lose original size of image Bug \nWORDSNET-10466 Doc to Pdf conversion issue with SYMBOL 168 Bug \nWORDSNET-10626 Doc to RTF conversion issue with TextBox orientation Bug \nWORDSNET-10644 Comments indication are shifted to the right in FF/Chrome for the document Bug \nWORDSNET-10649 Aspose.Words generated PDF output does not match MS Word Bug \nWORDSNET-10811 Aspose.Words corrupts the document when saving from DOCX to WordML Bug \nWORDSNET-10881 Bullets are missing from SmartArt when Docx is exported to Pdf/Doc Bug \nWORDSNET-10907 Image width/height are not being set correctly in DOCX when aspect ratio is locked Bug \nWORDSNET-11003 Text position is changed after conversion from Docx to Pdf Bug \nWORDSNET-11004 DrawingML.Width and DrawingML.Height do not work Bug \nWORDSNET-11019 Doc to Pdf conversion issue with footer's contents Bug \nWORDSNET-11036 Table's header row is missing after re-saving the Doc file Bug \nWORDSNET-11038 Position of table's contents are changed after re-saving Doc file Bug \nWORDSNET-11065 Document.Save corrupts the Hyperlinks Bug \nWORDSNET-11075 Bug whereby comments appear in wrong place when converting RTF to Word format Bug \nWORDSNET-11133 The text formatting of DrawingML is lost after converting from Docx to Pdf/HTML Bug \nWORDSNET-11134 Text color of DrawingML is lost after conversion from Docx to Pdf/Html/Doc/Docx Bug \nWORDSNET-11149 Blue lines appear when converting a flow chart to PDF Bug \nWORDSNET-11168 Tab characters are added after re-saving RTF Bug \nWORDSNET-11203 Incorrect representation of RTL text in HTML DOM Bug \nWORDSNET-11248 Bookmark position is changed after conversion from Doc to Html Bug \nWORDSNET-11252 Border should not be visible in Aspose.Words generated output documents Bug \nWORDSNET-11262 Some entries of TOC are pushed down to the next page in PDF Bug \nWORDSNET-11277 HTML to Docx/Doc issue with left indentation Bug \nWORDSNET-11291 Docx to Pdf conversion issue with left indentation of list items Bug \nWORDSNET-11324 Issues with table heights in PDF Bug \nWORDSNET-11340 Html to Doc/Pdf/Html conversion issue with Arial black font Bug \nWORDSNET-11352 ParagraphFormat.LeftIndent return incorrect value Bug \nWORDSNET-11355 Incorrect Y position is returned by LayoutEnumerator Bug \nWORDSNET-11357 Twip-based attributes with fractional parts rounds up for DOCX or WML. Bug \nWORDSNET-11418 Track changes on pictures issue during DOCX to HTML conversion Bug \nWORDSNET-11422 Hyperlink is chagned after covnersion from Doc to Doc/Docx Bug \nWORDSNET-11433 Doc to Docm conversion issue with embedded images Bug \nWORDSNET-11474 Document.PageCount returns wrong value Bug \nWORDSNET-11475 A DrawingML is not preserved during open/save a DOC Bug \nWORDSNET-11508 Conversion into Postscript, special characters (german Umlauts) get lost Bug \nWORDSNET-11514 LoadOptions.WebRequestTimeout ignores the web request time out Bug \nWORDSNET-11520 Issue with font family which is not reflected in Word document Bug \nWORDSNET-11528 Document locks up Aspose.Words while getting page count. Bug \nWORDSNET-11537 Docx to fixed file format conversion issue with STYLEREF Bug \nWORDSNET-11541 WORDSNET-10264 was not resolved in 14.10.0 Bug \nWORDSNET-11549 Conditional Merge fields causing whole document to not merge Bug \nWORDSNET-11561 Assertion on Part.Height less than 0 for a text box Bug \nWORDSNET-11562 Table's contents are missing after conversion from Docx to Pdf Bug \nWORDSNET-11572 Chart data values overlap Pie chart's graphical area Bug \nWORDSNET-11573 Bookmark's contents are not visible after conversion from Docx to Docx/Doc/Pdf Bug \nWORDSNET-11574 Document.Save method does not stop while converting Docx to Png Bug \nWORDSNET-11583 When converting Word document to PDF, there are additional empty pages Bug \nWORDSNET-11587 Some elements of a wmf image are missing in AW pdf output Bug \nWORDSNET-11595 Complete image inside INCLUDEPICTURE is not visible after mail merge Bug \nWORDSNET-11596 Shape.SizeInPoints returns incorrect value if shape is child node of GroupShape Bug \nWORDSNET-11600 A picture overlaps Table in HtmlFixed Bug \nWORDSNET-11613 Images in .DOC files being shifting to LEFT on save Bug \nWORDSNET-11675 DocumentBuilder.InsertImage causing Wrapping error Bug \nWORDSNET-3922 Huge DOCX document failed to load Bug \nWORDSNET-4985 UnsupportedFileFormatException is thrown when try to open ODT document. Bug \nWORDSNET-5444 Paragraph down border is rendered incorrectly inside the text box. Bug \nWORDSNET-5477 Content is moved outside textbox after rendering. Bug \nWORDSNET-5479 Image effects are lost after updating page layout. Bug \nWORDSNET-5623 Aspose.Words returns incorrect indents. Bug \nWORDSNET-5726 Specified Alpha color component in Shape.FillColor exported incorrectly to DOCX Bug \nWORDSNET-6037 /aps/ Page border should be rendered behind the comments Bug \nWORDSNET-6186 Run.Font.Bold returns incorrect value Bug \nWORDSNET-6221 Text overlapped while Converting Word document to PDF. Bug \nWORDSNET-7264 /shading bounds/ Paragraph shading overlaps wrapped image in PDF Bug \nWORDSNET-7438 Conversion of MS Word document to HTML issue with overlapped shapes Bug \nWORDSNET-7497 DML rescaling does not work when specifying non-uniform aspect ratio Bug \nWORDSNET-8580 RTF to Pdf conversion issue with content rendering at first page Bug \nWORDSNET-9695 Docx to Html conversion issue with image position Bug \nWORDSNET-9975 /aps/ /trailing space shading/ The last letter is cut off after conversion from Docx to Pdf Bug \nWORDSNET-9982 Fields in shapes // Aspose.Words does not update TIME and DATE fields automatically Bug \nWORDSNET-9983 Fields in shapes // Aspose.Words does not update NUMPAGES, PAGE fields automatically Bug \nWORDSNET-10617 Add feature to implement IWarningCallback for Document.RenderToSize method Enhancement \nWORDSNET-10900 Issue with resizing DrawingML node Enhancement \nWORDSNET-10923 Aspose.Words.FileCorruptedException occurs when specifying password via LoadOptions Enhancement \nWORDSNET-10949 Document.AppendDocument throws System.ArgumentException for cloned documents Enhancement \nWORDSNET-11302 Footer position is changed after conversion from Docx to Pdf Enhancement \nWORDSNET-11403 Throw warning using IWarningCallback when an image is unavailable Enhancement \nWORDSNET-11490 Doc to Pdf conversion issue with footer position Enhancement \nWORDSNET-11502 DrawingML shape that simultaneously has 3D effect and others effects is rendered incorrectly (except simultaneous applying three effects - 3D effect, Outer shadow and Reflection) Enhancement \nWORDSNET-11511 Header content does not render correctly in HtmlFixed Enhancement \nWORDSNET-11609 Frames with inline shapes truncated, wrapped incorrectly in a multi-column section Enhancement \nWORDSNET-2268 Consider support of CSS3 paged media attributes Enhancement \nWORDSNET-4167 Page Background specified using picture is not displayed in HTML. Enhancement \nWORDSNET-4195 Space appears between two inline images in HTML output Enhancement \nWORDSNET-4580 Size of image is incorrect after inserting to document. Enhancement \nWORDSNET-5818 document to pdf conversion, shape width increase Enhancement \nWORDSNET-6133 Space between number and text in a heading is incorrect when rendering Enhancement \nWORDSNET-6273 Docx to PDF conversion issue with table Enhancement \nWORDSNET-6494 Table is not being rendered properly during conversion DOC to PNG Enhancement \nWORDSNET-6593 Text formatting issue while converting Docx to Pdf Enhancement \nWORDSNET-6684 Table in footer has incorrect width. Enhancement \nWORDSNET-6711 Docx to PDf conversion issue, text misplaced Enhancement \nWORDSNET-8780 Position of floating DrawingML is incorrect after exporting Docx to HTML Enhancement \nWORDSNET-9679 Bullet symbols in SmartArt are not rendering in Pdf Enhancement \nWORDSNET-10619 System.TypeInitializationException occurs when creating Document instance Exception \nWORDSNET-11088 Document.UpdatePageLayout throws System.InvalidOperationException Exception \nWORDSNET-11183 System.InvalidOperationException is thrown while saving Docx to Pdf Exception \nWORDSNET-11491 System.StackOverflowException is thrown while saving doc to pdf Exception \nWORDSNET-11507 Null Pointer Exception with MergeFields execute Exception \nWORDSNET-11519 NodeImporter.ImportNode throws System.ArgumentException Exception \nWORDSNET-11522 System.InvalidOperationException occurs during rendering DOCX to PDF Exception \nWORDSNET-11523 System.InvalidOperationException occurs during rendering DOCX to PDF Exception \nWORDSNET-11524 System.InvalidOperationException occurs during rendering DOCX to PDF Exception \nWORDSNET-11526 System.StackOverflowException during rendering to PDF Exception \nWORDSNET-11535 Document.Save throws System.InvalidOperationException Exception \nWORDSNET-11544 Document.Save throws System.ArgumentOutOfRangeException Exception \nWORDSNET-11576 Stroke.Color throws System.NullReferenceException Exception \nWORDSNET-11580 Aspose.Words.FileCorruptedException is thrown while loading Docx Exception \nWORDSNET-11621 System.NullReferenceException occurs during saving a DOCX Exception \nWORDSNET-11635 System.NullReferenceException occurs during saving a DOCX Exception \nWORDSNET-11637 System.NullReferenceException occurs during saving a DOC to PDF Exception \nWORDSNET-11644 System.ArgumentOutOfRangeException is thrown while re-saving Docx Exception \nWORDSNET-11651 System.NullReferenceException is thrown while re-saving Docx Exception \nWORDSNET-11673 Stroke.Color throws System.NullReferenceException Exception \nWORDSNET-10775 Add feature to support HTML TextArea tag to load into DOM same as MS Word does Feature \nWORDSNET-10812 Aspose.Words corrupts the document when saving from DOCX to WordML Feature \nWORDSNET-10944 Support for DISPLAYBARCODE merge field Feature \nWORDSNET-11443 Export Content Controls as SDT tags in HTML Feature \nWORDSNET-5742 Implement support for new AbsolutePositionTab model node. Feature \nWORDSNET-11009 Document.UpdateFields takes time to update fields Performance \nWORDSNET-11109 Document.UpdatePageLayout takes much time to complete Performance \nWORDSNET-11450 Excessive PDF output file size issue Performance \nWORDSNET-11525 Bad rendering performance Performance \nWORDSNET-11559 Document.UpdatePageLayout or MHTML to PDF hangs if ResourceLoadingAction.Skip is set Performance \nWORDSNET-11447 System.NullReferenceException occurs when calling ToString(SaveFormat.Text) Regression \nWORDSNET-11465 Incorrect brackets in RTL text when saving to fixed formats Regression \nWORDSNET-11516 When converting Word file to PDF logo placed in header drops into main document Regression \nWORDSNET-11558 BookmarkStart.remove() causes an IllegalStateException Regression \nWORDSNET-11633 DocumentBuilder.InsertImage causing Wrapping error Regression",
  "requireLicenseAcceptance": true,
  "title": "Aspose.Words for .NET",
  "version": "15.3.0",
  "tags": [
    "Word",
    "DOC",
    "DOCX",
    "OOXML",
    "OpenDocument",
    "PDF",
    "XPS",
    "ODT",
    "HTML",
    "XHTML",
    "WordprocessingML",
    "Document",
    "EPUB"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    }
  }
}