{
  "@id": "https://api.nuget.org/v3/catalog0/data/2018.05.24.10.44.15/gnostice.web.typescript.18.1.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "Gnostice Information Technologies",
  "catalog:commitId": "a92c5523-3c2d-4a6e-a14c-5af7f391da9e",
  "catalog:commitTimeStamp": "2018-05-24T10:44:15.1078164Z",
  "copyright": "© 2002-2018 Gnostice Information Technologies Private Limited. All rights reserved.",
  "created": "2018-05-24T10:39:29.27Z",
  "description": "Gnostice XtremeDocumentStudio .NET Multi-format ASP.NET Document Viewer is the next-generation multi-format document-viewing technology for .NET developers. The DocumentViewer control supports viewing, form-filling, text searching (with OCR support) and printing PDF, DOCX, DOC, TXT, BMP, JPEG, PNG, WMF, EMF, and single-page and multi-page TIFF. It works on both desktop(Windows 7, Windows 8.1, Windows 10, Linux, Mac OS X) and mobile browsers (IOS, Android, Windows Phone).",
  "iconUrl": "http://www.gnostice.com/images/ICON_xtremedocumentstudio_dot_net.png",
  "id": "Gnostice.Web.TypeScript",
  "isPrerelease": false,
  "lastEdited": "2018-05-24T10:43:38.043Z",
  "licenseUrl": "http://www.gnostice.com/XtremeDocumentStudio_dot_NET.asp?show=licenses",
  "listed": true,
  "packageHash": "5NCXj2CEeo24s+ko1MFCtA55DwpsrxxIboe/PL6Ip6Vt2EilSWQ0bJB2vS50YPgH1c25RvPVsXP0cdvOtDUDvQ==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 16305,
  "projectUrl": "http://www.gnostice.com/XtremeDocumentStudio_dot_NET.asp",
  "published": "2018-05-24T10:39:29.27Z",
  "releaseNotes": "Version 2018 R1 - May 24th, 2018\n=============================\nEnhanced\n~~~~~~~~\n- ASP.NET Document Viewer\n\t- appSettings (in Web.Config)\n\t\t- Introduced an additional option for \"DocumentCache\" property to cache the input document to database.\n\t\t- Introduced \"DBConnectionStringName\" property to specify the database connection string name.\n\t\t- Introduced “DBCleanupRetentionTime” property to specify the number of days to retain a document’s processed data since the time the document was last viewed.\n\t\t- Introduced “DBCleanupIntervalTime” property to specify the database cleanup time in days.\n\t\t- Renamed the option “License-Key” to “LicenseKey”.\n\t- Server-side features:\n\t\t- Introduced new document cache store (database). This enables efficient document viewing, especially when using multiple servers in a load-balanced setup.\n\t- Client-side features:\n\t\t- Introduced loadDocumentFromServer(serverDocumentPath: string) API to view document from server document path.\n\t\t- Animation is added for progressive page count for flow-based documents.\n- WinForms Document Viewer\n\t- Introduced a new property “MouseMode” in DocumentViewer to change the mouse pointer actions. It provides three options: pan, selection and marquee zoom.\n\t- Introduced area selection in the document viewer control.\n\t- Introduced drag and zoom feature in document viewer control.\n\t- Implemented Zonal OCR, where an area can be selected through viewer and the cropped image of the selected area is returned through a mouse event and the image can be sent to digitization engine to make it searchable.\n- XtremeDigitizationEngine\n\t- Added image preprocessing techniques to improve accuracy of recognized text.\n\t- Upgraded to Tesseract version 3.0.2\n- Word Engine\n\t- Added functionality to optionally enable \"WordPerfect 6.x for Windows\" style text justification.\n\nFixed\n~~~~~\n- ASP.NET Document Viewer\n\t- Incorrect handling of Bookmarks in disk caching.\n\t- Incorrect handling of radio buttons at client side when its radio items are in different pages.\n\t- Font color is not considered while rendering form fields.\n\t- Radio button’s interactivity is lost due to Z-index issue.\n\t- Form field parsing issue where the caption of push button is not being fully read.\n\t- Checkboxes which acts as radio buttons are not checked while rendering.\n- PDF Engine\n\t- Updated fault tolerance logic to handle faults such as incorrect xref offset specified in startxref, null reference exception if a valid PDF object is not present, same object offsets values in xref table entries and incorrect /Prev entry in the trailer dictionary.\n\t- Bookmarks’ actions modification issue where the edited bookmarks changes are not saved in the output document.\n\t- Text field rendering issue where the flags are not processed for a child textfield.\n\t- Individual glyph positioning value specified before first character in TJ operator is not handled.\n\t- FontList.XML file is not created when the base directory doesn’t have write permission. So creation path is changed to temporary folder.\n\t- Formfield’s coordinates are calculated relative to the current page even if the field does not belong to the page.\n\t- Saving the document results in blank pages when the page content stream in the loaded document already contains a new-line character at the beginning of the stream.\n\t- Captions of push button not being read correctly from the appearance stream when the caption is split across multiple text rendering operators.\n- Word Engine\n\t- DOCX rendering issue where image in the header and table are not rendered.\n\t- Table rendering issue where paragraph borders inside the nested table cells are overflowing.\n\t- Table rendering issue where the text position is incorrect inside the table.\n\t- Exception thrown when rendering Text run which has a zero font size.\n\t- DOC format parsing issue where the engine hangs when a corrupted file is loaded.\n\t- Rendering Issue where table row overflowing a page is not being handled correctly.\n\t- Rendering Issue where table row with \"cantSplit\" property set to true is not being handled correctly.\n\t- Rendering Issue where table rows with \"exact\" height is not being handled correctly\n\t- If a numbered paragraph in a table cell overflows to a new page then the overflowed text is not being laid out properly.\n\t- Incorrect clipping of rectangles while rendering table cell contents.\n\t- Page wise conversion from DOCX to text produces files with incorrect contents.\n\t- Exception thrown when converting DOCX to HTML because of invalid URI in the document.\n\t- Minor theme fonts are not parsed properly resulting in using incorrect font while rendering DOCX file.\n\t- Text lines are not rendered properly when a paragraph has spaces at the end of the line and it is out of boundary.\n\t- Alternate font not being considered resulting in rendering text with wrong font.\n\t- Parsing issue with different locales.\n\t- Line spacing is not applied to an empty paragraph resulting in less paragraph spacing.\n\t- Incorrect paragraph spacing when paragraph contains section break.\n\t- Increase in table height when there are nested tables as an extra paragraph spacing is added in the end.\n\t- Trailing spaces are not ignored when aligning a paragraph to right or center resulting in wrong alignment.\n\t- Rendering issue where Default table style is not being applied.\n\t- Words and characters are bunching up together due to insufficient inter-word and inter-character spacing.\n\t- DOC rendering issue with Large headers resulting in infinite page rendering.\n- Spreadsheet Engine\n\t- Byte order is not considered while parsing cell formats. It is always parsed in single byte order resulting in wrong cell format.\n\t- Incorrect calculation of cell value while parsing when it has a floating point number.\n\t- XLSX parsing issue where “Very Hidden” sheet state is not handled resulting in incorrect rendering.",
  "requireLicenseAcceptance": true,
  "summary": "TypeScript Definitions (d.ts) Gnostice XtremeDocumentStudio .NET ASP.NET Document Viewer",
  "title": "Gnostice.Web.TypeScript.Declarations",
  "verbatimVersion": "18.1.0",
  "version": "18.1.0",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.05.24.10.44.15/gnostice.web.typescript.18.1.0.json#Gnostice.Web.TypeScript.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 3128,
      "fullName": "Gnostice.Web.TypeScript.nuspec",
      "length": 7774,
      "name": "Gnostice.Web.TypeScript.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.05.24.10.44.15/gnostice.web.typescript.18.1.0.json#Content/Scripts/typings/gnostice.xtremedocumentstudio/documentviewer.d.ts",
      "@type": "PackageEntry",
      "compressedLength": 11112,
      "fullName": "Content/Scripts/typings/gnostice.xtremedocumentstudio/documentviewer.d.ts",
      "length": 75269,
      "name": "documentviewer.d.ts"
    }
  ],
  "tags": [
    "ASP.NET",
    "Web-PDFViewer",
    "ASP.NET-PDF-Viewer",
    "Web-document-Viewer",
    "pdfviewer",
    "documentviewer",
    "asp.netpdfviewer",
    "asp.net-mvc-viewer",
    "htmlpdfviewer",
    "Document",
    "Viewer",
    "PDF",
    "DOCX",
    "DOC",
    "TIFF",
    "JPG",
    "BMP",
    "PNG",
    "image",
    "viewer",
    "Printer",
    "tiffviewer",
    "docxviewer",
    "docviewer",
    "imageviewer",
    "OCR",
    "Search",
    "FormFilling"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    }
  }
}