{
  "@id": "https://api.nuget.org/v3/catalog0/data/2015.02.07.15.55.12/aspose.diagram.5.0.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "Aspose",
  "catalog:commitId": "7b4fd5f6-bfff-41f7-833c-e3dd4768011b",
  "catalog:commitTimeStamp": "2015-02-07T15:55:12.4325309Z",
  "copyright": "© Aspose 2002-2013. All Rights Reserved.",
  "created": "2015-01-16T03:21:57.117Z",
  "description": "Aspose.Diagram is a class library for working with Microsoft Visio files. It allows developers to create new diagrams and work with VSD, VSDX, VSS, VST, VSX, VTX, VDW and VDX files on ASP.NET web applications, web services and Windows applications. It allows you to open files and manipulate the elements of the diagram, from lines and fills, to more complex elements, and then export to VDX, VSX, VTX, XPS, HTML, SVG, SWF, XAML, image or PDF formats.",
  "iconUrl": "http://www.aspose.com/images/products/dotnet/Aspose.Diagram_128x128.png",
  "id": "Aspose.Diagram",
  "isPrerelease": false,
  "lastEdited": "0001-01-01T00:00:00Z",
  "licenseUrl": "http://www.aspose.com/corporate/purchase/end-user-license-agreement.aspx",
  "packageHash": "dnLJZ1a5mW7InQSH3sTxBK/TwJaoH8H8GIqCgy077Y8RSReCXFLLvZlkRq/igMjBfDBfDxfzb1I22cnHvLy65w==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 7304776,
  "projectUrl": "http://www.aspose.com/categories/.net-components/aspose.diagram-for-.net/default.aspx",
  "published": "2015-01-16T03:21:57.117Z",
  "releaseNotes": "This release introduces the features, enhancements,task and bug fixes as detailed below:\n   \n    Enhancements\n\n   \n    Bugs  \n   DIAGRAMNET-50022-VSDX to VDX conversion, warning message of invalid data\n   DIAGRAMNET-50032-Laying out shapes in the FlowChart, the position of the shapes is not changed.\n   DIAGRAMNET-50059-VSD to SVG conversion, incorrect visibility by overlapping of black color\n   DIAGRAMNET-50074-VSD to PDF conversion, bullet text lines are going outside the container shape\n   DIAGRAMNET-50076-VSD to HTML conversion, bullet text lines are going outside the container shape   \n   DIAGRAMNET-50107-VSD to PDF conversion, additional white space on the top of actual drawing\n   DIAGRAMNET-50133-VSD to PDF conversion, text items with incorrect position      \n   DIAGRAMNET-50153-InvalidCastException message while saving diagram to SVG format\n   DIAGRAMNET-50174-Can't assign a shape to a layer\n   DIAGRAMNET-50177-VSD to PDF conversion, missing an empty line from the paragraph\n   DIAGRAMNET-50179-VSD to PDF conversion, Shape's text with incorrect wrapping/layout   \n   DIAGRAMNET-50213-Error message when opened output VDX drawing in the Visio\n   DIAGRAMNET-50266-VSDX to PDF conversion, shape Fill color is changed\n   DIAGRAMNET-50267-VSDX to HTML conversion, shape Fill color is changed\n   DIAGRAMNET-50323-VSD to PDF conversion, background color of the shape is not preserved   \n   DIAGRAMNET-50326-VSDX to PDF conversion, missing textfield at the top right corner\n   DIAGRAMNET-50330-VSDX to PDF conversion, shapes are not preserved\n   DIAGRAMNET-50331-VSDX to HTML conversion, shapes are not preserved\n   DIAGRAMNET-50333-Performance issue while exporting VSDX to PDF format   \n   DIAGRAMNET-50336-VSDX to PDF conversion, incorrect sequence of line breaks in the shape's text\n   DIAGRAMNET-50337-VSDX to HTML conversion, incorrect sequence of line breaks in the shape's text\n   DIAGRAMNET-50342-VSDX to PDF conversion, incorrect background color of the shapes\n   DIAGRAMNET-50343-VSDX to HTML conversion, incorrect background color of the shapes   \n   DIAGRAMNET-50354-Warnings when opened output Visio file in MS Office 2010/2007",
  "requireLicenseAcceptance": true,
  "summary": "Aspose.Diagram is a class library for working with Microsoft Visio files.",
  "title": "Aspose.Diagram for .NET",
  "version": "5.0.0",
  "tags": [
    "Visio",
    "Diagram",
    "Aspose.Diagram",
    "VSD",
    "VSS",
    "VST",
    "VSX",
    "VTX",
    "VDW",
    "VDX"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    }
  }
}