{
  "@id": "https://api.nuget.org/v3/catalog0/data/2020.09.09.10.39.06/groupdocs-viewer-dotnet.2.0.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "GroupDocs Team",
  "catalog:commitId": "11f856eb-22b0-40bc-9237-1b010d3d41c0",
  "catalog:commitTimeStamp": "2020-09-09T10:39:06.3389118Z",
  "created": "2014-04-28T05:40:59.887Z",
  "deprecation": {
    "@id": "https://api.nuget.org/v3/catalog0/data/2020.09.09.10.39.06/groupdocs-viewer-dotnet.2.0.0.json#deprecation",
    "alternatePackage": {
      "@id": "https://api.nuget.org/v3/catalog0/data/2020.09.09.10.39.06/groupdocs-viewer-dotnet.2.0.0.json#deprecation/alternatePackage",
      "id": "GroupDocs.Viewer",
      "range": "*"
    },
    "message": "GroupDocs.Viewer API has been moved to a new package \"GroupDocs.Viewer\" with new & improved feature set. ",
    "reasons": [
      "Legacy"
    ]
  },
  "description": "GroupDocs.Viewer for .NET is a flexible library that enables you to display documents and images of more than 45 file formats from within your web & mobile applications. The library is 100% independent and doesn't require any 3rd-party software installation. This allows end users to, for example, view PDF documents from within your .NET applications without having to install Adobe Reader.\n\nWith GroupDocs' document viewer for .NET, your app's users can view documents and images of the following file formats:\n\nPortable Document Format: PDF\nMicrosoft Word: DOC, DOCX, DOCM, DOT, DOTX, DOTM\nMicrosoft Excel: XLS, XLSX, XLSM, XLSB, XML\nMicrosoft PowerPoint: PPT, PPTX\nMicrosoft Visio: VSD, VDX, VSS, VSX, VST, VTX, VSDX, VDW\nMicrosoft Project: MPP, MPT\nMicrosoft Outlook: MSG, EML\nOpenDocument Formats: ODT, OTT, ODS, ODP\nRich Text Format: RTF\nPlain Text File: TXT\nComma-Separated Values: CSV\nHyperText Markup Language: HTM, HTML, MHT, MHTML\nXML Paper Specification: XPS\nAutoCAD Drawing File Format: DXF\nImage files: BMP, GIF, JPG, PNG, TIFF\nElectronic publication: EPUB\n\nDocuments can be both rasterized and converted to SVG+HTML+CSS, delivering high-fidelity native text rendering.\n\nGroupDocs.Viewer for .NET comes with a convenient UI, which allows users to easily navigate documents when viewing them. For instance, users can scroll multi-page documents, turn pages with the Go Forward/Backward buttons, jump straight to a specified page, search for text within the document using keywords, preview pages with thumbnails, zoom, print and download documents right from a web-browser.\n\nFor more details on the GroupDocs.Viewer for .NET Library, please visit our website: \nhttp://groupdocs.com/dot-net/document-viewer-library\n\nNote: this download contains a fully working version of the product, however without a license set it will run in evaluation mode with some limitations. To test GroupDocs' document viewer for .NET library without evaluation limitations, request a free 30-day temporary license.",
  "iconUrl": "http://i.imgur.com/41jV3uV.png",
  "id": "groupdocs-viewer-dotnet",
  "isPrerelease": false,
  "lastEdited": "2020-09-09T10:38:55.79Z",
  "listed": false,
  "packageHash": "4YFhmQIPlsln5KDG4kX40D7MiqgeSZgE9mY461Y2iZISVPlKs3szty1qa2yIBIo9PPa7B+geQTb8F9S8B2w77Q==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 39745065,
  "projectUrl": "http://groupdocs.com/dot-net/document-viewer-library",
  "published": "1900-01-01T00:00:00Z",
  "releaseNotes": "# Bugs Fixed:\n\nWEB-532\tInstallable Viewer. Text selection is shifted for some documents\nWEB-684\tThe filenames are incorrect when downloading files\nWEB-685\tThe print dialog only shows once\nWEB-692\tViewer does not work with UNC root storage paths\nWEB-693\tText is selected too slowly in IE8\nWEB-695\tText selection is not being deleted when shrinking the selection area\nWEB-703\tNot all supported MIME types are recognized when opening a file from a URL\nWEB-704\tLong URLs can't be opened when the root storage path is long\nWEB-713\tViewer.Net - Search performs line by line\nWEB-716\tAn error is shown after removal of a Viewer instance: 'disabled' is null or not an object\nWEB-723\tDesktop Viewer.Net - Horizontal scroll bar doesn't appear after zoom-in\nWEB-724\tDesktop Viewer.Net - Exception occurs after attempt to work with the application when a document isn't loaded\nWEB-725\tDesktop Viewer.Net - Exception occurs after click on \"Preview\" button and attempt to print a document\nWEB-726\tDesktop Viewer.Net - UI issues are presented in application\nWEB-727\tDesktop Viewer.Net - Textboxes at header panel become inactive after mousover on document field\nWEB-729\tDesktop Viewer.Net - Cach should updates each time after opening of document\nWEB-730\tDesktop Viewer.Net - Exception occurs after attempt to open BMP, GIF, JPEG, PNG file\nWEB-731\tDesktop Viewer.Net - All buttons in \"Print\" pop up are affected only after double click\nWEB-732\tDesktop Viewer.Net - Exception occurs after click on \"Page Setup\" button when none printer is specified\nWEB-743\tWhen use SupportTextSelection(false).,an error is shown: \"Unable to get value of the property 'documentDescription': object is null or undefined\"\nWEB-745\t.MSG files are rendered without embedded images and text formatting\nWEB-746\tFiles which are not PDF cannot be opened\nWEB-752\tThe DocumentCache class does not remove the FromStream directory\nWEB-759\tViewer.NET - The right side of the page is cut if document has landscape view\nWEB-765\tText selection instead of scrolling happens on iPad when the jQuery UI Touch Punch is loaded\nWEB-768\tFile access violations when viewing the same document in multiple instances of the desktop viewer\nWEB-774\tIt takes a long time to load a document even if the PreloadPagesCount is set to a few pages\nWEB-776\tThe application is not responding when a document is being loaded into the desktop control\nWEB-777\tPublic methods of the desktop control throw an exception if no document is loaded\nWEB-784\tJS, CSS and embedded image caching does not work\nWEB-788\tSVGs can't be loaded in a Razor 3/.NET 4.5 project\nWEB-789\tThe thumbnails button is under the thumbnails panel when ShowThumbnails(false) is called\nWEB-790\tThe inner thumbnails are not displayed in Chrome\nWEB-798\tThe zoom value dropdown is invisible when the view type dropdown is invisible\nWEB-799\tPage reordering does not work for overlaid thumbnails\nWEB-801\tText selection works incorrectly after reordering pages\nWEB-802\tAn exception is thrown when closing the WinForms Viewer while scrolling through pages.\nWEB-810\tViewer.NET - Dropdown is not closing after attempt to open second dropdown\nWEB-815\tIt's impossible to obtain a current page number after a document just loaded\nWEB-816\tThe destroy method is not working\nWEB-817\tAn error is shown about too many redirections when opening a document from an HTTPS URL in Viewer.\nWEB-819\tPage images don't load when the BaseUrl includes a virtual directory\nWEB-820\tThe Fit Width option does not work for the HTML-based engine\nWEB-822\tThe zooming does not work in IE8 for the HTML-based engine\nWEB-824\t\"System.UriFormatException: Invalid URI: The format of the URI could not be determined\" when BaseUrl=\"/\"\nWEB-830\tWhen viewing, a System.IO.IOException occurs: The process cannot access the file because it is being used by another process.\"\nWEB-832\tViewer.NET - Pages are too small in IE9 after the running project on IIS\nWEB-835\tViewer.NET - Errors are displayed in console after refreshing the page\nWEB-836\tThe search methods does not work when ShowSearch(false) is called\nWEB-839\tA file name for a stream is used as a display file name in Viewer for .NET\nWEB-844\tSearch does not work if text is in multiple spans on one line\nWEB-846\tAn internal server error occurs when the Viewer DLL has a date/time which are later than the current date/time\nWEB-848\tSVG graphics in IE10 are larger than the text when using the HTML-based engine\nWEB-849\tBlack dots instead of button tooltips in IE\n\n#Improvements:\n\nWEB-691\tA file name parameter for the Stream method\nWEB-696\tTooltips localization\nWEB-699\tAn error modal dialog without the use of jQuery UI\nWEB-700\tA parameter for the cache file name of the Stream method\nWEB-705\tThe use of Knockout.js ver.3.0.0\nWEB-769\tHide thumbnails when loading a document\nWEB-771\tPDF to HTML conversion performance improvement by using page-by-page conversion\nWEB-772\tRemove Packages from the samples\nWEB-773\tAdd licenses for the 3rd party libraries in the Aspose libraries to the installers\nWEB-780\tRemove DocViewerId\nWEB-794\tMigration to Aspose.Slides 14\nWEB-831\tReduce the size of the sprites.png file\nWEB-838\tMake sprites.png not to be loaded when the header, thumbnails and file browser are not shown\nWEB-840\tAdd support for \"fit to page width\" and \"fit to page height\" in setZoom JavaScript method\nWEB-843\tWhen a phrase is in double quotes and treatPhrasesInDoubleQuotesAsExact is set, search should search for exact words\n\n# New Features:\n\nWEB-682\tThe flowing of header controls onto new lines when narrowing the header\nWEB-697\tThe displaying of document pages as HTML\nWEB-707\tDesktop Viewer\nWEB-719\tAn option for downloading PDF instead of the original file\nWEB-739\tThe enabling and disabling of the file downloading and printing\nWEB-755\tSearch for any of multiple words\nWEB-770\tThumbnails beside the document area\nWEB-778\tProperties which show the current state of the document in the desktop control\nWEB-781\tA watermark on pages\nWEB-783\tRearranging of pages\nWEB-818\tSearch for the HTML engine\nWEB-827\tAn option for the color of search hits\nWEB-828\tCurrent search hit highlighting\nWEB-829\tTreat phrases in double quotes as exact phrases when searching for separate words\nWEB-850\tA setting for PNG images only in the HTML-based engine",
  "requireLicenseAcceptance": false,
  "summary": "GroupDocs.Viewer for .NET is a flexible library that enables you to display documents and images of more than 45 file formats from within your web & mobile applications. The library is 100% independent and doesn't require any 3rd-party software installation. This allows end users to, for example, view PDF documents from within your .NET applications without having to install Adobe Reader.",
  "title": "GroupDocs.Viewer for .NET",
  "verbatimVersion": "2.0.0",
  "version": "2.0.0",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2020.09.09.10.39.06/groupdocs-viewer-dotnet.2.0.0.json#groupdocs-viewer-dotnet.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 3845,
      "fullName": "groupdocs-viewer-dotnet.nuspec",
      "length": 9534,
      "name": "groupdocs-viewer-dotnet.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2020.09.09.10.39.06/groupdocs-viewer-dotnet.2.0.0.json#lib/Groupdocs.Viewer.dll",
      "@type": "PackageEntry",
      "compressedLength": 39729276,
      "fullName": "lib/Groupdocs.Viewer.dll",
      "length": 43798528,
      "name": "Groupdocs.Viewer.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2020.09.09.10.39.06/groupdocs-viewer-dotnet.2.0.0.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9465,
      "fullName": ".signature.p7s",
      "length": 9465,
      "name": ".signature.p7s"
    }
  ],
  "tags": [
    "Document-Viewer",
    "Image-Viewer",
    "PDF",
    "Word",
    "Excel",
    "PowerPoint",
    "Visio",
    "AutoCad",
    "DOC",
    "DOCX",
    "XLS",
    "XLSX",
    "PPT",
    "PPTX",
    "VSD",
    "DXF",
    "TIFF"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}