{
  "@id": "https://api.nuget.org/v3/catalog0/data/2015.02.01.10.04.09/jeffferguson.gepsio.2.1.0.5.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "Jeff Ferguson",
  "catalog:commitId": "6e442dc3-da7d-4d27-9231-2fdf57b16243",
  "catalog:commitTimeStamp": "2015-02-01T10:04:09.2721459Z",
  "created": "2011-11-03T13:07:10.28Z",
  "description": "Gepsio is a .NET-based document object model for XBRL documents. Load your XBRL document with the XbrlDocument class and work with your XBRL document exposed as a set of .NET classes with a variety of properties and methods. Loaded XBRL documents are automatically validated against the information against the XBRL specification, and exceptions are thrown when invalid XBRL documents are loaded. The Gepsio code base is unit tested using the XBRL-CONF-CR3-2007-03-05 unit tests designed by the XBRL organization.",
  "id": "JeffFerguson.Gepsio",
  "isPrerelease": false,
  "language": "en-US",
  "lastEdited": "0001-01-01T00:00:00Z",
  "licenseUrl": "http://gepsio.codeplex.com/license",
  "packageHash": "caREGKjGZy8YEAo0Zfr9aZPcbIJcF6ILj0C8jPzxjqdKFgct0SUMMO2bjbFlhsDvNZbZP/ybmqSBxFGzAk9ZsA==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 46692,
  "projectUrl": "http://gepsio.codeplex.com",
  "published": "1900-01-01T00:00:00Z",
  "releaseNotes": "Welcome to the Nov 2011 CTP release of Gepsio. This release passes 191 of the tests in the XBRL-CONF-CR3-2007-03-05 conformance suite (which is 32 more than the 159 tests that passed in the last CTP release). This release builds on the previous CTP release in the following ways:\n\n(*) First Class Support For Items and Tuples. Previous releases of Gepsio used a single class called Fact to represent a fact in an XBRL fragment. Starting with this release, the Fact class is a base class for two derived classes: one called Item and the other called Tuple. The Facts collection available from an XbrlFragment object is a collection of Fact objects, and each Fact in the collection could, in fact, be either an Item object or a Tuple object. This work brings the XBRL concept of tuples in as a first-class citizen of the Gepsio object model. \n\n(*) Complete Support For Essence Aliases. This release of Gepsio passes all of the conformance suite tests relating to the concept of essence aliases. \n\n(*) Better Support For Calculation Arc Validation. Gepsio now has a better validation engine for calculation arcs. This release now includes better handling of context-equals and unit-equals items, items with a nil value, and better support for contributing concept items found in tuples.",
  "requireLicenseAcceptance": true,
  "summary": "Gepsio is a .NET-based document object model for XBRL documents.",
  "title": "Gepsio",
  "version": "2.1.0.5",
  "tags": [
    "XBRL"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    }
  }
}