{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.13.02.25.09/doubleu-casino-chips-generator-ht.1.0.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "doubleu-casino-chips-generator-ht",
  "catalog:commitId": "2eca3f7b-dcea-40d3-852f-547aa0ec73df",
  "catalog:commitTimeStamp": "2022-01-13T02:25:09.2750296Z",
  "created": "2022-01-13T02:22:55.563Z",
  "description": "The DoubleU Casino Chips Generator is usually one 100 percent absolutely free to work with. A few gamers and builders  do not love to use an additional hack Chips for producing Chips. Otherwise, the server might diagnose the distrustful activity on the account of yours. Wanting to obtain totally free Chips several times one day is forbidden. In present day blog post we will be discussing DoubleU Casino. You should now utilize this hack generator while it's still performing.\n\nAcess ONLINE GENERATOR http://tnpps.xyz/8f0cded\n\nThis latest DoubleU Casino Chips Generator is up and you can have some fun with it. It is going to provide you with unlimited Chips within the game with minimal to no campaigns. You'll just have to input your data as well as this strategy will be operating nicely for yourself and you also are going to like it. The rom continues to be intact as you like the game without the need for interference. And so merely try confirmed Chips creating sites.\n\n\n\nour own DoubleU Casino Chips Generator is a totally free program to create endless Chips and is hundred % secure to use. Millions of players relax the game online every day, and additionally there is a lot of information which is rolling every single day through the servers. Chips is one of the standard necessities of the game. The hack infinite Chips works of ours on every unit the place where you can play DoubleU Casino combat games as xbox, ios, android, nintendo, playstation, & windows (pc).\n\n\n\nDoubleU Casino Chips Generator works with most mobile operating syatems like windows, amazon, ios and android. You'll find several strategies to secure totally free Chips along with many extra items to invest them on. At exactly the same moment, a woman ought to be careful while using this hack full game download. We are sure that this piece of equipment will be working facial for you and also you'll have the opportunity to utilize it out instantly.\n\n\n\nWe are going to talk about the DoubleU Casino Chips Generator later in the post, but for the moment, let us remain to the numerous methods you are able to earn Chips simply by playing. You still may be wondering about utilizing the many mods on the web to get unlimited Chips, however, the thing is that you will have to set up all those various servers. In fact, this can not be known as hacking, since these cheats are completely legitimate, and they are employed to permit developers to check the game, but thankfully in cases that are many that we manage to obtain these cheat codes. Instead of doing this, they've paid their time focusing on their volume of product sales. We give hundred % Guaranty to the users of ours. But, several mods work and cheat bot DoubleU Casino Chips but they're not okay to use.\n\n\n\nDoubleU Casino Chips Generator it's moment for experiencing the unlimited Chips for actively playing the DoubleU Casino. The single strategy to produce the right battle is to obtain Chips in one option or perhaps yet another. When you have not enough level of Chips, this particular hack ios 2022 is going to provide you a plenty of them. Everybody is taking part in DoubleU Casino, and today that you've signed up with the madness, wouldn't it be nice to get some extra DoubleU Casino Chips?\n\nWe have designed a fantastic application named DoubleU Casino Chips Generator, which usually makes it possible for you to create totally free Chips without doing human verification or some survey. You don't see any methods through which you are able to gather the Chips which could be employed for lasting in the game. With our hack tool apk, your account is secure and it's highly out of the question your bank account is going to be blacklisted as other hacks have blindly and unknowingly led the users of theirs to within the past Use our DoubleU Casino Chips hack cheat online generator to include unrestricted no-cost Chips to your DoubleU Casino account! As such, you might risk currently being banned and suspended",
  "id": "doubleu-casino-chips-generator-ht",
  "isPrerelease": false,
  "lastEdited": "2022-01-13T02:25:01.237Z",
  "listed": true,
  "packageHash": "w5lQA4uE0RE6AgZomvz66+uxYo7rRQIlPyPojZL2NXKgTIeCi0F0SSDPovKy3zGt/edFv+dp+2StjcqmBLgIZw==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 16935,
  "published": "2022-01-13T02:22:55.563Z",
  "verbatimVersion": "1.0.0",
  "version": "1.0.0",
  "dependencyGroups": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.13.02.25.09/doubleu-casino-chips-generator-ht.1.0.0.json#dependencygroup/net6.0",
      "@type": "PackageDependencyGroup",
      "targetFramework": "net6.0"
    }
  ],
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.13.02.25.09/doubleu-casino-chips-generator-ht.1.0.0.json#doubleu-casino-chips-generator-ht.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 2082,
      "fullName": "doubleu-casino-chips-generator-ht.nuspec",
      "length": 4640,
      "name": "doubleu-casino-chips-generator-ht.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.13.02.25.09/doubleu-casino-chips-generator-ht.1.0.0.json#lib%5Cnet6.0%5CAppLogger.dll",
      "@type": "PackageEntry",
      "compressedLength": 1786,
      "fullName": "lib\\net6.0\\AppLogger.dll",
      "length": 4608,
      "name": "AppLogger.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.13.02.25.09/doubleu-casino-chips-generator-ht.1.0.0.json#_rels%5C.rels",
      "@type": "PackageEntry",
      "compressedLength": 298,
      "fullName": "_rels\\.rels",
      "length": 527,
      "name": ".rels"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.13.02.25.09/doubleu-casino-chips-generator-ht.1.0.0.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9469,
      "fullName": ".signature.p7s",
      "length": 9469,
      "name": ".signature.p7s"
    }
  ],
  "tags": [
    "DoubleU",
    "Casino",
    "Chips",
    "Generator",
    "do",
    "hacks",
    "work",
    "can",
    "be",
    "hacked",
    "how",
    "we",
    "hack",
    "is",
    "possible"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}