{
  "@id": "https://api.nuget.org/v3/catalog0/data/2024.05.15.13.11.18/hyland.documentfilters.macos.24.2.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "Hyland Software, Inc.",
  "catalog:commitId": "110eea8f-6174-4f68-b6d9-8fd86388dbb1",
  "catalog:commitTimeStamp": "2024-05-15T13:11:18.0425159Z",
  "copyright": "(c) 2024 Hyland Software, Inc. and its affiliates. All rights reserved.",
  "created": "2024-05-15T13:06:26.383Z",
  "description": "Document Filters is a toolkit that allows application developers to identify and extract metadata, as well as convert and render almost any file type. It is a core component of many products, but can also be leveraged as a stand-alone service for organizations or application developers.",
  "iconFile": "hyland.png",
  "id": "Hyland.DocumentFilters.MacOS",
  "isPrerelease": false,
  "lastEdited": "2024-05-15T13:11:03.133Z",
  "licenseUrl": "https://docs.hyland.com/DocumentFilters/en_US/Print/nuget-license.html",
  "listed": true,
  "packageHash": "pNm7xtddphSF5NQ+5BMLxclkFpuW8KXjTpKUB6Qt0rYYKttyjHP58n8utxm82ZakxLMYVqG8v0oDqoELLaqX4A==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 21225,
  "projectUrl": "https://www.hyland.com/en/products/document-filters",
  "published": "2024-05-15T13:06:26.383Z",
  "releaseNotes": "# Enhancements\n\n- Enhanced Accessibility Info Extraction: Document Filters now supports the extraction of accessibility information from MS Office documents, aiding in the development of accessible products. The extracted \"alt text\" labels include images, drawings, objects, word art, smart art, charts, icons, shapes, and text boxes across Word (DOC and DOCX), PowerPoint (PPT and PPTX), Excel (XLS and XLSX), and Visio (VSDX) files. The extracted alt text is surfaced in various output formats, including HTML5, Classic HTML, XML, and PDF (when creating accessible output).  (DF-1926)\n- Introduced support for extracting links to external workbooks within XLS files when EXCELMODE is not 'TEXT', using the \"SHOWHIDDEN_EXCEL_REFS\" option, defaulting to OFF. (DF-1662)\n- Introducing Custom Tesseract Integration: In response to compatibility challenges with the latest Tesseract version, we've enhanced Document Filters to seamlessly integrate with custom versions of Tesseract. Users can now specify their preferred Tesseract executable path via a simple configuration option. If no custom path is provided or if the location is not found, Document Filters intelligently falls back to the bundled Tesseract version. Our updated documentation provides clear guidance on configuring and utilizing custom Tesseract versions with Document Filters, ensuring a smooth integration experience. (DF-1979)\n- Introducing Document Comparison API: Our latest release introduces a powerful API for comparing documents with precision and flexibility. Users can compare entire documents or individual pages, with options to exclude headers, footers, and specify margins for accurate comparisons. The API detects and highlights changes, including modifications, insertions, and deletions, providing a comprehensive view of document differences. With markup rendering for visual clarity, users can easily review and assess changes. Supporting various formats like MS Word and PDF, this API is well-documented, scalable, and designed for seamless integration into existing systems. Learn more about its capabilities in our documentation here: https://docs.hyland.com/DocumentFilters/en_US/Print/common_use_cases/how_do_i_compare_documents.html. (DF-1984)\n- Introducing Enhanced File Type Categorization: In this release, we've expanded the capabilities of `IGR_Get_Format_Attribute` by introducing a more detailed File Format Category system. Now, users can categorize file formats based on the type of applications that created them, allowing for more granular organization and handling of various file types within the Document Filters system. This feature brings added flexibility and efficiency to file format management, enhancing the overall usability of the platform. (DF-1903)\n- Introducing RGBA and ABGR Pixel Formats: We've enhanced the functionality of `IGR_Get_Page_Pixels` and `IGR_Open_DIB` functions by adding support for RGBA and ABGR pixel formats.  (DF-1953)\n- Upgraded Leptonica to 1.84.1. (DF-1638)\n- Upgraded ODA to 23.12 SP2. (DF-1829)\n- Upgraded Xpdf to 4.05. (DF-1897)\n\n# Updates\n\n- HD Mode: Resolved a condition for MSG files where black boxes may appear incorrectly. (DF-1928)\n- HD Mode: Resolved a condition for PDF files where radio buttons and check boxes were incorrectly marked as ON. (DF-1970)\n- HD Mode: Resolved a condition for PDF files where radio buttons were displayed in a rectangle instead of a circle. (DF-1970)\n- HD Mode: Resolved a condition for Visio files where fonts scaled below 1 would render as large default font-size. (DF-1965)\n- HD Mode: Resolved a condition when converting an RTF file with an image may cause the image to shift. (DF-1951)\n- HD Mode: Resolved a condition when using 'DrawImage' or 'DrawScaleImage' with an HTML5 canvas would cause the same image to be drawn on each page. (DF-1900)\n- HD Mode: Resolved a condition where PPTX files containing a corrupted image would cause the file conversion operation to fail. (DF-1967)\n- HD Mode: Resolved a condition where converting a DOCX file to PDF on Linux may result in the file size drastically increasing. (DF-2008)\n- HD Mode: Resolved a condition where converting an DWG file may cause a segmentation fault. (DF-1985)\n- HD Mode: Resolved a condition where converting an MS Excel file may cause a segmentation fault. (DF-1962)\n- HD Mode: Resolved a condition where converting an MS Word file may cause a segmentation fault. (DF-1937)\n- HD Mode: Resolved a condition where converting an MS Word file may cause a segmentation fault. (DF-1963)\n- HD Mode: Resolved a condition where converting an MSG file to an image may cause the body of the MSG to not render. (DF-1893)\n- HD Mode: Resolved a condition where converting an RTF file to PDF may cause the output to be empty. (DF-1978)\n- HD Mode: Resolved a condition where converting an XLSB file may result in a corrupt sheet error. (DF-1929)\n- HD Mode: Resolved a condition where setting OCR_REORIENT_PAGES=ON and setting GRAPHIC_DPI to a specific value will cause any page that is ‘reoriented’ to not respect the GRAPHIC_DPI value. (DF-1973)\n- HD Mode: Resolved a condition where text on a PDF may display as an empty box for unicode characters. (DF-1931)\n- Resolved a condition for Excel files where hyperlinked images would not output the link when EXCELMODE is not 'text'. (DF-1949)\n- Resolved a condition for HTML files where using the IMAGEURL option would not enclose the URL within quotes. (DF-1957)\n- Resolved a condition for PDFs when 'OCR_REORIENT_PAGES' is enabled would not reorient the pages. (DF-1933)\n- Resolved a condition where a text file may be identified as WordPerfect. (DF-1959)\n- Resolved a condition where extracting MSG files from PST files would fail. (DF-1950)\n- Security: xpdf: CVE-2024-2971: patched: applied security patch to address this issue. (DF-1990)\n- Security: xpdf: CVE-2024-3247: not-exploitable: issue is already mitigated; does not impact document filters. (DF-1994)\n- Security: xpdf: CVE-2024-3248: patched: applied security patch to address this issue. (DF-1991)\n- Security: xpdf: CVE-2024-3900: patched: applied security patch to address this issue. (DF-1992)",
  "requireLicenseAcceptance": true,
  "summary": "An SDK to identify, extract and view hundreds of file formats. Contains the Linux native binaries required to deploy with .NET core on Linux",
  "title": "Hyland.DocumentFilters.MacOS",
  "verbatimVersion": "24.2.0",
  "version": "24.2.0",
  "dependencyGroups": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2024.05.15.13.11.18/hyland.documentfilters.macos.24.2.0.json#dependencygroup",
      "@type": "PackageDependencyGroup",
      "dependencies": [
        {
          "@id": "https://api.nuget.org/v3/catalog0/data/2024.05.15.13.11.18/hyland.documentfilters.macos.24.2.0.json#dependencygroup/hyland.documentfilters.macos-x64",
          "@type": "PackageDependency",
          "id": "Hyland.DocumentFilters.MacOS-x64",
          "range": "[24.2.0, )"
        },
        {
          "@id": "https://api.nuget.org/v3/catalog0/data/2024.05.15.13.11.18/hyland.documentfilters.macos.24.2.0.json#dependencygroup/hyland.documentfilters.macos-arm64",
          "@type": "PackageDependency",
          "id": "Hyland.DocumentFilters.MacOS-arm64",
          "range": "[24.2.0, )"
        }
      ]
    }
  ],
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2024.05.15.13.11.18/hyland.documentfilters.macos.24.2.0.json#Hyland.DocumentFilters.MacOS.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 3019,
      "fullName": "Hyland.DocumentFilters.MacOS.nuspec",
      "length": 7652,
      "name": "Hyland.DocumentFilters.MacOS.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2024.05.15.13.11.18/hyland.documentfilters.macos.24.2.0.json#LICENSE.txt",
      "@type": "PackageEntry",
      "compressedLength": 606,
      "fullName": "LICENSE.txt",
      "length": 1084,
      "name": "LICENSE.txt"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2024.05.15.13.11.18/hyland.documentfilters.macos.24.2.0.json#hyland.png",
      "@type": "PackageEntry",
      "compressedLength": 2695,
      "fullName": "hyland.png",
      "length": 2785,
      "name": "hyland.png"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2024.05.15.13.11.18/hyland.documentfilters.macos.24.2.0.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 12934,
      "fullName": ".signature.p7s",
      "length": 12934,
      "name": ".signature.p7s"
    }
  ],
  "tags": [
    "docfilters",
    "linux",
    "windows",
    "cross-platform"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}