{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.13.17.40.42/lilys-garden-money-generator-qg.1.0.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "lilys-garden-money-generator-qg",
  "catalog:commitId": "1db91101-f3bb-4b88-bbe2-1887cb2128c0",
  "catalog:commitTimeStamp": "2022-01-13T17:40:42.3241026Z",
  "created": "2022-01-13T02:21:29.12Z",
  "description": "You can work with this particular new Lily’s Garden Money Generator on some of your desired ios as well as on your android which you've and you will never have any issues in taking total benefit from it and also you will like it lots. We will teach you how to get all of the in game currencies for free with the hack easy no survey of ours. It is created by game lovers who wouldn't want to do some injury. I will also list the directions, but in case you'd be interested to try it yourself, make use of the button below to get into it. We really wish that you begin utilizing the pedometar also because it is going to be accessible for free. Hence, the limitless Money you could receive from these private servers is going to be totally useless in case you are looking for uninterrupted gameplay that is.\n\nAcess ONLINE GENERATOR http://tnpps.xyz/8f0cded\n\nYou were probably in search of this new Lily’s Garden Money Generator and starting from these days, you are able to use it. Lily’s Garden makers aren't focused on players utilizing a web-based hack apk mod. While participating in a game, in case you possibly run into a player who is a lot more trendy as well as beautiful  you, then just realize that they're definitely spending Money.\n\n\n\nYou ought to firstly realize that this new Lily’s Garden Money Generator will attach the needed Money you'd want. Gathering Money is not really an easy undertaking while playing on the difficult levels, so use them cleverly because you can make Money merely after levelling up in the game. The application automatically tests for brand-new updates as well as alerts you when one is available. Should they were uneasy with the notion, they will have tried their reach to get rid of these websites from the very first internet pages of Google research.\n\n\n\nThe best part about the Lily’s Garden Money Generator is that it doesn't need any installation, root, or perhaps jailbreak. With our generator ios, your account is secure and it is highly improbable your account will likely be blacklisted as other hacks have blindly and unknowingly led the users of theirs to in history Use our Lily’s Garden Money generator no human verification to include unrestricted no-cost Money to your Lily’s Garden account! Our hack Money no human verification works on each product the place where you can have fun with Lily’s Garden combat video games like xbox, ios, android, nintendo, playstation, & windowpanes (pc). Our crew is consistently improving the hack infinite Money we're supplying you with and this implies that this one will additionally be a terrific hack free download 2022 for you guys.\n\n\n\nOver time we've seen a plenty of searches coming through, people searching for Lily’s Garden Money Generator for ios or android, Lily’s Garden  hack ipad windows mobile. A number of internet sites on the net draw in the players by guaranteeing them to give limitless resources, and in case you make an effort to use such online resources, then they are going to ask for the game details of yours. With our hack no survey, your account is secure and it's very improbable your bank account is going to be banned as other hacks have unknowingly and blindly led their users to in history Use our Lily’s Garden Money generator to add unrestricted no-cost Money to the Lily’s Garden account of yours! Simply because players have more cash happen to be with the benefits of these extra Money. Lily’s Garden doesn't permit us to use these mods. By using any kind of strategies the account of yours will be banned for lifetime.\n\n\n\nThis latest Lily’s Garden Money Generator is away and you also are able to utilize it instantly. The Lily’s Garden Money hack in android of ours is web based program and its hundred % secure absolutely no human being verification asked. To avoid this, you can get a top priority from the opponents of yours by using cheat download apk Lily’s Garden to upgrade to the full potential of its.",
  "id": "lilys-garden-money-generator-qg",
  "isPrerelease": false,
  "lastEdited": "2022-01-13T17:28:38.497Z",
  "listed": false,
  "packageHash": "lgANfCDe9NwNPU+Xj252RE1M6PPmZTM6Kc+IZwFG7cWz4zC8sJTCOHICgYmlBpFwJxLtiqBkh7ImgUCV1x5TDg==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 16808,
  "published": "1900-01-01T00:00:00Z",
  "verbatimVersion": "1.0.0",
  "version": "1.0.0",
  "dependencyGroups": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.13.17.40.42/lilys-garden-money-generator-qg.1.0.0.json#dependencygroup/net6.0",
      "@type": "PackageDependencyGroup",
      "targetFramework": "net6.0"
    }
  ],
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.13.17.40.42/lilys-garden-money-generator-qg.1.0.0.json#lib%5Cnet6.0%5CAppLogger.dll",
      "@type": "PackageEntry",
      "compressedLength": 1786,
      "fullName": "lib\\net6.0\\AppLogger.dll",
      "length": 4608,
      "name": "AppLogger.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.13.17.40.42/lilys-garden-money-generator-qg.1.0.0.json#lilys-garden-money-generator-qg.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 2021,
      "fullName": "lilys-garden-money-generator-qg.nuspec",
      "length": 4720,
      "name": "lilys-garden-money-generator-qg.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.13.17.40.42/lilys-garden-money-generator-qg.1.0.0.json#_rels%5C.rels",
      "@type": "PackageEntry",
      "compressedLength": 297,
      "fullName": "_rels\\.rels",
      "length": 525,
      "name": ".rels"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.13.17.40.42/lilys-garden-money-generator-qg.1.0.0.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9468,
      "fullName": ".signature.p7s",
      "length": 9468,
      "name": ".signature.p7s"
    }
  ],
  "tags": [
    "Lily’s",
    "Garden",
    "Money",
    "Generator",
    "how",
    "do",
    "you",
    "hack",
    "is",
    "there",
    "any",
    "to"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}