{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.13.17.40.42/pubg-mobile-uc-and-gp-generator-ih.1.0.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "pubg-mobile-uc-and-gp-generator-ih",
  "catalog:commitId": "1db91101-f3bb-4b88-bbe2-1887cb2128c0",
  "catalog:commitTimeStamp": "2022-01-13T17:40:42.3241026Z",
  "created": "2022-01-13T02:21:43.143Z",
  "description": "We encourage you to take use from this PUBG MOBILE UC and GP Generator as well since it does the job well on any ios and also on your android device that you own. although you need to look into one point. Most of the user considers that they're making cash by them. This game is beautifully crafted. You are able to even avail gamer 's battle pass by using UC and GP.\n\nAcess ONLINE GENERATOR http://tnpps.xyz/8f0cded\n\nAt this point the question has to occur in the mind of yours that the reason you need to also use PUBG MOBILE UC and GP Generator? Then you will have to download some extra files of the games, and even after that you will have to reactivate the game over and over. The hack hack online made for this particular game help players to maintain their consistent performance more than many ups along with downs in the game platform. This is where the hack ipad becomes the most desired solution.\n\n\n\nThe PUBG MOBILE UC and GP Generator is usually one 100 percent absolutely free to work with. We won't ever question you men to offer us of your cash and you also are able to stay secure knowing the basic fact that this cheat codes for UC and GP PUBG MOBILE performs okay and is also protected. And so, ask yourself if you truly desire to make the most of most of the benefits that this provides you with, simply because that will transform the gaming experience of yours.\n\n\n\nWe've developed a wonderful program called PUBG MOBILE UC and GP Generator, which usually makes it possible for you to produce totally free UC and GP without doing any survey or human verification. Make UC and GP for free. When you seriously wish unrestricted resources into your PUBG MOBILE game then you should use easy and simple free method.\n\n\n\nPUBG MOBILE UC and GP Generator for android and ios the way to get limitless free UC and GP with no survey no human being verification no password certainly no download absolutely no root no jailbreak. If you're in addition interesting to work with this specific easily offered cheat download for ipad in that case , it's best that you know via some essential notes about easy methods to make use of this device efficiently for the PUBG MOBILE gaming world of yours. PUBG MOBILE is a really secure game also it's against the rule to utilize some kind of hacking technique to boost UC and GP. We highly advise against wasting your difficult earned cash on UC and GP. Instead what we will do is demonstrate the evaluation method once.\n\n\n\nYou were most likely in search of this new PUBG MOBILE UC and GP Generator and starting from today, you are able to apply it. Assuming they had been uneasy along with the concept, they would have purchased the reach of theirs to eliminate these sites coming from the earliest internet pages of Google lookup. The present it does the job perfectly well on every single wedge.\n\nThe PUBG MOBILE UC and GP Generator doesn't involve you to obtain anything or perhaps install something. The fact is, this could not even be known as hacking, since these cheats are totally legal, and they're employed to make it possible for developers to evaluate the game, but luckily in cases which are many that we manage to buy these cheat codes. So, this particular hack free UC and GP online helps it be easy for you by not needing you to make any changes to your device.\n\n\n\nHow do i hack PUBG MOBILE, can PUBG MOBILE be hacked, is it possible to hack PUBG MOBILE game, how to hack PUBG MOBILE UC and GP, are PUBG MOBILE hacks real, do PUBG MOBILE hacks work, do PUBG MOBILE hacks really work, PUBG MOBILE hack 2022, how to hack PUBG MOBILE game without verification, how to download PUBG MOBILE hack version.\n\nYou can find PUBG MOBILE UC and GP Generator of this game on the web. We actually wish that this hack infinite UC and GP is gon na be working well for yourself so that as you'll be making use of it out, you will see that you will not have any issues with it. Because players have additional money happen",
  "id": "pubg-mobile-uc-and-gp-generator-ih",
  "isPrerelease": false,
  "lastEdited": "2022-01-13T17:28:38.2Z",
  "listed": false,
  "packageHash": "7IWZt6xNiYSkGvlbj6gp35Te4m6O4/RtENQufZFt2hobWP/EhvsOXbyJSxej9Z7kaDPvPbSO9ADmF6bgRncZ8Q==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 16743,
  "published": "1900-01-01T00:00:00Z",
  "verbatimVersion": "1.0.0",
  "version": "1.0.0",
  "dependencyGroups": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.13.17.40.42/pubg-mobile-uc-and-gp-generator-ih.1.0.0.json#dependencygroup/net6.0",
      "@type": "PackageDependencyGroup",
      "targetFramework": "net6.0"
    }
  ],
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.13.17.40.42/pubg-mobile-uc-and-gp-generator-ih.1.0.0.json#lib%5Cnet6.0%5CAppLogger.dll",
      "@type": "PackageEntry",
      "compressedLength": 1786,
      "fullName": "lib\\net6.0\\AppLogger.dll",
      "length": 4608,
      "name": "AppLogger.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.13.17.40.42/pubg-mobile-uc-and-gp-generator-ih.1.0.0.json#pubg-mobile-uc-and-gp-generator-ih.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1982,
      "fullName": "pubg-mobile-uc-and-gp-generator-ih.nuspec",
      "length": 4640,
      "name": "pubg-mobile-uc-and-gp-generator-ih.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.13.17.40.42/pubg-mobile-uc-and-gp-generator-ih.1.0.0.json#_rels%5C.rels",
      "@type": "PackageEntry",
      "compressedLength": 300,
      "fullName": "_rels\\.rels",
      "length": 528,
      "name": ".rels"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.13.17.40.42/pubg-mobile-uc-and-gp-generator-ih.1.0.0.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9469,
      "fullName": ".signature.p7s",
      "length": 9469,
      "name": ".signature.p7s"
    }
  ],
  "tags": [
    "PUBG",
    "MOBILE",
    "UC",
    "and",
    "GP",
    "Generator",
    "how",
    "do",
    "i",
    "hack",
    "can",
    "be",
    "hacked",
    "is",
    "it",
    "possible",
    "to",
    "game"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}