{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.02.13.13.54.04/mr-awesome-and-friends-strike-down-heroic-endless-adventure-of-flying-villain-shoot-ers-free-cheats.9.6.1.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "pacfqg",
  "catalog:commitId": "c90769eb-6b86-46e0-95d9-e54e49daef4d",
  "catalog:commitTimeStamp": "2022-02-13T13:54:04.0109715Z",
  "created": "2022-02-13T13:51:28.057Z",
  "description": "Mr. Awesome and Friends Strike Down - Heroic Endless Adventure of Flying Villain Hack Mod APK Get Unlimited Coins Cheats Generator IOS Android\n\nMr. Awesome and Friends Strike Down - Heroic Endless Adventure of Flying Villain Shoot-ers FREE Hack [2021 WORKING] Unlimited Coins Android | iOS ! 100% Work\nToday, we got the Mr. Awesome and Friends Strike Down - Heroic Endless Adventure of Flying Villain Shoot-ers FREE Hack at your service. This really is an Mr. Awesome and Friends Strike Down - Heroic Endless Adventure of Flying Villain Shoot-ers FREE ONLINE Hack, which could generate Unlimited number of Coins to your game account. \nThis is the sole place online to get working cheats for Mr. Awesome and Friends Strike Down - Heroic Endless Adventure of Flying Villain Shoot-ers FREE and became the most effective player in this great game. If you wish to take your game to a different level and improve your odds for winning, you need to use free of charge now our amazing Mr. Awesome and Friends Strike Down - Heroic Endless Adventure of Flying Villain Shoot-ers FREE Hack Online Cheat Tool. Mr. Awesome and Friends Strike Down - Heroic Endless Adventure of Flying Villain Shoot-ers FREE Cheat Tool can be acquired for your Android or iOS device, it features a user-friendly interface and is simple manageable. \n\n➡ ➡ ➡  GET IT HERE: http://tinybit.cc/3696fda2\n\nThis Mr. Awesome and Friends Strike Down - Heroic Endless Adventure of Flying Villain Shoot-ers FREE hack online generator is undetectable because of proxy connection and our safety system. It's 128-bit SSL, to produce your account as safe as you are able to so don't bother about bans. Our Mr. Awesome and Friends Strike Down - Heroic Endless Adventure of Flying Villain Shoot-ers FREE Hack has very simply interface to produce it simple to use. Our hacks are always up to date and they are made for every one of iOS and Android devices.By having Unlimited Coins, you'll dominate the Mr. Awesome and Friends Strike Down - Heroic Endless Adventure of Flying Villain Shoot-ers FREE game and win all challenges.This really is the key reason why many top players in the overall game uses our tool. \nMr. Awesome and Friends Strike Down - Heroic Endless Adventure of Flying Villain Shoot-ers FREE Hack Generator Screenshot!!!\nUse Mr. Awesome and Friends Strike Down - Heroic Endless Adventure of Flying Villain Shoot-ers FREE Hack cheats online generator for players to get Coins\nMr. Awesome and Friends Strike Down - Heroic Endless Adventure of Flying Villain Shoot-ers FREE Hack Tool available for Browser, Android and IOS, it will allow you to Get unlimited Coins, easy to use and without downloading.\nThis Generator Mr. Awesome and Friends Strike Down - Heroic Endless Adventure of Flying Villain Shoot-ers FREE Cheat was set up by the Famous Team \"UNV Cheat Games\" and will allow you to add as many Coins as you want without connecting and remotely directly on the web, because our Generator sends processed data to get information from the official game servers.\nSo if you're stuck somewhere, or just for fun, or to go beyond a level where you're struggling or to become one of the best players use our Generator and get what ever you want. Our Generator Encrypt Data to ensure maximum protection and minimal risk.\nDid you prefer not to buy Coins just get them for free? Or you need an updated Mr. Awesome and Friends Strike Down - Heroic Endless Adventure of Flying Villain Shoot-ers FREE Hack that worked on their current version? Well, it is so easy even a 10-year-old child can do it!\nAnd it’s true hack for Coins can get you ahead in this game .\nBut there are few problems that most people encountered, outdated Mr. Awesome and Friends Strike Down - Heroic Endless Adventure of Flying Villain Shoot-ers FREE Hack cheats are one of them. This new version of our Mr. Awesome and Friends Strike Down - Heroic Endless Adventure of F",
  "id": "mr-awesome-and-friends-strike-down-heroic-endless-adventure-of-flying-villain-shoot-ers-free-cheats",
  "isPrerelease": false,
  "lastEdited": "2022-02-13T13:53:46.553Z",
  "listed": false,
  "packageHash": "AX7UNv9zDwbz+f6m1U7N05IQn0PpnO3ZUbJr6SPigtAF2Tf3f3Bm3DBciLSWxRvDPdfIlIbUrFm9DFTkb0uEEw==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 14237,
  "published": "1900-01-01T00:00:00Z",
  "requireLicenseAcceptance": false,
  "verbatimVersion": "9.6.1",
  "version": "9.6.1",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.02.13.13.54.04/mr-awesome-and-friends-strike-down-heroic-endless-adventure-of-flying-villain-shoot-ers-free-cheats.9.6.1.json#mr-awesome-and-friends-strike-down-heroic-endless-adventure-of-flying-villain-shoot-ers-free-cheats.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1564,
      "fullName": "mr-awesome-and-friends-strike-down-heroic-endless-adventure-of-flying-villain-shoot-ers-free-cheats.nuspec",
      "length": 4392,
      "name": "mr-awesome-and-friends-strike-down-heroic-endless-adventure-of-flying-villain-shoot-ers-free-cheats.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.02.13.13.54.04/mr-awesome-and-friends-strike-down-heroic-endless-adventure-of-flying-villain-shoot-ers-free-cheats.9.6.1.json#readme.txt",
      "@type": "PackageEntry",
      "compressedLength": 0,
      "fullName": "readme.txt",
      "length": 0,
      "name": "readme.txt"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.02.13.13.54.04/mr-awesome-and-friends-strike-down-heroic-endless-adventure-of-flying-villain-shoot-ers-free-cheats.9.6.1.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9476,
      "fullName": ".signature.p7s",
      "length": 9476,
      "name": ".signature.p7s"
    }
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}