{
  "@id": "https://api.nuget.org/v3/catalog0/data/2020.04.15.11.31.16/hangfire.1.6.29.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "Sergey Odinokov",
  "catalog:commitId": "fa43502d-3e53-494f-a9da-c53a63c021f8",
  "catalog:commitTimeStamp": "2020-04-15T11:31:16.7571658Z",
  "copyright": "Copyright © 2013-2019 Sergey Odinokov",
  "created": "2020-04-15T11:28:36.7Z",
  "description": "An easy and reliable way to perform fire-and-forget, delayed and recurring long-running, short-running, CPU or I/O intensive tasks inside ASP.NET application. No Windows Service / Task Scheduler required. Even ASP.NET is not required.\nBacked by Redis, SQL Server, SQL Azure or MSMQ. This is a .NET alternative to Sidekiq, Resque and Celery.\nhttps://www.hangfire.io/",
  "id": "Hangfire",
  "isPrerelease": false,
  "lastEdited": "2020-04-15T11:31:07.543Z",
  "licenseUrl": "https://raw.github.com/HangfireIO/Hangfire/master/LICENSE.md",
  "listed": true,
  "packageHash": "kZR6lV2D7i4IQaTk2vJz/ZBcibuYRAprh1GDB55PQjuqD7kvowjUvjZFvkzQ5EbMkT2c/+vM8ANs3fMgEtGX4g==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 20215,
  "projectUrl": "https://www.hangfire.io/",
  "published": "2020-04-15T11:28:36.7Z",
  "releaseNotes": "https://www.hangfire.io/blog/\n\n1.6.29\n\nHangfire.Core\n\nBackported from 1.7:\n• Added – Add built-in support for reliable shutdown detection of ASP.NET apps.\n• Changed – Internal feature to perform state changes without calling any filters.\n• Fixed – Let workers to ignore any state change filters when all previous attempts to call them failed.\n• Fixed – Don't let `DelayedJobScheduler` to stall the pipeline when state filters throw an exception.\n• Fixed – `JobLoadException` when new methods deployed, caused by overlapped recycles in ASP.NET applications.\n• Fixed – Configuration changes aren't taken into account, caused by overlapped recycles in ASP.NET.\n• Fixed – Zombie servers shown on the \"Servers\" page that aren't stopped automatically unless app pool is recycled.\n• Fixed – Add another check before removing non-existing jobs from delayed jobs to avoid race conditions.\n\n1.6.28\n\nHangfire.Core\n\nBackported from 1.7:\n• Fixed – `CultureInfo.InvariantCulture` is now restored properly in background jobs.\n• Fixed – Use `LazyThreadSafetyMode.PublicationOnly` to avoid caching \"JobStorage.Current is null\" exceptions.\n\nHangfire.SqlServer\n\nBackported from 1.7:\n• Fixed – Don't leak a `DbConnection` instance when an exception occurs while trying to open it.\n\n1.6.27\n\nHangfire.SqlServer\n\nBackported from 1.7:\n• Fixed – Cannot resolve the collation conflict in `CountersAggregator`.\n• Fixed – Set `SqlParameter` types explicitly to not to duplicate query plans and and avoid conversion issues.\n\n1.6.26\n\nHangfire.Core\n\n• SECURITY – Use `HtmlEncode` in all remaining places in Dashboard UI to prevent XSS attacks.\n\n1.6.25\n\nHangfire.Core\n\n• Fixed – Buggy `CancellationToken` consumers now can't cause memory leaks related to token registrations.\n\n1.6.24\n\nHangfire.Core\n\n• Fixed – `PreserveCulture` filter logs a message instead of throwing an error when it can't find the culture.\n• Fixed – Uninitialized continuation shouldn't cause exception when completing an antecedent job.\n\nHangfire.SqlServer\n\n• Fixed – Validate `JobExpirationCheckInterval` option to avoid exceptions in runtime (by @carlowahlstedt).\n• Fixed – Don't throw an exception, when current schema version is higher than expected.\n\n1.6.23\n\nHangfire.Core\n• Added – Slow log to see warning messages when filters or queries take more than 1 minute.\n• Fixed – Catching `DistributedLockTimeoutException` based on resource name in schedulers (by @bogdandanielb).\n• Fixed – Serilog context property name does not follow Serilog convention (by @pobiega).\n• Fixed – Add more guards against `NullReferenceException` on Recurring Jobs page.\n• Fixed – Don't handle recurring jobs created by newer version of Hangfire.\n\nHangfire.AspNetCore\n• Fixed – Could not load type `Microsoft.***.FormattedLogValues` in ASP.NET Core 3.0.\n\nHangfire.SqlServer\n• Fixed – Make `GetRangeFromSet` to be forward compatible with the 1.7.0 schema.\n• Fixed – Changed some SQL queries to not to cause index scans when using 1.7.0 schema.\n\n1.6.22\n\nHangfire.Core\n• Added – Ability to use custom type resolvers to modify the type de-serialization logic.\n• Fixed – `JobLoadException` when processing jobs in .NET Framework, which were created in .NET Core.\n• Fixed – `JobLoadException` when jobs reside in a signed assembly and a new version is deployed.\n• Fixed – Don't produce extra logging message when there's an exception in a worker.\n• Fixed – Ensure form values are properly returned when there are different versions of Microsoft.Owin (by @DC-jc).\n• Fixed – Dashboard fails with 404 \"Not Found\" error if there's a trailing slash for some reason.\n\nHangfire.SqlServer\n• Added – Connection factory overload for the `SqlServerStorage` class (by @chinwobble).\n• Fixed – Inability to use package with Azure's managed service identity (by using a connection factory).\n    \n1.6.21\n\nHangfire.Core\n• Fixed – High CPU usage and long response time when accessing Failed jobs page with Linux stack traces.\n• Fixed – RecurringJobScheduler may block server shutdown and cause distributed lock to be abandoned.\n\nHangfire.SqlServer\n• Fixed – Change locking scheme in the `Connection.SetRangeInHash` method to avoid deadlocks.\n\nHangfire.AspNetCore\n• Fixed – Null-based implementation of the `IAntiforgery` interface doesn't lead to an exception.\n      \n1.6.20\n\nHangfire.Core\n\n• SECURITY – Add \"robots\" meta tag to ensure browser don't index dashboard pages.\n• SECURITY – Add support for antiforgery validation to prevent CSRF attacks (requires configuration).\n\n• Fixed – Perform state change retries using a fresh connection when job's distributed lock may be abandoned.\n• Fixed – Disallow transitions to the Failed state on retries that bypass all the filters.\n• Fixed – Remove possible rare CPU spikes due to the use of `CancellationToken.WaitHandle`.\n• Fixed – Avoid resolving types and methods for logging in static constructors that may lead to process shutdown.\n• Fixed – Prevent Recurring jobs dashboard from throwing `NullReferenceException` (by @mattkwiecien).\n• Fixed – Replace wall clocks with monotonic ones when calculating local timeouts.\n• Fixed – Change logger initialization to be deterministic and predictable by using instance fields.\n• Fixed – Make `_currentLogProvider` field access to use volatile reads/writes.\n• Fixed – Typo in `NotSupportedException`'s message (by @benrick).\n• Fixed – Typo on the Failed jobs page (by @gareth-evans).\n\nHangfire.SqlServer\n\n• Fixed – Remove the synthetic limitation to support Azure SQL Management instance (by @TimSQL).\n\nHangfire.AspNetCore\n\n• SECURITY – Use ASP.NET Core's built-in antiforgery validation to prevent CSRF attacks.\n      \n1.6.19\n\nHangfire.Core\n\n• Fixed – NullReferenceException in JobMethodCallRenderer regression appeared in 1.6.18.\n\nHangfire.SqlServer\n\n• Fixed – \"String or binary data would be truncated\" exception when state reason is too long.\n• Fixed – Command handling in batch mode now stops after the first error due to \"XACT_ABORT ON\".\n• Fixed – Make SqlCommandBatch disposable to dispose all the commands.\n\n1.6.18\n\nHangfire.Core\n\n• Added – Add on option to remove the storage connection string from the footer (by @sandorfr).\n• Added – Add Dashboard UI Resource zh-TW (by @crablin).\n• Fixed – OutOfMemoryException in dashboard when arguments are too big.\n• Fixed – DisplayNameAttribute doesn't work when using dashboard in .NET Core.\n• Fixed – Update rickshaw css to match the js version (by @pieceofsummer).\n• Fixed – Bad exception when Job.FromExpression fails to resolve method for explicit interface implementations (by @f00).\n• Fixed – Missing intValue-values in \"/stats\" endpoint (by @pieceofsummer).\n• Fixed – Logging doesn't work with log4net integration in .NET Core (by @evollu).\n• Fixed – Fix nuspec pointing to version of Newtonsoft.Json that does not exist (by @mvestergaard)\n• Fixed – Server start time has a bad tooltip position (by @pieceofsummer).\n• Fixed – Prevent connection string from blowing mobile page layout (by @pieceofsummer).\n• Fixed – Number of recurring jobs per page is now correct (by @pieceofsummer).\n• Project – Get rid of all the compile-time warnings (by @liakamp).\n• Project – More details for build instructions for the project (by @kristofferjalen).\n• Project – Unable to build project with space in folder path (by @stefanviberg).\n\nHangfire.AspNetCore\n\n• Added – More Hangfire-related services are now registered in an IoC container (by @pieceofsummer).\n• Fixed – Queue parameter is ignored in .NET Core when creating a job (by @pieceofsummer).\n• Fixed – Fix issue with configuration block not called on .NET Core (by @pieceofsummer).\n\nHangfire.SqlServer\n\n• Fixed – Rare deadlocks in SQL Server caused by the SetRangeInHash command.\n    \n1.6.17\n\nHangfire.SqlServer\n\n• Added – `SqlServerStorageOptions.CommandBatchMaxTimeout` parameter to enable batching in transactions.\n• Fixed – Timeout exceptions when there are a lot of large concurrent transactions by using the new batching method.\n• Fixed – Distributed locks are safe now even in very unreliable networks and after network blips.\n• Performance – Greatly decreased the number of connections required to process background jobs.\n• Performance – Significantly decrease the number of roundtrips required to commit a transaction.\n    \n1.6.16\n\nHangfire.Core\n\n• Fixed – Unexpected `DateTime` and `DateTime?` serialization issues in background job arguments (by @plaisted).\n• Fixed – `DistributedLockTimeoutException` in some background processes now logged with \"DEBUG\" level instead of \"ERROR\".\n• Fixed – `ElmahLogProvider` to show errors when using SQL log (by @francnuec).\n• Fixed – Last execution field isn't shown on recurring jobs page, when background job has already expired.\n• Fixed – `Hangfire.SqlServer` assembly doesn't include version in the `netstandard` target.\n\nHangfire.SqlServer\n\n• Fixed – Lower the number of requests, when trying to acquire a distributed lock.\n• Fixed – Problems with continuations and batch continuations, when using existing `SqlConnection` instance.\n• Fixed – Distributed locks were silently released, when passing explicit closed connection to a storage.\n• Fixed – `KeyNotFoundException` errors on various dashboard pages don't appear anymore (by @benjymous).\n• Fixed – \"Cannot release the application lock because it is not currently held\" exceptions, when connection was closed.\n• Fixed – Allow to use zero timeout for SQL Server-based distributed locks.\n    \n1.6.15\n\nHangfire.SqlServer\n\n• Fixed – Timeout exceptions that's caused by SQL Server's thread pool starvation, caused by sp_getapplock.\n• Fixed – Antecedent background job is constantly failing, when its continuation hasn't been fully created.\n    \n1.6.14\n\nHangfire.SqlServer\n\n• Added – `SqlServerStorageOptions.SlidingInvisibilityTimeout` to fetch jobs without using transaction.\n• Fixed – Transaction log is full due to 'ACTIVE_TRANSACTION' by enabling to use new non-transactional fetch.\n• Fixed – `SqlServerJobQueueMonitoringApi` can't cause READ UNCOMMITTED isolation level to leak on SQL Server 2012 or earlier. \n• Fixed – Add missing `SqlServerStorage(DbConnection, SqlServerStorageOptions)` constructor.\n    \n1.6.13\n\nHangfire.Core\n• Fixed – Continuation is fired on a wrong queue, when parent job is finished before the creation.\n• Fixed – Impossible to intercept failed state transition before `AutomaticRetryAttribute`.\n• Fixed – Fixed translation in Chinese localization on home page (by @JustinChia).\n• Fixed – Don't throw `NullReferenceException`, when state has changed during query on Processing page.\n• Fixed – `CreateBatchFailedException`, when batch creation takes longer than 1 hour.\n\nHangfire.AspNetCore\n• Fixed – Types are resolved using the `GetServiceOrCreateInstance` method (by @Tsabo).\n\nHangfire.SqlServer\n• Fixed – Don't hide errors occurred while running SQL migrations.\n• Fixed – `KeyNotFoundException` when accessing Deleted Jobs page in Dashboard.\n• Fixed – `SqlServerDistributedLock` leaks connections, when lock acquisition is failed.\n    \n1.6.12\n\nHangfire.Core\n• Fixed – Buggy state filters may cause background job to be infinitely retried.\n• Fixed – Transient exception during Processing-Succeeded state transition may cause unexpected retry.\n    \n1.6.11\n\nHangfire.Core\n• Fixed – `NullReferenceException` in dashboard when OWIN's or ASP.NET Core's `User` is `null`.\n• Fixed – Regression related to missing CSS and JS resources in dashboard appeared in 1.6.10.\n    \n1.6.10\n\nHangfire.Core\n• Fixed – Duplicate job continuations aren't added anymore, when outer transaction has failed.\n• Fixed – Existing duplicate continuations don't lead to `ArgumentException`: the same key already added.\n• Fixed – Replace inline script, because it may violate the Content Security Policy (by @Beczka).\n• Fixed – Don't skip records in RecurringJobsPage (by @reaction1989).\n    \n1.6.9\n\nHangfire.SqlServer\n• Fixed – `TimeoutException` on large arguments or large batches via `SqlServerOptions.CommandTimeout`.\n\n1.6.8\n\nHangfire.Core\n• Fixed – `Cron.MonthInterval` now returns correct CRON expression.\n• Fixed – Throw `NotSupportedException` early, when arguments contain delegate or expression.\n• Fixed – Connection and distributed lock kept longer than necessary in `RecurringJobScheduler`.\n• Fixed – Use local date/times everywhere in Dashboard UI.\n• Fixed – Call chart update only when it exists in Dashboard UI to prevent JavaScript errors.\n• Fixed – Scheduled column title is now displaying correctly in Dashboard UI.\n• Fixed – Typo \"Nexts jobs\" should be \"Next jobs\" in Dashboard UI (by @danielabbatt).\n\nHangfire.SqlServer\n• Fixed – Use `long` where possible instead of `int` for background job identifiers, full support will be in 1.7.0.\n    \n1.6.7\n\nHangfire.Core\n• Fixed – ArgumentException when using complex arguments in generic methods like \"IList<T>\" (by @aidmsu).\n• Fixed – Generic arrays like \"T[]\" aren't supported in background job arguments (by @aidmsu).\n• Fixed – Wrong choice of the overload when multiple methods match the given arguments (by @aidmsu).\n• Fixed – Null values for arguments when there are errors during the JSON deserialization.\n• Fixed – Window resize cause errors and uncontrolled growth of event and poll listeners (by @Yarmonov).\n• Fixed – HtmlHelper.ToHumanDuration incorrectly formats fractional seconds (by @pieceofsummer).\n• Fixed – Exception in Dashboard UI when CRON expression is null by an accident (by @aidmsu).\n• Fixed – Error in Dashboard UI when rendering an array that contains a null element (by @djfoz).\n• Fixed – Inconsistent constructors' accessibility for different context classes (by @pieceofsummer).\n• Fixed – Decrease the max default workers count to \"20\" in tests (by patrykpiotrmarek).\n• Fixed – Inconsistent EOL characters in some files of a project (by @aidmsu).\n• Fixed – Make Queue name accessible from RecurringJobDto (by @swordfish6975).\n\nHangfire.SqlServer\n• Fixed – Validation added to avoid \"An invalid application lock time-out\" exceptions (by t0mburton).\n\nHangfire.AspNetCore\n• Fixed – Parameterless AspNetCoreJobActivator.BeginScope method now returns a correct instance (by @pieceofsummer).\n\n1.6.6\n\nHangfire.Core\n• Fixed – Hangfire.Core, Hangfire.SqlServer and Hangfire.SqlServer.Msmq marked as CLS-compliant.\n• Fixed – Generic methods cause ArgumentNullException when scoped variable is used in expression.\n\nHangfire.SqlServer\n• Fixed – SqlServerJobQueue class doesn't use obsolete InvisibilityTimeout parameter anymore.\n    \n1.6.5\n\nHangfire.Core\n• Added – Chinese language to Dashboard UI (by @andy-zhouyou).\n• Changed – Default upper limit of worker number is 20.\n• Changed – Default value for DashboardJobListLimit is now 10000.\n• Fixed – Deserialization exception in continuations, when TypeNameHandling.All option is used (by @MaksimSimkin).\n• Fixed – I18N is not working, because there are no localized resources in NuGet packages.\n• Fixed – Infinite redirect loops, when authenticated, but not authorized user accesses Dashboard UI.\n• Fixed – \"The type ... exists in both...\" issue when building Hangfire, related to Newtonsoft.Json.\n• Fixed – Use the given type's method, when scope variable is passed to a job expression.\n• Fixed – Very rare resource leaks detected by Coverity Scan.\n\nHangfire.SqlServer\n• Fixed – Different timeout issues after making performance optimizations.\n• Fixed – SQL timeouts while getting a connection, when using default settings and >= 8 CPU cores.\n• Fixed – ExpirationManager is bloated by SqlError instances, when there are a lot of messages from server.\n• Fixed – Counters query returned inconsistent results during CountersAggregator executions.\n• Performance – Added missing NOLOCK hint for monitoring queries when using SqlServer-based queues.\n• Performance – ExpirationManager is forced to use index seek operations for cascade deletions.\n• Performance – CountersAggregator now uses clustered index scan to issue less logical reads.\n• Performance – Paging queries in dashboard now use CTEs to utilize less logical reads.\n    \n1.6.4\n\nHangfire.SqlServer\n• Fixed – `SqlConnection` object leaks when using nested distributed locks (in batches and continuations).\n    \n1.6.3\n\nHangfire.Core\n• Fixed – Add missing `RecurringJob.AddOrUpdate` method overloads to prevent CS4014 warnings.\n• Fixed – `ToGenericTypeString` method now handles types with no namespace correctly.\n\nHangfire.SqlServer\n• Fixed – Prevent `ExpirationManager`'s command from timing out, when there are a lot of records.\n• Fixed – `CountersAggregator` issue introduced in 1.6.2, that causes slow record aggregation.\n• Fixed – Add `XLOCK` hint for `CountersAggregator` query to prevent deadlocks on lock escalation.\n\nHangfire.SqlServer.Msmq\n• Fixed – Prevent MSMQ transactions from timing out after 1 minute of processing.\n    \n1.6.2\n\nHangfire.Core\n• Changed – Recurring job page displays now raw cron strings, descriptions are in tooltips.\n• Fixed – Return non-highlighted stack trace, when parsing takes too long, instead of throwing an exception.\n• Fixed – Dashboard UI works correctly again, when IE 11 is in the Compatibility Mode.\n• Fixed – Long method names now don't push tables out of the boundaries now.\n\nHangfire.SqlServer\n• Changed – `JobExpirationCheckInterval` property value now defaults to 30 minutes.\n• Fixed – Excessive blocking when expiring records in `State` and `JobParameters` tables.\n• Fixed – Migration script `Install.sql` was deadlocked by itself, leading to errors on startup.\n\nHangfire.SqlServer.Msmq\n• Fixed – Public MSMQ queue paths are parsed correctly now, when determining the queue length.\n    \n1.6.1\n\nHangfire.Core\n• Added – Automatic unit tests execution for .NET Core on Windows, Linux and OS X using AppVeyor and Travis CI.\n• Fixed – `DateTime` deserialization issues on .NET Core platform.\n• Fixed – Fixed UI command behaviour, buttons can only be pressed once per command (by @mahoneyj2).\n• Fixed – `TypeInitializationException` when using Serilog appeared in version 1.6.0.\n• Fixed – Cron format strings for intervals are specified correctly now (by @stevetsang).\n• Fixed – `NullReference` on Job Details page when background job has null value for `IEnumerable` argument.\n• Fixed – Don't skip symbols when publishing NuGet packages.\n• Fixed – Use GUID identifier when can't determine the host name.\n\nHangfire.AspNetCore\n• Fixed – Add missing `GetHttpContext` extension method for the .NET Core platform.\n    \n1.6.0\n    \nHangfire.Core\n• Added – .NET Core support for Hangfire.Core and Hangfire.SqlServer packages (`netstandard1.3` target).\n• Added – Ability to create jobs based on async methods, they are awaited by a worker (by @tuespetre).\n• Added – Access to background job context from the `JobActivator.BeginScope` method.\n• Added – Add LatencyTimeoutAttribute To delete jobs if timeout is exceeded (by @Excommunicated).\n• Added – Ability to change statistics polling interval in dashboard (by @tristal).\n• Added – Non-blocking `BackgroundJobServer.SendStop` method, that requests for a shutdown.\n• Added – `BackgroundJobServerOptions.ServerName` option is back.\n• Added – `IDashboardAuthorizationFilter` interface that makes `IAuthorizationFilter` obsolete.\n• Added – Show background job continuations on Job Details page.\n• Added – Multilanguage support in Dashboard via resource files (by @Elph).\n• Added – Spanish localization for the Dashboard UI (by @Elph).\n• Added – Enable backtracking from background job to recurrent job (by @teodimache).\n• Added – Cron expressions for regular intervals for the `Cron` class (by @geirsagberg).\n• Added – `IRecurringJobManager` interface for the `RecurringJobManager` class (by @arnoldasgudas).\n• Added – Abstractions for Dashboard UI to decouple it from OWIN.\n• Changed – Make the realtime/history graph to use localized dates on hover (by @Elph).\n• Changed – Make graph tooltip also localized using data-attributes (by @Elph).\n• Changed – Dashboard metric's title now contains the ResourceKey instead the title (by @Elph).\n• Changed – Job Details page was redesigned to be more clean with less colors.\n• Changed – Update jQuery to 2.1.4 and rickshaw.js to 1.5.1.\n• Changed – Update NCrontab to 3.1.0.\n• Changed – Update CronExpressionDescriptor to 1.17.\n• Fixed – `ToGenericTypeString` method now supports nested classes (by @patrykpiotrmarek).\n• Fixed – Dashboard Errors in Chrome and IE - Cannot read property 'removeChild' of null.\n• Fixed – /hangfire/js outputs (unintended) UTF-8 BOM.\n\nHangfire.AspNetCore\n• Added – Deep integration with ASP.NET Core via Hangfire.AspNetCore package.\n\nHangfire.SqlServer\n• Added – .NET Core support for Hangfire.Core and Hangfire.SqlServer packages (`netstandard1.3` target).\n• Added – Zero latency processing when client and server reside in the same process (by @bgurmendi).\n• Changed – `SqlServerStorage` class constructor now takes `DbConnection` instances (by @tystol).\n• Changed – `SqlServerObjectsInstaller` class is public now (by @vbfox).\n• Changed – Update Dapper to 1.50.1 version.\n• Fixed – Drop constraints on Server.Id prior to altering it to avoid conflicts.\n\nHangfire.SqlServer.Msmq\n• Fixed – Package now depends on the latest Hangfire.SqlServer instead of version 1.2.2.",
  "requireLicenseAcceptance": false,
  "summary": "An easy way to perform fire-and-forget, delayed and recurring tasks inside ASP.NET applications. No Windows Service required.",
  "title": "Hangfire",
  "verbatimVersion": "1.6.29",
  "version": "1.6.29",
  "dependencyGroups": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2020.04.15.11.31.16/hangfire.1.6.29.json#dependencygroup/.netframework4.5",
      "@type": "PackageDependencyGroup",
      "dependencies": [
        {
          "@id": "https://api.nuget.org/v3/catalog0/data/2020.04.15.11.31.16/hangfire.1.6.29.json#dependencygroup/.netframework4.5/hangfire.core",
          "@type": "PackageDependency",
          "id": "Hangfire.Core",
          "range": "[1.6.29, 1.6.29]"
        },
        {
          "@id": "https://api.nuget.org/v3/catalog0/data/2020.04.15.11.31.16/hangfire.1.6.29.json#dependencygroup/.netframework4.5/hangfire.sqlserver",
          "@type": "PackageDependency",
          "id": "Hangfire.SqlServer",
          "range": "[1.6.29, 1.6.29]"
        },
        {
          "@id": "https://api.nuget.org/v3/catalog0/data/2020.04.15.11.31.16/hangfire.1.6.29.json#dependencygroup/.netframework4.5/microsoft.owin.host.systemweb",
          "@type": "PackageDependency",
          "id": "Microsoft.Owin.Host.SystemWeb",
          "range": "[3.0.0, )"
        }
      ],
      "targetFramework": ".NETFramework4.5"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2020.04.15.11.31.16/hangfire.1.6.29.json#dependencygroup/.netstandard1.3",
      "@type": "PackageDependencyGroup",
      "dependencies": [
        {
          "@id": "https://api.nuget.org/v3/catalog0/data/2020.04.15.11.31.16/hangfire.1.6.29.json#dependencygroup/.netstandard1.3/hangfire.core",
          "@type": "PackageDependency",
          "id": "Hangfire.Core",
          "range": "[1.6.29, 1.6.29]"
        },
        {
          "@id": "https://api.nuget.org/v3/catalog0/data/2020.04.15.11.31.16/hangfire.1.6.29.json#dependencygroup/.netstandard1.3/hangfire.sqlserver",
          "@type": "PackageDependency",
          "id": "Hangfire.SqlServer",
          "range": "[1.6.29, 1.6.29]"
        },
        {
          "@id": "https://api.nuget.org/v3/catalog0/data/2020.04.15.11.31.16/hangfire.1.6.29.json#dependencygroup/.netstandard1.3/hangfire.aspnetcore",
          "@type": "PackageDependency",
          "id": "Hangfire.AspNetCore",
          "range": "[1.6.29, 1.6.29]"
        }
      ],
      "targetFramework": ".NETStandard1.3"
    }
  ],
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2020.04.15.11.31.16/hangfire.1.6.29.json#Hangfire.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 8188,
      "fullName": "Hangfire.nuspec",
      "length": 24292,
      "name": "Hangfire.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2020.04.15.11.31.16/hangfire.1.6.29.json#readme.txt",
      "@type": "PackageEntry",
      "compressedLength": 647,
      "fullName": "readme.txt",
      "length": 1720,
      "name": "readme.txt"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2020.04.15.11.31.16/hangfire.1.6.29.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9465,
      "fullName": ".signature.p7s",
      "length": 9465,
      "name": ".signature.p7s"
    }
  ],
  "tags": [
    "Hangfire",
    "AspNet",
    "MVC",
    "OWIN",
    "SqlServer",
    "Long-Running",
    "Background",
    "Fire-And-Forget",
    "Delayed",
    "Recurring",
    "Tasks",
    "Jobs",
    "Scheduler",
    "Threading",
    "Queues"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}