{
  "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.21.06.27.57/aspose.words.11.4.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "Aspose",
  "catalog:commitId": "3173cdb1-90bc-485c-bf2f-57d9c3bf993e",
  "catalog:commitTimeStamp": "2018-10-21T06:27:57.0516839Z",
  "copyright": "© Aspose 2002-2011. All Rights Reserved.",
  "created": "2012-06-04T08:13:01.71Z",
  "description": "Aspose.Words for .NET class library supports DOC, DOCX, RTF, HTML, OpenDocument, PDF, XPS, EPUB and other formats. With Aspose.Words you can generate, modify, convert, render and print documents without utilizing Microsoft Word®",
  "iconUrl": "http://www.aspose.com/images/products/dotnet/Aspose.Words_128x128.png",
  "id": "Aspose.Words",
  "isPrerelease": false,
  "lastEdited": "2018-10-21T06:27:49.937Z",
  "licenseUrl": "http://www.aspose.com/corporate/purchase/end-user-license-agreement.aspx",
  "listed": true,
  "packageHash": "z21eJwa+1X7mqPD0f/EXmsZIhSOWOXCeAuti8ya1aViPcFXEEFRUdzIj0v3nNnzF0+tHfHhGGkEGYSY2pplipw==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 12349623,
  "projectUrl": "http://www.aspose.com/categories/.net-components/aspose.words-for-.net/default.aspx",
  "published": "2012-06-04T08:13:01.71Z",
  "releaseNotes": "There are 133 improvements and fixes in this regular monthly release. This release introduces the features, enhancements, performance improvements, excptions and bug fixes as detailed below:\n\n• New features\n\nWORDSJAVA-451\tWORDSJAVA-499 Open password protected documents\nWORDSNET-1770\tImage inserted by Aspose.Words appears with border in OpenOffice.\nWORDSNET-1815\tOutput custom footnote delimiter in layout\nWORDSNET-1864\tSome highlight colors are not showed in the word document.\nWORDSNET-4023\tRoot // Preserve signature image upon roundtrip.\nWORDSNET-4491\t/snap to grid/ Support document line grid\nWORDSNET-4688\tUnexpected endnote separator appears during rendering.\nWORDSNET-4804\t/snap to grid/ Intervals between empty paragraphs are rendered smaller than it should.\nWORDSNET-4832\tNon-existent separator line appears during footnote rendering\nWORDSNET-5277\tEndnote separator appear on each page with endnotes but should note appear at all.\nWORDSNET-5663\t/snap to grid/ Line spacing seems to be reduced in PDF\nWORDSNET-5664\t/snap to grid/ Shapes are getting overlapped to the content in PDF/XPS etc\nWORDSNET-6047\tImplement Load and Save warnings for DOCX format\nWORDSNET-6235\tImplement Read and Write warnings for Vml.\nWORDSNET-6249\tMove licenses to a central place in the installer and DLLs only downloads\nWORDSNET-6256\t/rtl/ Support list labels in RTL paragraphs\nWORDSNET-6288\tWORDSNET-5311 Create an article which demonstrates how to receive warnings when a font is substituted.\nWORDSNET-6353\tTest Aspose.Words with Visual Studio 2011\nWORDSNET-6389\tText is misplaced after conversion Doc to PDF.\nWORDSNET-969\tMake it possible to use some special syntax so users can insert merge fields in HTML\n\n• Enhancements\n\nWORDSJAVA-37\tWORDSJAVA-499 Support verification of digital signatures of a document\nWORDSJAVA-454\tMake links from documentation pages to API members functional in AWJAVA\nWORDSJAVA-506\tCan't apply attributes to image with rgb color map.\nWORDSJAVA-530\tWORDSJAVA-529 Spaces in path prevent loading images from internet.\nWORDSJAVA-539\tWORDSJAVA-499 Human-readable exceptions for digital signature and ecription code\nWORDSJAVA-543\tWORDSJAVA-499 Add signature examples back to Java samples\nWORDSNET-1685\tTable borders are shown not properly in DOCX.\nWORDSNET-2742\tRight margin is set to 0 after open/save the document.\nWORDSNET-4714\tShape height is read incorrectly.\nWORDSNET-4833\tRender custom footnote/endnote reference mark\nWORDSNET-5078\t/anchor push:20/ Support floater anchor push algorithm (scenario 2a).\nWORDSNET-5779\tSDTs combo box, SelectedItem doesn't show up\nWORDSNET-6013\tCreate an article and code sample which demonstrates how to specify default substitution font that is used upon rendering.\nWORDSNET-6167\tImage quality problem with Doc format when use builder.InsertImage\nWORDSNET-6177\tSupport EMF+ embedded metafiles\nWORDSNET-6214\tWORDSNET-6209 Support Vertical Alignment of elements in equations.\nWORDSNET-6215\tWORDSNET-6209 Support all variants of fraction.\nWORDSNET-6219\tWORDSNET-6209 Support column and row spacing in matrix and array.\nWORDSNET-6257\tUpdate Aspose.Words on Codeplex\nWORDSNET-6267\tSupport italic font simulation in GdiRenderer\nWORDSNET-6276\tImprove writing gray colors to PDF.\nWORDSNET-6278\tParagraph left indent increases in PDF\nWORDSNET-6308\tPDF Validator rejects signed PDF/A-1b document\nWORDSNET-6315\tCreate an article for how to control how fonts are embedded in PDF\nWORDSNET-6316\tCreate an article for how to avoid embedding Base 14 fonts and standard Windows fonts\nWORDSNET-6324\tSome internal git files appear in the examples archive\nWORDSNET-6336\tWrong Page Count while converting Docx to Pdf\nWORDSNET-6343\tFix any links using the old web address in the online documentation\nWORDSNET-6360\tRTF to Doc conversion issue, text is not properly render between Grid Lines\nWORDSNET-6364\tWORDSNET-6343 Check any old external links that can be updated or don't exist anymore\nWORDSNET-6365\tWORDSNET-6343 Check and fix any red links in the documentation pages\nWORDSNET-6377\tSupport font styles simulation when rendering to SWF\nWORDSNET-6378\tSupport font styles simulation when rendering to SVG\n\n• Performance\n\nWORDSJAVA-540\tReduce memory usage during saving to PDF\nWORDSNET-6217\tWORDSNET-6209 Investigate why height of glyphs in 'Cambria Math' is higher that needed when render to GDI.\n\n• Exceptions\n\nWORDSNET-4924\tInvalidOperationException: \"Cannot find a style with this style identifier.\" occurs during applying \"BookTitle\" style.\nWORDSNET-5282\t\"NullReferenceException\" exception occurs during getting width of page\nWORDSNET-5647\tInvalidOperationException occurs during open/save.\nWORDSNET-5796\tException occurs when converting DOCX with comments to PDF\nWORDSNET-5812\tAspose.Words.FileCorruptedException occurs upon loading RTF\nWORDSNET-6168\tCannot properly create a Row level StructuredDocumentTag\nWORDSNET-6171\tException throws \"Item has already been added. Key in dictionary: \"1062\" Key being added: \"1062\" on AppendDocument.\nWORDSNET-6334\tSystem.StackOverFlowException occurs upon loading the DOC file\nWORDSNET-6361\tAspose.Words.FileCorruptedException occurs upon loading DOC\nWORDSNET-6370\tNullReferenceException occurs during rendering Shapes to fixed page formats\nWORDSNET-6374\tTiffCompression.Ccitt3 throws System.ArgumentException upon rendering Shape to TIFF format\nWORDSNET-6384\tAspose.Words.FileCorruptedException occurs upon loading DOC\n\n• Bugs\n\nWORDSJAVA-408\tPicture colors are incorrect when rendering to graphics\nWORDSJAVA-429\tThe quality of PNG image is worsened upon HTML export.\nWORDSJAVA-474\tThe same image with different chroma key\nWORDSJAVA-488\tException Malformed pattern \"#'##0.00\" while using mail merge\nWORDSJAVA-489\tShape colors changed upon converting to PDF/XPS\nWORDSJAVA-497\tImage appears black upon converting to Fixed page formats\nWORDSJAVA-512\tQuality of downscaled image with non-standard dpi is degraded.\nWORDSJAVA-528\tIncorrect image backgorund problem occur while converting to pdf/xps.\nWORDSJAVA-529\tDoesn't follow redirect to mobile site when loading an image.\nWORDSJAVA-536\tImprove rendering to Gdi Emf Pens\nWORDSJAVA-549\tColor shift if color matrix is applied to indexed image\nWORDSJAVA-550\tOfficeMath symbols rendered in wrong vertical position\nWORDSJAVA-551\tEmf-rendered text doesn't visible under background fill\nWORDSNET-1631\tManipulations with bookmarks corrupt the model.\nWORDSNET-2280\tParagraph is placed before table but should be placed after it. Rendering/Convertign to PDF.\nWORDSNET-2518\tFormatting of WML document is changed after open/save.\nWORDSNET-2696\tTable rows are invisible after open/save DOCX (sdt).\nWORDSNET-2988\tTable in document is messed up after open save DOCX document.\nWORDSNET-3528\tHeight of row is incorrect during rendering.\nWORDSNET-3595\tShading patterns are lost during rendering.\nWORDSNET-3597\tPosition of text on the page is changed during rendering.\nWORDSNET-3642\tLine appears to be of another color after converting metafile to bitmap while rendering into PDF/XPS\nWORDSNET-3776\tPart of content is moved to the previous page during rendering.\nWORDSNET-3791\tRendered content layout differs a little from template\nWORDSNET-4071\tFill pattern specified in MS Word is just pure gray after rendering.\nWORDSNET-4246\tContent layout is differs from template upon rendering\nWORDSNET-4305\tEMF+ rendering problem\nWORDSNET-4668\tBold text becomes regular after converting DOC to DOCX\nWORDSNET-4788\tNested tables become misaligned when rendered\nWORDSNET-4836\tWatermark image shifts during rendering\nWORDSNET-5025\tFormatting of ODT document is broken after open/save.\nWORDSNET-5235\tEmf+ Dual // Border lines in metafile are too thin after rendering document.\nWORDSNET-5253\tCharacters overlap each other during rendering.\nWORDSNET-5431\tText appears with shadow after open/save\nWORDSNET-5562\tStyles are lost during converting WML to DOCX\nWORDSNET-5615\tEMF images are rendering with Question mark boxes in PDF\nWORDSNET-5698\tImage is lost upon converting WML document to ODT formats.\nWORDSNET-5733\tEvaluation watermark causes page break when converting ODT\nWORDSNET-5755\t/anchor push:20/ Pdf page count is less than input Word document, after converting doc to Pdf\nWORDSNET-5775\tIn SDT, LockContents=false doesn't work properly unless IsShowingPlaceholderText is specified\nWORDSNET-5866\tCell borders are rendering incorrectly in fixed page formats\nWORDSNET-5879\tAspose.Words does not show up in Visual Studio when the list is filtered to .NET 4.0\nWORDSNET-5932\tPage Contents are overlapping in Fixed Page Formats\nWORDSNET-6154\tsdt.RemoveSelfOnly() is not working properly\nWORDSNET-6161\t/rtl/ Incorrect width of italic arabic text is returned by TrueType font classes\nWORDSNET-6210\tDocx to PDF conversion. The Output quality of PDF is not good\nWORDSNET-6211\tDocx to PDF conversion with embedded Excel\nWORDSNET-6225\t/signature line/ Support \"Signature Line\" shapes in DOC format\nWORDSNET-6243\tWhen the rtf file is converted to doc file, the layout of first cell of the table is incorrect.\nWORDSNET-6260\tPartly loosing external schema references data during DOCX roundtrip.\nWORDSNET-6279\tDuring Mail merge, hidden paragraphs and fields are not visible in resultant docx file but visible in Pdf format.\nWORDSNET-6290\tDoc to SWF conversion issue. SWF output does not open in Browser\nWORDSNET-6306\tDocument background color is not retained when appended to anther Document\nWORDSNET-6307\t/rtl/ Tabs in RTL paragraphs are ordered in line incorrectly\nWORDSNET-6310\tDocument.Save corrupts DOCX during sending to Client's Browser\nWORDSNET-6321\tArgumentNullException is thrown upon saving SVG to stream\nWORDSNET-6323\tWORDSNET-6297 EMF rendering problem\nWORDSNET-6326\tDoc to PDf conversion issue, extra space at the top of first page in pdf.\nWORDSNET-6332\tFont language settings are lost when converting DOCX to DOC\nWORDSNET-6338\tImages transparency issue in exported PDF from Docx\nWORDSNET-6350\tBaseJustification.Bottom is lost after open/save in OfficeMath.\nWORDSNET-6351\tPDF1A/B violation discovered in released features\nWORDSNET-6356\t/rtl/ Incorrect order of characters in bidirectional text\nWORDSNET-6358\t/rtl/ Exception while converting Docx to PDF\nWORDSNET-6388\tException while converting doc to Tiff",
  "requireLicenseAcceptance": true,
  "title": "Aspose.Words for .Net",
  "verbatimVersion": "11.4.0",
  "version": "11.4.0",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.21.06.27.57/aspose.words.11.4.0.json#Aspose.Words.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 4895,
      "fullName": "Aspose.Words.nuspec",
      "length": 11340,
      "name": "Aspose.Words.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.21.06.27.57/aspose.words.11.4.0.json#lib/net1.1/Aspose.Words.dll",
      "@type": "PackageEntry",
      "compressedLength": 4070092,
      "fullName": "lib/net1.1/Aspose.Words.dll",
      "length": 6922240,
      "name": "Aspose.Words.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.21.06.27.57/aspose.words.11.4.0.json#lib/net2.0/Aspose.Words.dll",
      "@type": "PackageEntry",
      "compressedLength": 4131279,
      "fullName": "lib/net2.0/Aspose.Words.dll",
      "length": 7117824,
      "name": "Aspose.Words.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.21.06.27.57/aspose.words.11.4.0.json#lib/net3.5/Aspose.Words.dll",
      "@type": "PackageEntry",
      "compressedLength": 4130920,
      "fullName": "lib/net3.5/Aspose.Words.dll",
      "length": 7116288,
      "name": "Aspose.Words.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.21.06.27.57/aspose.words.11.4.0.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9463,
      "fullName": ".signature.p7s",
      "length": 9463,
      "name": ".signature.p7s"
    }
  ],
  "tags": [
    "Aspose.Words",
    "DOC",
    "DOCX",
    "RTF",
    "HTML",
    "OpenDocument",
    "XPS",
    "EPUB",
    "Word",
    "Document",
    "Processing"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    }
  }
}