{
  "@id": "https://api.nuget.org/v3/catalog0/data/2018.11.19.03.31.44/bytescout.pdfextractor.7.0.0.2474.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "ByteScout",
  "catalog:commitId": "3e119fcf-664b-4b49-991d-1913d6541eb9",
  "catalog:commitTimeStamp": "2018-11-19T03:31:44.8592151Z",
  "copyright": "(c) 2016 ByteScout",
  "created": "2016-05-26T14:42:16.523Z",
  "description": "Bytescout PDF Extractor SDK for .NET 2.00-4.50, ASP.NET, ActiveX\n\n(c) ByteScout 2008-2016\n\nSystem Requirements: .NET framework installed\nWorks with: ASP.NET, .NET (Server side and client side), ActiveX, Visual Basic 6, Delphi, Classic ASP, Delphi and others.\n\nBenefits:\n\n- Extracts data from tables in PDF files as CSV, XML, XLS, XLSX;\n- Extracts embedded files and attachmentes from PDF;\n- Splits, merges PDF documents, extracts single pages;\n- Extracts text from PDF (from whole page or given rectangle);\n- Extracts embedded images from PDF documents;\n- Extracts document information from PDF (author, subject, producer etc)\n- Detects tables in PDF file \n- Searches text inside PDF with support for regular expressions;\n- Extracts data from FDF, XFA forms;\n- Reads text from images using OCR with multiple Western and Asian languages supported;\n- and much more!\n\nWeb-site:\nhttp://bytescout.com/",
  "iconUrl": "http://bytescout.com/favicon.ico",
  "id": "Bytescout.PDFExtractor",
  "isPrerelease": false,
  "lastEdited": "2018-11-19T03:31:38.113Z",
  "licenseUrl": "https://bytescout.com/files/help/BytescoutPDFExtractorSDK/html/a48b0b0e-7321-4778-817a-8b35690fa815.htm",
  "listed": true,
  "packageHash": "6MGuZFX4C1Pd0fufGf4wLKEfCm700SooAFFtiqeKbyeOquVPKpJmhCN6UqOslX8LAav6zuR7XV3uvX7NiaII0A==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 32593568,
  "projectUrl": "http://bytescout.com/products/developer/pdfextractorsdk/index.html",
  "published": "2016-05-26T14:42:16.523Z",
  "releaseNotes": "7.00.0.2474 (May 26, 2016)\n==========================\n+ Added new DocumentPrinter utility class allowing to print PDF documents silently (without any user dialogs).\n+ Added new JSONExtractor class.\n+ Added override for DocumentSplitter.Split() method allowing to specify the output folder for generated files.\n- Fixed multi-threading bug in DocumentSplitter.\n- TableDetector now respects extraction area set by SetExtractionArea() method.\n+ New properties in extraction classes:\n  ExtractionColumns - contains coordinates of detected columns;\n  CustomExtractionColumns - allows to override the column detection.\n- GetPageRect* methods did not take the page rotation into account.\n- Fixed bug in installer causing some files from previous installation were interfering with updates.  \n= Reworked the registration checking. Now the library will not throw an exception, \n  but work in demo mode if you missed or input wrong RegistrationName and RegistrationKey.\n+ PDF Multitool: Added recent document list to \"Open PDF Document\" button.\n+ PDF Multitool: Selection can be resized now.\n+ PDF Multitool: Added Extract JSON feature.\n= PDF Multitool: Improved Table Detector UI.\n= PDF Multitool: Greatly improved font rendering quality.\n+ PDF Multitool: Added debug option \"Show Detected Extraction Columns\" to the context menu to display \n  the detected columns on the current page. Becomes visible only after running any extraction against \n  the current displayed page.\n- PDF Multitool: Fixed font rendering issue on 32-bit Windows.\n= Other minor improvements and bug fixes.\n\n\n6.30.0.2421 (March 23, 2016)\n============================\n+ Added TextComparer utility class (available in .NET 4.0 assemblies only) allowing \n  to compare text in two PDF documents and generate report.\n= Improved support of ICC color profiles.\n= Imporved handling of embedded fonts.\n= Improved AttachmentExtractor.\n- Fixed XMLExtractor.SaveXMLToStream() method.\n- Fixed extracted text duplication when using OCRCacheMode.WholePage option.\n= Other bug fixes and improvements.\n\n\n6.20.0.2354 (January 20, 2016)\n==============================\nPDF To Text, PDF To CSV, PDF To XML functions improved\nNew Extract Video, Extract Audio examples\nCSV and XML extractors improved support for tables with empty columns inside\nnew MultimediaExtractor to extract video and audio from PDF \nnew property PageDataCaching \nnew \"MemoryCareProcessingOfHugeFiles\" example \nfixed null exception when trying to dispose already disposed pages \nXLSExtractor: improves fonts support\nSkipInvisibleText now skips clipped text (which is not visible)\ntext output rendering improved\nXFDF Extractor: added support for checkboxes\nImages output improved to support more sub-formats\nUnicode text handling improved\n\n\n6.11.2193 (August 3, 2015)\n==========================\nBatch Processing samples updated to show the use of Reset() method\nC++ source code sample added for Pages Extraction\nDocumentMerger adds Merge2(inputfile1, inputfile2, outputfile) method to merge 2 files\nXLS Extractor minor bug-fixes\nPDF Multitool now allows to enable/disable text, image, vector layers, adds advanced settings for text extraction\nXML, CSV, Table extraction improves support for tables with emtpry cells inside columns\n\n\n6.10.2136 (June 16, 2015)\n=========================\nimproved PDF to Text extraction\n.ExtractShadowLikeText property improved: better filtering for shadow-like text\nimproved stability and PDF text support\n\n\n6.00.2071 (May 14, 2015)\n========================\nPDF to XML, PDF To CSV, PDF To Text functionality improved\nPDF To XLS command line sample added (based on vbscript)\nPDF To HTML SDK adds new .DetectHyperLinks property (TRUE by default) to enable/disable automated links detection in the text\nNew SearchablePDFMaker (available for PRO licenses) to convert PDF into searchable PDF files\nnew properties in extractor: ConsiderFontNames, ConsiderFontSizes, ConsiderFontColors, ConsiderVerticalBorders in CFG files\nheader columns detection (when AutoAlighHeaderToColumns = true) improved\n.DetectLinesInsteadOfParagraphs replaced with new .LineGroupingMode to control how lines are merged into paragraphs\nIMPORTANT PDF To XML fixes long time issue with incorrect Y coordinate for text objects (was point to the bottom left instead of top left)\n.TableXMinIntersectionRequiredInPercents and .TableYMinIntersectionRequiredInPercents properties added\nC++ source code sample added\nXML Extractor fixes missing empty columns in PreserveFormatting=true mode\nMinor fixes in colors in some PDF files\nsupport for for multiple OCR languages added\nPDF Multitool GUI: adds Copy to Clipboard button to TXT, CSV, XML and raster renderer dialogs\nXLSExtractor: adds PageToWorksheet property to enable/disable generation of separate worksheets per page.\nnew .TextEncodingCodePage property\nPDFViewerControl: adds ValidateContextMenu allowing user to add custom items to context menu\nPDF Viewer control: adds properties ShowTextObjects, ShowImageObjects, ShowVectorObjects.\nXMLExtractor now adds \"OCRConfidence\" attribute for recognized text \nPDF/A checking functionality (in beta)\nimproving controls and text checking and alignment according to the original layout. The issue was caused by the shift of Y coordinates in controls while parsing: that was incorrect. The correct way is to shif...\nXML Extractor updated: now produces <CONTROL> tag for checkboxes and text fields\nchanged using of current directory to temp directory.\ncheckboxes,radioboxes, editboxes, comboboxes are better supported\nnow allows partial trust callers.\n\n\n5.20.1781 (January 27, 2015)\nPDF to XML, PDF to CSV, PDF to Text functionality improved\nOCRMode now provides 9 modes\n.DetectLineInsteadOfParagraph now works much better. Set it to False to capture multiline text in table cells!\nPDF controls support improved\nFDF and XFDF data extraction added\nTable detection improved to support multline text in cells and tables with absent rows\nbeta version of PDF/A validator added\nminor fixes and improvements\n\n\n5.10.1747 (November 25, 2014)\nPDF to XML, PDF to CSV, PDF to Text functions improved\nnow supports text extraction from text controls\nXML extractor now adds font style, size, name, text coordinates into <text> tags\nASP.NET sample for OCR usage added\nnew property OCRLanguageDataFolder to specify the location of \"tessdata\" folder\nimproved support of PDF files\nimproves support for rotated text\nupdated source code samples\nupdated documentation\nminor improvements and fixes\n\n5.00.1626 (August 14, 2014)\nOCR (text from images) functionality added: now you may extract text from embedded images and repair damaged text\nissue fixed with CSV and XML extractor missing last columns with some settings\nimproved support for damaged PDF files\nmultiline search text search with word matching modes is now supported\nnow may search text with hyphens and on different lines: see new source code sample Find Text With Hyphens\nnew property .RTLTextAutoDetectionEnabled (false by default) to auto detect RTL languages\nPDF Viewer GUI demo improved\nminor improvements and fixes\n\n4.00.1487 (May 30, 2014)\nimproved pdf to text, pdf to csv, pdf to xml\nissue with extraction area fixed\nImproved Unicode handling\nnew .ContentType to check if PDF is PDF, Portfolio or XFAForm \nnew properties: Unwrap, ExtractionAreaUsageMode \nnew AttachmentInfo class to obtain details about attachment\nnew XFA Form XML extraction support (see XFAFormExtractor and XFAFormToXML samples)\nnew ZuGFeRD PDF support added\nMulthithreading performance improved\nLicensing updated: Now Licensing is per developer\nnew \"match whole word\" parameter to TextExtractor.Find()\nimproved XLS and XLSX output\n\n3.40.1349 (March 10, 2014)\nimproved stability of the text extraction\nissue with the very last text line missing in some PDF files fixed\ntables with empty cells are handled better now\nissue with incorrect extraction of overlapped text objects fixed\nissue with missing spaces between words in some files fixed\nissue with incorrect X coordinate returned while searching with extraction area defined\nminor bug-fixes and improvements\n\n3.30.1240 (November 27, 2013)\nimproved support for old formats PDF files\nimage flipping issue in some PDF files fixed \nimproved text rendering in PDF files\nminor bug-fixes\n\n3.20.1209 (October 31, 2013)\ntable detection was not returning proper coordinates for 2nd and further tables, fixed\nminor source code samples updates\nDocumentSplitter now works with multipage TIF files \nminor bug-fixes\n\n3.20.1200 (October 28, 2013)\nminor rotated text issues fixed\ntable detection was not returning proper coordinates, fixed\nminor bug-fixes\n\n3.20.1179 (October 22, 2013)\npdf to text and pdf data extraction improved\nnew .AutoAlignColumnsToHeader (true by default) property to automatically align cells to the header column or not (switching this setting will help if you are getting some shifted cells)\nnew DocumentRotator class to rotate pages in PDF documents\nnew ExtractRawImages property in Images Extractor to define if we are extracting raw images or images with rotation and transformation applied \nimproved support of PDF files with rotated objects and pages\nnew source code sample showing how to extract page found by a keyword \"Find Keyword And Extract Page\"\nImages Extractor: SetExtractionArea() method added to define a rectangle area to extract images from \nimproved Splitting Pages example\nimproved pages extraction from PDF\nnew RemoveUnusedResources method to remove unused resources from PDF to reduce file size\nminor bug-fixes and improvements\n\n3.20.1100 (August 22, 2013)\nnew method: DocumentSplitter.Split(sourcefile, splitPages) to extract mulitple ranges of pages from the same PDF file\nminor bug-fixes in pdf to text engine\n\n3.20.1093 (August 5, 2013)\npdf to text minor functionality fixes\nx64 installer improvements\nminor fixes for error messages\nPDFDocument.Dispose() now not disposing the source stream with PDF if this stream was supplied by the user (so user should dispose it)\nimproved PDF format support\nminor bug-fixes\n\n3.20.1075 (July 11, 2013)\nimproved PDF To CSV, PDF To XLS, PDF To XML extraction\nimproved PDF reading speed and stability\nminor bug-fixes\n\n\n3.10.1051 (June 29, 2013)\nimproved table extraction support\nimproved pdf files support\n\n3.10.1038 (June 26, 2013)\nimproved text extraction support\nissues fixed related to incorrect extraction area coordinates for some PDF files with scanned images \nspeed improvements\nimproved support for various PDF files\n\n3.10.942 (May 30, 2013)\nimproved pdf text extraction support\nminor bug-fixes and improvements\n\n3.10.899 (May 14, 2013)\nimproved pdf to text conversion\nimproved PDF reading support\nmore source Visual Basic .NET, C# and VBScript code samples added \ndocumentation updated\n\n3.00.864 (April 11, 2013)\nimproved PDF extraction support\nimproved PDF handling\npdf splitting and merging: new property to optimize PDF files after splitting DocumentSplitter.OptimizeSplittedDocuments may decrease file size when needed\nimproved PDF fonts handling\ndemo utility updated\nsource code samples updated to run on any .NET framework by default\nminor bug-fixes\n\n\n3.00.825 (March 12, 2013)\nimproved pdf to text, pdf to csv\ndemo utility PDF Viewer reworked and updated for better UI experience\nminor improvements and fixes in PDF support\nimproved PDF stability while working with PDF files with high density vector graphics inside\nimproved support for indexed color pallettes \nimproved embedded fonts rendering\nbetter support for Unicode fonts\nnew .Version property to read exact version of the dll\nminor updates and improvements\n\n\n2.50.708 (November 11, 2012)\nPDF data extraction speed improved\nWindows 8 support improved\nPDF images and colors support improved\nPDF to csv, PDF xml, PDF to xls/xslx now skips first leading rows if they are empty\npdf text search now works better and provides more intelligent support for regular expressions\nActiveX support and installation improved and now provides single batches to run on Windows x86/x64 for Windows XP to 8 Pro \nnew property: .ExtractShadowLikeText to enable/disable extraction of shadowed text (where it is used as effect to create visual shadows)\nminor bug-fixes and improvements\n\n\n2.40.650 (November 1, 2012)\nimproved support for Unicode text extraction \nimproved support for PDF/A pdf files \nissues with white stripes appearing on multiple images combined fixed\ndata extraction internal optimizations\nimproved support for 8 bit images inside PDF\nvector drawings improved to provide better support for multiple small objects \nColor representation in images with indexed colors fixed\nType2 fonts support improved\nImproved support for embedded fonts in PDF produced by Ghostscript engine\nCCIT images compression compression related issues fixed\nLZW compressed PDF support improved\nimproved support for shading objects\nimproved PDF fonts support \nimproved support for PDF with 4 bit images\n\n\n2.30.594 (September 18, 2012)\nPDF data extraction improved\nmemory and speed optimizations\nfixing issue with empty data while extracting data from some PDF files\nimproved images extraction support (more image encoding variations are supported)\nminor updates in examples\nminor bug-fixes\n\n2.30.568 (June 21, 2012)\npdf to text conversion quality improved\nmultithreading usage stability has been improved\nhanging issue on some PDF fixed\nPDF Extractor SDK: updated sample for StructuredExtractor (previously known as TableExtractor interface)\nminor fixes and improvements\n\n\n2.20.0.539 (May 4, 2012)\nimproved stability\ndemo utility improved\nimportant security fixes\n\n\n2.20.525 (April 14, 2012)\nimproved speed (up to x2 faster on some documents)\nTables detection improved\nupdated PDF Viewer utility\nimproved support for structured text extraction (CSV and XML data extraction)\nminor bug-fixes\n\n2.20.458 (February 2, 2012)\nminor fixes in TableDetector class (.TableDetectionMinNumberOfColumns and .TableDetectionMinNumberOfRows were working incorrectly)\nimproved text extraction for PDF files generated from text files\nimproved support for PDF files produced by Adobe Acrobat\nPDF Viewer: CSV, XML and Text extractor forms updated to show .PreserveFormattingOnTextExtraction option\nminor fixes in .NET 4.0 assemblies\nRenderer SDK adds /Visual Basic/PDF To BMP using streams/ sample\nimproved support for PDF with forms objects\nimproved leading spaces format detection in text extraction\n.SetExtractionArea() added to define area on a page to work with in PDF Renderer SKD\nimproved fonts information reading support in PDF files\nnew .PageSeparator property in TextExtractor allowing to define a separator string for pages if you need one\nfixing issue with indexed colorspaces in PDF\nimproved PDF format support\n\n2.20.415 (December 21, 2011)\nPDF Extractor SDK: minor update for PDF to XLS sample\nrendering: improved fonts support\ntext extraction with formatting improved\nnew source code sample to show how to save extracted text to a stream\nperformance optimized and pdf processing speed improved\nimproved support for PDF format\n\n2.20.396 (November 30, 2011)\nfixing issues with CSV, XML and XLS extraction on long tables\nPDF Viewer now provides ability to turn on/off text formatting support on extraction\nPDF support improved\nminor bug-fixes\n\n2.20.392 (November 25, 2011)\nNEW table detection implemented, see new Bytescout.PDFExtractor.TableDetector interface and source code samples in /Find Table And Extract As CSV/ sub-folder in examples\nNEW regular expressions support for text search in TextExtractor (see .RegexSearch property)\nText search functionality improved\nminor bug-fixes\n\n2.10.303 (October 4, 2011)\nNEW: DocumentMerger and DocumentSplitter interfaces and classes to merge and split PDF documents\nimproved support for PDF documents\nPDF processing speed increased\nminor bug-fixes\n\n2.10.276 (August 26, 2011)\nNEW: AttachmentExtractor interface to extract file attachments and embedded files from PDF (see /Examples/Extract Attachments/ for sample source code)\nNEW: XLSExtractor interface to extract tables from PDF as XLS and XLSX Excel files (including font formatting)\nimproved text extraction functionality\nimproved output image quality\nimproved support of Unicode text\nimproved support of damaged PDF files (not hanging on damaged files anymore)\n\n2.00.228 (12 July 2011)\nCSVExtractor: SeparationSymbol and QuotationSymbol properties were added\nTrimValues property for CSVExtractor and XMLExtractor: turned on by default to trim detected cell values automatically\nDefault properties for CSV extraction improved\nfixed incorrect default space ratio in text extractor to 0.4, previous value 1.2 was causing to join some words into a single one\nTextExtractor.detectNewColumnBySpacesRatio renamed into .SpaceRatioBetweenWords property\nPDFViewer now shows options dialog to adjust SpaceRatioBetweenWords if needed\nminor bug-fixes\n\n2.00.217 (21 June 2011)\nCSV and XML extraction speed greatly improved\nCSVExtractor and XMLExtractor classes add new .DetectNewColumnBySpacesRatio property: use this property to control space between detected columns of text\nXML and CSV Extractor adds .SkipCellsWithEmptyValues property (true by default to skip cells with empty values)\nPDF Viewer now shows extraction options dialog for XML and CSV export functions\nPDF To CSV to XLS source code sample added\nPDF To CSV\\Delphi\\ source code sample added\nminor bug-fixes and improvements\n\n2.00.206 (6 June 2011)\nsupport for .NET 3.5, .NET 4.00 added\nDelphi source code sample has been added\nminor bug-fixes and improvements\n\n2.00.186 (May 16, 2011)\npdf processing speed increased up to x10 times\nminor bug-fixes and improvements\n\n1.10.168 (May 6 2011)\nsupport for password protected PDF documents improved (was not working properly in previous release)\nminor bug-fixes and improvements\n\n1.10.160 (12 April 2011)\n\nXML comments are available now to show hints for methods, classes and properties in Visual Studio\nNew property: .ExtractColumnByColumn (false default), set to True to extract text column by column instead of line by line\nPDF Viewer freeware utility updated to feature \"Extract Text (line by line)\" and \"Extract Text (column by column)\" buttons\nimproved support for single paged PDF documents produced by Acrobat Distiller software\nclipping issues were fixed \nfixed hanging on some broken PDF documents \nimproved text decoding support\nminor bug-fixes\n\n\n1.10.150 (10 March 2011)\n* PDF files support improved\n+ now handles PDF files from Google Doc without errors\n* minor bug-fixes\n\n1.10.144 (26 February 2011)\n+ now works with secured documents (provide passsword if needed in .Password property)\n+ minor bug-fixes and improvements\n+ updated GUI demo application\n\n1.10.121 (11 February 2011)\n+ PDF to CSV extractor added\n+ PDF to XML extractor added\n+ support for invisible text extraction added\n+ minor bug-fixes and improvements\n\n\n1.00.30 (9 November 2010)\n+ new version",
  "requireLicenseAcceptance": false,
  "verbatimVersion": "7.00.0.2474",
  "version": "7.0.0.2474",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.11.19.03.31.44/bytescout.pdfextractor.7.0.0.2474.json#Bytescout.PDFExtractor.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 7271,
      "fullName": "Bytescout.PDFExtractor.nuspec",
      "length": 20565,
      "name": "Bytescout.PDFExtractor.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.11.19.03.31.44/bytescout.pdfextractor.7.0.0.2474.json#lib/net40/Bytescout.PDFExtractor.dll",
      "@type": "PackageEntry",
      "compressedLength": 4274744,
      "fullName": "lib/net40/Bytescout.PDFExtractor.dll",
      "length": 10695816,
      "name": "Bytescout.PDFExtractor.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.11.19.03.31.44/bytescout.pdfextractor.7.0.0.2474.json#lib/net40/Bytescout.PDFExtractor.OCRExtension.dll",
      "@type": "PackageEntry",
      "compressedLength": 4040277,
      "fullName": "lib/net40/Bytescout.PDFExtractor.OCRExtension.dll",
      "length": 8686728,
      "name": "Bytescout.PDFExtractor.OCRExtension.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.11.19.03.31.44/bytescout.pdfextractor.7.0.0.2474.json#lib/net40/Bytescout.PDFExtractor.XML",
      "@type": "PackageEntry",
      "compressedLength": 36467,
      "fullName": "lib/net40/Bytescout.PDFExtractor.XML",
      "length": 448480,
      "name": "Bytescout.PDFExtractor.XML"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.11.19.03.31.44/bytescout.pdfextractor.7.0.0.2474.json#lib/net40-client/Bytescout.PDFExtractor.dll",
      "@type": "PackageEntry",
      "compressedLength": 3844686,
      "fullName": "lib/net40-client/Bytescout.PDFExtractor.dll",
      "length": 9806472,
      "name": "Bytescout.PDFExtractor.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.11.19.03.31.44/bytescout.pdfextractor.7.0.0.2474.json#lib/net40-client/Bytescout.PDFExtractor.OCRExtension.dll",
      "@type": "PackageEntry",
      "compressedLength": 4039730,
      "fullName": "lib/net40-client/Bytescout.PDFExtractor.OCRExtension.dll",
      "length": 8686728,
      "name": "Bytescout.PDFExtractor.OCRExtension.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.11.19.03.31.44/bytescout.pdfextractor.7.0.0.2474.json#lib/net40-client/Bytescout.PDFExtractor.XML",
      "@type": "PackageEntry",
      "compressedLength": 36269,
      "fullName": "lib/net40-client/Bytescout.PDFExtractor.XML",
      "length": 445106,
      "name": "Bytescout.PDFExtractor.XML"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.11.19.03.31.44/bytescout.pdfextractor.7.0.0.2474.json#tools/net40/Bytescout.PDFExtractor.dll",
      "@type": "PackageEntry",
      "compressedLength": 4274744,
      "fullName": "tools/net40/Bytescout.PDFExtractor.dll",
      "length": 10695816,
      "name": "Bytescout.PDFExtractor.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.11.19.03.31.44/bytescout.pdfextractor.7.0.0.2474.json#tools/net40/Bytescout.PDFExtractor.OCRExtension.dll",
      "@type": "PackageEntry",
      "compressedLength": 4040277,
      "fullName": "tools/net40/Bytescout.PDFExtractor.OCRExtension.dll",
      "length": 8686728,
      "name": "Bytescout.PDFExtractor.OCRExtension.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.11.19.03.31.44/bytescout.pdfextractor.7.0.0.2474.json#tools/net40/Bytescout.PDFExtractor.tlb",
      "@type": "PackageEntry",
      "compressedLength": 24251,
      "fullName": "tools/net40/Bytescout.PDFExtractor.tlb",
      "length": 133272,
      "name": "Bytescout.PDFExtractor.tlb"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.11.19.03.31.44/bytescout.pdfextractor.7.0.0.2474.json#tools/net40/Bytescout.PDFExtractor.XML",
      "@type": "PackageEntry",
      "compressedLength": 36467,
      "fullName": "tools/net40/Bytescout.PDFExtractor.XML",
      "length": 448480,
      "name": "Bytescout.PDFExtractor.XML"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.11.19.03.31.44/bytescout.pdfextractor.7.0.0.2474.json#tools/net40-client/Bytescout.PDFExtractor.dll",
      "@type": "PackageEntry",
      "compressedLength": 3844686,
      "fullName": "tools/net40-client/Bytescout.PDFExtractor.dll",
      "length": 9806472,
      "name": "Bytescout.PDFExtractor.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.11.19.03.31.44/bytescout.pdfextractor.7.0.0.2474.json#tools/net40-client/Bytescout.PDFExtractor.OCRExtension.dll",
      "@type": "PackageEntry",
      "compressedLength": 4039730,
      "fullName": "tools/net40-client/Bytescout.PDFExtractor.OCRExtension.dll",
      "length": 8686728,
      "name": "Bytescout.PDFExtractor.OCRExtension.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.11.19.03.31.44/bytescout.pdfextractor.7.0.0.2474.json#tools/net40-client/Bytescout.PDFExtractor.XML",
      "@type": "PackageEntry",
      "compressedLength": 36269,
      "fullName": "tools/net40-client/Bytescout.PDFExtractor.XML",
      "length": 445106,
      "name": "Bytescout.PDFExtractor.XML"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.11.19.03.31.44/bytescout.pdfextractor.7.0.0.2474.json#content/net11/_._",
      "@type": "PackageEntry",
      "compressedLength": 2,
      "fullName": "content/net11/_._",
      "length": 0,
      "name": "_._"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.11.19.03.31.44/bytescout.pdfextractor.7.0.0.2474.json#content/net20/_._",
      "@type": "PackageEntry",
      "compressedLength": 2,
      "fullName": "content/net20/_._",
      "length": 0,
      "name": "_._"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.11.19.03.31.44/bytescout.pdfextractor.7.0.0.2474.json#content/net35/_._",
      "@type": "PackageEntry",
      "compressedLength": 2,
      "fullName": "content/net35/_._",
      "length": 0,
      "name": "_._"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.11.19.03.31.44/bytescout.pdfextractor.7.0.0.2474.json#content/net35-client/_._",
      "@type": "PackageEntry",
      "compressedLength": 2,
      "fullName": "content/net35-client/_._",
      "length": 0,
      "name": "_._"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.11.19.03.31.44/bytescout.pdfextractor.7.0.0.2474.json#content/net40/_._",
      "@type": "PackageEntry",
      "compressedLength": 2,
      "fullName": "content/net40/_._",
      "length": 0,
      "name": "_._"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.11.19.03.31.44/bytescout.pdfextractor.7.0.0.2474.json#content/net40-client/_._",
      "@type": "PackageEntry",
      "compressedLength": 2,
      "fullName": "content/net40-client/_._",
      "length": 0,
      "name": "_._"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.11.19.03.31.44/bytescout.pdfextractor.7.0.0.2474.json#content/net45/_._",
      "@type": "PackageEntry",
      "compressedLength": 2,
      "fullName": "content/net45/_._",
      "length": 0,
      "name": "_._"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.11.19.03.31.44/bytescout.pdfextractor.7.0.0.2474.json#lib/net11/_._",
      "@type": "PackageEntry",
      "compressedLength": 2,
      "fullName": "lib/net11/_._",
      "length": 0,
      "name": "_._"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.11.19.03.31.44/bytescout.pdfextractor.7.0.0.2474.json#lib/net20/_._",
      "@type": "PackageEntry",
      "compressedLength": 2,
      "fullName": "lib/net20/_._",
      "length": 0,
      "name": "_._"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.11.19.03.31.44/bytescout.pdfextractor.7.0.0.2474.json#lib/net35/_._",
      "@type": "PackageEntry",
      "compressedLength": 2,
      "fullName": "lib/net35/_._",
      "length": 0,
      "name": "_._"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.11.19.03.31.44/bytescout.pdfextractor.7.0.0.2474.json#lib/net35-client/_._",
      "@type": "PackageEntry",
      "compressedLength": 2,
      "fullName": "lib/net35-client/_._",
      "length": 0,
      "name": "_._"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.11.19.03.31.44/bytescout.pdfextractor.7.0.0.2474.json#lib/net45/_._",
      "@type": "PackageEntry",
      "compressedLength": 2,
      "fullName": "lib/net45/_._",
      "length": 0,
      "name": "_._"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.11.19.03.31.44/bytescout.pdfextractor.7.0.0.2474.json#tools/net11/_._",
      "@type": "PackageEntry",
      "compressedLength": 2,
      "fullName": "tools/net11/_._",
      "length": 0,
      "name": "_._"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.11.19.03.31.44/bytescout.pdfextractor.7.0.0.2474.json#tools/net20/_._",
      "@type": "PackageEntry",
      "compressedLength": 2,
      "fullName": "tools/net20/_._",
      "length": 0,
      "name": "_._"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.11.19.03.31.44/bytescout.pdfextractor.7.0.0.2474.json#tools/net35/_._",
      "@type": "PackageEntry",
      "compressedLength": 2,
      "fullName": "tools/net35/_._",
      "length": 0,
      "name": "_._"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.11.19.03.31.44/bytescout.pdfextractor.7.0.0.2474.json#tools/net35-client/_._",
      "@type": "PackageEntry",
      "compressedLength": 2,
      "fullName": "tools/net35-client/_._",
      "length": 0,
      "name": "_._"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.11.19.03.31.44/bytescout.pdfextractor.7.0.0.2474.json#tools/net45/_._",
      "@type": "PackageEntry",
      "compressedLength": 2,
      "fullName": "tools/net45/_._",
      "length": 0,
      "name": "_._"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.11.19.03.31.44/bytescout.pdfextractor.7.0.0.2474.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9465,
      "fullName": ".signature.p7s",
      "length": 9465,
      "name": ".signature.p7s"
    }
  ],
  "tags": [
    "bytescout",
    "pdf",
    "csv",
    "xml",
    "text",
    "to"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    }
  }
}