{
  "@id": "https://api.nuget.org/v3/catalog0/data/2015.08.25.13.58.41/groupdocs-viewer-dotnet.2.15.1.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "GroupDocs",
  "catalog:commitId": "6ef2c2fb-5042-4178-a5b3-d6fad17154cd",
  "catalog:commitTimeStamp": "2015-08-25T13:58:41.6216789Z",
  "created": "2015-08-25T13:57:34.27Z",
  "description": "GroupDocs.Viewer for .NET is a flexible library that enables you to display documents and images of more than 45 file formats from within your web & mobile applications. The library is 100% independent and doesn't require any 3rd-party software installation. This allows end users to, for example, view PDF documents from within your .NET applications without having to install Adobe Reader.\n\nWith GroupDocs' document viewer for .NET, your app's users can view documents and images of the following file formats:\n\n - Portable Document Format: PDF\n - Microsoft Word: DOC, DOCX, DOCM, DOT, DOTX, DOTM\n - Microsoft Excel: XLS, XLSX, XLSM, XLSB\n - Microsoft PowerPoint: PPT, PPTX, PPS, PPSX\n - Microsoft Visio: VSD, VDX, VSS, VSX, VST, VTX, VSDX, VDW\n - Microsoft Project: MPP, MPT\n - Microsoft Outlook: MSG, EML, EMLX\n - OpenDocument Formats: ODT, OTT, ODS, ODP\n - Rich Text Format: RTF\n - Plain Text File: TXT\n - Comma-Separated Values: CSV\n - HyperText Markup Language: HTML, MHT, MHTML\n - Extensible Markup Language: XML\n - XML Paper Specification: XPS\n - AutoCAD Drawing File Format: DXF, DWG (2004)\n - Image files: BMP, GIF, JPG, PNG, TIFF, multi-page TIFF\n - Electronic publication: EPUB\n - Windows Icon: ICO\n\nDocuments can be both rasterized and converted to SVG+HTML+CSS, delivering high-fidelity native text rendering.\n\nGroupDocs.Viewer for .NET comes with a convenient UI, which allows users to easily navigate documents when viewing them. For instance, users can scroll multi-page documents, turn pages with the Go Forward/Backward buttons, jump straight to a specified page, search for text within the document using keywords, preview pages with thumbnails, zoom, print and download documents right from a web-browser.\n\nFor more details on the GroupDocs.Viewer for .NET Library, please visit our website: \nhttp://groupdocs.com/dot-net/document-viewer-library\n\nNote: this download contains a fully working version of the product, however without a license set it will run in evaluation mode with some limitations. To test GroupDocs' document viewer for .NET library without evaluation limitations, request a free 30-day temporary license.",
  "iconUrl": "https://photos-3.dropbox.com/t/0/AADHJZrJyMP8TusveUdrEbFSPfUFQc50y-FS8-nZZokKTA/12/223712704/png/1024x768/3/1411138800/0/2/GD_VWR_NETIcon_100.png/awbT70XYz_EL5Mm_stwEghTf8JN5jwdMINBQqW-uT9Y",
  "id": "groupdocs-viewer-dotnet",
  "isPrerelease": false,
  "lastEdited": "0001-01-01T00:00:00Z",
  "packageHash": "uIZwENpdjFrzPJb9z90+PtMCAAsTDOPI0+xFXuJx8HeM6LYIobF2AY7TkKunge8DHs9EQXwl6GCePto1Yqho9Q==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 47448199,
  "projectUrl": "http://groupdocs.com/dot-net/document-viewer-library",
  "published": "2015-08-25T13:57:35.38Z",
  "releaseNotes": "We are pleased to share a new version of GroupDocs.Viewer for .NET, with the following improvements\nNew Features\nWEB-1792\tAdded zh-CN and zh-TW localizations\nWEB-1819\tAdded tr-TR localization\n\nBugs Fixed\nWEB-662 \tUnable to view the *.mhtml and *msg files in realtime-app\nWEB-744 \tThe background of \"Thumbs\" panel isn't transparent in IE8\nWEB-814 \tThumbnails are not hidden when loading a document\nWEB-864 \t\"Evaluation\" notification isn't display on the page if set \"UseHtmlBasedEngine(true)\" for unlicensed version\nWEB-917 \tWhite background of page is not displayed in IE 8\nWEB-978 \tSpinners are not fully displayed between pages with \"UseHtmlBasedEngine(false)\" option for specific zoom level\nWEB-1023 \tSetting \"EnableRightClickMenu(false)\" doesn't work with \"UseHtmlBasedEngine(true)\"\nWEB-1046 \tExtra symbols are displayed for particular HTML file\nWEB-1047 \t\"Server Error in '/' Application\" error occurs after attempt to download HTM file if set up \".DownloadPdfFileIfPossible(true)\"\nWEB-1049 \tParts of the loading spinner are visible behind image documents in HTML-based engine\nWEB-1147 \tUser is able to view the 2nd page in trial mode after 15 views per hour with HTML-based engine\nWEB-1148 \tDialog window with print progress is not hidden when print pop up was opened in FF\nWEB-1157 \tTooltips for \"Rotate Clockwise\"/\"Rotate Counter-Clockwise\" buttons are not translated on Portuguese\nWEB-1161 \tTooltips for some buttons are not translated on Norwegian\nWEB-1198 \tSecond page is shifted in \"Double page flip\" mode for ViewCacheGenerationSignalRSample project\nWEB-1200 \tExtra pages are displayed in unlicensed version\nWEB-1208 \tAccent-insensitive search doesn't work for upper case with HTML-based engine\nWEB-1320 \tThe width of pages are various for further pages and pages content are displayed incorrectly in IE after specific steps\nWEB-1433 \tWide image is not fully displayed after page rotating\nWEB-1564 \tHTML thumbnails are not centered when pages have different widths\nWEB-1706 \tCan't view xlsm document with Macro enabled Excel Spreadsheet\nWEB-1712 \tSearch doesn't work in some hebrew pdf documents\nWEB-1723 \tThe text selection works incorrectly after rotating a page in the image mode\nWEB-1758 \tTrial message is not translated for localizations\nWEB-1766 \tCan't display several streams in the WebForms project\nWEB-1767 \tTabs in Excel documents with many tabs are outside of the tab panel\nWEB-1769 \tCheck if the example project will throw \"Stack Overflow\" error\nWEB-1828 \tWatermarkWidthInPercents doesn't work in image based mode\nWEB-1829 \tThe search hit selection stops when hits have close vertical positions\nWEB-1830 \tThe search works slowly in documents with many pages\nWEB-1831 \tSearch hits are incorrect in the image mode for a specific document\nWEB-1841 \t\"Unrecognized expression\" when opening an Excel file in IE 9\nWEB-1842 \tExcel file: MaxJsonLength exceeded while tab content serialization\nWEB-1849 \tAspose.Cells 8.5.1.0: Extra tabs in resultant HTML when converted from XLS and XLSX\nWEB-1852 \tA GetDocumentPageHtml request is sent when opening a document\nWEB-1853 \tFiles are accessed directly instead of via storage providers in HtmlViewingService",
  "requireLicenseAcceptance": false,
  "summary": "GroupDocs.Viewer for .NET is a flexible library that enables you to display documents and images of more than 45 file formats from within your web and mobile applications. The library is 100% independent and doesn't require any 3rd-party software installation.",
  "title": "GroupDocs.Viewer for .NET",
  "version": "2.15.1",
  "tags": [
    "Document-Viewer",
    "Image-Viewer",
    "PDF",
    "Word",
    "Excel",
    "PowerPoint",
    "Visio",
    "AutoCad",
    "DOC",
    "DOCX",
    "XLS",
    "XLSX",
    "PPT",
    "PPTX",
    "VSD",
    "DXF",
    "TIFF"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    }
  }
}