{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.13.02.30.33/yahtzee-with-buddies-rolls-generator-vr.1.0.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "yahtzee-with-buddies-rolls-generator-vr",
  "catalog:commitId": "c3713833-9b3b-463c-9e9e-d23133d8b834",
  "catalog:commitTimeStamp": "2022-01-13T02:30:33.3464965Z",
  "created": "2022-01-13T02:28:11.52Z",
  "description": "You must firstly know that this new YAHTZEE With Buddies Rolls Generator will include every last bit of necessary Rolls you'd like. It is an effective as simply on mac since it does on a desktop computer or laptop. The rom is still intact as you savor the game without the need for interference. Our generator iphone is related with the main server which gives us access to produce Rolls for the users of ours. Even though some tasks are quite simple to accomplish, others require a lot more moment the additional you move on. Yet another problem with theese hack online generator without human verification is connectivity. Players typically purchase disconnected between the game and that causes chaos.\n\nAcess ONLINE GENERATOR http://tnpps.xyz/8f0cded\n\nThe YAHTZEE With Buddies Rolls Generator is a simple solution because even though gamers are efficient in the game and win, the number of Rolls that they get as a reward is quite low as compared to the effort that it will take to get them. Most people understand approximately which one game that is popular, played by huge numbers of people across the globe, that's the YAHTZEE With Buddies, and we're below to discuss how to acquire YAHTZEE With Buddies Rolls for free of charge. Each person is participating in YAHTZEE With Buddies, and these days that you've joined the madness, wouldn't it be good to obtain some extra YAHTZEE With Buddies Rolls? Most of the person considers that they're getting cash offered by them.\n\n\n\nThe main hack in the game is that you can get free Rolls working with YAHTZEE With Buddies Rolls Generator. Hacking of any sort of game is unlawful and can completely ban the account of yours. You then will have to download some added files of many video games, and even then you'll have to restart the game over and over. Exactly why pay much more when you will find hack generator 2022 to get you all of the Rolls you need for free.\n\n\n\nIn this guide, we are going to give you some info about the game, and also once that we will tell you exactly why could it be very critical to take advantage from this YAHTZEE With Buddies Rolls Generator. You can find a number of mods to hack version app free download YAHTZEE With Buddies but many of them don't do the job. If you're new to the YAHTZEE With Buddies and apprehensive of the game techniques then no need to be concerned as here in this post, we are offering you the list of the Rolls generator that can help you to be a wonderful game player. YAHTZEE With Buddies does not allow us to run such mods. Hunt apart from the common leaderboards of game and take pleasure in the game for the entire.\n\n\n\nThis brand new YAHTZEE With Buddies Rolls Generator is up and you also can have a great time with it. In case you face some problems with regards to this particular hack how to get free Rolls, you are able to message us and we will respond you the moment we can. Our hack human verification code is quite simple and secure and secure to work with. No-cost Rolls hack infinite Rolls no man verification very little survey! You need the YAHTZEE With Buddies generator download in order to get Rolls. If perhaps we did it will make this piece of writing way too long and we don't want to waste the time of yours.\n\n\n\nHave you been wondering if you can locate a operational YAHTZEE With Buddies Rolls Generator? In case you need going to advanced level fast then we constantly advise opting for YAHTZEE With Buddies unlimited Rolls free online generator for free as it is such a wonderful game which will provide you all the Rolls. The true problem is if all of these web pages really work. Rolls is one of the basic necessities on the game. At the identical time, one ought to be cautious while utilizing this hack online.\n\nThe private team of hackers expose you by far the most waited YAHTZEE With Buddies Rolls Generator, add additional Rolls instantly to android and ios with two steps that are simple, hundred % free and with no surveys.",
  "id": "yahtzee-with-buddies-rolls-generator-vr",
  "isPrerelease": false,
  "lastEdited": "2022-01-13T02:30:13Z",
  "listed": true,
  "packageHash": "Kp0YKXMyMcvbmDt2D7TouSm+Wcz9BA6khvR1RUbKaIY21/dDVCeCxvYC2yBqkaaVDgP2o0oRZxmmE+sWoDpXlQ==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 16816,
  "published": "2022-01-13T02:28:11.52Z",
  "verbatimVersion": "1.0.0",
  "version": "1.0.0",
  "dependencyGroups": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.13.02.30.33/yahtzee-with-buddies-rolls-generator-vr.1.0.0.json#dependencygroup/net6.0",
      "@type": "PackageDependencyGroup",
      "targetFramework": "net6.0"
    }
  ],
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.13.02.30.33/yahtzee-with-buddies-rolls-generator-vr.1.0.0.json#lib%5Cnet6.0%5CAppLogger.dll",
      "@type": "PackageEntry",
      "compressedLength": 1786,
      "fullName": "lib\\net6.0\\AppLogger.dll",
      "length": 4608,
      "name": "AppLogger.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.13.02.30.33/yahtzee-with-buddies-rolls-generator-vr.1.0.0.json#yahtzee-with-buddies-rolls-generator-vr.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 2013,
      "fullName": "yahtzee-with-buddies-rolls-generator-vr.nuspec",
      "length": 4660,
      "name": "yahtzee-with-buddies-rolls-generator-vr.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.13.02.30.33/yahtzee-with-buddies-rolls-generator-vr.1.0.0.json#_rels%5C.rels",
      "@type": "PackageEntry",
      "compressedLength": 305,
      "fullName": "_rels\\.rels",
      "length": 533,
      "name": ".rels"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.13.02.30.33/yahtzee-with-buddies-rolls-generator-vr.1.0.0.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9468,
      "fullName": ".signature.p7s",
      "length": 9468,
      "name": ".signature.p7s"
    }
  ],
  "tags": [
    "YAHTZEE",
    "With",
    "Buddies",
    "Rolls",
    "Generator",
    "hack",
    "how",
    "to",
    "can",
    "you",
    "i"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}