{
  "@id": "https://api.nuget.org/v3/catalog0/data/2015.02.05.13.28.02/throttlingsuite.http.1.3.1.17.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "Lenny Granovsky",
  "catalog:commitId": "23a289b2-b9ef-496c-bb51-a46f7b16fe0c",
  "catalog:commitTimeStamp": "2015-02-05T13:28:02.1512347Z",
  "created": "2014-06-08T14:46:01.847Z",
  "description": "This project is a spin-off of the original \"Throttling Suite for ASP.NET Applications\" with improved capabilities providing implementation for .NET Web API framework. The implementation supports all available hosting options provisioning equal functionality for IIS-hosted and OWIN self-hosted solutions. It is specifically designed to throttle high performance and high throughput Web API applications.\n\nThe library contains multiple controller types implementing different throttling algorithms:\nLinear throttling - limits the number of calls by enforcing consistent delay between consequent requests;\nShort Average - limits the number of calls by specified number of requests per configured duration; it does not intend to limit the overall number of requests, but rather assures blocking excessive requests; this strategy is very helpful to cut the requests floods;\nLong Average - limits the number of calls by specified number of requests per configured duration; this strategy limits an overall number of calls within long time duration; this is also known as applying penalty to the client for excessive application use.\n\nEach throttling controller is capable of unique client determination and management. The throttling for any end-point, or set of end-points can be configured either for the entire application, or per-client. It does not purely rely on client IP address, allowing multiple clients from the same network concurrently making requests to the server. \nThe Throttling Suite allows setting multiple controllers within the application and applying each to a pre-filtered traffic. The filters are also configurable.\n\nThe Throttling Suite provides two modes: real blocking mode when request is blocked with 429 HTTP Status code and log-only mode.\n\nThe code is highly optimized having very low memory impact. The throttling evaluation functionality takes less than 0.3 ms to run.\n\nThe v1.2 is updated to include \"Retry-After\" response header in the blocked response helping API client to negotiate the request rate with API server side. \n\nThe v1.2 also allows to ignore the actual request URL substituting one with Throttling controller instance scope. This provides the benefit to count requests for multiple API endpoints toward the same throttling threshold.\n\nThe v1.3 enables configuration from the code rather than XML *.config file.",
  "frameworkAssemblyGroup": {
    "@id": "https://api.nuget.org/v3/catalog0/data/2015.02.05.13.28.02/throttlingsuite.http.1.3.1.17.json#frameworkassemblygroup",
    "assembly": [
      "Microsoft.CSharp",
      "System",
      "System.Configuration",
      "System.Core",
      "System.Runtime.Serialization"
    ]
  },
  "id": "ThrottlingSuite.Http",
  "isPrerelease": false,
  "lastEdited": "0001-01-01T00:00:00Z",
  "licenseUrl": "http://throttlewebapi.codeplex.com/license",
  "packageHash": "RVSHfcs7Ldl7fRngk60YiF8It49M1SlTFOHHhrBDwrd3UmpQSniTgsdAtwjTzVvHoXKgNLh6sc7aBaln9QEd4w==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 108104,
  "projectUrl": "http://throttlewebapi.codeplex.com/",
  "published": "1900-01-01T00:00:00Z",
  "releaseNotes": "Please visit http://throttlewebapi.codeplex.com/documentation for assistance with configuration. It provides you with examples and rules used by Throttling Suite and its Controllers.\n\nThe Throttling Suite DLL with TRACE is available at http://throttlewebapi.codeplex.com should you require to analyze the TRACE output.\n\nThe v1.3.1 simplifies configuration from the code using additional short-cut methods. It also improves handling for application virtual path root.",
  "requireLicenseAcceptance": false,
  "summary": "The Throttling Suite provides throttling control capabilities to the .NET Web API applications. It is highly customizable product, yet simple to use.",
  "title": "Throttling Suite for Web API Applications",
  "version": "1.3.1.17",
  "dependencyGroups": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2015.02.05.13.28.02/throttlingsuite.http.1.3.1.17.json#dependencygroup",
      "@type": "PackageDependencyGroup",
      "dependencies": [
        {
          "@id": "https://api.nuget.org/v3/catalog0/data/2015.02.05.13.28.02/throttlingsuite.http.1.3.1.17.json#dependencygroup/newtonsoft.json",
          "@type": "PackageDependency",
          "id": "Newtonsoft.Json",
          "range": "[4.5.0, )"
        },
        {
          "@id": "https://api.nuget.org/v3/catalog0/data/2015.02.05.13.28.02/throttlingsuite.http.1.3.1.17.json#dependencygroup/microsoft.aspnet.webapi",
          "@type": "PackageDependency",
          "id": "Microsoft.AspNet.WebApi",
          "range": "[5.1.0, )"
        }
      ]
    }
  ],
  "tags": [
    "throttle",
    "Web",
    "API",
    ".NET",
    "OWIN",
    "throttling",
    "controller"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    }
  }
}