{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.18.15.18.41/monster-manual-5e-pdf.1.0.1.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "tony",
  "catalog:commitId": "f4ea632d-e0d1-40fc-83dc-5468b934a8db",
  "catalog:commitTimeStamp": "2022-01-18T15:18:41.3872761Z",
  "created": "2022-01-18T15:16:18.943Z",
  "description": "Monster Manual 5e Pdf\n\nThe Monster Manual is a bestiary of the creatures that populate the Dungeons & Dragons game. The Monster Manual is a compendium of all the monsters that can be used in Dungeons & Dragons adventures, and it includes monsters deemed appropriate for use with the 5th edition of the Dungeons & Dragons roleplaying game.\n\nClick Here to Download >>>>>>> https://za.uy/Npj8F\n\nThe Monster Manual is a compendium of creatures for use in the game of Dungeons & Dragons (D&D) and other tabletop role-playing games. It contains game statistics and illustrations for hundreds of monsters, including dragons, giants, mind flayers, and beholders.\n\nThe fifth edition of Dungeons & Dragons was released on July 15, 2014.\n\nMonster Manual 5e Pdf download\n\nSwashbucklers come in all shapes and sizes. Observe one to be that is a good time for you. \n\nD&D unites individuals and manufactures new kinships. Senseless minutes produce inside jokes; moving fights leave cherished recollections—regardless of whether in the fieriness of fight, involved in friendly interest, or tackling astute riddles, your party has you covered. \n\nPick Your Own Path \n\nThe forest are developing dim. Behind a mass of ivy, you see the stones of a disintegrating palace. What do you do? \n\nAn elvish pastor, driven from society for illegal entering custom. A dwarven paladin, offering reparations for a disgraceful past. The Player's Handbook gives the skeleton to your characters. Fully explore them anyway you pick. \n\nIn D&D, your choices are boundless. Since the Dungeon Master, as storyteller of your story, can make do in response to any decision you make, what occurs next is completely adaptable. Do you try to continue?\n\nThe first Monster Manual was published in 1977 by Gary Gygax, and the book has been printed in many editions over the years. The 5th edition Monster Manual was released on September 30th, 2014.\n\nProfoundly, every one of the three terrible game enhancements are marked down right now for around 20 bucks each on amazon this month, totally worth the cost of affirmation! \n\nPresently you could, similar to I, exclusively use applications like Fantasy Grounds (Steam customer) and additionally free PDFs, But nothing replaces the inclination and convenience of having actual duplicates of each guide close by. Also as a great reward they looks staggering in my shelf. Make you look much more expert as a DM face to face. In conclusion, each of the six together give you an outrageous take off platform for planning, running and changing premade or hand crafted crusades! \n\nShown up on schedule (in spite of the fact that had a few issues in my town, nothing to do with the thing) \n\nIt was in wonderful condition, spine unblemished, never opened. The craftsmanship is totally staggering. An incredible point by point manual for every one of the numerous beasts/foes you can toss into your D&D experience, yet really it's even enjoyable to simply flip through checking out the outlines and perusing up with regards to the animals!\n\nMonster Manual 5e Pdf google drive\n\nMy main lament was getting the one book I had before this deal however ce n'est pas grave.\n\nI might want a rundown of animals of the book assembled by cr before the finish of the book, and maybe one of them gathered by where it's probably going to experience them, similar to the DMs guide has. I figure they understood that subsequent to sending it off to print or something to that effect... Still an extraordinary assortment\n\nThe Monster Manual pdf is a book that contains information on the creatures that inhabit the Dungeons & Dragons universe. It details their behavior, statistics, and other important information that can be used to assess what kind of threat they are.\n\nThe Monster Manual is one of the most important tools in a Dungeon Master’s arsenal, and it is essential for creating encounters and worlds to challenge players.",
  "id": "monster-manual-5e-pdf",
  "isPrerelease": false,
  "lastEdited": "2022-01-18T15:18:06.907Z",
  "listed": true,
  "packageHash": "H2x4sp4jDk8OHkkYTAOOCNDMrhlrnVaeosevCb8i2PjEYkX9uA5LNxuUt0bH0cxCSdxDbq/WfzsboHLFlfirbw==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 21133,
  "published": "2022-01-18T15:16:18.943Z",
  "releaseNotes": "monster-manual-5e-pdf",
  "verbatimVersion": "1.0.1",
  "version": "1.0.1",
  "dependencyGroups": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.18.15.18.41/monster-manual-5e-pdf.1.0.1.json#dependencygroup/net6.0",
      "@type": "PackageDependencyGroup",
      "targetFramework": "net6.0"
    }
  ],
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.18.15.18.41/monster-manual-5e-pdf.1.0.1.json#monster-manual-5e-pdf.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 2167,
      "fullName": "monster-manual-5e-pdf.nuspec",
      "length": 4483,
      "name": "monster-manual-5e-pdf.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.18.15.18.41/monster-manual-5e-pdf.1.0.1.json#lib/net6.0/ClassLibrary2.dll",
      "@type": "PackageEntry",
      "compressedLength": 5860,
      "fullName": "lib/net6.0/ClassLibrary2.dll",
      "length": 16384,
      "name": "ClassLibrary2.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.18.15.18.41/monster-manual-5e-pdf.1.0.1.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9468,
      "fullName": ".signature.p7s",
      "length": 9468,
      "name": ".signature.p7s"
    }
  ],
  "tags": [
    "monster-manual-5e-pdf"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}