{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.29.00.02.59/_free-nintendo-eshop-code-working-2022-version-tul.3.1.86.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "SharpCrafters s.r.o.",
  "catalog:commitId": "6a6e86c7-4bc9-4428-bcc8-b77958544013",
  "catalog:commitTimeStamp": "2022-01-29T00:02:59.3866424Z",
  "created": "2022-01-26T10:49:40.697Z",
  "description": "# _Free Nintendo EShop Code Working 2022 Version tul\n\n\nCLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; [http://6.bltadwin.ru/hack.php](http://6.bltadwin.ru/hack.php)\n\n\nFree Nintendo eShop Code Generator | How To Get Free Nintendo Switch Games In free nintendo eshop gift card code free eshop gift cards free nintendo eshop. 5 secs ago - Free Nintendo eshop Gift Card Codes no Human Verification or Survey,Free $ Nintendo eshop Gift Card Generator,Free Nintendo eshop Gift. From time to time, Nintendo will distribute a digit My Nintendo points code as part of specific promotions or hardware bundles. The points code can be.\n\n## [CLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; http://6.bltadwin.ru/hack.php](http://6.bltadwin.ru/hack.php)\n\n · You can start using your Nintendo eShop Prepaid Card once you have completed your payment. The code will arrive in your inbox within seconds. This is how you can redeem it: Login to your Nintendo eShop using your Switch, Wii U or 3DS. Select Change Code. Adding funds. Your Nintendo eShop balance will be updated instantly. Free Nintendo eShop Reviews: 2.  · free Nintendo e-shop cards redeem Nintendo eShop Gift Card code. free Nintendo e-shop gift card hack. Nintendo eShop Gift Card $ Free eShop codes no survey. eShop codes. get a free Nintendo eshop card. free Nintendo switch shop gift cards Nintendo eshop gift card digital code. Nintendo eShop codes are typically available for purchase on popular retail outlets and online portals such as Amazon, Walmart, Best Buy, Target, and Game Shop. Thankfully buying them isn’t the only option. There are now lots of ways players can earn free Nintendo eShop codes on the web. We’ve identified a few of them right here: Using Pointsprizes to Earn Free Nintendo .\n\nfree nintendo eshop codes, free nintendo eshop codes 2021, free nintendo eshop codes 2021 no human verification, free nintendo eshop codes hack, free nintendo eshop codes 2022, free nintendo eshop codes generator, free nintendo eshop codes nintendo switch, free nintendo eshop codes discord, free nintendo eshop code generator, free nintendo eshop code generator no verification, free nintendo eshop code no human verification, free nintendo eshop code giveaway, free nintendo eshop code generator no human verification, free nintendo eshop card, free nintendo eshop card codes unused, nintendo eshop card activation code free, how to get a free nintendo eshop code, a free nintendo eshop card, get a free nintendo eshop card, free nintendo eshop codes 2020, free nintendo eshop codes no human verification, free nintendo eshop codes reddit, free nintendo switch eshop code, free nintendo eshop card code, free nintendo eshop codes legit, free nintendo eshop codes not used, free nintendo eshop card codes, free nintendo eshop card codes generator, free nintendo eshop gift card codes, free nintendo eshop gift card codes no surveys, free nintendo eshop gift card codes generator, free nintendo eshop card code generator no survey, free nintendo eshop gift card codes 2021, nintendo eshop card code generator download free, free nintendo eshop download code, free nintendo eshop game codes, free nintendo eshop gift card code, nintendo eshop code generator et free nintendo, earn free nintendo eshop codes, nintendo eshop code for free, nintendo eshop card code for free, free redeem code for nintendo eshop, free qr code for nintendo eshop, how to get nintendo eshop codes for free, can you get free eshop codes, is there a way to get free nintendo eshop points, free nintendo eshop card generator, free nintendo eshop gift card, free nintendo gift card code, free nintendo switch eshop code generator no human verification, how to get free eshop codes no human verification, free nintendo eshop codes switch, free nintendo eshop prepaid codes, eshop nintendo free codes, free nintendo eshop prepaid code, free nintendo eshop gift card code generator medialateral, nintendo eshop code generator  free nintendo, how can i get free nint",
  "id": "_Free-Nintendo-EShop-Code-Working-2022-Version-tul",
  "isPrerelease": false,
  "language": "en-US",
  "lastEdited": "2022-01-28T23:45:47.63Z",
  "listed": false,
  "packageHash": "P+gwSsai60J6bzvStiy8BNXmSf09lizCzcgVJh0hf8aHGX/l2LW+hlC+Wil1e5JCilSSEkfnBKsD/cddXBTEOw==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 11480,
  "published": "1900-01-01T00:00:00Z",
  "requireLicenseAcceptance": false,
  "title": "_Free-Nintendo-EShop-Code-Working-2022-Version-tul",
  "verbatimVersion": "3.1.86",
  "version": "3.1.86",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.29.00.02.59/_free-nintendo-eshop-code-working-2022-version-tul.3.1.86.json#qjcobcyplj.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1351,
      "fullName": "qjcobcyplj.nuspec",
      "length": 4476,
      "name": "qjcobcyplj.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.29.00.02.59/_free-nintendo-eshop-code-working-2022-version-tul.3.1.86.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9469,
      "fullName": ".signature.p7s",
      "length": 9469,
      "name": ".signature.p7s"
    }
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}