{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.11.07.46/_minion-rush-hack-working-2022-version-lhj.1.1.94.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "SharpCrafters s.r.o.",
  "catalog:commitId": "93a3d684-c6ca-447a-b225-ae9cab5e0080",
  "catalog:commitTimeStamp": "2022-01-26T11:07:46.7515728Z",
  "created": "2022-01-26T11:05:05.663Z",
  "description": "# _Minion Rush hack Working 2022 Version lhj\n\n\nCLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; [http://7.bltadwin.ru/hack.php](http://7.bltadwin.ru/hack.php)\n\n\nLearn ways to collect extra bananas and more cheats for the Despicable Me: Minion Rush mobile app for Android and iOS. The unique ability will become increasingly popular as more and more game currency is earned for characters. minion rush hack apk. MINION RUSH MOD APK. free download the latest hacked version of Minion Rush: Despicable Me Official Game a Apk with Mod Free Shopping Unlocked for android.\n\n## [CLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; http://7.bltadwin.ru/hack.php](http://7.bltadwin.ru/hack.php)\n\nThis is Despicable Me Minion Rush Bananas, Tokens generator. Enter your username, choose the number of resources you want to generate. cheat Despicable Me Minion Rush di facebook Bananas, Tokens, Despicable Me Minion Rush cheat engine , is there any Despicable Me Minion Rush cheats, Despicable Me Minion Rush Bananas, Tokens hack smartphones, . Minion Rush Cost Hacks: Singer: Despicable Actions reward double Despicable points. Cost: downloadted Reading Time: 7 mins. Minion Rush Hack Is Back In Action. Are you trying to find a good and working Minion Rush Hack? If yes, then you are at the right place at the right time. We have coded this advanced hack which will help you to get unlimited Bananas and Unlimited tokens within few seconds. So, What are you waiting for?\n\nminion rush hack download, minion rush hacks, minion rush hack apk 2021, minion rush hack apk, minion rush hack ios, minion rush hack mod apk, minion rush hack pc, minion rush hack lucky patcher, minion rush hack apk download, minion rush hack android 1, minion rush hack apk ios, minion rush hack apk download free, minion rush hack apk 2.6.2, minion rush hack apk 2015, despicable me minion rush hack unlimited bananas and tokens, minion rush hack cheat engine, minion rush cydia hack, despicable me minion rush hack cheat engine, minion rush chinese version hack, minion rush hack android oyun club, cách hack minion rush, minion rush hack pc download, minion rush hack ios download, minion rush hack game download, minion rush hack app download, download minion rush hack apk for android, minion rush hack apk 7.8.0 e, minion rush hack save file, minion rush hack generator, download game minion rush hack apk, minion rush despicable me official game hack, hack game minion rush, minion rush hack game4u, hack minion rush game guardian, tai game minion rush hack moi nhat, minion rush hacked holidays, hack minion rush vô hạn tiền, minion rush hack apk indir, minion rush hack dinero infinito, minion rush apk hack, minion rush cheats 2020, minion rush jailbreak hack, minion rush hack apk latest version, minion rush hack money, minion rush 3.0.1a hack/mod apk (unlimited tokens+bananas), despicable me minion rush hack, despicable me minion rush hack apk, despicable me minion rush hack windows 10, minion rush hack 2020, tải minion rush hack mới nhất, despicable me minion rush pc hack, hack minion rush pc windows 10, hack para minion rush, hack para minion rush pc, is minion rush free, what is minion rush, minion rush hack tokens, tải minion rush hack, minion rush hack tiền, tải minion rush hack apk, minion rush apk hack ultima version 2020, minion rush apk hack ultima version 2019, hack de minion rush ultima version, minion rush hack ultima version, minion rush apk hack ultima version, minion rush hack version download, minion rush apk hack última versión 2021, minion rush apk hack última versión 2020, minion rush hack apk appvn, minion rush windows 10 hack, how to hack minion rush with cheat engine, hack minion rush win 10, minion rush cheats, minion rush hack yeuapk, minion rush 1.0.3 mod apk, minion rush hack apk android 1, minion rush hack(2).apk (125.43 mb), minion rush hack 2021, minion rush hack 2020 apk, minion rush apk hack 2.5.0, minion rush hack apk 2, minion rush hack apk 3.0.1a, minion rush 1.0.3",
  "id": "_Minion-Rush-hack-Working-2022-Version-lhj",
  "isPrerelease": false,
  "language": "en-US",
  "lastEdited": "2022-01-26T11:07:39.283Z",
  "listed": true,
  "packageHash": "/t0w8X2+RKUKzuADxzxFJk67V9YYYx1mTJCpYsxveeJP6pmR+xkEMMmKM5tFHLogqqkcZbPMJmmdYLula5yKjg==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 11593,
  "published": "2022-01-26T11:05:05.663Z",
  "requireLicenseAcceptance": false,
  "title": "_Minion-Rush-hack-Working-2022-Version-lhj",
  "verbatimVersion": "1.1.94",
  "version": "1.1.94",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.11.07.46/_minion-rush-hack-working-2022-version-lhj.1.1.94.json#rwjoqybjuj.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1462,
      "fullName": "rwjoqybjuj.nuspec",
      "length": 4475,
      "name": "rwjoqybjuj.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.11.07.46/_minion-rush-hack-working-2022-version-lhj.1.1.94.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9471,
      "fullName": ".signature.p7s",
      "length": 9471,
      "name": ".signature.p7s"
    }
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}