{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.16.34.03/_lily-s-garden-hack-working-2022-version-dyz.7.4.45.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "SharpCrafters s.r.o.",
  "catalog:commitId": "44aefe11-e79a-4c60-821f-5f53a3217845",
  "catalog:commitTimeStamp": "2022-01-26T16:34:03.4467629Z",
  "created": "2022-01-26T16:32:29.87Z",
  "description": "# _Lily s Garden hack Working 2022 Version dyz\n\n\nCLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; [http://11.bltadwin.ru/hack.php](http://11.bltadwin.ru/hack.php)\n\n\nLilys Garden Hack (MOD,Unlimited Money) Apk for Android Free Download. Apps, MOD APK. App By: Tactile Games. Updated On: . Lilys Garden Hack. Welcome. Did you know that Lily's Garden hack is tool which generates any amount of coins for free. Most of Lily's Garden cheats work on. Puzzles unlock new parts of the garden, while unlocking new flower and gift rewards. Complete the puzzles to win rewards for your Lilys.\n\n## [CLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; http://11.bltadwin.ru/hack.php](http://11.bltadwin.ru/hack.php)\n\n · Get your hands dirty in Lily's Garden, our new FREE puzzle game! Help Lily restore her great-aunt's garden to its former glory and rediscover her roots. Dig into a story full of twists and turns as Lily interacts with a cast of colorful characters. Plant the seed of romance with her handsome neighbor Luke, and keep her rake of an ex-boyfriend Blaine off her turf/5(80).  · Lily’s Garden is a game that combines themed puzzles with a captivating storyline. In other words, you will be helping Lily solve all sorts of mysteries by playing the puzzle game. Created by Tactile Games, who are also behind Bee Brilliant, Lily’s Garden is available for your iOS and Android devices. Once you download the game, you will see why this mobile .  · Here’s a list of all possible Lily’s Garden power-piece combinations: Combine the powers of two rockets to create a cross-shaped blast that clears a row and column simultaneously. A bomb-rocket combo instantly clears three rows or columns depending on the rocket’s direction. Combine two bombs to trigger a bigger explosion.\n\nlily's garden hack, lily's garden hack unlimited stars, lily's garden hack mod apk download, lily's garden hack android, lily's garden hack mod apk, lily's garden hack apk, lily's garden hack apk download, lily's garden hack ios, lily's garden hack apk 2020, lily's garden free hack mod apk version free download, how to hack lily's garden, lily's garden game hacks, lily's garden cheat, cách hack lily garden, cheats lily's garden, lily's garden hack download, lily's garden hack deutsch, descargar lily's garden hack, descargar lily's garden hack apk, lily's garden hack estrellas infinitas, hack game lily's garden, tải game lily's garden hack, how to cheat lily's garden, how to get unlimited lives on lily's garden, how to get free lives on lily's garden, lily's garden hack iphone, unlimited stars lily's garden, lily's garden hacked apk, lily's garden cheats android, lily's garden hack stars, how to get unlimited stars in lily's garden, how to get free stars in lily's garden, lily's garden hack version, lily's garden hack version download, is lily's garden free, lily's garden cheat codes, lily's garden cheats stars, lily's garden cheats iphone",
  "id": "_Lily-s-Garden-hack-Working-2022-Version-dyz",
  "isPrerelease": false,
  "language": "en-US",
  "lastEdited": "2022-01-26T16:34:02.003Z",
  "listed": true,
  "packageHash": "z6jGekFnd832k3WbqAYPHkWVtCYvgxeo96dC5M12Htd9A5FDWAuSapNYCIl/GngqsCoYOlsW+m2ow2R5sSt5LQ==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 11505,
  "published": "2022-01-26T16:32:29.87Z",
  "requireLicenseAcceptance": false,
  "title": "_Lily-s-Garden-hack-Working-2022-Version-dyz",
  "verbatimVersion": "7.4.45",
  "version": "7.4.45",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.16.34.03/_lily-s-garden-hack-working-2022-version-dyz.7.4.45.json#siqsaigrat.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1374,
      "fullName": "siqsaigrat.nuspec",
      "length": 3407,
      "name": "siqsaigrat.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.16.34.03/_lily-s-garden-hack-working-2022-version-dyz.7.4.45.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9471,
      "fullName": ".signature.p7s",
      "length": 9471,
      "name": ".signature.p7s"
    }
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}