{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.29.00.00.28/_coin-master-cards-working-2022-version-fvl.6.4.26.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "SharpCrafters s.r.o.",
  "catalog:commitId": "553ec314-3469-45b5-84dd-b57a4f1cb4f5",
  "catalog:commitTimeStamp": "2022-01-29T00:00:28.9377769Z",
  "created": "2022-01-26T16:14:54.713Z",
  "description": "# _Coin Master Cards Working 2022 Version fvl\n\n\nCLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; [http://10.bltadwin.ru/hack.php](http://10.bltadwin.ru/hack.php)\n\n\n1, Results · X1 Queen Bee Coin Master Gold Card: Coin Master Golden Trade · coin master cards Aquarium Trip set 1X · Coin Master Cards Warriors Set All White. Cards are collectible items that are found throughout the game. Nine unique Cards make up each themed Collection. Each completed Collection rewards players. Welcome to the Coin Master Official Trading Group! A place for Coin Master players to meet, chat and trade cards:) Enjoy! Video Game Group.\n\n## [CLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; http://10.bltadwin.ru/hack.php](http://10.bltadwin.ru/hack.php)\n\n · Here's how to find your cards: On the main Coin Master hub, where you can see your current village, swipe down on the screen. This will take you to the spin menu. In the bottom-left of the screen, you'll see a card icon emblazoned with a crown. Tap this icon and you'll see your card downloadtion: Staff Writer.  · Are you looking for Completing your Coin Master Card Collection? Click on the online tool. Input your coin master userid (where you want to receive the Card) Now select the Card Category in which you need the Card. The online tool will search all its repository and show you 09 Cards in that Reviews: 2. rows · What are cards in coin master? Cards are collectable items that are found Estimated Reading Time: 5 mins.\n\ncoin master cards for sale ebay, coin master cards free, coin master cards for sale, coin master cards for chests, coin master cards hack, coin master cards list, coin master cards ebay, coin master cards collection, coin master cards and where to find them, coin master all cards set, coin master all cards turned gold, coin master free cards and spin link, coin master rare cards august 2020, coin master which cards are rare, coin master rare cards area 51, coin master sets and cards, coin master cards boom, coin master cards buy, coin master card boom village, coin master beast cards, coin master best cards, coin master rare cards by set, buy coin master cards ebay, coin master best villages for cards, coin master cards collection list, coin master cards cheat, coin master clone cards, coin master claim cards, coin master chests cards, coin master change cards, coin master cards for chests event, coin master cards free link, coin master duplicate cards, coin master free cards download, coin master free daily cards, coin master free cards today daily links, coin master duplicate gold cards, coin master rare cards list 2020 deutsch, how to clone coin master cards, what's the rarest card on coin master, coin master exchange cards, coin master extra cards, coin master rare cards ebay, coin master gold cards event, coin master gold cards ebay, ebay uk coin master cards, coin master free cards link 2020, coin master free cards hack, coin master free cards link 2021, coin master card guide, coin master gold cards hack, coin master gold cards free, coin master gold cards hack 2021, coin master gold cards, coin master golden cards link, coin master gold cards hack 2020, coin master gold cards list, coin master heaven cards, coin master hardest cards, coin master hard cards, coin master rare cards in order, cards in coin master, rarest coin master cards, coin master joker cards, coin master rare cards july 2020, coin master rare cards list july 2020, coin master rare cards knights, coin master knights set rare cards, coin master cards link, coin master cards link 2020, coin master cards list 2020, coin master cards levels, coin master rare cards list, coin master rare cards list 2021, coin master missing cards, coin master 50 more cards, coin master 50 more cards link, coin master how many cards can you send a day, coin master most rare cards, coin master mod clone cards, coin master max send cards, coin master most rare cards list, coin master new cards, coin master new cards hack, co",
  "id": "_Coin-Master-Cards-Working-2022-Version-fvl",
  "isPrerelease": false,
  "language": "en-US",
  "lastEdited": "2022-01-28T23:45:43.067Z",
  "listed": false,
  "packageHash": "2DUCnVCQuZo3tkjh2YGIYir3bIO8Q23ie6FgsDjyxjvARdAhe2v8hYcIcDbO22K0A8HD2w292jW92/so+NV5TQ==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 11553,
  "published": "1900-01-01T00:00:00Z",
  "requireLicenseAcceptance": false,
  "title": "_Coin-Master-Cards-Working-2022-Version-fvl",
  "verbatimVersion": "6.4.26",
  "version": "6.4.26",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.29.00.00.28/_coin-master-cards-working-2022-version-fvl.6.4.26.json#xvaxbrmkwx.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1427,
      "fullName": "xvaxbrmkwx.nuspec",
      "length": 4464,
      "name": "xvaxbrmkwx.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.29.00.00.28/_coin-master-cards-working-2022-version-fvl.6.4.26.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9466,
      "fullName": ".signature.p7s",
      "length": 9466,
      "name": ".signature.p7s"
    }
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}