{
  "@id": "https://api.nuget.org/v3/catalog0/data/2015.02.02.01.53.36/cuemon.1.0.2012.2200.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "Michael Mortensen",
  "catalog:commitId": "e5b566bf-1814-4856-aca9-f942515c38c6",
  "catalog:commitTimeStamp": "2015-02-02T01:53:36.67517Z",
  "copyright": "Copyright © MuchMore 2009-2012. All rights reserved.",
  "created": "2012-08-09T01:14:46.25Z",
  "description": "If you like the structure of the .NET platform, then the Cuemon .NET Framework Additions might just be that extra solution you have been looking for! With these assemblies I have aimed to accomplish at least two things; simplify the tedious work that is always present when coding towards a generic framework, and implementing some core- and utility classes for you to enjoy.",
  "iconUrl": "http://cdn.cuemon.net/themes/cuemon/images/nuget.png",
  "id": "Cuemon",
  "isPrerelease": false,
  "language": "en-US",
  "lastEdited": "0001-01-01T00:00:00Z",
  "licenseUrl": "http://creativecommons.org/licenses/by/3.0/",
  "packageHash": "v4MMGUxugyNC9emfRM33iqKaCkk1pmZTXx5CO0tWHkq4MCULbXMxI8Iqdt1Ob7/E4u6gXwKueEnPFixYFb1uBA==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 438052,
  "projectUrl": "http://www.cuemon.net/",
  "published": "2012-08-09T01:14:46.25Z",
  "releaseNotes": "This release contains a lot of new features, several performance improvements and some minor bugs was fixed.\n\nThe primary focus for this release was to start enabling parts of the Cuemon assembly family for high performance multi-threading; easier access to in-depth instrumentation; provide bulk load of databinding in the Cuemon.Data.Entity assembly - and last but not least; overall improvements throughout the family. \n\nThe following work was implemented:\n\n- New DictionaryUtility class that supplements the EnumerableUtility class; ToDictionary<TKey, TValue> and FirstOrDefault<TKey, TValue>\n- New ProcessInfo class that provides a snapshot of information about an associated process\n- New namespace in the Cuemon assembly; Management\n- ManagementUtility class that provides easy access to common management operations through the Windows Management Instrumentation (WMI) infrastructure\n- New namespace in the Cuemon assembly; Net.Http\n- New HttpMethod enum that follows RFC 2616, section 9\n- New NetHttpUtility class that provides stunningly fast HTTP implementations\n- New namespace in the Cuemon assembly; Threading\n- New initial AsyncCall class which provides a way of encapsulating asynchronous operations using a synchronous programming model\n- New AsyncCallResult<TState, TResult> class designed to encapsulate the result of an asynchronous operation\n- New CountdownEvent class which is a lightweight implementation of the one found in .NET 4\n- New CountdownEventEventArgs to provide data for a CountdownEvent\n- New ISortedWorkItem<out TKey> interface that defines a method to control thread related work operations while keeping them sorted\n- New IWorkItem interface that defines a method to control thread related work operations\n- New IWorkItemPool interface that defines a way to control a thread pool to execute work items\n- New SortedWorkItem<TKey> abstract class providing a way for outsourcing thread intensive work\n- New SortedWorkItemPool<TKey> that provides a pool of threads to execute work items\n- New WorkItem abstract class providing a way for outsourcing thread intensive work\n- New WorkItemPool that provides a pool of threads to execute work items\n- New Action delegates as found in .NET 4\n- New Func delegates as found in .NET 4\n- Renamed Cuemon.ServiceModel.ServiceInstrumentation to Cuemon.ServiceModel.EndPoint\n- Extended the ArrayUtility class with a Cast<TResult> member\n- Extended the EnumerableUtility class with support for an extra overload of Count and three new members; FirstOrDefault<TSource>, FindAll<T> and Cast<TResult>\n- Extended the NumberUtility class with four new methods; BytesToKilobytes, BytesToMegabytes, BytesToGigabytes and BytesToTerabytes\n- Extended the DataCommand class with string formatting\n- Extended the StreamUtility class with support for two new overloads of CopyStream\n- Extended the HttpRequestUtility class with an extra overload of ParseFieldValuePairs, which now supports option for urlEncode\n- Extended the GlobalModule with support for AppPoolUptime property and OnApplicationEnd method\n- Extended the DataManager class with several new members; ParseDbType, GetReaderColumnNames, GetReaderColumnValues, GetReaderColumns and GetReaderColumnsAsDictionary\n- Refactored BusinessEntityDataAdapter to support bulk loading of dataset\n- Overall performance improvements of BusinessEntityDataAdapter Open and OpenList methods - up to factor 5\n- Some minor bugs fixed in the XmlSerializationUtility class\n- One minor bug fix in SimpleSerializationSurrogate class\n\nThere are even more improvements, but the above are the highlights. Do enjoy this release.",
  "requireLicenseAcceptance": false,
  "summary": "Simple,  logical and every-day usage additions to the Microsoft .NET Framework 2.0 and forward. Follows the established namespace structure already found in the .NET Framework.",
  "title": "Cuemon .NET Framework Additions",
  "version": "1.0.2012.2200",
  "tags": [
    "cuemon",
    "xml",
    "xslt",
    "json",
    ".net",
    "framework",
    "additions",
    "businessentity",
    "caching",
    "manager",
    "datespan",
    "depedency",
    "watcher",
    "dataadapter",
    "datamanager",
    "sqlceclient",
    "sqlclient",
    "datadepedency",
    "netdepedency",
    "securitytoken",
    "hash",
    "aes",
    "utility",
    "classes",
    "xsltpage",
    "xsltmaterpage",
    "globalmodule",
    "ihttpmodule",
    "cloud",
    "security",
    "wcf",
    "wmi",
    "threading",
    "async",
    "httppost",
    "httpput",
    "httpget",
    "httpdelete",
    "countdownevent",
    "processinfo"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    }
  }
}