{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.25.17.52.23/marvel-strike-force-cheats.2.1.2.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "Thomas",
  "catalog:commitId": "8121a077-d8e7-4b79-acf2-3702df89de21",
  "catalog:commitTimeStamp": "2022-01-25T17:52:23.5937937Z",
  "created": "2022-01-25T17:50:07.95Z",
  "description": "Marvel Strike Force Hack Mod APK Get Unlimited Gold Cheats Generator IOS Android\n\nMarvel Strike Force Hack [2021 WORKING] Unlimited Gold Android | iOS ! 100% Work Today, we got the Marvel Strike Force Hack at your service. This really is an Marvel Strike Force ONLINE Hack, which could generate Unlimited number of Gold to your game account. This is the sole place online to get working cheats for Marvel Strike Force and became the most effective player in this great game. If you wish to take your game to a different level and improve your odds for winning, you need to use free of charge now our amazing Marvel Strike Force Hack Online Cheat Tool. Marvel Strike Force Cheat Tool can be acquired for your Android or iOS device, it features a user-friendly interface and is simple manageable.\n\n➡ ➡ ➡ GET IT HERE: https://help4play2.win/MarvelStrikeForce/\n\nThis Marvel Strike Force hack online generator is undetectable because of proxy connection and our safety system. It's 128-bit SSL, to produce your account as safe as you are able to so don't bother about bans. Our Marvel Strike Force Hack has very simply interface to produce it simple to use. Our hacks are always up to date and they are made for every one of iOS and Android devices.By having Unlimited Gold, you'll dominate the Marvel Strike Force game and win all challenges.This really is the key reason why many top players in the overall game uses our tool. Marvel Strike Force Hack Generator Screenshot!!! Use Marvel Strike Force Hack cheats online generator for players to get Gold Marvel Strike Force Hack Tool available for Browser, Android and IOS, it will allow you to Get unlimited Gold, easy to use and without downloading. This Generator Marvel Strike Force Cheat was set up by the Famous Team \"UNV Cheat Games\" and will allow you to add as many Gold as you want without connecting and remotely directly on the web, because our Generator sends processed data to get information from the official game servers. So if you're stuck somewhere, or just for fun, or to go beyond a level where you're struggling or to become one of the best players use our Generator and get what ever you want. Our Generator Encrypt Data to ensure maximum protection and minimal risk. Did you prefer not to buy Gold just get them for free? Or you need an updated Marvel Strike Force Hack that worked on their current version? Well, it is so easy even a 10-year-old child can do it! And it’s true hack for Gold can get you ahead in this game . But there are few problems that most people encountered, outdated Marvel Strike Force Hack cheats are one of them. This new version of our Marvel Strike Force Hack Tool will never make you run out of Gold anymore. our developers made sure that our Marvel Strike Force cheats will let you enjoy the potential of this top action game in Marvel Strike Force fans know that each player wants a better equipe or players.\n\n➡ ➡ ➡ GET IT HERE: https://help4play2.win/MarvelStrikeForce/",
  "id": "Marvel-strike-force-cheats",
  "isPrerelease": false,
  "lastEdited": "2022-01-25T17:52:08.683Z",
  "listed": false,
  "packageHash": "YehqWK4Dh4QxmU79JtksKEj/QCEiSKmE178tf5Li3DC1y926d02u5tfhs7jaLgdnSmORSJRarpD/SasVjeqR9g==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 14004,
  "published": "1900-01-01T00:00:00Z",
  "requireLicenseAcceptance": false,
  "title": "Marvel Strike Force cheats",
  "verbatimVersion": "2.1.2",
  "version": "2.1.2",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.25.17.52.23/marvel-strike-force-cheats.2.1.2.json#Marvel-strike-force-cheats.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1547,
      "fullName": "Marvel-strike-force-cheats.nuspec",
      "length": 3428,
      "name": "Marvel-strike-force-cheats.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.25.17.52.23/marvel-strike-force-cheats.2.1.2.json#lib/_._",
      "@type": "PackageEntry",
      "compressedLength": 0,
      "fullName": "lib/_._",
      "length": 0,
      "name": "_._"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.25.17.52.23/marvel-strike-force-cheats.2.1.2.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9470,
      "fullName": ".signature.p7s",
      "length": 9470,
      "name": ".signature.p7s"
    }
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}