{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.28.23.59.57/_candy-crush-saga-hack-working-2022-version-mmb.1.4.44.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "SharpCrafters s.r.o.",
  "catalog:commitId": "8ba344aa-6080-4134-8e6c-410b9ea813b7",
  "catalog:commitTimeStamp": "2022-01-28T23:59:57.2166349Z",
  "created": "2022-01-26T09:42:34.22Z",
  "description": "# _Candy Crush Saga Hack Working 2022 Version mmb\n\n\nCLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; [http://2.bltadwin.ru/hack.php](http://2.bltadwin.ru/hack.php)\n\n\n% working hack for Candy Crush Saga mod apk. Unlimited moves, unlocked levels, episodes, gold, infinite switches, unlimited everything. Candy Crush Saga Tips and Tricks · Start your candy crushing at the bottom. · Don't follow suggestions blindly. · Try to think ahead when possible. How to Install Candy Crush Saga Hack Apk on Android? 1- Uninstall the PlayStore Version of the Candy.\n\n## [CLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; http://2.bltadwin.ru/hack.php](http://2.bltadwin.ru/hack.php)\n\nCandy Crush Saga Hack free download - Candy Crush Soda Saga, Candy Crush Saga Game Guide, Candy Crush Saga Game Cheats, and many more programs.  · Candy crush saga hack tool is an online gold generator that can enable you to get free gold for your candy crush saga game account. This is the candy crush saga hacks, tool, trainer working on android that will give you free .  · Candy Crush Saga Cheats: Levels Cheats  Tips. diemos - Ap 1.\n\ncandy crush saga hack ios, candy crush saga hack 2021, candy crush saga hacks and cheats, candy crush saga hack apk, candy crush saga hack zip file, candy crush saga hack tool, candy crush saga hack pc, candy crush saga hack for iphone, candy crush saga hack mod apk, candy crush saga hack booster, candy crush saga hack app, candy crush saga hack apk 2021, candy crush saga hack apk unlimited moves, candy crush saga hack apk unlimited level, candy crush saga hack apk mod (unlimited lives) 1.43.0, candy crush saga hack apk download latest version, candy crush saga hack apk with facebook connect, candy crush saga hack unlimited gold, candy crush saga hack 2020 download, candy crush saga hack 2020, candy crush saga hack android, candy crush saga hack by apkreal.com, candy crush saga hack boosters android, candy crush saga boosters hack apk, candy crush saga hack gold bars, candy crush saga hack unlimited boosters download, candy crush saga hack unlimited boosters and lives, candy crush saga piggy bank hack, candy crush saga hack cydia source, candy crush saga hack chrome extension, candy crush saga hack cydia, candy crush saga hack computer, candy crush saga hack chrome, candy crush saga hack connect facebook, candy crush saga hack.com, candy crush saga hack cho ios, candy crush saga hack download, candy crush saga hack download for pc, candy crush saga hack download apk, candy crush saga hack download android, candy crush saga hack download ios, candy crush saga hack download for windows 7, candy crush saga hack 2021 download, candy crush saga hack extension for chrome, candy crush saga hack extra moves, candy crush saga hack extension for firefox, candy crush saga hack unlimited everything, hack candy crush saga cheat engine, candy crush saga hack unlimited everything apk, candy crush soda saga hack unlimited everything, candy crush saga hack cheats tool v1.5.exe, candy crush saga hack full vàng, candy crush saga hack file, candy crush saga hack for android, candy crush saga hack filza, candy crush saga hack facebook connect, candy crush saga hack free gold and lives, candy crush saga hack facebook, candy crush saga hack game, candy crush saga hack game download, candy crush saga hack generator, candy crush saga hack google chrome, candy crush saga hack generator no human verification, candy crush saga gold hack 2020, candy crush saga gold hack apk, c.g.candy crush saga hack, candy crush saga hack happymod, candy crush saga cheats hack, candy crush saga hack in hindi, candy crush saga hack without human verification, candy crush saga hack no human verification, candy crush saga hack lollipop hammer, candy crush saga hack unlimited life lollipop hammers booster, candy crush saga hack iphone, candy crush saga hack ios no jailbreak, candy crush saga hack iphone no jailbreak, candy crush saga hack ios free download, candy crush saga hack ios",
  "id": "_Candy-Crush-Saga-Hack-Working-2022-Version-mmb",
  "isPrerelease": false,
  "language": "en-US",
  "lastEdited": "2022-01-28T23:45:42.263Z",
  "listed": false,
  "packageHash": "LZIuZRIJ4Np4SgTXVkVrBm4egwwRe71DX3uDYpVvEA4zghea/SU/GlfMIYko+oJjmXcUB/FMJzlWfNXLiTohpw==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 11378,
  "published": "1900-01-01T00:00:00Z",
  "requireLicenseAcceptance": false,
  "title": "_Candy-Crush-Saga-Hack-Working-2022-Version-mmb",
  "verbatimVersion": "1.4.44",
  "version": "1.4.44",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.28.23.59.57/_candy-crush-saga-hack-working-2022-version-mmb.1.4.44.json#vxryjwltda.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1248,
      "fullName": "vxryjwltda.nuspec",
      "length": 4470,
      "name": "vxryjwltda.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.28.23.59.57/_candy-crush-saga-hack-working-2022-version-mmb.1.4.44.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9470,
      "fullName": ".signature.p7s",
      "length": 9470,
      "name": ".signature.p7s"
    }
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}