{
  "@id": "https://api.nuget.org/v3/catalog0/data/2015.02.04.03.15.24/aspose.words.13.10.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "Aspose",
  "catalog:commitId": "d4ee56e5-b353-4db8-ab79-8c50fe3cff55",
  "catalog:commitTimeStamp": "2015-02-04T03:15:24.7015699Z",
  "copyright": "© Aspose 2002-2013. All Rights Reserved.",
  "created": "2013-11-12T03:24:24.26Z",
  "description": "Aspose.Words for .NET class library supports DOC, DOCX, RTF, HTML, OpenDocument, PDF, XPS, EPUB and other formats. With Aspose.Words you can generate, modify, convert, render and print documents without utilizing Microsoft Word®",
  "iconUrl": "http://www.aspose.com/images/products/dotnet/Aspose.Words_128x128.png",
  "id": "Aspose.Words",
  "isPrerelease": false,
  "lastEdited": "0001-01-01T00:00:00Z",
  "licenseUrl": "http://www.aspose.com/corporate/purchase/end-user-license-agreement.aspx",
  "packageHash": "uhKoH9AQHMohUpkiNJBTNvt3IsKu6Bt9bufoookokNKAB19p0Gq5LrOfViOtoFHVyuZ9scUC3jtunPgOpU8xag==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 11016989,
  "projectUrl": "http://www.aspose.com/categories/.net-components/aspose.words-for-.net/default.aspx",
  "published": "2013-11-12T03:24:24.26Z",
  "releaseNotes": "There are 192 improvements and fixes in this regular monthly release. The most notable are:\n\n• Finally implemented a much richer support of CSS cascading and inheritance in HTML and MHTML imports\n• Added support of table styles in HTML and MHTML imports\n• Quirks and Standards modes are supported now in HTML import\n• Improved import of CSS margins for paragraphs, lists and tables\n• Base PDF/A-1b compliance level is implemented in rendering to PDF\n• Improved floating shape positioning in complex scenarios\n• Implemented vertical section alignment\n\nThis release introduces the new features, enhancements and fixes to the excptions/bugs as detailed below:\n\n• New features\nWORDSNET-2020\tSupport 'style' attribute of 'img'\nWORDSNET-2306\tWhen import “blockquote”, paragraph should have indentations on left and on right sides.\nWORDSNET-2356\tSupport PDF/A-1a compliance level\nWORDSNET-2705\tSupport 'inherit' (explicit CSS attribute inheritance) on import\nWORDSNET-2706\tFont size is incorrect upon rendering.\nWORDSNET-3163\tSupport CSS styles on table, tr, td and th nodes on import\nWORDSNET-318\tAdd support for tables styles during HTML import\nWORDSNET-3318\tCSS styles applied to element by id is ignored upon importing HTML.\nWORDSNET-3606\tMultiple classes are completely ignored upon HTML import.\nWORDSNET-3637\tBackground color is applied to paragraph instead of table cell during HTML import.\nWORDSNET-39\tImport CSS from HTML\nWORDSNET-3915\tAll spans in paragraph inherits formatting of span with “display:block” attribute set.\nWORDSNET-4336\tFont is not changed during appending with UseDestinationStyles\nWORDSNET-4604\tDocument looks different when converting from HTML to other format.\nWORDSNET-4744\tCell background color is imported as paragraph background color when CSS sheet is used\nWORDSNET-4780\tConsider adding an ability to set “Document structure tags for accessibility” option.\nWORDSNET-4887\tTry to avoid a line break after each text line in PDF.\nWORDSNET-4957\tTable looks incorrectly\nWORDSNET-6460\tWhile converting HTML to EPUB, embedded CSS is malfunctioning\nWORDSNET-6546\tSupport importing nested CSS selectors from HTML\nWORDSNET-6716\tSupport 'style' attribute of <h1> ... <h6>\nWORDSNET-7436\tBorder style is applied to a cell's text (to a child paragraph) instead of to the cell itself\nWORDSNET-7442\tDocumentBuilder.InsertHtml supports only styles from CSS\nWORDSNET-8195\tFont-family specified inside paragraph style is changed after HTML import.\nWORDSNET-8890\tImport css style names used in table tags during converting Html to Word\nWORDSNET-8999\tSupport tick mark type.\nWORDSNET-9011\tHtml to Doc/Docx/Pdf file conversion issue with images\nWORDSNET-9020\tAW applies \"font-size\" css property to text if property is specified for body element in HTML import but browsers don't.\nWORDSNET-9021\tBorder is not applied to table in HTML import (system color values aren't supported).\nWORDSNET-9022\tBorder css style specified for div is not present in resulting DOCX in HTML import.\nWORDSNET-9023\tIf hyperlink is a first child in body hyperlink has space after set to 0 in HTML import.\nWORDSNET-9025\ttd's \"text-decoration\" css property is not applied to cell's text in HTML import.\nWORDSNET-9029\tExtra border appears around text in HTML import.\nWORDSNET-9060\tSuperscript from the footnote does not render in output Pdf\n\n• Enhancements\nWORDSJAVA-767\tcom.aspose.words.UnsupportedFileFormatException when loading a TXT DOC in Japanese encoding\nWORDSJAVA-788\tLost figures with small fractional size multiplied on big scale in DrawingML\nWORDSJAVA-789\tIgnore invalid Bmp\nWORDSJAVA-791\tInserted Svg image saved as Png instead of Emf\nWORDSNET-2850\tText formatting is changed during open/save\nWORDSNET-2974\tMS Word 2002 crashes when try to open DOC file produced by Aspose.Words.\nWORDSNET-3452\tBorder appears around paragraph after importing HTML.\nWORDSNET-3942\tMargin-bottom attribute is ignored if specified in CSS\nWORDSNET-4713\tNumbering format is changed upon rendering\nWORDSNET-5111\tMoveToMergeField should move based off the builder's current position\nWORDSNET-5548\tUnicode symbols are filtered out of document runs, resulting in information loss during roundtrip.\nWORDSNET-5746\tSupport characters from Unicode Supplementary Planes\nWORDSNET-5876\tBullet character symbol is changed after resave the document\nWORDSNET-5992\tFont size changed after appending one document to another\nWORDSNET-6213\tDocx to PDF conversion issue with image position\nWORDSNET-6339\tDocx to PDF conversion issue with page\nWORDSNET-6386\tDocx to PDF conversion issue with header text\nWORDSNET-6585\tException while loading MHTML file\nWORDSNET-6610\tDocx to Pdf conversion issue with footnotes\nWORDSNET-7561\tRefactoring of HTML Import\nWORDSNET-7816\tDo not use auto spacing for paragraphs on HTML import\nWORDSNET-7817\tApply margin values of parent HTML elements to paragraphs\nWORDSNET-7818\tTable cell margins in HTML quirks mode\nWORDSNET-7875\tSupport nowrap attribute of TD\nWORDSNET-8099\tSupport vertical alignment of section followed by \"section break continuous\"\nWORDSNET-8483\tA Drop Cap letter renders twice in PDF\nWORDSNET-8601\tTake width of paragraph border into account on HTML import\nWORDSNET-8614\tWrong number format after field update\nWORDSNET-8645\tEnhancement of HTML import of lists\nWORDSNET-8675\tPdfTextureBrushTilingPattern caching improvement\nWORDSNET-9012\tWrite font underline style to CSS when saving to HtmlFixed format\nWORDSNET-9018\tText's indent is not taken into account in HTML import when calculating column's width.\nWORDSNET-9026\th1, h2 and h3 has \"Arial\" default font but browsers use \"Times New Roman\" in HTML import.\nWORDSNET-9033\tCSS stylesheets specified for print media should be ignored in HTML import.\nWORDSNET-9036\tException is thrown while loading html file.\nWORDSNET-9049\tFloating shape is rendered on the wrong page\nWORDSNET-9127\tUpdateFields forcefully renders deletion/insertion revisions in PDF even if AcceptAllRevisions is called\nWORDSNET-9148\tShape is rendered twice.\nWORDSNET-9182\tA DrawingML is repeated many times in PDF\n\n• Exceptions\nWORDSJAVA-748\tjava.lang.NoSuchMethodError: java.awt.Font.canDisplay(I)Z occurs when converting to TIFF under JDK1.4\nWORDSNET-6070\tAspose.Words.FileCorruptedException occur while loading mht file.\nWORDSNET-8114\tDocument.Save throws System.InvalidCastException on re-saving Docx\nWORDSNET-8259\tAspose.Words.FileCorruptedException occurs when loading MHT file\nWORDSNET-8618\tNullReferenceException occurs when calling UpdateFields after MaileMerge.Execute method\nWORDSNET-8652\tSystem.ArgumentException is thrown while doing Mail Merge\nWORDSNET-8914\tNullReferenceException occurs during rendering/exporting a Shape to PDF/HTML\nWORDSNET-8947\tAspose.Words.FileCorruptedException is thrown while loading Rtf\nWORDSNET-8990\tNullReferenceException occurs when converting a Word document to Pdf on Mono 2.10.8.1\nWORDSNET-9002\tOverFlowException occurs when calling UpdatePageLayout method\nWORDSNET-9037\tFieldChar.GetField throws System.InvalidOperationException when Track change is ON\nWORDSNET-9047\tDocument.Save throws System.InvalidOperationException for SaveFormat.Docx\nWORDSNET-9071\tAspose.Words.FileCorruptedException occurs when loading DOC file\nWORDSNET-9078\tAspose.Words.FileCorruptedException is thrown while loading Doc file\n\n• Bugs\nWORDSJAVA-782\tSpecifying PdfImageCompression.JPEG option renders a black PNG in PDF\nWORDSJAVA-786\tAbsent line endings during emf rendering\nWORDSJAVA-790\tIgnore invalid metafile\nWORDSJAVA-793\tdiacritic signs shifted during rendering complex script to GDI\nWORDSNET-5015\tBackground color of paragraphs is changed after converting MHTML to other formats.\nWORDSNET-5026\tPosition of floating frame is changed during rendering.\nWORDSNET-5069\tIndent of paragraph is incorrect after rendering.\nWORDSNET-5074\tGray text appears on gray background after importing MHTML.\nWORDSNET-5113\tAspose.Words does not take in account value of ASK field upon updating fields.\nWORDSNET-5117\tAspose.Words does not use values of bookmarks upon updating fields.\nWORDSNET-5368\tBullets disappears after appending document.\nWORDSNET-5389\tSize of font is changed during rendering.\nWORDSNET-5485\tFootnote in heading paragraph also appears in TOC after updating.\nWORDSNET-5503\tInline border style for div is not working\nWORDSNET-5583\tBackground color of Content is changed upon MHTML to DOC conversion\nWORDSNET-5588\tImage appears as \"red cross\" after open/save MHT.\nWORDSNET-5632\tTabStop/TabLeaders rendering incorrectly in PDF,XPS\nWORDSNET-5659\tNumber -1 appears before the bullet list after rendering to PDF\nWORDSNET-5696\tShape inside header gets rendered behind the table\nWORDSNET-5757\tHTML to Doc conversion; <TD style=\"TEXT-ALIGN: center; is not working. align=\"center\" is working\nWORDSNET-5993\tUpdateFields splits a single Run of text in Date field into many Runs\nWORDSNET-6042\tJoinRunsWithSameFormatting does not seem to be working\nWORDSNET-6083\tTable tag > Style > background attribute does not support when converting HTML to DOC.\nWORDSNET-6148\tStructuredDocumentTag text is changed during open/save docx file.\nWORDSNET-6342\tBullet symbols are lost upon exporting DOCX to EPUB\nWORDSNET-6366\tImport TD CSS from HTML\nWORDSNET-6391\tThe value of Date SDT becomes visible when converting to formats other than DOCX\nWORDSNET-6398\tAcceptAllRevisions is not working correctly in the footer\nWORDSNET-6499\tComparisonEvaluator.EvaluateCore method doesn't handle simple string values properly.\nWORDSNET-6605\tCell's content is not aligned with the text in another table cell\nWORDSNET-6626\tCell widths are incorrect when appending documents\nWORDSNET-6630\tText is shifted/shrinked during printing PDF i.e. generated by Aspose.Words\nWORDSNET-6909\tHTML Cell content is not aligned centred when converting to DOC\nWORDSNET-6920\tCell text is wrapped incorrectly during HTML import\nWORDSNET-7277\tHTML to PDF conversion issue with contents rendering\nWORDSNET-7420\tSupport Font style attributes of td\nWORDSNET-7462\tColor attribute in CSS style is not imported into DOM\nWORDSNET-7549\tAdditional border around Text is added when importing Html\nWORDSNET-7631\tText-Align style attribute of div is not preserved during converting Html to Rtf\nWORDSNET-7632\tTable and Cell options are imported incorrectly from HTML\nWORDSNET-7633\tCSS rule is not applied to Table when converting Html to Rtf\nWORDSNET-7634\tSupport font-size attribute during converting HTML to RTF\nWORDSNET-7695\tCell shading color is not imported from background-color CSS\nWORDSNET-7700\tul and li css styles are imported incorrectly\nWORDSNET-7701\tCSS embedded in HTML file is not applied to DIV\nWORDSNET-7789\tmargin-left style attribute of <body> is ignored during importing Html\nWORDSNET-7878\tUnwanted borders around Runs are observed in DOCX that is imported from HTML\nWORDSNET-7890\tConsider Importing all Table formatting from CSS in HTML\nWORDSNET-7922\tBorder style attribute of <table> is not imported from Html\nWORDSNET-8025\tException while converting Docx to HTML\nWORDSNET-8177\tAspose.Words hangs during rendering ODT to Pdf\nWORDSNET-8364\tDebug.Assert fails in BorderGrid.CorrectParagraphPoints()\nWORDSNET-8391\tProcess CSS descendant combinators on HTML import\nWORDSNET-8467\tCSS from an external file is not getting applied to SPAN tag\nWORDSNET-8552\tAspose.Words hangs during rendering DOC to HTML\nWORDSNET-8587\tDocx to fixed file format conversion issue with Set Field\nWORDSNET-8595\tLayout of DrawingML is not preserved during rendering to PDF\nWORDSNET-8608\tMore words per line are rendered inside TextBox in PDF\nWORDSNET-8610\tText in TextBox shape is rendering beyond the limits of right page margin\nWORDSNET-8670\tText background color is lost after importing html into Aspose.Word DOM\nWORDSNET-8671\tHTML to Word/PDF Conversion issue with text formatting\nWORDSNET-8693\tA Span of text is incorrectly imported with Italic font formatting\nWORDSNET-8715\tHTML to Doc conversion issue with table Line Style\nWORDSNET-8721\tAspose.Words hangs during rendering DrawingML to Pdf\nWORDSNET-8747\tRow height is ignored when importing Html into Aspose.Words\nWORDSNET-8750\tTable left indent is not preserved during DOC->HTML->DOC roundtrip\nWORDSNET-8783\tContents position is changed in output Pdf after conversion from Docx\nWORDSNET-8785\tHtmlFixedSaveOptions.ResourcesFolder is not working\nWORDSNET-8825\tIncorrect font is applied to Paragraphs when importing <p> tags from Html\nWORDSNET-8830\tHeader and footer do not render correctly in output Pdf file\nWORDSNET-8839\tDocument.UpdateFields removes content of TOC field\nWORDSNET-8853\tBlank pages are being inserted during appending documents\nWORDSNET-8861\tMisplaced shapes and connectors while rendering\nWORDSNET-8872\tA blank Tiff is produced when specifying Ccitt4 or Ccitt3 TiffCompression option\nWORDSNET-8879\tShapes are rendering without preserving their Hyperlinks in Pdf\nWORDSNET-8903\tDoc to Pdf conversion issue with SEQ field\nWORDSNET-8907\tDocumentBuilder.MoveToMergeField removes all merge field inside an IF field\nWORDSNET-8909\tA Heading2 paragraph is incorrectly appearing on 1st PDF ouline level\nWORDSNET-8973\tEndnotes at the end of document are not rendered in PDF\nWORDSNET-8983\tTable's border is missing after conversion from html to Docx/Doc/Pdf\nWORDSNET-8984\tTable's width is changed after conversion from html to Docx/Doc/Pdf\nWORDSNET-8988\tAspose.Words does not update Author field\nWORDSNET-8992\tStrikethrough effect applied on white spaces should not be displayed in Pdf\nWORDSNET-8995\tIncorrect page count\nWORDSNET-9008\tMerged data is formatted with two different fonts after ExecuteWithRegions\nWORDSNET-9016\t0px image border becomes visible after import from HTML file\nWORDSNET-9024\tCSS style of <p> elements affects text of other elements\nWORDSNET-9054\tCharts images become distorted during exporting to HTML\nWORDSNET-9061\tIMailMergeDataSource.GetChildDataSource is called when mail merge filed contains dot (.)\nWORDSNET-9063\tPictures within RTF file when saved to pdf are positioned incorrectly.\nWORDSNET-9064\tImages are not preserved during importing Html\nWORDSNET-9072\tDoc to Pdf conversion issue with mathematical formulas rendering\nWORDSNET-9073\tDoc to XPS conversion issue with mathematical formulas rendering\nWORDSNET-9074\tDocument.Save does not preserve bullets\nWORDSNET-9098\tAcrobat gives error message when displaying a PDF document generated using Aspose.Words\nWORDSNET-9122\tUpdateFields throws ArgumentNullException\nWORDSNET-9125\tText formatted with Arial Black font is made extra bold in PDF\nWORDSNET-9130\tText is not selectable when viewing the HtmlFixed document with Chrome or FireFox browsers\nWORDSNET-9133\tA Paragraph is given extra left indentation and is split into two lines in PDF\n\n• Performance\nWORDSJAVA-770\tInvestigate memory leaks when running under Open JDK 1.7\nWORDSNET-9005\tImprove MHT loading and resaving to HtmlFixed time\n\n• Regressions\nWORDSNET-9041\tSystem.DivideByZeroException occurs during rendering Docx to Pdf\nWORDSNET-9132\tSystem.ArgumentNullException is thrown when exporting a Doc to Html\nWORDSNET-9145\tOverFlowException occurs when invoking Document.PageCount property\nWORDSNET-9019\tdiv's \"background-color\" css property is not applied to inner table in HTML import.",
  "requireLicenseAcceptance": true,
  "title": "Aspose.Words for .Net",
  "version": "13.10.0",
  "tags": [
    "Aspose.Words",
    "DOC",
    "DOCX",
    "RTF",
    "HTML",
    "OpenDocument",
    "XPS",
    "EPUB",
    "Word",
    "Document",
    "Processing"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    }
  }
}