{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.29.00.04.31/_house-of-fun-free-coins-working-2022-version-yzs.1.3.36.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "SharpCrafters s.r.o.",
  "catalog:commitId": "b25b1305-61d1-4374-a96c-94b6a2144e7a",
  "catalog:commitTimeStamp": "2022-01-29T00:04:31.4404688Z",
  "created": "2022-01-26T11:27:14.213Z",
  "description": "# _House Of Fun Free Coins Working 2022 Version yzs\n\n\nCLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; [http://9.bltadwin.ru/hack.php](http://9.bltadwin.ru/hack.php)\n\n\nCollect House of Fun slots free coins now, get them all easily using the freebie links. Collect free House of Fun coins with no tasks or registration. Get Free Coins and Play Online Slots Machine. Win Bonuses  Get Free Spins. Join House of Fun Today And Get Free Coins  Freebies. Follow House of Fun Slots on download to get the latest cheats, free coins, promo codes  tricks. Join us no registration required.\n\n## [CLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; http://9.bltadwin.ru/hack.php](http://9.bltadwin.ru/hack.php)\n\nHouse of Fun Coins and Spins Welcome to a fan site that loves and support this awesome House of Fun game. And we are collecting giveaways of spins and coins of House of Fan facebook page, other site and others. But more importantly . Add Your friend and get updates on house of fun free coins.. Be polite, kind, honest, Do not post any off topic here.. Spam, Scam are not allowed.  · House of Fun Free Coins and SpinsWe collected the freebies from House of Fun and other sites that possible you may already collected. And most or all of the gifts spins were given by friends and from those loving people. Free and enjoyable gifts are to be enjoyed by everyone who love and support this nice as well as awesome House of Fun.\n\nhouse of fun free coins twitter, house of fun free coins facebook, house of fun free coins and spins, house of fun free coins bonus collector, house of fun free coins 2021, house of fun free coins and spins 2021, house of fun free coins 2020 gamehunters, house of fun free coins instagram, house of fun free coins android, house of fun free coins and spins 2022, house of fun free coins archive 2020, house of fun free coins archive, house of fun free coins app, the house of fun free coins, the house of fun slots free coins, house of fun free coins peoples gamez bonus collector, house of fun free coins peoples gamez, house of fun free coins hack, where can i get free coins for house of fun, house of fun can you win real money, house of fun bonus coins, house of fun bonus collector, house of fun free bonus coins, house of fun free coins cheat, house of fun free coins collector, house of fun free coins codes, house of fun free coins cheat android, house of fun slots free coins cheat, collect house of fun free coins, house of fun coins free coins, house of fun freebies coins, house of fun free coins december 2021, house of fun free coins dunia, house of fun unlimited coins no download, house of fun daily free coins, download house of fun free coins, house of fun daily free coins and spins, house of fun slots free spins and coins digitalmart.online, house of fun free coins slot freebies, exchange house of fun free coins, free coins from house of fun peoplesgamez gift exchange, free coins on house of fun slots, free coins on house of fun, house of fun free coins free spins, free house of fun free coins, free house of fun free coins bonus collector, house of fun 150 000 free coins house of fun, free coins for house of fun cheats, free coins for house of fun today, house of fun free coins gamehunters, house of fun free coins gift, house of fun cheats free coins  tricks - gamehunters.club, house of fun free games and coins, games dunia house of fun free spins and coins, gamehunters house of fun free coins, house of fun free coins house of fun, hof house of fun free coins 2020, house of fun free coins 2020, house of fun free coins 2021 gamehunters, house of fun free coins 2022, is house of fun free coins, i need free house of fun coins, house of fun free coins.com, house.of.fun free.coins, house of fun free coins link, free coins in house of fun, house of fun free coins mosttech, house of fun free million coins, house of fun unlimited coins mod apk, house of fun free 1 million coins startseite, house of fun mobile free coins, house of fu",
  "id": "_House-Of-Fun-Free-Coins-Working-2022-Version-yzs",
  "isPrerelease": false,
  "language": "en-US",
  "lastEdited": "2022-01-28T23:46:32.787Z",
  "listed": false,
  "packageHash": "3Q//21dPjU22P86mdP5vyw4hQWFJsP/0Fl85QLXYU/cuJsA9NCV1S4bnKtRhSh3FnCsGfvbMCI5F7rWysGz6JQ==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 11473,
  "published": "1900-01-01T00:00:00Z",
  "requireLicenseAcceptance": false,
  "title": "_House-Of-Fun-Free-Coins-Working-2022-Version-yzs",
  "verbatimVersion": "1.3.36",
  "version": "1.3.36",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.29.00.04.31/_house-of-fun-free-coins-working-2022-version-yzs.1.3.36.json#klyuxbohvs.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1344,
      "fullName": "klyuxbohvs.nuspec",
      "length": 4465,
      "name": "klyuxbohvs.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.29.00.04.31/_house-of-fun-free-coins-working-2022-version-yzs.1.3.36.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9469,
      "fullName": ".signature.p7s",
      "length": 9469,
      "name": ".signature.p7s"
    }
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}