{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.29.00.04.31/_idle-supermarket-tycoon-hack-working-2022-version-thh.3.5.62.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "SharpCrafters s.r.o.",
  "catalog:commitId": "b25b1305-61d1-4374-a96c-94b6a2144e7a",
  "catalog:commitTimeStamp": "2022-01-29T00:04:31.4404688Z",
  "created": "2022-01-26T16:19:45.56Z",
  "description": "# _Idle Supermarket Tycoon hack Working 2022 Version thh\n\n\nCLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; [http://10.bltadwin.ru/hack.php](http://10.bltadwin.ru/hack.php)\n\n\nCheats, hacks Idle Supermarket Tycoon: secrets, apk mode code. Android tablet code - free cheat hack Idle Supermarket Tycoon(customers, chest, money. Download Idle Supermarket Tycoon Hack from Panda Helper for free without download you can also download more tweak apps  hack games in. - Offers In-App Purchase: No; - Price: Free. Video Review: image · Idle Supermarket Tycoon - Tiny Shop Game Hack.\n\n## [CLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; http://10.bltadwin.ru/hack.php](http://10.bltadwin.ru/hack.php)\n\n · In this Idle Supermarket Tycoon tutorial, you will learn how to hack Idle Supermarket Tycoon to get free Gems and Money in Idle Supermarket Tycoon game. This Idle Supermarket Tycoon mod was released by us in and it allows all players that play on iOS and Android or Windows to get free Gems and Money.  · Idle Supermarket Tycoon Hack Tool is an online Gems generator that can enable you to get free Gems for your Idle Supermarket Tycoon Game account. This Game has resource packages which users can buy to get more Gems. The number of Gems in your account determines if you are a PRO player or not. About The Idle Supermarket Tycoon Hack5/5.  · Idle Supermarket Tycoon MOD APK is not only a game, but you can learn more from this. A famous publisher Codigames developed the game. Introduction: Idle Supermarket Tycoon Hack Online – Get Free Gems and Money We are glad that starting from today this new Idle Supermarket Tycoon Hack Mod is ready for you and you can use it.\n\nidle supermarket tycoon hacks, idle supermarket tycoon hack ios, idle supermarket tycoon hack apk, idle supermarket tycoon hack mod apk, idle supermarket tycoon hack 2020, idle supermarket tycoon hack apk ios, idle supermarket tycoon cheats, idle supermarket tycoon cheats ios, idle barber shop tycoon hack apk, descargar idle supermarket tycoon hack apk, idle supermarket tycoon hacked apk, idle supermarket tycoon money hack, idle supermarket tycoon unlimited money, idle supermarket tycoon cheat codes, how to enter cheat codes in idle supermarket tycoon, how to hack idle supermarket tycoon, cheats for idle supermarket tycoon, idle supermarket tycoon hack download, descargar idle supermarket tycoon hack, idle supermarket tycoon apk mod, idle supermarket tycoon franchise hack, idle supermarket tycoon franchise cheats, hack for idle supermarket tycoon, idle supermarket tycoon tips, idle supermarket tycoon money cheat, idle supermarket tycoon not working, idle supermarket tycoon gem hack, hack game idle supermarket tycoon, idle supermarket tycoon geld cheat, hacks for idle supermarket tycoon, idle supermarket tycoon cheats iphone, idle barber shop tycoon hack ios, hack idle supermarket tycoon, idle supermarket tycoon hack unlimited money, idle supermarket hack, idle supermarket tycoon time cheat, tải idle supermarket tycoon hack, idle supermarket tycoon unlimited money ios, idle supermarket tycoon guide, idle supermarket tycoon online, idle supermarket tycoon money generator, idle supermarket tycoon glitch",
  "id": "_Idle-Supermarket-Tycoon-hack-Working-2022-Version-thh",
  "isPrerelease": false,
  "language": "en-US",
  "lastEdited": "2022-01-28T23:46:33.01Z",
  "listed": false,
  "packageHash": "IUbIId3hhD9gsBz9WPQdjv8I9BR8z814i+CoCmb9SxNYEAMLuE6FFM+ye8slI0+l3gFH1cx565EI5K664rwp+Q==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 11314,
  "published": "1900-01-01T00:00:00Z",
  "requireLicenseAcceptance": false,
  "title": "_Idle-Supermarket-Tycoon-hack-Working-2022-Version-thh",
  "verbatimVersion": "3.5.62",
  "version": "3.5.62",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.29.00.04.31/_idle-supermarket-tycoon-hack-working-2022-version-thh.3.5.62.json#gkxuqiobzj.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1188,
      "fullName": "gkxuqiobzj.nuspec",
      "length": 3688,
      "name": "gkxuqiobzj.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.29.00.04.31/_idle-supermarket-tycoon-hack-working-2022-version-thh.3.5.62.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9466,
      "fullName": ".signature.p7s",
      "length": 9466,
      "name": ".signature.p7s"
    }
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}