{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.04.25.17.27.03/microsoft.crmsdk.xrmtooling.coreassembly.9.1.0.110.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "Microsoft",
  "catalog:commitId": "ed82b30c-5372-4933-b768-1cc28dd4a560",
  "catalog:commitTimeStamp": "2022-04-25T17:27:03.5707992Z",
  "copyright": "© Microsoft Corporation. All rights reserved.",
  "created": "2022-04-25T17:24:34.877Z",
  "description": "This package contains the official Microsoft.Xrm.Tooling.Connector assembly and has been authored by the Microsoft Common Data Service SDK team.",
  "iconFile": "images\\Dataverse.128x128.png",
  "id": "Microsoft.CrmSdk.XrmTooling.CoreAssembly",
  "isPrerelease": false,
  "language": "en-US",
  "lastEdited": "2022-04-25T17:26:35.117Z",
  "licenseUrl": "https://go.microsoft.com/fwlink/?linkid=2108407",
  "listed": true,
  "packageHash": "e2nMIERgQ2H/iRgVTdynw33FhzVsX3G9HJ+hkOgg1rz8MkbZvGBiFSZd3kV2JhnIsCYA5P/Xk6Ipr7KDsAQYLA==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 237283,
  "projectUrl": "https://docs.microsoft.com/dotnet/api/microsoft.xrm.tooling.connector",
  "published": "2022-04-25T17:24:34.877Z",
  "releaseNotes": "This package contains assemblies for Dynamics 365 (online and on-premises). These assemblies require application development using the Microsoft .NET Framework 4.6.2 or later.\n\n9.1.0.110:\nUpdated Throttled Telemetry | Logging alert to be visible for Warning vs Verbose.\nAdded Discovery Filter support for Korea and Norway GEO's\nAdded support to force WS-TRUST based auth flows to oAuth, this feature is disabled currently, but will be enabled in the future as default\n\n\n9.1.0.92:\nUnsealed CrmServiceClient Class to allow for inheritance\nFixed an issue with null values being sent to the API causing a null exception to be raised. \nAdded new property \"RecommendedDegreesOfParallelism\". \n    This property will report the recommended number of threads for communicating with Dataverse. \n\n9.1.0.90:\nFixed toggling EnableAffinityCookie a connection was created would not respect the requested state.  It will now properly respect the state of the EnableAffinityCookie property.\n\n9.1.0.88:\nUpdating Base dependency for CrmSdk.CoreAssemblies to 9.0.2.42 + \n\n9.1.0.86:\nUpdated for Current Dataverse SDK\nUpdated behavior of ImportSolutionAsync to leverage updated Dataverse behavior post 9.2 release.\nUpdated Display name for Northamerica 2 Region to reflect that it is more commonly know as GCC. \nUpdated Newtonsoft.Json to v11.0.2 to match Dataverse server.\n\n9.1.0.79:\nAdding EnableAffinityCookie to allow for override of Affinity behavior when interacting with Dataverse. \n    In general, users should not manipulate this property. more details can be found here: https://docs.microsoft.com/en-us/powerapps/developer/data-platform/api-limits#remove-the-affinity-cookie\nAdding support for enhanced features for solution import. \n\n9.1.0.77:\nAdded support to auto retry 503 server unavailable network errors\nAdded support to allow for callers to add custom headers to the request to Dataverse - this is intended for Microsoft releated consumers only.\n\n9.1.0.68: \nFixed an issue where BypassPluginExecution property on request was not being understood properly by the server. \n\n9.1.0.64:\nUpdated minimum required Microsoft.Xrm.Sdk.dll assembly version to Microsoft.CrmSdk.CoreAssemblies.9.0.2.25. \nWarning!, failure to update to this or higher level assembly will result in the following error: \n        Method not found: 'Void Microsoft.Xrm.Sdk.ParameterCollection.AddOrUpdateIfNotNull(System.String, System.Object)'.\n    \n9.1.0.63: \nAdded new public property to Read out InMemory Logs in string list format or Tuple(datetime,logevent) format. \nAdded new public property for OrganizationDetail Information called \"OrganizationDetail\" for the currently connected environment.\nAdded new enum for ImportSolution additional property options called \"ImportSolutionProperties\" - this contains valid options for additional properties for the ImportSolution handler\nAdding Switzerland Geo to Regions List.\nAdded support for bypassing custom Plug-in Execution during SDK Operation.  \n    This is a special use capability that requires a specialized permission in the CDS infrastructure to use. \n    Currently this is only permitted for use by users that have the System Administrator Security Role.\nFixed an issue with .Clone not correctly supporting adding telemetry handlers to cloned connections\nFixed an issue with telemetry for the client that was using incorrect format for useragent content\n\n9.1.0.51:\nAdded initial support for in memory log capture support. \n\n9.1.0.49:\nFixed an issue with sovereign cloud discovery reference data that would prevent a login control from picking the correct global discovery server when connecting.\n\n9.1.0.44:\nFixed Authority property data loss post clone process\nFixed an error with connection string based IFD Auth flows that slipped though testing.\nNote: connection strings for IFD should no longer use the formation host/org and instead just use the format https://org.hostname.  this is the same pattern used for connecting to online.\n\n9.1.0.43:\nFixed an error where discovery would be used when using AD and IFD to connect to onpremise even if connection strings where used.\nUp-taking new CoreSDK release.\n\n9.1.0.42:\nFixed an error with setting CallerId when ClientSecret Auth type is used.\nThanks for all the bug reports on this and repro's that really helped us run it down.\n\n9.1.0.39:\nCorrecting an internally Nuget dependency issue.  No Public changes\nUp-taking new CoreSDK release\n\n9.1.0.38:\nUp-taking new CoreSDK release\n\n9.1.0.37:\nInternal fixes to unify the way in which online and onprem instances were determined from the URI provided.\nAdded new Static Property on Utilities called IsValidOnlineHost, this takes a URL and determines if it a valid OnLine URI for the CDS Service\n\n9.1.0.26:\nUpdated CRMSDK baseline dependency to match what is currently required for this assembly to function correctly\nFixed a bug Null Object Error that would occur occasionally during connect when many concurrent connects were run.\nThis would typically happen if a developer used a Task.Wait behavior to create a stack of connections at once.\nFixed a bug that would prevent logs from being generated even when verbose tracing was enabled.\n\n\n9.1.0.25:\nAdded Support for new properties in discovery response.\nAdded:\nTenant Id - ID of the tenant that the instance resides in\nEnvironment Id - ID of the PowerPlatform Environment that the instance resides in\nUrlName - Host name for the target instance.\nFixed a bug where the second ( or third ) connection string attempt in the same process would cause the client to try to reuse the current connection.\nFixed a bug where the SDK Version Property was not properly returning from the CrmServiceClient\n\n9.1.0.21:\nFixed a bug with how errors are handled when they are raised from ADAL 3.19+.  MFA Force Login will now work properly again.\nFixed an issue with Current user login failing after discovery process.\nAdded 3 new GEO's to Selection List.\nRegion Name - RegionCode:\nUnited Arab Emirates - UAE\nSouth Africa - ZAF\nGermany (Go Local) - GER\n\n9.1.0.17:\nUpdating for 9.1.0.8833 CDS/XRM release\nUpdated default response sizes to support more verbose error messages from CDS\n\n9.1.0.13:\n**BREAKING CHANGE**\nADAL 3.19+ is now required for this library.  ADAL 2.x clients will need to be updated to use ADAL 3.x+\nImportSolution, ImportSolutionAsync method signature was changed to remove optional \"solutionname\" parameter. This was intended for internal use only.\n\nUpdates:\nAdded Support for Current User ID login when using Online flows with oAuth ( Including constructor/connection string support )\nAdded Support for ClientID Secret Auth when using oAuth flows. ( Including constructor/connection string support )\nFixed an issue with Clone that would not clone the Retry Properties if they were set by property and not via App.config\nOptimized Token Refresh logic for oAuth connections.\nUpdated Telemetry some Telemetry information to report version of CrmServiceClient in use\n\n9.0.2.25:\nAdded support for France and New US Geo's\nAdded new behavior to return the full login error when initial connect fails in LastException.\nFixed https activation issue introduced by .net 4.8. - This should no longer require http activation to be enabled on windows.\nFixed issue where a long running cloned connection loses its access token.\n\n9.0.2.16:\nAdded native support for handing throttling messages from server.\nFixed issue where a cloned connection's token could time out in a way that was not detected.\nWhen failing, this would result in a mid operation Authentication failure reporting something like 'Anonymous Access Failed'\n\n9.0.2.14:\nAdded Support for China Geo\nMinor changes to logging of Import Solution Activities\n\n9.0.2.12:\nFixed bug in CrmServiceClient which would cause some OnPrem connections to fail with an error \"Item already added to List\"\nMinor Pref Improvements\n\n9.0.2.11:\nUpdated to include Fixed version of CrmServiceClient and login control for new US Geo ( US Gov High )\n\n9.0.2.10:\nAdded Property to get current accesstoken to be used for Token Exchange requests. - Only available in oAuth mode\nFixed User reported bug with Early Binding not working correctly for WS-TRUST based auth type.\n\n9.0.2.9:\n.Net 4.6.2 is now required for this assembly.\nWarning! : by User request, the limitation on max ADAL version has been removed from this package. However anything higher then ADAL 2.9.x will cause this assembly to fail when using oAuth based authentication.\nAdded resiliency to \"GET\" operations in the API to improve API reliability.\nAdded Support for new GEO,  \"USGov High\" with deploymentRegion=USGov\nAdded New Property called \"ForceServerMetadataCacheConsistency\"\n-warning:\nThis will force the CDS server to refresh the current metadata cache with current DB config.\nNote, that this is a performance impacting property.\nUse of this flag will slow down operations server side as the server is required to check for consistency of the platform metadata against disk on each API call executed.\nIt is recommended to use this ONLY in conjunction with solution import or delete operations.\nUpdated default settings for Retry of retryable failures,  Delay between retrys is now 5 seconds with a max retry count of 10\nMajor cleanup pass on logging of errors,  Error logging should be more concise now.\n\n\n9.0.2.8:\nFixed a bug where the request id property, when passed on an organization request or webRequest, would not be honored.\nAdded Request Id's to Async requests for SolutionImportAsync and DeleteAndPromoteSolutionAsync.\nAdded verbose log events for reporting request ids from Async requests.\n\n9.0.2.7:\nFixed a bug that would occur when using oAuth based login where the same user windows session  ( login to windows ) was used to then connect to more than one user of CDS/CRM in the same domain.\nExample of failure:\nuser contoso\\Jdoe (shared account) is used to login into a windows desktop.\nOn that desktop cdsuser1@contoso.com is used to login into CDS,  then a second application is launched and the user cdsuser2@contoso.com is used to login into CDS.\nThis would result in login failure for the second user with a error indicating that ADAL could not determine which token to use to login.\nFixed a bug in ExecuteCrmWebRequest where some http success codes would be incorrectly seen as a fault.\n\nAdded new property on CrmServiceClient called MaxConnectionTimeout to allow you to set MaxConnectionTimeout of any given action.\nThis property works in conjunction with the existing AppSetting MaxConnectionTimeoutMinuets that can be set in the app.config file.\nif both are set, the property on CrmServiceClient is what is used.\nNote:  this is a global property and cannot be changed once the connection is established.\nNote2: this is subject to network controls imposed by the network between your client and the CDS Service endpoint.\n\nAdded new property on CrmServiceClient called SessionTrackingId to allow you to track all SDK operations made in a process as a given session.\nWhen set, all operations executed by your application via this CrmServiceClient will be tagged with SessionID you provide.\nThis property is primary used by Microsoft Support to help troubleshoot issues, and if available, will speed the identification of issues.\n\nUpdated behavior to block use of token cache files when the setting CacheCredentials = false\nUpdated behavior of ExecuteCrmWebRequest to auto include oData 4.0 default headers for CDS.\nThis call now includes the following headers automatically:\nAccept=application/json\nOData-MaxVersion=4.0\nOData-Version=4.0\nIf-None-Match=\nThese headers can be overridden by passing the same key with the updated value via the customHeaders parameter.\nUpdated behavior of error loggers to include SessionID when present and tag root errors with a visual key \" |=> \" to allow for parsing.\n\n**POSSIBLE BREAKING CHANGE**\nUpdated behavior of connections string to *NOT* use discovery by default. This will require the URL passed to be the correct URL to connect to the CDS instance\n\n\n9.0.2.5:\nFixed a bug with using ExecuteCrmWebRequest where SkipDiscovery was also used that would cause the command to fail with a malformed URI error.\nFix to support SSO login, issue manifested as unable to execute a SSO login on second attempt.\nFix to make local metadata cache instance aware,\nIssue manifested in a single client process where more then one connection was made to different CDS instances and the metadata helpers were used.  The Metadata would not be instance specific.\n\nStreamlined .Clone support by removing unneeded WhoAmI validation call.\nAdded new .Clone override to allow a developer to pass an assembly reference to the .Clone method to use when establishing strong types for that connection.\nAdded addition error log details when a fault is detected\nAdded settings to control inline retry of requests when request is failed due to a network related issue.\nApiOperationRetryCountOverride - count of retries before the connection gives up.  default is 3.\nApiOperationRetryDelayOverride - Time the system waits between retries in seconds.  default is 1.\n\n9.0.2.4:\nAdded support for retrying SDK request if the server throws a retriable errors.\nImportSolutionToCrmAsync –\nReturns an AsyncOperation ID that must be polled for solution Import competition or failure.\nNote, Async jobs are subject to Async queueing and overhead, thus use this with caution.\nDeleteAndPromoteSolutionAsync –\nReturns an AsyncOperation ID that must be polled for competition\nNote: DeleteAndPromote Async support is not generally available to all regions and versions of the platform.  If this not available the async job with fail immediately.\nNote: Async jobs are subject to Async queueing and overhead, thus use this with caution.\nAdded support for retrying SDK request if the server throws a retriable errors.\nModified Package to include Json.net as a proper nuget reference.\nModified logging to report time lost to threading blocks (threading blocks occur when the service client is being used in a multithreaded application)\n\n9.0.2.3:\nAdded new dependencies:\nJson.net version 6.0.0.0\nMicrosoft.Rest.ClientRuntime 3.0.0.0\nAdded Support for Caller ID using AAD Object ID of caller -\nAdded new property on CrmServiceClient: CallerAADObjectId\nSupported for 8.1 and later.\nAdded New Method ExecuteCrmWebRequest\nThis method supports using the XRM WebAPI directly from the CRMServiceClient.\nSupports only oAuth and Certificate Auth connection types\nSupported for 8.0 and later.\nSupports Common request types and supports batch execute.\nAdded Global Discovery Support for Instance lookup\nGlobal discovery is now used for all lookup, both regional and global (Online Region = Don't Know) when OAuth is used, except where special region rules are required.\nNote: Germany and North America 2 are not scanned when Online Region = Don't Know is selected.\nAdded SkipDiscovery to all connection string variants.\nAdded Certificate support for constructor variants.\nFixed issue with allowing discovery selection using onPrem and OAuth.\nFixed an issue with older On-Prem ADFS instances that do not require a resource URI.\n\n**Special notes:\nAdded additional telemetry support to connection requests\nThis will add the process name of the calling process (if available) to help with troubleshooting and support requests.\nAdded request IDs to all requests to help with troubleshooting and support requests.\nThese will appear only when verbose logging is enabled.\n\n\n9.0.0.7: Fixed to allow External Authentication Type to function in released versions of Xrm.Tooling.Connector.dll\n9.0.0.5: 9.0 Initial Release\n9.0.0.2-Preview:\nImproved cache system for faster reconnects.\nNew interfaces to support certificate based auth.\nAdded support to skip discovery\nAdded Clone connection support of OAuth based connections\nAdded New Authentication type to support externally hosted auth.\n**Note: Interface for Xrm.Tooling.Connector is *NOT* Final. there are new API interfaces that will be surfaced before GA.\n\n8.2.0.5:\nFix to memory leak in Microsoft.Xrm.Tooling.Connector.TraceLoggerBase.  Trace Listener collection would not be released within a process over a very long time frame over multiple connections. This would manifest as increasing memory consumption over a very long period.\nFix cleans this up on the .dispose() call on the CrmServiceClient.\nNote: if you have built your own logger based on the Microsoft.Xrm.Tooling.Connector.TraceLoggerBase, you must call .dispose() when you are done with it to clean up the listener collection assigned to it.\n\n8.2.0.4:\nAdded:\nAdded Support for United Kingdom CRM GEO\n\nAdded new behavior to DynamicsFileLogTraceListener.  You can now specify a rolling log behavior based on log size.  To enabled this, add the MaxFileSize key set to the size in bytes and the MaxFileCount set to the max number of files to the Microsoft.Xrm.Tooling.Connector.DynamicsFileLogTraceListener in your app.config.\n\n8.2.0.2: Fix of dependency issue in nuget package. Now properly requires .net 4.5.2 as a baseline\n8.2.0.1: Assembly version changed to 2.2.0.0\nFixes:\nConnection String support:\nCorrected issues with connection string login to properly support the \"never prompt\" behavior.\nCorrected issue were the connector would create a new instance of the connection unnecessarily – impacted ONLY connection string process.\nRequireNewInstance=True will now properly create a unique connection instance, RequireNewInstance = false, will now properly reuse the cached instance of the connection,  default is ‘false’\n\nStreamlined re-use of existing connection code when a new instance is called for by a constructor to remove unnecessary calls.\nModified Caching support to return the full object from in memory cache vs just the core connection.\nFixed token cache behavior to work properly when assembly is resident on an Azure WebApp or Function.\nFixed ADAL nuget dependency issue to allow assembly to consumed directly from nuget into an Azure function.\nFixed MFA ( multifactor authentication ) to properly handle password expired, and password to MFA scenarios\n\nAdded:\nNew Function Utility.GetOrgnameAndOnlineRegionFromServiceUri, Used to parse a Org URL for the correct online region and org name.\nCrmServiceClient now implements IDisposable to allow for the object to be explicitly disposed.\n\n8.1.0.1: Updated to a newer version of Microsoft.IdentityModel.Clients.ActiveDirectory as required by the Xrm Tooling assemblies\n8.1.0: CRM Online 2016 Update 1\n8.1-preview: Pre-release CRM Online 2016 Update 1\n8.0.2: UR1 (Update Rollup 1)\n8.0.0: RTM",
  "requireLicenseAcceptance": true,
  "summary": "Core assembly required to develop managed code applications using the Xrm Tooling Connector.",
  "title": "Microsoft Dynamics 365 SDK Xrm Tooling core assembly",
  "verbatimVersion": "9.1.0.110",
  "version": "9.1.0.110",
  "dependencyGroups": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.04.25.17.27.03/microsoft.crmsdk.xrmtooling.coreassembly.9.1.0.110.json#dependencygroup/.netframework4.6.2",
      "@type": "PackageDependencyGroup",
      "dependencies": [
        {
          "@id": "https://api.nuget.org/v3/catalog0/data/2022.04.25.17.27.03/microsoft.crmsdk.xrmtooling.coreassembly.9.1.0.110.json#dependencygroup/.netframework4.6.2/microsoft.crmsdk.coreassemblies",
          "@type": "PackageDependency",
          "id": "Microsoft.CrmSdk.CoreAssemblies",
          "range": "[9.0.2.42, )"
        },
        {
          "@id": "https://api.nuget.org/v3/catalog0/data/2022.04.25.17.27.03/microsoft.crmsdk.xrmtooling.coreassembly.9.1.0.110.json#dependencygroup/.netframework4.6.2/microsoft.crmsdk.deployment",
          "@type": "PackageDependency",
          "id": "Microsoft.CrmSdk.Deployment",
          "range": "[9.0.2.25, )"
        },
        {
          "@id": "https://api.nuget.org/v3/catalog0/data/2022.04.25.17.27.03/microsoft.crmsdk.xrmtooling.coreassembly.9.1.0.110.json#dependencygroup/.netframework4.6.2/microsoft.crmsdk.workflow",
          "@type": "PackageDependency",
          "id": "Microsoft.CrmSdk.Workflow",
          "range": "[9.0.2.42, )"
        },
        {
          "@id": "https://api.nuget.org/v3/catalog0/data/2022.04.25.17.27.03/microsoft.crmsdk.xrmtooling.coreassembly.9.1.0.110.json#dependencygroup/.netframework4.6.2/microsoft.identitymodel.clients.activedirectory",
          "@type": "PackageDependency",
          "id": "Microsoft.IdentityModel.Clients.ActiveDirectory",
          "range": "[3.19.8, )"
        },
        {
          "@id": "https://api.nuget.org/v3/catalog0/data/2022.04.25.17.27.03/microsoft.crmsdk.xrmtooling.coreassembly.9.1.0.110.json#dependencygroup/.netframework4.6.2/newtonsoft.json",
          "@type": "PackageDependency",
          "id": "Newtonsoft.Json",
          "range": "[11.0.2, )"
        },
        {
          "@id": "https://api.nuget.org/v3/catalog0/data/2022.04.25.17.27.03/microsoft.crmsdk.xrmtooling.coreassembly.9.1.0.110.json#dependencygroup/.netframework4.6.2/microsoft.rest.clientruntime",
          "@type": "PackageDependency",
          "id": "Microsoft.Rest.ClientRuntime",
          "range": "[2.3.20, )"
        }
      ],
      "targetFramework": ".NETFramework4.6.2"
    }
  ],
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.04.25.17.27.03/microsoft.crmsdk.xrmtooling.coreassembly.9.1.0.110.json#Microsoft.CrmSdk.XrmTooling.CoreAssembly.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 7758,
      "fullName": "Microsoft.CrmSdk.XrmTooling.CoreAssembly.nuspec",
      "length": 20651,
      "name": "Microsoft.CrmSdk.XrmTooling.CoreAssembly.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.04.25.17.27.03/microsoft.crmsdk.xrmtooling.coreassembly.9.1.0.110.json#images/Dataverse.128x128.png",
      "@type": "PackageEntry",
      "compressedLength": 12331,
      "fullName": "images/Dataverse.128x128.png",
      "length": 12404,
      "name": "Dataverse.128x128.png"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.04.25.17.27.03/microsoft.crmsdk.xrmtooling.coreassembly.9.1.0.110.json#lib/net462/Microsoft.Rest.ClientRuntime.dll",
      "@type": "PackageEntry",
      "compressedLength": 38720,
      "fullName": "lib/net462/Microsoft.Rest.ClientRuntime.dll",
      "length": 82808,
      "name": "Microsoft.Rest.ClientRuntime.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.04.25.17.27.03/microsoft.crmsdk.xrmtooling.coreassembly.9.1.0.110.json#lib/net462/Microsoft.Xrm.Tooling.Connector.dll",
      "@type": "PackageEntry",
      "compressedLength": 105806,
      "fullName": "lib/net462/Microsoft.Xrm.Tooling.Connector.dll",
      "length": 272784,
      "name": "Microsoft.Xrm.Tooling.Connector.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.04.25.17.27.03/microsoft.crmsdk.xrmtooling.coreassembly.9.1.0.110.json#lib/net462/Microsoft.Xrm.Tooling.Connector.xml",
      "@type": "PackageEntry",
      "compressedLength": 36812,
      "fullName": "lib/net462/Microsoft.Xrm.Tooling.Connector.xml",
      "length": 300039,
      "name": "Microsoft.Xrm.Tooling.Connector.xml"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.04.25.17.27.03/microsoft.crmsdk.xrmtooling.coreassembly.9.1.0.110.json#lib/net462/Other%20Redistributable.txt",
      "@type": "PackageEntry",
      "compressedLength": 192,
      "fullName": "lib/net462/Other Redistributable.txt",
      "length": 557,
      "name": "Other Redistributable.txt"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.04.25.17.27.03/microsoft.crmsdk.xrmtooling.coreassembly.9.1.0.110.json#lib/net462/Third%20Party%20Notices%20for%20Dynamics%20365%20SDK.docx",
      "@type": "PackageEntry",
      "compressedLength": 14213,
      "fullName": "lib/net462/Third Party Notices for Dynamics 365 SDK.docx",
      "length": 19409,
      "name": "Third Party Notices for Dynamics 365 SDK.docx"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.04.25.17.27.03/microsoft.crmsdk.xrmtooling.coreassembly.9.1.0.110.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 18693,
      "fullName": ".signature.p7s",
      "length": 18693,
      "name": ".signature.p7s"
    }
  ],
  "tags": [
    "Dynamics",
    "CRM",
    "SDK",
    "XRM",
    "D365",
    "Dynamics365",
    "365",
    "CommonDataService",
    "CDS",
    "PowerApps",
    "Dataverse",
    "CrmServiceClient"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}