{
  "@id": "https://api.nuget.org/v3/catalog0/data/2015.02.03.08.42.57/siteseeker.core.4.2.76-beta4.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "Euroling AB",
  "catalog:commitId": "25673f5b-e73f-4131-8572-5ee747ec241d",
  "catalog:commitTimeStamp": "2015-02-03T08:42:57.4022737Z",
  "copyright": "Euroling Copyright 2013",
  "created": "2013-05-03T07:47:00.19Z",
  "description": "SiteSeeker integration module for Web applications",
  "iconUrl": "http://www.siteseeker.se/files/euroling-siteseeker-nuget.png",
  "id": "SiteSeeker.Core",
  "isPrerelease": true,
  "lastEdited": "0001-01-01T00:00:00Z",
  "packageHash": "6I+T2Q4bq+Gkpp21pmoui9qzBtx8os616HRHRiTCbi58Pnd25MS6zMNRsbuQO5+tbq2ZN56ERPAtjKv4PKmo8Q==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 2317105,
  "projectUrl": "http://www.siteseeker.se",
  "published": "2013-05-03T07:47:00.19Z",
  "releaseNotes": "4.2.76.1\n*Fixed a serious memory leak.\n\n4.2.75.1\n*Return a 500 Internal Server Error status code if an exception occurs in an HttpHandler. (#5610)\n*Fixed an issue with notifications for ACL modifications in EPiServer 7.\n*Fixed issue with inability to delete EPiServer 7 blocks in edit mode after installing SiteSeeker.EPiServer module. (#5632)\n*Added the ability to set the MaxLengthTextExtract on a SearchRequest. Useful for example mobile scenarios. (#5316)\n*Example projects updated to show the best practice of using javascript helpers.\n\n4.2.74.1\n*Fixed an issue with TabFacets not rendering correctly if ResultFacetList is called before TabFacets. (#5600)\n*Important: Breaking change introduced by this fix (#5600). Please see http://www.siteseeker.se/sv/kunskapsdatabas/guider/overriding-resultfacetlist/\n*Updated pre-release support for SiteSeeker view engine with Razor syntax.\n\n4.2.70.1\n*Fixed an issue with incorrect version string sent to SiteSeeker in a search request.\n*Enhanced the version string to include EPiServer and .Net Framework versions.\n*Added pre-release support for SiteSeeker view engine with Razor syntax. http://nuget.org/packages/SiteSeeker.ViewEngine.Examples\n\n4.2.69.1\n*Fixed pagination not being reset when clicking on facet value\n*Fixed issue with autocomplete javascript not using the correct dynamic selector\n*Fixed issue with the SiteSeeker crawler being redirected if an EPiServer url didn't have a trailing slash\n*Enhanced SiteSeeker notifications in EPiServer to ignore pages in the waste basket\n\n4.2.68.1\n*Fixed issue with string and integer indexers on the Results property of a NullSearchResponse\n*Fixed issue with SiteSeeker plugin not loading in EPiServer 5\n*Fixed breaking change between 4.2.67.1 and 4.2.66.1 related to css style names ess-searchbox and ess-searchbutton\n\n4.2.67.1\n*Added autocomplete support for two search boxes on the same page\n*Added QuickAndAdvancedSearchAutocomplete.aspx to example mvc and webforms projects\n*Enhanced SiteSeeker notifications in EPiServer to handle moved and deleted pages\n\n4.2.66.1\n*Fixed issue with the path not being a valid virtual path if uiUrl is configured as an absolute url\n*Fixed issue with notification event that still fired on publish for a scheduled page\n*Added support to correctly handle autocomplete suggestions with html encoded special characters.\n*Deprecated the BeginFacetTabs method and renamed it to FacetTabs for clarity\n\n4.2.65.1\n*Improved the styling of the SiteSeeker shell module in EPiServer\n*Fixed issue where SiteSeeker notifications did not fire in EPiServer when browsing with 'localhost'\n*Fixed issue where SiteSeeker shell module did not redirect to EPiServer login page after session timeout\n\n4.2.64.1\n*Fixed issue with crawler authentication for the filemetadata.siteseeker http handler that didn't work\n*Fixed intellisense in VS for release assemblies SiteSeeker and SiteSeeker.EPiServer\n*Fixed autocomplete compatibility issue with jQuery 1.9\n*Updated embedded jQuery to 1.9\n\n4.2.63.1\n*Updated the article about logging. \nhttp://www.siteseeker.se/sv/kunskapsdatabas/guider/integration-module-exception-logging/\n*Fixed issue with EPiServer running under a non-default port causing publish events not to fire\n*Fixed issue with modification of an existing page in EPiServer not firing a notification event to SiteSeeker\n*Fixed issue where notification to SiteSeeker didn't properly honour excluded paths\n*Performance improvements for authorization filters\n\n4.2.62.1\n*Added support for the legacy SiteSeeker/FileInformation.aspx script (#5514)\n*Fixed issue with pagination and facet values that were not reset when clicking on tab facets or refinements links (#5500)\n*Fixed issue with incorrect numbering of results on subsequent pages\n\n4.2.61.1\n*Fixed issue with empty query in examples\n*Fixed issue with SiteSeeker tab not showing in EPiServer 6.0.x.x\n*Fixed issue with autocomplete not working in certain scenarios where html helper is used in a web user control\n\n4.2.60.1\n*Added the ability to control the log level through config file or in code\n*Added the ability to specify the location of the log file through config file or in code\n*Added logging of soap messages.\n*Fixed issue with overriding Configure method of EPiServerFileMetaDataCommand (#5460) \n\n4.2.59.1\n*Added live logs viewer to SiteSeeker integration in EPiServer\n*Added additional logging information\n*Removed external SiteSeeker log4net config file\n*Improved EPiServer authorization filter\n*Fixed issue with deleting EPiServer page\n\n4.2.58.1\n*Fixed issue with tcp connection closed unexpectedly by server\n*Fixed issue with HtmlHelpers causing website to hang when index is down.\n*Added Automatic indexing support for EPiServer for published and deleted pages\n*Added EPiServer indexing job to ensure scheduled pages are indexed\n\n4.2.57.1\n*Added EPiServer shell module integration (Statistics and Diagnostics)\n\n4.2.56.1\n*Fixed castle proxy issue (#5448)\n*Fixed issue with duplicate html meta tags\n\n4.2.55.1\n*Added gzip compression for stylesheets and javascripts.\n*Added stylesheet minification. Use SiteSeeker_Css(bool minified).\n*Reduced the number of javascript and stylesheet links rendered by the Html helpers.\n*Added a far future Expires header on css, js and image responses.\n*Introduced new url formats for the previous http handler h.siteseeker.\n*Fixed an issue with the session id that never change between different sessions if caching is enabled.\n\nBreaking Changes:\n*SiteSeeker.EPiServer.ICrawlerAuthenticator.HasAccess(HttpContextBase) is replaced with SiteSeeker.EPiServer.ICrawlerAuthenticator.HasAccess(CommandData).\n*SiteSeeker.UI.ClickRegistrationHandler is replaced with SiteSeeker.UI.ClickTrackingCommand\n*SiteSeeker.UI.QueryCompletionHandler is replaced with SiteSeeker.UI.QueryCompletionCommand\n*SiteSeeker.EPiServer.FileMetaDataHandler is replaced with SiteSeeker.EPiServer.SiteSeeker.EPiServer.EPiServerFileMetaDataCommand\n*SiteSeeker.UI.HtmlHelper.GetCssLink(String) is replaced with SiteSeeker.UI.HtmlHelper.GetCssLink(List<Stylesheets>,boolean)\n*SiteSeeker.UI.HtmlHelper.GenerateCSSScriptLink(String) is replaced with SiteSeeker.UI.UrlBuilder.CreateEmbeddedStylesheetUrl(String,Stylesheets[],Boolean)\n*SiteSeeker.UI.HtmlHelper.GenerateJSScriptLink(String) is replaced with SiteSeeker.UI.UrlBuilder.CreateEmbeddedJavascriptUrl(String,JavaScripts[],Boolean)\n\n4.2.54.1\n*Added release notes to NuGet packages\n*Changed the version format from 4.2.0.xx to 4.2.xx.1\n*Fixed issue with Age filtering not working\n*Fixed issue with log4net ambiguous reference\n\n4.2.0.53\n* Added support for Norwegian (#5034)\n* Added Checkboxes for multiple-choice \nand intersection facets rendered with \nthe HTML helper ResultFacetList.\n* Removed dependency to log4net.\n* Fixed byte order marker issue when indexing files (#5389)\n\n4.2.0.52\n* Improved memory management\n* Added ability to configure permissions \nfor the diagnostics page. Read more about this here\n* Added the ability to log exceptions in order to troubleshoot and diagnose problems. Read more about this here\n* Fixed issue with page load registration for non javascript clients, e.g bots. (#5377)\n* Fixed issue with exceptions on worker threads not being exposed to main thread.\n* Fixed an issue with asynchronous operations that are not allowed in certain contexts. (#5418)\n\n4.2.0.49\n* Fixed issue with an incorrect version number that is sent from the integration module via the web service. The version number is used for logging and diagnostics, and does not affect searching or indexing.\n* Added a Diagnostics Page. Read more about integration module diagnostics here.",
  "requireLicenseAcceptance": false,
  "version": "4.2.76-beta4",
  "tags": [
    "SiteSeeker",
    "Core",
    "Search",
    "module"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    }
  }
}