{
  "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.21.06.27.02/aspose.words.11.11.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "Aspose",
  "catalog:commitId": "dfbdbb73-04d7-4bbe-88d4-64dd6f4c3429",
  "catalog:commitTimeStamp": "2018-10-21T06:27:02.2363647Z",
  "copyright": "© Aspose 2002-2011. All Rights Reserved.",
  "created": "2012-12-31T08:29:44.55Z",
  "description": "Aspose.Words for .NET class library supports DOC, DOCX, RTF, HTML, OpenDocument, PDF, XPS, EPUB and other formats. With Aspose.Words you can generate, modify, convert, render and print documents without utilizing Microsoft Word®",
  "iconUrl": "http://www.aspose.com/images/products/dotnet/Aspose.Words_128x128.png",
  "id": "Aspose.Words",
  "isPrerelease": false,
  "lastEdited": "2018-10-21T06:26:32.89Z",
  "licenseUrl": "http://www.aspose.com/corporate/purchase/end-user-license-agreement.aspx",
  "listed": true,
  "packageHash": "VAQOsvfPcf7qSVuyz6fVRtvJpNj0sQSFTdgD9UbV+nIUq1SfwoCOXKksbUnk2fUsQdHDls3L2P6cV/e4Yj58gQ==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 14980113,
  "projectUrl": "http://www.aspose.com/categories/.net-components/aspose.words-for-.net/default.aspx",
  "published": "2012-12-31T08:29:44.55Z",
  "releaseNotes": "There are 174 improvements and fixes in this regular monthly release. The most notable are:\n\n• DrawingML SmartArt (Diagrams) are now rendered.\n• Multiple enhancements in DrawingML Charts rendering.\n• Different text directions are supported in DrawingML textboxes rendering.\n• Optimized output of PDF files.\n\nThis release introduces the new features, enhancements and fixes to the excptions, bugs and regressions as detailed below:\n\n• New features\n\nWORDSJAVA-562\tSupport enhanced effects for DrawingML pictures\nWORDSNET-4171\tIndex field is lost after open/save ODT document\nWORDSNET-4213\tBackground color is missing after open/save odt document\nWORDSNET-4332\tSupport Tight wrapping style during rendering.\nWORDSNET-4333\tSupport through wrapping style during rendering.\nWORDSNET-5343\tConfigure to build AWNET Debug configuration\nWORDSNET-6041\t/tight wrapping/ While converting docx to Pdf, first page is incorrectly positioned on second page.\nWORDSNET-6713\t/through wrapping/ Docx to Pdf conversion issue with TextBoxes positions\nWORDSNET-6795\tSupport list-style-type attribute of HTML ordered list\nWORDSNET-7112\tOOXML Diagrams // SmartArt objects are not preserved in PDF\nWORDSNET-7138\tSupport multiLvlStrRef upon rendering charts.\nWORDSNET-7243\tSupport render legend markers in data labels.\nWORDSNET-7262\tSupport rendering of minor grid lines.\nWORDSNET-7299\tSupport style:color attribute of anchor tag\nWORDSNET-7300\tSupport style:text-decoration attribute of anchor tag\nWORDSNET-7319\tImplement gradient brush transformation during 3d transformation of front/back faces.\nWORDSNET-7357\tSupport dml text direction and rotation\nWORDSNET-7365\tSupport rendering of up-down bars.\nWORDSNET-7366\tSupport rendering high-low lines.\nWORDSNET-7395\tScaling GIF images\nWORDSNET-7396\tRender OOXML diagrams using data in drawingN.xml.\n\n• Enhancements\n\nWORDSJAVA-588\tEmbedded picture with negative shape height unproperly saved from RTF to html\nWORDSJAVA-592\t“Xerces hell” with crimson-1.1.3.jar\nWORDSJAVA-646\tSkip parsing invalid metafile\nWORDSJAVA-651\tRemove com.sun.org.apache.* references from Digital Signature module\nWORDSJAVA-661\tScan all directories to find out the presence of a Font in Linux\nWORDSNET-2302\tIndents of list items are not the same as in original document.\nWORDSNET-2317\tEach line in output RTF should not exceed 255 lines or so\nWORDSNET-3286\tUnused styles in document are changed after converting document using AW.\nWORDSNET-3616\tLists are not exported as native lists into HTML after appending documents.\nWORDSNET-4454\tDocument layout is changed during rendering.\nWORDSNET-4544\tJoinRunsWithSameFormatting does not work properly in DOC format\nWORDSNET-5875\tWhile converting Word document to Html, document Numbering misplaced.\nWORDSNET-5888\tDont add spacing between paragraphs of the same style is not supported in export to HTML\nWORDSNET-6058\tShape contents are getting overlapped in Fixed Page Formats\nWORDSNET-6477\tImprove line height calculation in complex scenarios\nWORDSNET-6589\tDocx to PDF conversion issue, Logo image is misplaced\nWORDSNET-6741\tTextBoxes are laid out incorrectly in fixed page formats\nWORDSNET-6950\tSupport text wrapping for EMF+ DrawString record\nWORDSNET-7258\tTestInsertImageFromHttp stopped passing when Google replaced image file on its side.\nWORDSNET-7297\tDocument.UpdateFields do not update TOC with images.\nWORDSNET-7318\tFix incorrect faces display in some cases\nWORDSNET-7320\tParagraphBreakFont highlight color appears in PDF\nWORDSNET-7326\tUnexpected characters appear in the output documents produced by Aspose.Words\nWORDSNET-7355\tPictures are not preserved during open/save an XML document\nWORDSNET-7358\tPicture is not preserved during open/save XML Document\nWORDSNET-7359\tMultiple Paragraphs are getting lost during open/save an XML Document\nWORDSNET-7360\tParagraphs from the bottom of the Page are missing in output Document\nWORDSNET-7361\tParagraphs from the bottom of the Page are missing in output Document\nWORDSNET-7362\tMultiple Paragraphs are getting lost during loading into DOM\nWORDSNET-7363\tMultiple Paragraphs are getting lost during loading into DOM\nWORDSNET-7364\tRemove Encoding.IsSingleByte call from metafile rendering code\nWORDSNET-7383\t\\mmathPict attribute is not generated when converting Docx to Rtf\nWORDSNET-7428\tImplement correct scale for picture brush during 3d transformation of front/back faces.\nWORDSNET-7430\tHide front/back edges for faces haven't solid brush.\nWORDSNET-7444\tShape is cut\nWORDSNET-7455\tA signature image is not preserved during open/save\nWORDSNET-7463\tUse wrapping polygon read from file for a group shape\nWORDSNET-7464\tArrow shapes are not positioned correctly in pdf output\nWORDSNET-7471\tUpdate warning messages to reflect recent support for tight/through wrapping\nWORDSNET-7480\tBookmark.Text is not working while conversion from Docx to PDF\nWORDSNET-7500\tRTL text order is not preserved when saving DOCX to PDF\nWORDSNET-7502\tDifference in Html and DocumentBuilder.InsertHtml result\nWORDSNET-7504\tImprove bubble size calculation algorithm.\nWORDSNET-7526\tConsider inserting a Bookmark when updating an ASK field\n\n• Exceptions\n\nWORDSNET-5979\tInvalidOperationException occur while updating fields.\nWORDSNET-6293\tDocument.Save (Memory Stream) in parallel exception (Parallel.ForEach)\nWORDSNET-7292\tDocument.Save method throws exception on converting Docx to Fixed Page Formats\nWORDSNET-7340\tSystem.OverflowException occurs during importing DOCM\nWORDSNET-7388\tAspose.Words.FileCorruptedException occurs when loading RTF file\nWORDSNET-7393\tException on converting Doc to PDF\nWORDSNET-7397\tSystem.Drawing.Printing.InvalidPrinterException occurs during printing over IIS\nWORDSNET-7403\tStyle.BaseStyleName throws Exception System.InvalidOperationException\nWORDSNET-7418\tInvalidOperationException occurs during rendering DOC to PDF\nWORDSNET-7424\tGroup shape wrapping boundary for tight wrapping is not correct\nWORDSNET-7448\tAspose.Words.FileCorruptedException occurs when loading RTF file\nWORDSNET-7451\tInvalidCastException occurs during rendering FlatOpc to Pdf\nWORDSNET-7523\tStyle.Name throws NullReferenceException during copying style name from another Document\nWORDSNET-7554\tException while conversion from Docx to Fixed file format\n\n• Bugs\n\nWORDSJAVA-516\tExtra CR introduced in the WORD ouput\nWORDSJAVA-554\tDocument.Save corrupts DOCX during sending to Client's Browser\nWORDSJAVA-604\tWordArt text rendered inproperly\nWORDSJAVA-606\tWordArt loses new line during conversion of DOC to PDF\nWORDSJAVA-636\tCreate Digitally Signed PDF Documents throws exception\nWORDSJAVA-648\tRenderToScale changes the background colour from White to Salmon\nWORDSJAVA-663\tAspose.Words does not render a document over WebSphere 6.0\nWORDSNET-3579\tWidth of horizontaly merged cell is incorrect in exported HTML.\nWORDSNET-3628\tField nested into INCLUDEPICTURE field is broken after open/save\nWORDSNET-3679\t=SUM(ABOVE) fails to display correct value when numbers have a symbol with length > 1\nWORDSNET-5145\t<a> tags appear blue and underlined during HTML import\nWORDSNET-5735\tLeft and First Line Indents are not preserved on DOC>HTML>DOC roundtrip\nWORDSNET-5832\tIncorrect border rendered for a vertically merged cell in case of border conflict.\nWORDSNET-6268\tODT to PDF conversion: position of embedded pictures not correct\nWORDSNET-6403\tCell border thickness is calculated incorrectly in fixed page formats\nWORDSNET-6500\tBullets in lists are displayed as question marks in HTML\nWORDSNET-6501\tLeft margin of lists is exported incorrectly to HTML\nWORDSNET-6653\tborder-bottom-style:none doesn't has any affect during converting HTML to DOCX\nWORDSNET-6745\tIncorrect horizontal border selected for vertically merged cells\nWORDSNET-6843\tBorders are appearing incorrectly for some Cells in PDF\nWORDSNET-6872\tHebrew (RTL) text is not preserved when saving HTML to PDF\nWORDSNET-6994\tAdd cell's padding to table's margin read from HTML to correspond an internal DOM\nWORDSNET-7003\tShape overlaps the content during printing\nWORDSNET-7062\tSmartArt objects are not preserved when saving to flow formats.\nWORDSNET-7106\tParagraph space after increases after resaving HTML.\nWORDSNET-7181\tHTML to Docx conversion issue with borders\nWORDSNET-7193\tRTL text is reversed when converting HTML to RTF\nWORDSNET-7200\tDirect formatting of Normal style is applied to <h2> element\nWORDSNET-7212\tSpace between words is incorrectly added in PDF to make lines justified\nWORDSNET-7217\tX-axis texts values are changed to numbers in PDF\nWORDSNET-7229\tDoc to PDF conversion issue with Shape rendering\nWORDSNET-7247\tDoc to HTML conversion issue with image rendering\nWORDSNET-7259\tTable content is poorly laid out in PDF\nWORDSNET-7272\tText in Cell is getting truncated at bottom and Text Warping is incorrect\nWORDSNET-7273\tCell borders are getting lost when rendering to PDF\nWORDSNET-7283\tDocument.Save method freezes on saving TXT to fixed file formats\nWORDSNET-7286\tTable Cells are getting scattered all over the pages in PDF\nWORDSNET-7287\tTable Cells are getting scattered all over the pages in PDF\nWORDSNET-7293\tShape position is changed on save\nWORDSNET-7310\tColumn widths are not preserved during exporting to Html\nWORDSNET-7314\tVertical text alignment of Cell changes from Center to Top in Html\nWORDSNET-7315\tUnexpected cell border appears during Docx to Html conversion\nWORDSNET-7321\tArabic (RTL) text is reversed during rendering to Pdf\nWORDSNET-7327\tLogo in top left corner on first page is in wrong place in Pdf\nWORDSNET-7328\tTextBox in top right corner on first page is in wrong place in Pdf\nWORDSNET-7329\tIcons in the Shape are distorted and aligned horizontally in Pdf\nWORDSNET-7330\tExtra blank page is generated after first page in Pdf\nWORDSNET-7331\tBullet list text is partially obscured near bottom of page 3 in Pdf\nWORDSNET-7332\tParagraph is rendering on the previous page in Pdf\nWORDSNET-7334\tTables with merged cells do not rendered properly\nWORDSNET-7338\tDoc to HTML conversion - some TOC links do not work\nWORDSNET-7339\tProtecting a Word Document Reverses Arabic Words\nWORDSNET-7343\tUse AppendDocument with OoxmlCompliance.Iso29500_2008_Transitional shows unreachable contents\nWORDSNET-7347\tHebrew RTL text is getting reversed during Html to Rtf conversion\nWORDSNET-7348\tCell content alignment is incorrect during Html to Doc conversion\nWORDSNET-7349\tBullets and Numbering of Lists are incorrect during Html to Docx conversion\nWORDSNET-7356\tA Table on second page is merged into a Table on first page\nWORDSNET-7369\tTable Row is expanding more than the Page width in Pdf\nWORDSNET-7371\tIncorrect rendering of WordArt object with CR symbol\nWORDSNET-7375\tCell vertical text alignment is not preserved when exporting to Html\nWORDSNET-7389\tMath equations do not correctly render in output PDF/XPS file\nWORDSNET-7392\tTable borders are misaligned when exporting to Html (in IE7)\nWORDSNET-7394\tDot to Docx conversion issue with table's border lines\nWORDSNET-7398\tImporting a Section twice corrupts Docx document\nWORDSNET-7399\tLink between grouped textboxes breaks when saving a .docx\nWORDSNET-7400\tLink between textboxes breaks when saving to Doc/Docx\nWORDSNET-7401\tCalling InsertField method changes the CurrentUICulture\nWORDSNET-7404\tStyle.Name do not change the style name\nWORDSNET-7405\tDocument.Save method throws exception System.InvalidCastException.\nWORDSNET-7409\tChart \"X\" Axis values are appeared in output PDF but not exists in input Docx\nWORDSNET-7410\tDocx to PDF conversion issue with charts data\nWORDSNET-7413\tAlternate background color of Rows is lost during importing HTML\nWORDSNET-7414\tAlternate background color of Rows is lost during importing HTML\nWORDSNET-7417\tMail Merge field lost font after calling MailMerge.Execute\nWORDSNET-7419\tText-Align style attribute of td is not preserved during converting Html to Doc\nWORDSNET-7441\tArrow Shape do not render correctly while conversion from Doc to Fixed file format\nWORDSNET-7443\tAspose.Words hangs during rendering DOC to Pdf\nWORDSNET-7445\tDocument.Save freeze while saving Docx to fixed file format\nWORDSNET-7469\tIncorrect text size in pdf output\nWORDSNET-7474\tAttribute \"dashstyle\" is not preserved during open/save XML\nWORDSNET-7475\tShapes are not preserved during open/save FlatOpc\nWORDSNET-7498\tFigures in Table are not alinged properly in Html\nWORDSNET-7511\tPosition of frame is changed after conversion from Docx to Doc\nWORDSNET-7512\tFrame is incorrectly rendered after conversion from Docx to PDF\nWORDSNET-7525\tShapes become distorted and their size is not preserved during open/save\nWORDSNET-7536\tDoc to RTF conversion issue text Highlighted color\n\n• Regressions\n\nWORDSNET-7008\tBullets are exported as question marks in HTML\nWORDSNET-7454\tColor of <a> changes and it becomes underlined during converting Html to Docx\nWORDSNET-7472\tFont of MERGEFIELD is not preserved after MailMerge\nWORDSNET-7473\tMailMerge does not merge all fields any more\nWORDSNET-7489\tUpdateFields doesn't remove fields inside the alternative view of if-fields any more\nWORDSNET-7521\tMERGEFIELDS are auto updated when rendering to Pdf\n\n• Performance\n\nWORDSNET-7295\tFix the pattern generation code in PDF renderer to avoid large patterns\nWORDSNET-7425\tDocx take much time to load as compared to Doc file format\nWORDSNET-7491\tFile size of PDF that is generated by Aspose.Words is too big",
  "requireLicenseAcceptance": true,
  "title": "Aspose.Words for .Net",
  "verbatimVersion": "11.11.0",
  "version": "11.11.0",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.21.06.27.02/aspose.words.11.11.0.json#Aspose.Words.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 5579,
      "fullName": "Aspose.Words.nuspec",
      "length": 14448,
      "name": "Aspose.Words.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.21.06.27.02/aspose.words.11.11.0.json#lib/net1.1/Aspose.Words.dll",
      "@type": "PackageEntry",
      "compressedLength": 5011267,
      "fullName": "lib/net1.1/Aspose.Words.dll",
      "length": 8425472,
      "name": "Aspose.Words.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.21.06.27.02/aspose.words.11.11.0.json#lib/net2.0/Aspose.Words.dll",
      "@type": "PackageEntry",
      "compressedLength": 4976281,
      "fullName": "lib/net2.0/Aspose.Words.dll",
      "length": 8647680,
      "name": "Aspose.Words.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.21.06.27.02/aspose.words.11.11.0.json#lib/net3.5/Aspose.Words.dll",
      "@type": "PackageEntry",
      "compressedLength": 4974548,
      "fullName": "lib/net3.5/Aspose.Words.dll",
      "length": 8646144,
      "name": "Aspose.Words.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.21.06.27.02/aspose.words.11.11.0.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9463,
      "fullName": ".signature.p7s",
      "length": 9463,
      "name": ".signature.p7s"
    }
  ],
  "tags": [
    "Aspose.Words",
    "DOC",
    "DOCX",
    "RTF",
    "HTML",
    "OpenDocument",
    "XPS",
    "EPUB",
    "Word",
    "Document",
    "Processing"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    }
  }
}