{
  "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.21.06.27.02/aspose.words.11.9.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "Aspose",
  "catalog:commitId": "dfbdbb73-04d7-4bbe-88d4-64dd6f4c3429",
  "catalog:commitTimeStamp": "2018-10-21T06:27:02.2363647Z",
  "copyright": "© Aspose 2002-2011. All Rights Reserved.",
  "created": "2012-11-03T05:15:18.757Z",
  "description": "Aspose.Words for .NET class library supports DOC, DOCX, RTF, HTML, OpenDocument, PDF, XPS, EPUB and other formats. With Aspose.Words you can generate, modify, convert, render and print documents without utilizing Microsoft Word®",
  "iconUrl": "http://www.aspose.com/images/products/dotnet/Aspose.Words_128x128.png",
  "id": "Aspose.Words",
  "isPrerelease": false,
  "lastEdited": "2018-10-21T06:26:43.907Z",
  "licenseUrl": "http://www.aspose.com/corporate/purchase/end-user-license-agreement.aspx",
  "listed": true,
  "packageHash": "t4aasxdqxgMee+z24Qp8jk8Za0DXA2k3LJWTPPnzbBe5Qw8SgdWZXawmYpD9br6TdKy2iCR6ktJeR1/MwWWwxg==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 14653447,
  "projectUrl": "http://www.aspose.com/categories/.net-components/aspose.words-for-.net/default.aspx",
  "published": "2012-11-03T05:15:18.757Z",
  "releaseNotes": "There are 152 improvements and fixes in this regular monthly release. The most notable are:\n\n• Many more features supported when rendering DrawingML charts.\n• Borders for \"conforming\" paragraphs are exported to HTML correctly.\n• It is possible to specify image size now when inserting images during mail merge.\n• Significant improvements to layout of floating tables when converting to PDF and XPS.\n• Improvements to handling of spaces for East Asian languages when converting to PDF and XPS.\n• Improvements to RTL text layout when converting to PDF and XPS.\n\nThis release introduces the new features, enhancements and fixes to the excptions, bugs and regressions as detailed below:\n\n• New features\n\nWORDSJAVA-628\tPublic API to set ImageColorMode (Grayscale, BlackAndWhite) in ImageSaveOptions.\nWORDSNET-2809\t/conforming borders/ Border around few paragraphs appears for each paragraph in HTML.\nWORDSNET-3909\tSupport rendering DrawingML basic features\nWORDSNET-4479\t/conforming borders/ Extra border line appears upon HTML export.\nWORDSNET-4702\tAllow specifying image size in Image:Mergefield.\nWORDSNET-5087\tSupport \"Allow overlap\" attribute for floaters.\nWORDSNET-5190\tFloating table moves to the top of the page and overlaps content when rendering\nWORDSNET-5362\tAdd the ability to intercept an image being inserted into a document\nWORDSNET-5951\t/conforming borders/ While converting docx to html, additional borders are generated.\nWORDSNET-6054\t/conforming borders/ Hide borders between paragraphs if they have the save format\nWORDSNET-6116\tFloating table overlaps in rendered output\nWORDSNET-6521\tFloating table overlaps another floating table in PDF\nWORDSNET-6767\tImplement ASK and FILLIN fields\nWORDSNET-6774\tAdd support for locked fields (fldLock attribute)\nWORDSNET-6915\tFloating tables are overlapping each other in fixed page formats\nWORDSNET-6935\tSupport Data Point formatting.\nWORDSNET-6936\tSupport custom font formatting.\nWORDSNET-6937\tSupport manual layout of chart elements.\nWORDSNET-6939\tSupport custom axis formatting.\nWORDSNET-6940\tSupport custom legend formatting.\nWORDSNET-6957\tHorizontal axis labels are rendered improperly.\nWORDSNET-6958\tMake sure charts are rendered upon converting to flow formats.\nWORDSNET-6959\tSupport explosion upon rendering Pie charts.\nWORDSNET-6961\tSupport gap width upon rendering bar charts.\nWORDSNET-6970\tFloating tables are overlapping the first Paragraph in PDF\nWORDSNET-6996\tSupport tickLblPos upon rendering axis labels.\nWORDSNET-7039\tDocx to PDF conversion issue with image position\nWORDSNET-7056\tFloating tables are overlapping each other in fixed page formats\nWORDSNET-7061\tA document with DrawingML Chart is not rendered.\nWORDSNET-7094\tImages overlap each other\nWORDSNET-7126\tSupport locked fields\n\n• Enhancements\nWORDSJAVA-610\tYet another .Net DateTime custom patterns\nWORDSJAVA-623\tDateTime.Parse support of locales\nWORDSJAVA-624\tDateTime parser support of TimeZones\nWORDSJAVA-625\tDateTime parser support of custom formats\nWORDSJAVA-640\tautomatic import of CultureInfo data from .Net\nWORDSJAVA-641\tParse date strings formatted with custom DateTimeFormatInfo\nWORDSNET-3903\tWhite-spaces are replaced with tabs after open/save document.\nWORDSNET-4070\tFont size is chenged upon loading DOCX document.\nWORDSNET-4732\tName and description of DrawingML object are lost after converting to WML\nWORDSNET-5036\tPosition of floating table is incorrect.\nWORDSNET-5954\tShapes are getting overlapped and positioned incorrectly in fixed page formats\nWORDSNET-6027\t/floater par Y/ Table's position is changed after doc to pdf conversion\nWORDSNET-6207\tSupport insertion of SVG images\nWORDSNET-6314\tShape overlaps its child Paragraphs in PDF\nWORDSNET-6373\tDocx to PDF conversion issue with table overlap (Allow overlap = true)\nWORDSNET-6425\tText of text boxes and shapes is not exported in output PDF file\nWORDSNET-6442\tSupport getting text wrapping bounds for DrawingML objects.\nWORDSNET-6504\tIssue with AppendDocument method, the image disappears after appending document.\nWORDSNET-6665\tExtra frames around text on HTML to DOCX conversion\nWORDSNET-6686\tNested floating table position incorrect, overlaps another table.\nWORDSNET-6885\tAlignment of cell contents is imported incorrectly\nWORDSNET-6938\tSupport elements overlapping on chart area.\nWORDSNET-6981\tRework EMF and WMF clipping\nWORDSNET-6995\tImprove handling of Auto flag in Axis.\nWORDSNET-6998\tSupport suppressOverlap paragraph attribute\nWORDSNET-7024\tParagraph MirrorIndents attribute is lost after open/save RTF\nWORDSNET-7043\tAdd supported features for OOXML Chart rendering\nWORDSNET-7044\tCreate a list of new API changes for this months release\nWORDSNET-7049\tIssue with SECTIONPAGES field when Docx file is converted to PDF\nWORDSNET-7058\tFloating frame is rendering at the right edge of page\nWORDSNET-7060\tDrawingML formula is rendered incorrectly\nWORDSNET-7065\tFloating tables are overlapping each other in fixed page formats\nWORDSNET-7075\tIncorporate code from API changes article into main code base\nWORDSNET-7076\tUpdate any articles that reference ToTxt method\nWORDSNET-7093\tBold font formatting is lost when rendering to PDF\nWORDSNET-7109\tFont size renders smaller than the actual size in DOCX\nWORDSNET-7144\tFloating table is broken between pages in pdf output\nWORDSNET-7170\tUnexpected square boxes appear when converting to TIFF format\n\n• Exceptions\n\nWORDSNET-3945\tUriFormatException is thrown upon executign mail merge.\nWORDSNET-4618\tStackOverflowException occurs upon updating fields.\nWORDSNET-5624\tIndexOutOfRangeException occurs upon executing mail merge.\nWORDSNET-5927\tException while using updateFields() after appending document\nWORDSNET-6108\tException while using mail merge with nested regions\nWORDSNET-6232\tInvalidOperationException occurs during converting DOCX to DOC\nWORDSNET-6700\tOffice 2013 document throwing Aspose.Words.FileCorruptedException\nWORDSNET-6949\tArgumentOutOfRangeException occurs on specifying TxtSaveOptions.PreserveTableLayout property\nWORDSNET-6984\tUnable to load a Word 2013 document into Aspose.Words' DOM\nWORDSNET-6988\tImage.GetFrameCount(FrameDimension) throws GDI+ error\nWORDSNET-7000\tUnsupportedFileFormatException occurs when loading a TEXT file into DOM\nWORDSNET-7011\tNullReferenceException occurs during rendering to PDF\nWORDSNET-7042\tException throws while converting Docx to PDF conversion\nWORDSNET-7047\tAspose.Words.FileCorruptedException occurs when loading ODT file\nWORDSNET-7071\tInvalidOperationException occurs during exporting to ePub\nWORDSNET-7091\tSystem.ArgumentException occurs when processing document in multiple threads\nWORDSNET-7100\tUnsupportedFileFormatException occurs when loading a TEXT file into DOM\nWORDSNET-7107\tException on saving Doc file to Doc/Docx\nWORDSNET-7108\tInvalidOperationException occurs during rendering DOC to PNG\nWORDSNET-7176\tException on converting Docx to PDF/XPS\n\n• Bugs\n\nWORDSJAVA-609\tShort hour DateTime format\nWORDSNET-4160\tMergeFields which contain white spaces in the name are not replaced with value during mail merge.\nWORDSNET-4782\tParagraph SpaceAfter/SpaceBefore is incorrect.\nWORDSNET-5688\tIf TOC is inside table cell, its page numbers on right become invisible\nWORDSNET-5933\tFile name in hyperlink URL gets corrupted when exporting to PDF\nWORDSNET-6021\tFont is changed during converting DOCX to RTF\nWORDSNET-6064\tIncorrect paragraph borders height\nWORDSNET-6269\tStandard style lost when open/save Word document.\nWORDSNET-6304\tMissing spaces in document after resave the docx file\nWORDSNET-6367\tField value is surrounded by unwanted border in DOCX\nWORDSNET-6397\tCalling StructuredDocumentTag.ChildNodes.Clear() removes the SDT itself\nWORDSNET-6435\tTable in Header overlaps the Table in body during rendering to fixed page formats\nWORDSNET-6540\tParagraph Mirror Indenting Issue\nWORDSNET-6606\tDrop Cap: DropCapPostion property not working properly\nWORDSNET-6631\tLeading space is missing upon rendering DOCX document to PDF, while using Aspose.Words v11.5.0.\nWORDSNET-6652\tcell.CellFormat.HorizontalMerge do not return correct value\nWORDSNET-6756\tChanged behaviour of Form field while rendering DOCX to PDF\nWORDSNET-6811\tBullets are rendering as square boxes in fixed page formats\nWORDSNET-6837\tText font issue while converting Docx to Pdf\nWORDSNET-6858\tSpecialChars are displaying as question marks in DOC\nWORDSNET-6895\tText is repeated when converting Docx to PDF\nWORDSNET-6911\tStructuredDocumentTag Dropdown and ComboBox SelectedValue is null\nWORDSNET-6913\tFORMCHECKBOX fields don't appear after calling doc.UpdateFields\nWORDSNET-6918\tFloating table in Word duplicates when converted to PDF\nWORDSNET-6951\tRTF to Doc conversion issue with [Line spacing and Spacing after] after adding section breaks\nWORDSNET-6969\tRight-To-Left Hebrew RTF conversion to DOC/DOCX problems\nWORDSNET-6976\tDocx to Epub file conversion issue with image rendering\nWORDSNET-6985\tDoc to RTF conversion issue with text rendering\nWORDSNET-6990\tDoc to PDF conversion issue with Japanese characters\nWORDSNET-7006\tDocx to PDF conversion issue with bullet, bullet is italic\nWORDSNET-7009\tDocx to PDF conversion issue with StructuredDocumentTag\nWORDSNET-7017\tDot To PDF conversion issue with checkboxes\nWORDSNET-7018\tRTF to PDF conversion issue with contents rendering\nWORDSNET-7019\tA text box with vertical text is rendered horizontally.\nWORDSNET-7020\tHTML to TXT conversion issue with text rendering\nWORDSNET-7021\tDoc to PDF conversion issue with image rendering\nWORDSNET-7026\tA floating table overlaps another floating table\nWORDSNET-7028\tTables in DOC are imported as Rows in DOM\nWORDSNET-7029\tGetText returns text with incorrect character encoding\nWORDSNET-7030\tSet Bookmark's text to empty string change the text formatting/style\nWORDSNET-7031\tBFFValidator does not validate DOC produced by Aspose.Words\nWORDSNET-7032\tInvalidOperationException occurs when calling SetLicense\nWORDSNET-7035\tTreat '\\x3000' (Ideographic Space) at the end of a line as normal Space character\nWORDSNET-7048\tIF field fails to update when true or false argument is merged\nWORDSNET-7051\tRTF to Doc conversion issue with Track changes\nWORDSNET-7053\tText in Textbox is cut off after conversion\nWORDSNET-7057\tPage numbering scheme is not correct in PDF\nWORDSNET-7072\tDoc to PDF conversion issue with Shape Rendering\nWORDSNET-7081\tGlyphs become squares in Doc to PDF conversion\nWORDSNET-7082\tUnable to set Width and Height of DrawingML in fixed page formats\nWORDSNET-7089\tDoc to Docx conversion issue with table width\nWORDSNET-7092\tTelephone symbol in DOCX is rendering as question mark in PDF\nWORDSNET-7098\tAcceptAllRevisions inserts a square box character in DOCX\nWORDSNET-7146\tRTL text is reversed when converting to TIFF\n\n• Regressions\n\nWORDSNET-6992\tColumn width is imported incorrectly from HTML\nWORDSNET-7025\tam/pm mergefield time format is no longer working\n\n• Performance\n\nWORDSNET-6925\tVisio.Drawing.11 objects are rendered very slow to PDF\nWORDSNET-6982\tInterrupt metafile processing if fall-back should be performed",
  "requireLicenseAcceptance": true,
  "title": "Aspose.Words for .Net",
  "verbatimVersion": "11.9.0",
  "version": "11.9.0",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.21.06.27.02/aspose.words.11.9.0.json#Aspose.Words.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 4737,
      "fullName": "Aspose.Words.nuspec",
      "length": 12130,
      "name": "Aspose.Words.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.21.06.27.02/aspose.words.11.9.0.json#lib/net1.1/Aspose.Words.dll",
      "@type": "PackageEntry",
      "compressedLength": 4900680,
      "fullName": "lib/net1.1/Aspose.Words.dll",
      "length": 8249344,
      "name": "Aspose.Words.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.21.06.27.02/aspose.words.11.9.0.json#lib/net2.0/Aspose.Words.dll",
      "@type": "PackageEntry",
      "compressedLength": 4867849,
      "fullName": "lib/net2.0/Aspose.Words.dll",
      "length": 8467968,
      "name": "Aspose.Words.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.21.06.27.02/aspose.words.11.9.0.json#lib/net3.5/Aspose.Words.dll",
      "@type": "PackageEntry",
      "compressedLength": 4867745,
      "fullName": "lib/net3.5/Aspose.Words.dll",
      "length": 8466944,
      "name": "Aspose.Words.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.21.06.27.02/aspose.words.11.9.0.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9462,
      "fullName": ".signature.p7s",
      "length": 9462,
      "name": ".signature.p7s"
    }
  ],
  "tags": [
    "Aspose.Words",
    "DOC",
    "DOCX",
    "RTF",
    "HTML",
    "OpenDocument",
    "XPS",
    "EPUB",
    "Word",
    "Document",
    "Processing"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    }
  }
}