{
  "@id": "https://api.nuget.org/v3/catalog0/data/2019.10.28.11.41.02/powerofficegosdk.2.8.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "PowerOffice AS",
  "catalog:commitId": "84cfc9da-74ba-410b-854a-1231fb1dcba9",
  "catalog:commitTimeStamp": "2019-10-28T11:41:02.2420208Z",
  "copyright": "Copyright © 2014-2019",
  "created": "2019-09-09T10:37:45.087Z",
  "description": "PowerOffice® Go™ Add-on API SDK",
  "iconUrl": "http://api.poweroffice.net/web/nuget/logo.png",
  "id": "PowerOfficeGoSdk",
  "isPrerelease": false,
  "lastEdited": "2019-10-28T11:40:57.58Z",
  "licenseUrl": "https://raw.githubusercontent.com/PowerOffice/go-api/master/License.md",
  "listed": false,
  "packageHash": "HqhPjrTDwPBpAjsQ8YmwV7TUg+J6u+64U9Sg/z2jyYYQP4vbCcWKsXwl0CmlxgF5AdsSTX9JV/SrZ1+GO/bMKg==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 834214,
  "projectUrl": "http://api.poweroffice.net/",
  "published": "1900-01-01T00:00:00Z",
  "releaseNotes": "2.8.0:\n- Breaking change in ExternallyDeliverableInvoiceService. Generated invoice file is made mandatory in the Delivered method in ExternallyDeliverableInvoiceService. \n- DebtorEmailAddress and DebtorPhoneNumber added to FactoringInvoiceDetails.\n- ExternalImportReference added to DebtCollectionInvoiceMatch and DebtCollectionInvoice.\n- SubledgerNumberSeriesId added to Customer, Supplier and Employee. Makes it possible to select which number series the party should belong to.\n- FinancialYearEndMonth added to Client.\n- Added new data object Accrual that is used by OutgoingInvoiceLine to enable accrual of invoices.\n- Added new service FinancingService. Used by invoice financing providers to get and update financing status.\n- Added RetrieveClientDataFromSessionId to ClientAuthService. This is currently used by invoice financing providers to onboard integrations from Go using a temporary session id.\n- HourlyCost and HourlyRate added to TimeTrackingEntry\n- SalesAccount, VatExemptSalesAccount , VatCode and VatRate added to OutgoingInvoiceLine\n- VatCode added to Product\n- Added ContractNo to ImportLine, JournalEntryVoucher and IncomingInvoiceVoucher\n- Added PurchaseOrderNo to JournalEntryVoucher and IncomingInvoiceVoucher\n- Bug fix TimeTrackingEntryService: If the provided project belongs to a different customer than the provided customer in the TimeTrackingEntry, the TimeTrackingEntry was prevously stored with customer connected to the project entity. This is now changed to throw an Exception.\n\t\n2.7.1:\n- New Service: FactoringServcie, which is custom-made for factoring integrations.\n- BankTransfer: Added InvoiceId and SubLedgerEntryId that can be used to make the remittances from bank transfers match with subledger entries.\n \n2.7.0:\nEmployee hourly rate and cost:\nEmployee hourly rate and cost was reworked in PowerOffice Go that leads to some breaking changes. The employee hourly rates and cost is now replaced with a collection with a valid from date instead of single properties:\n- New class EmployeeTimeHourlyRates added, and an IEnumerable of EmployeeTimeHourlyRates is added to the Employee object. To alter the hourly rate and/or hourly cost of an employee either edit the current EmployeeHourlyRates in the collection, or add a new EmployeeHourlyRates with a new ValidFromDate these rates should be valid from, and run a Save (POST) of the Employee object.\n- HourlyRate and HourlyCost on Employee is now marked as Obsolete. GET requests on employee will return the current (today's) HourlyRate and HourlyCost on the Employee, while Save (POST) requests will not alter the rates.\n\nBetter handling of duplicate Save/POST requests:\n\nTo prevent the creation of duplicate vouchers or payments when saving, we've added the property ExternalImportReference to a few API data objects. When saving a new API object with ExternalImportReference provided, PowerOffice Go checks if there is already an object of the same type and equal reference already saved. If the object already exists, PowerOffice Go throws an exception and does not save the provided API object. API objects that now have ExternalImportReference are:\n- BankTransfer\n- JournalEntryVoucher\n- OutgoingInvoice\n- All objects extending Voucher (BankJournalVoucher, CashJournalVoucher, ExpenseVoucher, IncomingInvoiceVoucher, ManualJournalVoucher, OutgoingInvoiceVoucher, PayrollJournalVoucher and YearEndJournalVoucher)\nIt is also possible to query vouchers or accounting entries by ExternalImportReference in the reports:\n- InvoiceJournal\n- AccountTransaction\n- CustomerLedger\n- SupplierLedger\n\nOther changes:\n- New Service: VoucherDocumentationService that can be used to retrieve voucher documentation and add documentation to an imported voucher.\n- OutgoingInvoice and OutgoingInvoiceListItem: Added ContactGroupId and ContactGroup.\n- Project: Added FixedPrice and BillableRate.\n- DebtCollectionCase: Added InvoiceLastChanged.\n- DebtCollectionInvoice: Added LastReminderEmailAddress and InvoiceEmailAddress.\n- SalaryLine: Added CarRegistrationNo.\n- Customer: Added ReminderEmailAddress and TransferToDebtCollectionAgency.\n- ContactGroupService: Added methods GetCustomers, GetEmployees and GetSuppliers that can be used to query all Customers/Employees/Suppliers that are added to a specific ContactGroup.\n- VatCode: Added ValidFrom and ValidTo.\n- Voucher: Added HasImportedDocumentation added to base class Voucher. This property is set to true if the voucher is imported and has documentation added by the new VoucherDocumentationService.\n\n2.6.2:\nProject's budget was reworked in PowerOffice Go, leading to some breaking changes on Project in the API:\n-BudgetedRevenueBillableExpenses no longer exist on the server side. Property in the API is marked as obsolete and will no longer return anything other then null. Setting the property does nothing. Budgeted revenue billable expenses is now included in the new property BudgetedTotalRevenue.\n-New property: BudgetedTotalRevenue that holds the total budgeted revenue for a project. This includes revenue from billable hours and other expenses that is being invoiced to the customer.\n-New property: BudgetedCostOfGoods that holds the budgeted cost of goods from purchases.\n\nOther changes:\n\n-PartyCustomerCode and PartySupplierCode added to ContactPerson \n-CustomMatchingReference added to Voucher lines of type BankJournalVoucherLine, CashJournalVoucherLine, ManualJournalVoucherLine, PayrollJournalVoucherLine and YearEndJournalVoucherLine\n-CustomMatchingReference added to Vouchers of type IncomingInvoiceVoucher, OutgoingInvoiceVoucher and ExpenseVoucher\n\n\n2.6.1:\n-Added ImportedVoucherNo to Voucher.\n\n2.6.0:\n- Authorization, Go: Streamlined the API by adding a standardized CreateAsync factory method - marked the members that should be avoided in the future as obsolete\n- Authorization: Makes it easier to write thread-safe code by allowing for individual headers for individual Authorization instances\n-EndPointMode that was previously only a global variable, can now be overridden on the Go object - enabling the possibility of one solution communicating with both our production and our demo environment.\n-Changed Authorization endpoint from go.poweroffice.net to api.poweroffice.net.\n-Fixed potential performance issue with HttpClient being instanciated too often.\n-New Service: VoucherService enabling the creation of different voucher types and posting them directly into PowerOffice Go without going through the ImportService.\n-OutgoingInvoice: Added Balance\n-OutgoingInvoiceListItem: Added Balance\n\n2.5.0:\n- Customer: Added PaymentTerms, UseFactoring, DepartmentCode, OurReferenceEmployeeCode, DeliveryTerm and other settings related to reminders\n- Employee: Added HourlyCost\n- ProjectTeamMember: Added BudgetHours\n- Client: Added VatPeriod\n- OutgoingInvoiceListItem: Added ContractNo, CustomerReference, DeliveryAddressId, DeliveryTerm and CurrencyExchangeRate\n- OutgoingInvoice: Added DeliveryTerm and CurrencyExchangeRate\n- Product: Added AvailableStock\n- DebtCollectionInvoice: Added LastReminderSentDate, LastReminderDueDate and LastReminderVoucherType\n- InvoiceJournalLine: Added Balance\n\n2.4.1:\nDebtCollectionMergeCasesRequest: Added ExternalCaseUrl\n\n2.4.0:\n- Client: Added SalesAccountCode, VatExemptSalesAccountCode and IsVatRegistered\n- TimeTrackingEntry: Added IsInvoiced and IsTransferedToPayroll\n- Project: Added many more properties\n- AccountTransaction: Added SubLedgerEntryId\n- Fixed a bug on ImportService.SaveAsync method\n\n2.3.0:\n-NewService: InvoiceAttachment that can be used to get, add and delete attachments from OutgoingInvoices and RecurringInvoices\n-TimeTrackingEntry: Added ExcludedFromPayroll and OutgoingInvoiceLineId\n-New service: Go.PartyBankAccount to query party bank accounts without iterating customer, supplier or employee objects\n-New service: Go.PartyContactPerson to query party contact persons without iterating customer or supplier objects\n-ProjectActivity: Added HourlyRate\n-OutgoingInvoiceLine: Added UnitCost\n-DebtCollectionInvoiceMatch added IsWriteOff\n-Customer/Employee/Supplier: Added LastChanged to Addresses. LastChanged on the entity will include when one of it's addresses is changed last.\n-Fixed issue with DateTime that had specified DateTimeKind.Local causing offset to have effect on the Date.\n-Fixed an issue with DebtCollection.GetInvoicePdf routing generation\n-Fixed an issue with refresh authorization and ITokenStore.Save being called to often.\n\t\n2.2.1\n-DebtCollectionInvoiceMatch added ImportedVoucherNo, CreatedFromImportId and VoucherId\n\t\n2.2.0\n-Public release with support for temporary authorization urls\n-JournalEntryVoucherLine added InvoiceNo\n-All API services now have server side access controll implemented for each service and type of request (Get, Post, Put and Delete). This means that not every integration have access to all API services and methods. Calling an API service method that the current integration does not have permission to use will result in an ApiException with the message \"Unauthorized access\".\n\n      2.1.0:\n      -New Service: ExternallyDeliverableInvoice used by invoice delivery services to deliver invoices instead of sending them from PowerOffice Go\n      -SalaryLine: Added VatCode\n\n      2.0.4:\n      -First official version of support for multiple .NET Framework targets: .NET Standard 2.0, .NET 4.6.1 and .NET 4.5.2\n      -New Service: JournalEntryVoucher to create vouchers that will appear in Journal Entry.\n      -Service for debt collection agencies (DebtCollectionService) finalized.\n      \n      2.0.0-beta1:\n      - New Service: DebtCollection to be used by debt collection agencies to manage debt collection cases\n      - Customer: Added ExternalCode\n      - Supplier: Added ExternalCode and StandardGeneralLedgerAccountCode\n      - Employee: Added ExternalCode\n      - Client: Added LockDate\n      - ClientBankAccount: Added IsCurrentAccount\n      - Project: Added ContractNo\n      - Removed Dependency on DotNetOAuth\n      - Support for multiple .NET Framework targets: .NET Standard 2.0, .NET 4.6.1 and .NET 4.5.2\n      - Fixed possible deadlock in http requests\n      - Added async methods in DataObject services base classes\n\n      1.7.3:\n      - AccountTransaction: Added ImportedVoucherNo\n\n      1.7.2:\n      - ImportFile: Added ImportFileType.NetsOcrFile adding the possibility to upload Nets OCR files to PowerOffice.\n\n      1.7.1:\n      - New Service: BrandingTheme to query branding themes on the client.\n      - Customer: Added InvoiceBrandingThemeCode\n      - Project: Added BrandingThemeCode\n      - OutgoingInvoice (and OutgoingInvoiceListItem): Added BrandingThemeCode\n      - SalesOrder: Added BrandingThemeCode\n\n      1.6.3:\n      -OutgoingInvoice: Now possible to set status to either Draft or Approved through the API.\n      -Customer: Added DateOfBirth and SocialSecurityCode. SocialSecurityCode is hidden when querying customers through Get.\n      -Supplier: Added DateOfBirth and SocialSecurityCode. SocialSecurityCode is hidden when querying suppliers through Get.\n\n      1.6.2:\n      - OutgoingInvoiceLine added flag IsDeleted that can be used to delete lines from an Invoice/RecurringInvoice calling the Save method.\n\n      1.6.1:\n      API Support for Time:\n      TimeTrackingServices is buildt up by 3 services:\n      - HourType: Service to query and manipulating hour types on the client.\n      - Activity: Service to query and manipulating activities on the client.\n      - TimeTrackingEntry: Service to query and manipulating time tracking entries on the client.\n\n      Other changes:\n      - New Service: GeneralLedgerAccount service to query and manipulating general ledger accounts on the client.\n      - New Service: SubledgerNumberSeries for querying subledger number series on the client.\n      - New Service: Location for querying and manipulating locations on the client.\n      - New Service: RecurringInvoice for querying and manipulating recurring invoices (repeated invoices) on the client.\n      - Support for adding, removing and editing bank accounts on parties (Customer/Supplier/Employee).\n      - Added CreatedFromImportJournalId on GeneraLedgerAccount, Department, Customer, Supplier, Employee, Product, ProductGroup, Project, AccountTransaction, InvoiceJournalLine, CustomerLedgerEntry, SupplierLedgerEntry to indicate witch import has created this entity.\n      - Added IsCreatedFromEhf on SupplierLedgerEntry and AccountTransaction.\n      - BlobService: New method (VoucherEhf) to get EHF documents for vouchers sent to PowerOffice Go as streams.\n      - Added IsOnHold, ExternalCaseNumber and LastChanged to InvoiceJournalLine\n      - InvoiceJournal: New method (SetExternalCaseNumber)\n      - ContactPerson: Added IsActive\n      - BankTransfer: Added ProjectCode and DepartmentCode\n      - Customer: Added InvoiceEmailAddress and HourlyRate\n      - ClientBankAccount: Added IsClientTrustAccount\n      - AccountTransaction: Added BankTransferId\n      - Project: Added LocationCode, AllowAllActivities and AllowAllEmployees\n      - Employee: Added LocationCode and HourlyRate\n      - ProjectService: Added sub-service TeamMember to add, manipulate and removing team members from projects.\n      - ProjectService: Added sub-service Activity to add, manipulate and removing project activities from projects.\n      - PayItem: Added ProcessingType\n      - SalaryLine: Added IsDeletedByUser flag. Lines that have been manually deleted in PowerOffice Go will have this flag set to true.\n      - OutgoingInvoice (and OutgoingInvoiceListItem): Added PaymentTerms\n\n      1.5.1:\n      - Added IsPerson, FirstName and LastName to Customer and Supplier\n      - Added DeliveryDate and PurchaseOrderNo to ImportLine and SalesOrder\n      - Added CustomMatchingReference on ImportLine. Can be used to match subledger (Customer, Supplier and Employee) entries when importing.\n      - Added DocumentNo on AccountTransaction.\n      - New Service: ClientBankAccountService to query, update and delete bank accounts on the client.\n      - New Service: BankTransferService to query, create and delete bank transfers on the client.\n      - Added ReminderSentDate and ReminderDueDate to InvoiceJournalLine\n\n      1.4.12:\n      - Added Id to InvoiceJournalSalesLine\n      - Added SortOrder to SalesOrderLine\n      - Added VoucherDueDate, VoucherReference, VoucherCID, VoucherCreditNoteReference and VoucherId to AccountTransaction\n      - Added CurrencyRate to InvoiceJournalLine\n\n      1.4.11:\n      - Fixed issue with using enum values in Where expressions\n\n      1.4.1:\n      - New Service: PayrollService. This service can be used to query pay items on Go clients, and create salary lines that will be added to next payroll.\n      - New Service: OutgoingInvoiceService. This service can be used to create OutgoingInvoices that will get draft status on Go. This is a reimplementation of SalesOrder import. The service can also be used to query invoices and check it's status, and edit/delete invoices that have draft status.\n\n      1.3.12:\n      - Automatic handling of API request per second limit\n      - BasicTokenStore is now thread safe\n\n      1.3.11:\n      - Added method to get AccountTransaction within a date without specifying account code\n      - Added Id and AccountCode properties to AccountTransaction\n\n      1.3.10:\n      - Fixed missing time zone offset in DateTimeOffset OData filters\n\n      1.3.9:\n      - Added ContactGroupService for querying, creating and modifying contact groups\n      - Customer/Employee/Supplier contact groups can now be queried and edited from Customer/Supplier/Employee service\n      - Fixed error with currency code not working on SalesOrder\n\n      1.3.8:\n      - Added ContactPersonId on SalesOrder import.\n\n      1.3.7:\n      - Fixed error on VatCode.Get method.\n\n      1.3.6:\n      - Added support for DateTimeOffset in OData-queries\n\n      1.3.4:\n      - Added ImportedOrderNo to InvoiceJournal and CustomerLedger.\n      - CustomerLedger/SupplierLedger now displays LastChanged and CreatedDate.\n      - Default contact person is now set on orders imported.\n\n      1.3.3:\n      - Open items for Customers/Suppliers now also displays CID on each entry\n\n      1.3.2:\n      - Open items for Customers/Suppliers with matching abilities\n      - It is now possible to set customers \"excempt vat\"\n\n      1.2.1:\n      - New report: InvoiceJournal\n\n      1.1.3:\n      - Product: Now possible to update ProductsOnHand through API.\n\n      1.1.2:\n      - Added last changed date/created date to many entities. Added InvoiceDeliveryType to Customers.\n\n      1.1.1.2:\n      - Fixed an issue with some cultures getting BadRequest.\n\n      1.1.1:\n      - Import: SalesOrderLines can now override product's price by setting SalesOrderLineUnitPrice.\n\n      1.1.0:\n      - Support for Orders\n      - Support for Products\n\n      1.0.0:\n      - First official release",
  "repository": "",
  "requireLicenseAcceptance": false,
  "title": "GoApi",
  "verbatimVersion": "2.8.0",
  "version": "2.8.0",
  "dependencyGroups": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2019.10.28.11.41.02/powerofficegosdk.2.8.0.json#dependencygroup/.netframework4.5.1",
      "@type": "PackageDependencyGroup",
      "dependencies": [
        {
          "@id": "https://api.nuget.org/v3/catalog0/data/2019.10.28.11.41.02/powerofficegosdk.2.8.0.json#dependencygroup/.netframework4.5.1/microsoft.csharp",
          "@type": "PackageDependency",
          "id": "Microsoft.CSharp",
          "range": "[4.5.0, )"
        },
        {
          "@id": "https://api.nuget.org/v3/catalog0/data/2019.10.28.11.41.02/powerofficegosdk.2.8.0.json#dependencygroup/.netframework4.5.1/newtonsoft.json",
          "@type": "PackageDependency",
          "id": "Newtonsoft.Json",
          "range": "[12.0.2, )"
        },
        {
          "@id": "https://api.nuget.org/v3/catalog0/data/2019.10.28.11.41.02/powerofficegosdk.2.8.0.json#dependencygroup/.netframework4.5.1/system.componentmodel.annotations",
          "@type": "PackageDependency",
          "id": "System.ComponentModel.Annotations",
          "range": "[4.5.0, )"
        }
      ],
      "targetFramework": ".NETFramework4.5.1"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2019.10.28.11.41.02/powerofficegosdk.2.8.0.json#dependencygroup/.netframework4.5.2",
      "@type": "PackageDependencyGroup",
      "dependencies": [
        {
          "@id": "https://api.nuget.org/v3/catalog0/data/2019.10.28.11.41.02/powerofficegosdk.2.8.0.json#dependencygroup/.netframework4.5.2/microsoft.csharp",
          "@type": "PackageDependency",
          "id": "Microsoft.CSharp",
          "range": "[4.5.0, )"
        },
        {
          "@id": "https://api.nuget.org/v3/catalog0/data/2019.10.28.11.41.02/powerofficegosdk.2.8.0.json#dependencygroup/.netframework4.5.2/newtonsoft.json",
          "@type": "PackageDependency",
          "id": "Newtonsoft.Json",
          "range": "[12.0.2, )"
        },
        {
          "@id": "https://api.nuget.org/v3/catalog0/data/2019.10.28.11.41.02/powerofficegosdk.2.8.0.json#dependencygroup/.netframework4.5.2/system.componentmodel.annotations",
          "@type": "PackageDependency",
          "id": "System.ComponentModel.Annotations",
          "range": "[4.5.0, )"
        }
      ],
      "targetFramework": ".NETFramework4.5.2"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2019.10.28.11.41.02/powerofficegosdk.2.8.0.json#dependencygroup/.netframework4.6",
      "@type": "PackageDependencyGroup",
      "dependencies": [
        {
          "@id": "https://api.nuget.org/v3/catalog0/data/2019.10.28.11.41.02/powerofficegosdk.2.8.0.json#dependencygroup/.netframework4.6/microsoft.csharp",
          "@type": "PackageDependency",
          "id": "Microsoft.CSharp",
          "range": "[4.5.0, )"
        },
        {
          "@id": "https://api.nuget.org/v3/catalog0/data/2019.10.28.11.41.02/powerofficegosdk.2.8.0.json#dependencygroup/.netframework4.6/newtonsoft.json",
          "@type": "PackageDependency",
          "id": "Newtonsoft.Json",
          "range": "[12.0.2, )"
        },
        {
          "@id": "https://api.nuget.org/v3/catalog0/data/2019.10.28.11.41.02/powerofficegosdk.2.8.0.json#dependencygroup/.netframework4.6/system.componentmodel.annotations",
          "@type": "PackageDependency",
          "id": "System.ComponentModel.Annotations",
          "range": "[4.5.0, )"
        }
      ],
      "targetFramework": ".NETFramework4.6"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2019.10.28.11.41.02/powerofficegosdk.2.8.0.json#dependencygroup/.netframework4.6.1",
      "@type": "PackageDependencyGroup",
      "dependencies": [
        {
          "@id": "https://api.nuget.org/v3/catalog0/data/2019.10.28.11.41.02/powerofficegosdk.2.8.0.json#dependencygroup/.netframework4.6.1/microsoft.csharp",
          "@type": "PackageDependency",
          "id": "Microsoft.CSharp",
          "range": "[4.5.0, )"
        },
        {
          "@id": "https://api.nuget.org/v3/catalog0/data/2019.10.28.11.41.02/powerofficegosdk.2.8.0.json#dependencygroup/.netframework4.6.1/newtonsoft.json",
          "@type": "PackageDependency",
          "id": "Newtonsoft.Json",
          "range": "[12.0.2, )"
        },
        {
          "@id": "https://api.nuget.org/v3/catalog0/data/2019.10.28.11.41.02/powerofficegosdk.2.8.0.json#dependencygroup/.netframework4.6.1/system.componentmodel.annotations",
          "@type": "PackageDependency",
          "id": "System.ComponentModel.Annotations",
          "range": "[4.5.0, )"
        }
      ],
      "targetFramework": ".NETFramework4.6.1"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2019.10.28.11.41.02/powerofficegosdk.2.8.0.json#dependencygroup/.netframework4.6.2",
      "@type": "PackageDependencyGroup",
      "dependencies": [
        {
          "@id": "https://api.nuget.org/v3/catalog0/data/2019.10.28.11.41.02/powerofficegosdk.2.8.0.json#dependencygroup/.netframework4.6.2/microsoft.csharp",
          "@type": "PackageDependency",
          "id": "Microsoft.CSharp",
          "range": "[4.5.0, )"
        },
        {
          "@id": "https://api.nuget.org/v3/catalog0/data/2019.10.28.11.41.02/powerofficegosdk.2.8.0.json#dependencygroup/.netframework4.6.2/newtonsoft.json",
          "@type": "PackageDependency",
          "id": "Newtonsoft.Json",
          "range": "[12.0.2, )"
        },
        {
          "@id": "https://api.nuget.org/v3/catalog0/data/2019.10.28.11.41.02/powerofficegosdk.2.8.0.json#dependencygroup/.netframework4.6.2/system.componentmodel.annotations",
          "@type": "PackageDependency",
          "id": "System.ComponentModel.Annotations",
          "range": "[4.5.0, )"
        }
      ],
      "targetFramework": ".NETFramework4.6.2"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2019.10.28.11.41.02/powerofficegosdk.2.8.0.json#dependencygroup/.netstandard2.0",
      "@type": "PackageDependencyGroup",
      "dependencies": [
        {
          "@id": "https://api.nuget.org/v3/catalog0/data/2019.10.28.11.41.02/powerofficegosdk.2.8.0.json#dependencygroup/.netstandard2.0/microsoft.csharp",
          "@type": "PackageDependency",
          "id": "Microsoft.CSharp",
          "range": "[4.5.0, )"
        },
        {
          "@id": "https://api.nuget.org/v3/catalog0/data/2019.10.28.11.41.02/powerofficegosdk.2.8.0.json#dependencygroup/.netstandard2.0/newtonsoft.json",
          "@type": "PackageDependency",
          "id": "Newtonsoft.Json",
          "range": "[12.0.2, )"
        },
        {
          "@id": "https://api.nuget.org/v3/catalog0/data/2019.10.28.11.41.02/powerofficegosdk.2.8.0.json#dependencygroup/.netstandard2.0/system.componentmodel.annotations",
          "@type": "PackageDependency",
          "id": "System.ComponentModel.Annotations",
          "range": "[4.5.0, )"
        }
      ],
      "targetFramework": ".NETStandard2.0"
    }
  ],
  "frameworkAssemblyGroup": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2019.10.28.11.41.02/powerofficegosdk.2.8.0.json#frameworkassemblygroup/.netframework4.5.1",
      "assembly": [
        "System.Net.Http",
        "System.Web"
      ],
      "targetFramework": ".NETFramework4.5.1"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2019.10.28.11.41.02/powerofficegosdk.2.8.0.json#frameworkassemblygroup/.netframework4.5.2",
      "assembly": [
        "System.Net.Http",
        "System.Web"
      ],
      "targetFramework": ".NETFramework4.5.2"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2019.10.28.11.41.02/powerofficegosdk.2.8.0.json#frameworkassemblygroup/.netframework4.6",
      "assembly": [
        "System.Net.Http",
        "System.Web"
      ],
      "targetFramework": ".NETFramework4.6"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2019.10.28.11.41.02/powerofficegosdk.2.8.0.json#frameworkassemblygroup/.netframework4.6.1",
      "assembly": [
        "System.Net.Http",
        "System.Web"
      ],
      "targetFramework": ".NETFramework4.6.1"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2019.10.28.11.41.02/powerofficegosdk.2.8.0.json#frameworkassemblygroup/.netframework4.6.2",
      "assembly": [
        "System.Net.Http",
        "System.Web"
      ],
      "targetFramework": ".NETFramework4.6.2"
    }
  ],
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2019.10.28.11.41.02/powerofficegosdk.2.8.0.json#PowerOfficeGoSdk.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 6064,
      "fullName": "PowerOfficeGoSdk.nuspec",
      "length": 20567,
      "name": "PowerOfficeGoSdk.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2019.10.28.11.41.02/powerofficegosdk.2.8.0.json#lib/net451/GoApi.dll",
      "@type": "PackageEntry",
      "compressedLength": 135875,
      "fullName": "lib/net451/GoApi.dll",
      "length": 355328,
      "name": "GoApi.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2019.10.28.11.41.02/powerofficegosdk.2.8.0.json#lib/net452/GoApi.dll",
      "@type": "PackageEntry",
      "compressedLength": 135878,
      "fullName": "lib/net452/GoApi.dll",
      "length": 355328,
      "name": "GoApi.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2019.10.28.11.41.02/powerofficegosdk.2.8.0.json#lib/net46/GoApi.dll",
      "@type": "PackageEntry",
      "compressedLength": 135909,
      "fullName": "lib/net46/GoApi.dll",
      "length": 355328,
      "name": "GoApi.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2019.10.28.11.41.02/powerofficegosdk.2.8.0.json#lib/net461/GoApi.dll",
      "@type": "PackageEntry",
      "compressedLength": 135913,
      "fullName": "lib/net461/GoApi.dll",
      "length": 355328,
      "name": "GoApi.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2019.10.28.11.41.02/powerofficegosdk.2.8.0.json#lib/net462/GoApi.dll",
      "@type": "PackageEntry",
      "compressedLength": 135914,
      "fullName": "lib/net462/GoApi.dll",
      "length": 355328,
      "name": "GoApi.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2019.10.28.11.41.02/powerofficegosdk.2.8.0.json#lib/netstandard2.0/GoApi.dll",
      "@type": "PackageEntry",
      "compressedLength": 135795,
      "fullName": "lib/netstandard2.0/GoApi.dll",
      "length": 355328,
      "name": "GoApi.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2019.10.28.11.41.02/powerofficegosdk.2.8.0.json#License.md",
      "@type": "PackageEntry",
      "compressedLength": 109,
      "fullName": "License.md",
      "length": 145,
      "name": "License.md"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2019.10.28.11.41.02/powerofficegosdk.2.8.0.json#README.md",
      "@type": "PackageEntry",
      "compressedLength": 757,
      "fullName": "README.md",
      "length": 1751,
      "name": "README.md"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2019.10.28.11.41.02/powerofficegosdk.2.8.0.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9484,
      "fullName": ".signature.p7s",
      "length": 9484,
      "name": ".signature.p7s"
    }
  ],
  "tags": [
    "poweroffice"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}