{
  "@id": "https://api.nuget.org/v3/catalog0/data/2018.12.10.21.09.38/serialkeymaker.4.0.0.2.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "Petrax Software,Inc",
  "catalog:commitId": "902de483-ac0b-48ef-a211-3356d491c069",
  "catalog:commitTimeStamp": "2018-12-10T21:09:38.0075147Z",
  "copyright": "Petrax Software, Inc",
  "created": "2012-07-26T16:17:40.38Z",
  "description": "Serial Key Maker is made by PETRAX Software, Inc which is our small, hard-working independent software vendor. We love writing software that is simple to use, and (more importantly) software that works! \n\nWe made this licensing application to be inexpensive and easy to implement. So many solutions on the market are exhorbantly expensive for start up companies, and have very complicated implementation steps. \n\nWe are developers and we feel your pain. \n\nWe trust that you will find this solution affordable and very simple to implement. We will answer all support emails as fast as humanly possible.",
  "iconUrl": "http://www.serialkeymaker.com/favicon.ico",
  "id": "SerialKeyMaker",
  "isPrerelease": false,
  "language": "en-US",
  "lastEdited": "2018-12-10T21:09:35.217Z",
  "listed": true,
  "packageHash": "LdcpctEGHKMbo1XhLufk4+kt5knyqOXAiM3fk/RbXoJJ6ECTsrobvv9itSDnLC24W9Gbs3YRVsAf7hQv3PhH6Q==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 53256,
  "projectUrl": "http://www.serialkeymaker.com/",
  "published": "2012-07-26T16:17:43.02Z",
  "releaseNotes": "July 2012 - v4.0.0.2 Build 2418\nDo you have the Latest Version?\nMinor Release Update\nAdded suppoprt for NuGet.org in VS 2010 integration!\nMarch 2012 - v4.0.0.2 Build 2100\nDo you have the Latest Version?\nMinor Release Update\nFixed bug where API caused a runtime when date was turned back - added a usefull error message.\nSeptember 2011 - v4.0.0.2\nDo you have the Latest Version?\nMajor Release Update\nAdded the ability to generate an API key from the user interface.\nAdded sample project for web service generation.\nVarious user interface bugs fixed.\nFixed link to check for updates.\nJuly 2011 - v4.0.0.1 Build 9812\nDo you have the Latest Version?\nMinor Release Update\nAdded web service project to the VS 2010 samples.\nJanuary 2011 - v4.0.0.1 Build 9800\nDo you have the Latest Version?\nMinor Release Update\nFixed sample files to be downloaded to correct location.\nAdded friendly error message when sample file does not exist.\nDecember 2010 - v4.0.0.1 Build 9701\nDo you have the Latest Version?\nMinor Release Update\nFixed strongly named API DLL's (PG_SerialKeyMaker_API.dll and PG_SerialKeyMaker_API_Extension.dll are strongly named again.)\nAdded the ability to specify an end date for demo license keys. Before you could only specify how many days the key was active for. Now you can specify a hard date to end the demo period.\nExtended the Demo period limit from 360 days to 999 days in the PRO version. Standard version is still limited to 360 days\nSeptember 2010 - v4.0.0.1 Build 9621\nDo you have the Latest Version?\nMinor Release Update\nAdded the ability for the wrapper generation process to specify and use settings at the machine level. This is optional. By default, settings are stored at the Current Logged in user level.\nSeptember 2010 - v4.0.0.1 Build 9566\nDo you have the Latest Version?\nMinor Release Update\nAdded tool tip to generated key to display key settings in one glance.\nAll fields are now \"sticky\" - UI remembers all previously used settings so they do not have to be re-entered.\nJune 2010 - v4.0.0.1 Build 9387\nDo you have the Latest Version?\nMinor Release Update\nFixed bug where example \"Show me the code\" failed to display correctly.\nFixed wrapper example for C# - license save routine now works.\nRe-Added tool tips to Cmachine Key tab - they somehow got removed in a previous release.\nAdded ability to always delete unwrapped file after use when using the wrapper functionality.\nAug 2009 - v4.0.0.1\nDo you have the Latest Version?\nMajor Release Update\nAdded the ability to programatically generate license keys based on selected private key.\nAdded demo web service to illustrate how to use extension (\"PG_SerialKeyMaker_API_Extension.dll\") API methods.\nAdded \"Generate Code\" feature that generates code based on the private key selected.\nAdded ability to always delete unwrapped file after use when using the wrapper functionality.\nFixed bug in Wrapper functionality that did not show help text on advanced functions.\nFixed bug in user interface that caused incorrect display of number of demo days left.\nFeb 2009 - v3.0.1.3\nDo you have the Latest Version?\nMinor Release Update\nBug Fix: Allow Wrapper functionality in DEMO mode\nNovember 2008 - v3.0.1.2\nDo you have the Latest Version?\nMinor Release Update\nAdded \"MakeDemoKey\" method to the API. Call the method to have the API create a demo kery for you.\nCleaned up some unused references in the API\nFixed bug when creating multiple keys in DEMO mode. You can now create up to 10 keys in DEMO mode.\nNovember 2008\nWebsite\nAdded this update history page to the website\nSeptember 2008 - v3.0.1.1\nDo you have the Latest Version?\nMajor Release Update\nAdded Wrapper functionality\nCan now wrap documents or applications with Serial Key Logic, and have Serial Key Maker manage the license key validation.\nAvailable to Professional Version Only\nAdded examples of how to create a lincense key entry form to the sample applications\nVarious small bug fixes\nWeb Site\nRepriced the software and modified website and payment system to reflect new prices\nEnhanced FAQ with multiple user questions\nCreated \"Testimonial Section\"\nAugust 2008 - v2.1.0.2\nDo you have the Latest Version?\nBug Fixes\nFreeform text now works for some special characters (apostrophe doesn't convert back to unprintable character)\nJuly 2008 - v2.1.0.1\nDo you have the Latest Version?\nMajor Release Update\nAdded ability to lock application to a specific machine (cannot generate multiple keys when locing to a specific machine)\nAdded ability to lock individual features\nAdded ability to store free form text with the license key (when used license key is no longer in 25 character format)\nmachine locking, feature locking and/or freeform text are embedded into the license key\nModified the API to use and display the machine locking, feature locking and freeform text.\nModified the \"Validate Key\" form to more robustly display the details of a specified license key\nModified the sample code to include examples of how to use the new feature\nRestructured the pricing model to allow the new features only in the Professional Version\nAgain, implement Serial Key Maker to use Serial Key Maker for feature locking\nLite, Stand and Professional Versions are now available\nWeb Site\nNew look and feel to web site\nNew pricing options available\nNew feature comparison page\nJuly 2008 - v2.0.1.2\nBug Fix\nFix Setup utility to correctly identify previous installations\nJuly 2008 - v2.0.1.1\nBug Fix\nFixed date bug in demo version. Demo license keys will be valid for the number of days specified, and not a fixed 30 days.\nAdded encryption utility tool for help when coding.\nAdded multiple unit tests to validate encryption routines more thouroughly.\nJune 2008 - v2.0.0.5\nBug Fixes\nYet another date bug fixed. Setting the computer date forward no longer causes false positives in match logic\nUnit test modified to catch wierd/uncommon situation that caused this bug.\nOther\nCreated video demonstration of how to use and implement Serial Key Maker.\nAdded it to Website, blog and YouTube.\nMay 2008\nNo new version, but added a blog to accompany the website\nApril 2008 - v2.0.0.3\nBug Fixes\nExit from file menu works again\nAdded notes to sample application to indicate that the user should verify that the project's reference to the API is valid\nExport to file now \"remembers\" last file location\nAdded \"New Line\" as one of the export options\nApril 2008 - v2.0.0.2\nBug Fixes\nFixed tab-order bugs in the UI. Tabbing between fields should flow better now.\nSetup application now correctly installs demo folder in the install application folder\nFixed broken links on the web site\nAdded check for updates feature. Created simple web pages to notify the user, from the UI whether they have the latest version or not.\nUsers can purchase directly from the application now\nApril 2008 - v2.0.0.1\nMajor Release (now officially named Serial Key Maker)\nFeatures\nAdded User Interface to generate license keys.\nRemoved the ability to generate keys from the command line\nAdded the ability to export license keys to the clipboard or file in a number of formats\nUpgraded to 2.0 framework\nProvided public methods to encrypt and decrypt private keys\nCompletely overhauled encryption of license key. It is still in 25 character format, but now embeds start and end dates, whether it is a demo key or not.\nUI works in limited demo mode by default and can be unlocked via purchasing a full license key\nAPI returns information by about the validated key as a structured object to make more information available\nAdded multiple examples of how to use the API\nAdded a setup/install package\nImplemented Licensing Solution. Serial Key Maker uses Serial Key Maker for its licensing solution!\nOther\nReleased accompanying website that contains information about using Serial Key Maker\nSigned up with Fastspring to process sales of Serial Key Maker\nJuly 2007 - v1.0.0.4\nFeatures\nImplement Unit testing to all public methods\nOverloaded constructor to allow you to specify start date\nRe-worked date comparison functions to more robustly handle international dates\nChanged private key to allow up to 25 characters\nBug Fixes\nAllow license key to contain hyphens or spaces (or combination) between blocks of letters\nFixed the \"Strip Hyphens\" function to also stip spaces\nMay 2007 - v1.0.0.3\nBug Fixes\nRe-Fixed issue where date created is null. The check really does return a valid value when checking now\nMay 2007 - v1.0.0.2\nBug Fixes\nFixed issue where date created was null\nFixed issue related to date expires was before date created\nChanged format to be 25 characters (down from 36)\nChanged public safe data functions to be private\nApril 2007 - v1.0.0.1\nInitial Release of the License API DLL",
  "requireLicenseAcceptance": false,
  "summary": "Effortless Software Licensing",
  "title": "Serial Key Maker",
  "verbatimVersion": "4.0.0.2",
  "version": "4.0.0.2",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.12.10.21.09.38/serialkeymaker.4.0.0.2.json#SerialKeyMaker.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 5047,
      "fullName": "SerialKeyMaker.nuspec",
      "length": 20402,
      "name": "SerialKeyMaker.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.12.10.21.09.38/serialkeymaker.4.0.0.2.json#lib/PG_SerialKeyMaker_API.dll",
      "@type": "PackageEntry",
      "compressedLength": 22125,
      "fullName": "lib/PG_SerialKeyMaker_API.dll",
      "length": 44032,
      "name": "PG_SerialKeyMaker_API.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.12.10.21.09.38/serialkeymaker.4.0.0.2.json#lib/PG_SerialKeyMaker_API_Extension.dll",
      "@type": "PackageEntry",
      "compressedLength": 13339,
      "fullName": "lib/PG_SerialKeyMaker_API_Extension.dll",
      "length": 26112,
      "name": "PG_SerialKeyMaker_API_Extension.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.12.10.21.09.38/serialkeymaker.4.0.0.2.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9470,
      "fullName": ".signature.p7s",
      "length": 9470,
      "name": ".signature.p7s"
    }
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    }
  }
}