{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.29.00.01.28/_dragon-city-hack-working-2022-version-enf.8.4.13.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "SharpCrafters s.r.o.",
  "catalog:commitId": "0b7e53d6-c0ef-4a63-b072-677cee0e80da",
  "catalog:commitTimeStamp": "2022-01-29T00:01:28.2860119Z",
  "created": "2022-01-26T11:25:51.477Z",
  "description": "# _Dragon City Hack Working 2022 Version enf\n\n\nCLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; [http://9.bltadwin.ru/hack.php](http://9.bltadwin.ru/hack.php)\n\n\nDragon City Nobile MOD APK (Unlimited Money) for Android Collect amazing dragons build an amazing dragon city best simulation game. Dragon city mod apk a hack version of dragon city APK you can download from here. updating latest version of this cracked. Dragon City Hack Apk (Mod, cracked Unlimited Money) - Simulation and Fun Game for Android A game of choice on HackDL Mod Hack.\n\n## [CLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; http://9.bltadwin.ru/hack.php](http://9.bltadwin.ru/hack.php)\n\n · Dragon City Gems Hack is a free online tool to generate gems and gold. With this hack, you can generate unlimited and free gems and gold without human verification. There are many hacking tools that you can use but these tools can permanently ban your account. Using Dragon City hack is the fastest way to get free Gem in the game without spending real cash in the playstore. Every player knows that Gem are the most important currency in the game. How to get Gem for free with Dragon City hacking tool You can do this by complete quests or task but this is really time-consuming. This hack is called Dragon City Hack Online, If you're confused to see how it works please watch the video tutorial below, it includes the step-by-step tutorial as well as proof of getting 2, gems, , food and , downloadted Reading Time: 15 mins.\n\ndragon city hacks, dragon city hacks 2021, dragon city hack tool, dragon city hack generator, dragon city hack no verification 2021, dragon city hacks for gems, dragon city hack 2021 ios, dragon city hack tool 2021, dragon city hack pc, dragon city hack 2022, dragon city hack client, dragon city hack apk 2021, dragon city hack android, dragon city hack account, dragon city hack apple, dragon city hack apk 12.8.5, dragon city hack apk unlimited gems, dragon city hack apk mod(working )unlimited gems.v2.zip, dragon city hack app, a baixar dragon city hackeado, dragon city hack bluestacks, dragon city hack.best, dragon city hack.beast, dragon city hack breeding, dragon city hack by session id, dragon city hack buy, dragon city hack baixar, dragon city hack ban, dragon city hack cheat, dragon city hack cheats free gems gold and food, dragon-city-hack.com code, dragon city hack computer, dragon city hack cydia, dragon city hack club, dragon city hack.com, dragon city hack download unlimited gems gold and food, dragon city hack download ios, dragon city hack discord, dragon city hack download 2021, dragon city hack diamond, dragon city hack download unlimited gems, dragon city hack ditlep, dragon city hack extension, dragon city hack event, dragon city hack egg, dragon city hack es file explorer, dragon city hack easy, dragon city hack elitepvpers, dragon city hack en celular, dragon city empower hack, hacked dragon city, dragon city hack gemas ouro e comida infinitas, dragon city hack for ios, dragon city hack for pc, dragon city hack food, dragon city hack free download apk, dragon city hack free gems, dragon city hack free download, dragon city hack food gold gems, dragon city hack facebook, dragon city hack gems 99999, dragon city hack generator no human verification, dragon city hack gems and gold, dragon city hack game guardian, dragon city hack game, dragon city hack game download, dragon city hack gems 99999 download, hack for dragon city, dragon city hack ios, dragon city hack ios 2021, dragon city hack ipa, dragon city hack iosgods, dragon city hack ios no human verification, dragon city hack injector, dragon city hack info, dragon city hack unlimited gems, dragon city hack jailbreak, fabulous joker dragon city hack, dragon city juwelen hack, hack joias dragon city, hack do dragon city jogo, tải dragon city hack cho java, dragon city hack kim cương, cách hack dragon city kim cương, data hack dragon city by kunz yt.7z, data hack dragon city by kunz, dragon c",
  "id": "_Dragon-City-Hack-Working-2022-Version-enf",
  "isPrerelease": false,
  "language": "en-US",
  "lastEdited": "2022-01-28T23:45:44.47Z",
  "listed": false,
  "packageHash": "Z4Pu6eef/KJuGNzLqWUl22oDc7rLgLvCPh47bl/pJaWp4dfnDWJp9IqGUD5FdwpJr2CJeeakuT+pt1CSmnceyA==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 11620,
  "published": "1900-01-01T00:00:00Z",
  "requireLicenseAcceptance": false,
  "title": "_Dragon-City-Hack-Working-2022-Version-enf",
  "verbatimVersion": "8.4.13",
  "version": "8.4.13",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.29.00.01.28/_dragon-city-hack-working-2022-version-enf.8.4.13.json#cqxashyhuz.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1491,
      "fullName": "cqxashyhuz.nuspec",
      "length": 4462,
      "name": "cqxashyhuz.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.29.00.01.28/_dragon-city-hack-working-2022-version-enf.8.4.13.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9469,
      "fullName": ".signature.p7s",
      "length": 9469,
      "name": ".signature.p7s"
    }
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}