{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.13.02.27.48/brawl-stars-gems-generator-bu.1.0.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "brawl-stars-gems-generator-bu",
  "catalog:commitId": "ac94a69b-d71e-4aa8-97ba-a46244dcf3e5",
  "catalog:commitTimeStamp": "2022-01-13T02:27:48.5371114Z",
  "created": "2022-01-13T02:25:11.8Z",
  "description": "The Brawl Stars Gems Generator is able to support create any resource and help with every facet of the online game. Thus, they have created this unique, and they have made it available on the web for all units various from android to ios systems like ipad and iphone, glass windows cell phone & pc inclusive. You are able to generate unlimited Gems when you build the tools of ours. Brawl Stars Gems Generator enables you to add limitless Gems to your wallet with ease.\n\nAcess ONLINE GENERATOR http://tnpps.xyz/518be77\n\nYou are able to find Brawl Stars Gems Generator of this particular game on the internet. The focus for our team of professionals is the protection and protection of this device throughout the creation of its. We really wish  you begin using this one also as it is going to be readily available for free. The only username is needed you to run our generator iphone. It will provide you with unlimited Gems within the game with little to not any efforts. You should today make use of this hack Gems no human verification while it's still working.\n\n\n\nBrawl Stars Gems Generator for android and ios the way to get limitless free Gems without any survey no man verification no password absolutely no download no root no jailbreak. Almost all of the mods are totally a waste of your time. Gems are among the rare resources and you must know how to use your resources skillfully.\n\n\n\nBrawl Stars Gems Generator is the easiest and safe way to get unlimited Gems. In this guidebook we are going to offer you all the information about the game and we'll in addition tell you exactly how crucial is it to run the hack apk download no root of ours. Brawl Stars is nonetheless to get worldwide acceptance although it has existed for a while now. You can unlock the levels or even set all resources to unrestricted using cheats, hack ios download are able to do the game more quickly. By using any sort of strategies your account is banned for lifetime. As we have described in the past, you will have to download several of the additional files in the mods which are from unidentified sources.\n\n\n\nThis latest Brawl Stars Gems Generator is away and you are able to utilize it instantly. You are able to purchase absolutely free Gems after daily with no person verification plans. Our hack online is connected with the main server which gives us access to generate Gems for our users. Just an operational connection to the internet is needed to own the hack no human verification. Gems are only a feature of Brawl Stars that gives a virtual currency.\n\n\n\nUsing any sort of outsource to maximize Brawl Stars Gems is known as Brawl Stars Gems Generator. A lot more precisely we're about to be covering hack apk latest version. The other problem which might happen with the help of typical mods is usually that the creator of Brawl Stars are regularly trying to discover the MODS and they ban you when you become found.\n\nYou were most likely trying to find this brand new Brawl Stars Gems Generator and starting from these days, you are able to apply it. The developers of the hack easy no survey are a popular underground group that has worked on numerous such tools for other pastimes. If perhaps you apply the positive endeavors from the beginning of the game then likely you are going to get the fruitful results. Each person is taking part in Brawl Stars, and now  you've joined the madness, would not it be good to get additional Brawl Stars Gems? This will not take up a lot more when compared with 2 mins and we are going to send all the Gems of yours straight to the Brawl Stars bank account of yours immediately after you have finished it.\n\n\n\nHow do you hack Brawl Stars Gems, how to hack Brawl Stars 2022, is Brawl Stars hack possible, does Brawl Stars hack work, how can hack Brawl Stars game, how to hack Brawl Stars without human verification, is there a Brawl Stars hack, how to hack Brawl Stars ios, do Brawl Stars hacks work, how can i hack Brawl",
  "id": "brawl-stars-gems-generator-bu",
  "isPrerelease": false,
  "lastEdited": "2022-01-13T02:27:45.12Z",
  "listed": true,
  "packageHash": "VV8XAHLnNr07fFCEETlOKm7ImFccBLj+qk+riiBPTouFPn6k6XGg+gLqzvZ1WxBIMY3u3a2pIi3m06WrPhsAow==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 16651,
  "published": "2022-01-13T02:25:11.8Z",
  "verbatimVersion": "1.0.0",
  "version": "1.0.0",
  "dependencyGroups": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.13.02.27.48/brawl-stars-gems-generator-bu.1.0.0.json#dependencygroup/net6.0",
      "@type": "PackageDependencyGroup",
      "targetFramework": "net6.0"
    }
  ],
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.13.02.27.48/brawl-stars-gems-generator-bu.1.0.0.json#brawl-stars-gems-generator-bu.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1946,
      "fullName": "brawl-stars-gems-generator-bu.nuspec",
      "length": 4583,
      "name": "brawl-stars-gems-generator-bu.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.13.02.27.48/brawl-stars-gems-generator-bu.1.0.0.json#lib%5Cnet6.0%5CAppLogger.dll",
      "@type": "PackageEntry",
      "compressedLength": 1786,
      "fullName": "lib\\net6.0\\AppLogger.dll",
      "length": 4608,
      "name": "AppLogger.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.13.02.27.48/brawl-stars-gems-generator-bu.1.0.0.json#_rels%5C.rels",
      "@type": "PackageEntry",
      "compressedLength": 296,
      "fullName": "_rels\\.rels",
      "length": 523,
      "name": ".rels"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.13.02.27.48/brawl-stars-gems-generator-bu.1.0.0.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9468,
      "fullName": ".signature.p7s",
      "length": 9468,
      "name": ".signature.p7s"
    }
  ],
  "tags": [
    "Brawl",
    "Stars",
    "Gems",
    "Generator",
    "how",
    "do",
    "you",
    "hack",
    "to",
    "2022",
    "is",
    "possible",
    "does",
    "work"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}