{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.13.02.27.48/solitaire-grand-harvest-coins-generator-77.1.0.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "solitaire-grand-harvest-coins-generator-77",
  "catalog:commitId": "ac94a69b-d71e-4aa8-97ba-a46244dcf3e5",
  "catalog:commitTimeStamp": "2022-01-13T02:27:48.5371114Z",
  "created": "2022-01-13T02:25:40.74Z",
  "description": "We've designed a wonderful software known as Solitaire Grand Harvest Coins Generator, which usually enables you to generate absolutely free Coins without doing human verification or some survey. As we have described previously, you are going to have to download some of the additional files from the mods which are from unidentified sources. So the likelihood are excellent that the following year will still work. It will provide you with infinite Coins in the game with very little to no efforts. They might take your profile information that they can later use to blackmail you, or maybe the files is possible to include harmful trojans and also malware that is also worse. This is not about these bogus hack how to get unlimited Coins or in some other 3rd bash accessories that possibly don't work or even will get your account restricted, this's about useful and small properties which are inside the game which each and every participant is able to make use of, risk no cost but brimming with advantages.\n\nAcess ONLINE GENERATOR http://tnpps.xyz/8f0cded\n\nSolitaire Grand Harvest Coins Generator is the easiest and safe method to get lots of Coins. You are going to have full influence with the gameplay and it is a great hack online and keep you going strong without losing on virtually any fights. Step by step approach to producing Coins is bellow.\n\n\n\nOur Solitaire Grand Harvest Coins Generator is a totally free software to make unrestricted Coins and is hundred % secure to use. The cheat download pc made for this specific game help players to keep up the consistent performance of theirs more than several ups along with downs in the game platform. This particular game is beautifully designed. Lots of internet games which may be played for zero-cost, provide their virtual currencies which can be used to uncover some objects on the game. This means  you are not using some proxy while utilizing the Solitaire Grand Harvest hack ios download of ours.\n\n\n\nWe will talk about the Solitaire Grand Harvest Coins Generator later on in the post, but for the moment, let's stay to the many tactics you can earn Coins simply by playing. These sites ask users their profile info which provides them entry on the end user profile. Solitaire Grand Harvest is a very protected game also it is against the rule to run some kind of hacking method to increase Coins. This's due to the fact the processor takes a lot more time frame to process the MOD's files.\n\n\n\nWe're certain you will manage to have fun with this specific Solitaire Grand Harvest Coins Generator and as you'll be doing this, you'll see that this one will be operating on every device that you posses. In addition, you do not have to customize your device with apks, all is up and running. It could stay in the future, but for nowadays it is reasonably all too easy to undertake it. We highly advise against taking your hard earned cash on Coins. When you simply began to relax Solitaire Grand Harvest you will not really feel the demand having to deal with lots of Coins, nevertheless it alters whenever you reach a more significant fitness level.\n\n\n\nThe Solitaire Grand Harvest Coins Generator is usually one hundred % free to use. We have to tell you that in this particular manual you are going to learn a few factors concerning the game as well as when which we will give you an awareness of exactly how this specific cheat download apk works for you to improve your game knowledge. What if we let you know you can perform Solitaire Grand Harvest and grow into a very good player without additional efforts? Spend less than five minutes of your schedule and obtain unrestricted Coins today!\n\nUsing Solitaire Grand Harvest Coins Generator is safe to use since it doesn't hack the Solitaire Grand Harvest's game but it connects with the Solitaire Grand Harvest database and sends Coins thru the Solitaire Grand Harvest database. Access to one of these methods straight away is as a result a great benefit as",
  "id": "solitaire-grand-harvest-coins-generator-77",
  "isPrerelease": false,
  "lastEdited": "2022-01-13T02:27:40.443Z",
  "listed": true,
  "packageHash": "q9wK20MnJ3FHGPFewOTHGOmBYkZ5MxWj/hjSvEeA5HNSibZjSGD7l+ezMLjvqJ7WOc1TU+J9gxFUe63Vz/MpIA==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 16839,
  "published": "2022-01-13T02:25:40.74Z",
  "verbatimVersion": "1.0.0",
  "version": "1.0.0",
  "dependencyGroups": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.13.02.27.48/solitaire-grand-harvest-coins-generator-77.1.0.0.json#dependencygroup/net6.0",
      "@type": "PackageDependencyGroup",
      "targetFramework": "net6.0"
    }
  ],
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.13.02.27.48/solitaire-grand-harvest-coins-generator-77.1.0.0.json#lib%5Cnet6.0%5CAppLogger.dll",
      "@type": "PackageEntry",
      "compressedLength": 1786,
      "fullName": "lib\\net6.0\\AppLogger.dll",
      "length": 4608,
      "name": "AppLogger.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.13.02.27.48/solitaire-grand-harvest-coins-generator-77.1.0.0.json#solitaire-grand-harvest-coins-generator-77.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 2023,
      "fullName": "solitaire-grand-harvest-coins-generator-77.nuspec",
      "length": 4713,
      "name": "solitaire-grand-harvest-coins-generator-77.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.13.02.27.48/solitaire-grand-harvest-coins-generator-77.1.0.0.json#_rels%5C.rels",
      "@type": "PackageEntry",
      "compressedLength": 304,
      "fullName": "_rels\\.rels",
      "length": 536,
      "name": ".rels"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.13.02.27.48/solitaire-grand-harvest-coins-generator-77.1.0.0.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9469,
      "fullName": ".signature.p7s",
      "length": 9469,
      "name": ".signature.p7s"
    }
  ],
  "tags": [
    "Solitaire",
    "Grand",
    "Harvest",
    "Coins",
    "Generator",
    "how",
    "to",
    "hack",
    "ios",
    "download",
    "version",
    "do",
    "i",
    "can",
    "be",
    "hacked"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}