{
  "@id": "https://api.nuget.org/v3/catalog0/data/2015.02.03.08.57.03/aspose.words.13.4.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "Aspose",
  "catalog:commitId": "2af420bc-eab5-4010-b11d-de6ded69dbe3",
  "catalog:commitTimeStamp": "2015-02-03T08:57:03.7866046Z",
  "copyright": "© Aspose 2002-2013. All Rights Reserved.",
  "created": "2013-05-07T13:56:42.68Z",
  "description": "Aspose.Words for .NET class library supports DOC, DOCX, RTF, HTML, OpenDocument, PDF, XPS, EPUB and other formats. With Aspose.Words you can generate, modify, convert, render and print documents without utilizing Microsoft Word®",
  "iconUrl": "http://www.aspose.com/images/products/dotnet/Aspose.Words_128x128.png",
  "id": "Aspose.Words",
  "isPrerelease": false,
  "lastEdited": "0001-01-01T00:00:00Z",
  "licenseUrl": "http://www.aspose.com/corporate/purchase/end-user-license-agreement.aspx",
  "packageHash": "TIvme0QkEqekVDkpOKzil7sDNNuLA9R95wA2kxjhRSIVXZ4H5v5R6+UpRodKDJCqCBSJsdCGJFtV6sw3NRTwMA==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 10282181,
  "projectUrl": "http://www.aspose.com/categories/.net-components/aspose.words-for-.net/default.aspx",
  "published": "2013-05-07T13:56:42.68Z",
  "releaseNotes": "There are 173 improvements and fixes in this regular monthly release. The most notable are:\n\n• Printing to multitray printers improved\n• Printing documents that contain pages with different orientation\n• Improved memory performance for large documents (now code uses ~20% less memory for 1Gb+ documents)\n• DOC and DOCX document can be signed with digital signatures, also signatures can be removed;\n• 3D color for VML extrusion effect is supported\n• Improved performance of PDF rendering of documents with Jpeg images\n• DML Charts enhancements: surface charts rendering, moving average trend lines rendering and more\n• Supported rendering of revisions\n• Improved pagination of footnotes\n• Implemented character paragraph indents\n• Fixed positioning of a table broken across pages when it has repeated header rows\n• Improved table row wrapping around floaters\n• Fixed issue with Arabic-Indic numerals inside SDT\n• Aspose.Words allows to write OOXML documents that do not cause Compatibility Mode when opened in MS Word 2010-2013 \n\nThis release introduces the new features, enhancements and fixes to the excptions/bugs as detailed below:\n\n• New features\nWORDSJAVA-644\tAutoporter to support implicit and explicit castings\nWORDSJAVA-716\tAdd the examples dashboard to the Java release\nWORDSNET-2018\tSupport XAML (Flow document).\nWORDSNET-2120\t/revision marks/ Support revision marks upon rendering/converting to PDF.\nWORDSNET-2852\tDigitally sign a DOCX document\nWORDSNET-656\tDigitally sign a DOC document\nWORDSNET-6750\tSupport surface chart rendering.\nWORDSNET-6826\tParapragh Tight Wrap property do not preserve on re save the document\nWORDSNET-7368\tDocx to HTML conversion issue with Paragraph rendering\nWORDSNET-7612\t/revision marks/ Hidden text becomes visible in PDF\nWORDSNET-7884\tText wrapping is changed from \"Square\" to \"in line with text\" in output Doc/Docx\nWORDSNET-7894\t/revision marks/ Revision formatting and comments are not preserved in PDF\nWORDSNET-8006\tSupport AlternateContent upon reading charts for rendering.\nWORDSNET-8061\tForce LoadFormat during document load\nWORDSNET-8076\tAdd another Automation to Aspose migration tip to the docs\nWORDSNET-8093\tSupport band formats upon rendering surface charts.\nWORDSNET-8105\tSupport rendering of Linear trendlines.\nWORDSNET-8107\tSupport rendering of Moving Average trendlines.\nWORDSNET-8130\tReview the blog release for the dashboard\nWORDSNET-8131\tAdd the release to the downloads module\nWORDSNET-8133\tInclude dashboard in the MSI and add prompt the user to open at the end of the installer\nWORDSNET-8134\tAdd dashboard to dlls only zip for all products\nWORDSNET-8135\tRemove .sh file to register Aspose.Words.dll on Mono\nWORDSNET-8136\tRemove existing demo code from the installer\n\n• Enhancements\nWORDSJAVA-627\tAutoporting of static classes\nWORDSJAVA-702\tEffects are not applied correctly\nWORDSJAVA-705\tAdding JavaDelete annotation should delete existing java file too.\nWORDSJAVA-706\tWorkaround for TestNG's explicit test class bug.\nWORDSJAVA-710\tTestNG to not run non-test public mthods.\nWORDSJAVA-711\tFull name of attribute should be stripped.\nWORDSJAVA-718\tOfficeCripto manual lifting\nWORDSNET-2092\tAvoid using fonts during rendering checboxes.\nWORDSNET-2198\tSize of images is changed after open/save the document.\nWORDSNET-2226\tFile size is increased two times after open/save the document.\nWORDSNET-3580\tSupport transparency in WMF emulated by SRCPAINT and SRCAND raster operations.\nWORDSNET-3849\tVML // Shape shadow effect rendering\nWORDSNET-4351\tText inside textbox is cropped during rendering.\nWORDSNET-4861\tPosition of Textbox is incorrect after converting to DOCX\nWORDSNET-5169\tInvestigate whether we can decrease memory usage upon rendering documents.\nWORDSNET-5529\tDML linear gradient brushes should use transformation matrices instead of angle.\nWORDSNET-5697\t/page vertical alignment/document to pdf conversion, image lose its postion\nWORDSNET-5754\twhile converting doc to pdf, image properties not available\nWORDSNET-5756\tPdf page count is greater than input Word document, after converting doc to Pdf\nWORDSNET-5784\tdocument to pdf conversion, creating multiple tables\nWORDSNET-5830\tDOC to PDF conversion issue; All pages not exported to PDF\nWORDSNET-5831\tDocument text out of position, While saving Word document in Pdf format\nWORDSNET-5842\tWhile doc to Pdf, footer image render incorrectly.\nWORDSNET-5889\tWhile converting Word document to Multipage Tiff image, first image missing.\nWORDSNET-6203\tTextBox is hidden while rendering.\nWORDSNET-6218\tDocx to PDF conversion issue with tables\nWORDSNET-6327\tDoc to PDF conversion issue with left margin\nWORDSNET-6381\tDoc to PDF conversion issue with Text field's text\nWORDSNET-6410\tWork out a useful way to avoid running into Compatibility Mode when saving OOXML and opening in Word 2010\nWORDSNET-6531\tDocx to Html conversion issue with text position\nWORDSNET-6570\tText is misplaced after conversion from Doc to Pdf\nWORDSNET-6954\tImprove work with brushes upon rendering charts.\nWORDSNET-7256\tComplete and release the offline examples dashboard\nWORDSNET-7324\tUnexpected vertical border line appears besides characters in Html\nWORDSNET-7557\tErrors with math symbols when converting .docx to .pdf on Ubuntu\nWORDSNET-7758\tTable Width Changed Issue in Html2Doc2Html\nWORDSNET-7797\tFont is incorrectly imported from HTML\nWORDSNET-7798\tTwo tables are joined into one\nWORDSNET-7880\tOne of the tables incorrectly reads into model\nWORDSNET-7883\tContent is imported as a single Paragraph\nWORDSNET-7892\tText contents misplaced while conveying from Doc to Fixed file format\nWORDSNET-7919\tHTML to Doc conversion issue with Paragraph Left Indent\nWORDSNET-7920\tOpen and Save HTML file lost Left Indentation of Paragraphs\nWORDSNET-7936\tXPS printing issue with text at physical printer\nWORDSNET-7937\tShape's z-order is incorrect in HTML export.\nWORDSNET-7953\tCreate infrastructure for compliance info gathering during OOXML document loading\nWORDSNET-7973\tFailed assertion in BorderGrid.AddCell()\nWORDSNET-7984\tWord 2013 does not respect zoom level set by Aspose.Words\nWORDSNET-8019\tAdd support of 3D color to extrusion effect.\nWORDSNET-8020\tAdd support of gradient brush scale.\nWORDSNET-8040\tIncorrect tab width when list aligned tab occurs after another tab\nWORDSNET-8055\tShadow for shapes with broad stroke differs from MS Word 2013 result\nWORDSNET-8057\tLine width is not considered during appling extrusion effect\nWORDSNET-8089\tSupport Z-Axis labels rendering.\nWORDSNET-8090\tImprove drop lines rendering for 3D line charts.\nWORDSNET-8100\t/footnote balancing/ Docx to PDF conversion issue\nWORDSNET-8125\tLine chart is rendered as smooth but should be rendered as straight lines.\nWORDSNET-8151\tFont of text inside WordArt Shape is incorrect in PDF\nWORDSNET-8154\tUpdate links to Aspose site in shortcuts created by the installer\n\n• Exceptions\nWORDSNET-3926\tOutOfMemoryException occurs during converting to PDF.\nWORDSNET-4143\tRef field in footer causes exception while UpdateField running\nWORDSNET-4243\t/performance/ OutOfMemoryException is thrown upon rendering.\nWORDSNET-4293\tArgumentException occurs during UpdateField.\nWORDSNET-4672\tArgumentException is thrown upon rendering.\nWORDSNET-6265\tStack Empty Exception when UpdatePageLayout() is called\nWORDSNET-6298\tInvalidOperationException occurs during converting DOC to fixed page formats\nWORDSNET-7830\tAspose.Words.FileCorruptedException is thrown when load Doc file into Aspose.Word DOM\nWORDSNET-7945\tAspose.Words.FileCorruptedException occurs when loading a DOCX\nWORDSNET-7976\tSystem.InvalidOperationException occurs during rendering to fixed page formats\nWORDSNET-7983\t'Infinite loop detected' error occurs during rendering to fixed page formats\nWORDSNET-7993\tUnsupportedFileFormatException occurs during loading Unknown file format\nWORDSNET-8002\tDrawingML causes Aspose.Words to throw InvalidOperationException during open/save DOCX\nWORDSNET-8051\tDocuments fall into infinite loop when rendering to fixed page formats\nWORDSNET-8098\tNullReferenceException occurs during rendering to fixed page formats\nWORDSNET-8137\tAspose.Words.FileCorruptedException occurs when loading a DOC\n\n• Bugs\nWORDSJAVA-652\tPage prints with incorrect orientation when printing to a physical printer\nWORDSJAVA-659\t% formatting of doubles in charts.\nWORDSJAVA-709\tAvoid duplicates in Java annotation arguments\nWORDSJAVA-712\tInvestigate if the conversions are performed twice\nWORDSJAVA-713\tConsider removing temporary image files after save operation\nWORDSJAVA-717\tChart axis labels are stripped.\nWORDSJAVA-719\tChart axis labels: integer formatted as float\nWORDSNET-2504\tHyperlink to an external document crashes XPS Viewer\nWORDSNET-5411\tOn DOC to PDF conversion, Logo inside header is misplaced\nWORDSNET-5599\tUpon rendering to PDF, Body of document becomes invisible\nWORDSNET-5633\tShapes are rendering behind the DrawingML objects in PDF,XPS\nWORDSNET-5634\tContent is overlapped by image during open/save.\nWORDSNET-5966\tWhile converting doc to pdf, Tables overlapped because of text wrapping set to Around.\nWORDSNET-6028\tDocument looks different when rendered to Fixed page formats\nWORDSNET-6107\tRed TextBox Shape becomes in front of all other objects after conversion/rendering\nWORDSNET-6117\tHorizontal merged cells rendered incorrectly while saving in PDF format first.\nWORDSNET-6123\tTable contents are cut off while converting doc to PDF format.\nWORDSNET-6164\tWhile converting doc to Pdf, nested table text rendered incorrectly.\nWORDSNET-6231\tVertical WordArt is not converting properly to RTF\nWORDSNET-6233\tOOXML Charts // DrawingML Chart disappears during converting to DOC\nWORDSNET-6396\tText is misplaced after conversion From Doc to PDF\nWORDSNET-6562\tAspose.Words hangs during rendering Microsoft Visio Drawing Object to PDF/XPS\nWORDSNET-6568\tDrawingML images are misplaced during open/save\nWORDSNET-6575\tBuiltInDocumentProperties.Words property returns incorrect value\nWORDSNET-6664\tDrawing Objects are not being rendered properly to PNG\nWORDSNET-6904\tIncorrect shapes zorder\nWORDSNET-6972\tAutoshape is sent behind an image while saving DOCX to PDF\nWORDSNET-7125\tDML inside SDT is transformed into a GroupShape during open/save\nWORDSNET-7353\tFrame is not positioned at the correct place when exporting to Html\nWORDSNET-7516\tA DML incorrectly renders in front of other DML nodes\nWORDSNET-7722\tLine graph is missing with legends after conversion from Docx to Fixed file format\nWORDSNET-7767\tVertical border line appears besides logo image when printing\nWORDSNET-7799\tTextBox shapes are sent behind other Shapes during open/save\nWORDSNET-7807\tOrdinal Date field format is not correct in Fixed Page Formats\nWORDSNET-7872\tDocument contents are shifted to the next page in PDF document\nWORDSNET-7908\tA string is repeated twice with two different formats in PDF\nWORDSNET-7932\tFonts used in PDF are different to those used by Microsoft Word\nWORDSNET-7934\tTextBox and it's content is not visible in fixed page formats\nWORDSNET-7935\tAn image is incorrectly displayed on all pages in PDF other than first page\nWORDSNET-7942\tImprove min/max axis values calculation algorithm for 3D charts.\nWORDSNET-7943\tA TextBox is sent behind DrawingML image during rendering to fixed page formats\nWORDSNET-7954\tContent from Text file is not read during loading into DOM\nWORDSNET-7968\tBlack lines appear in Rectangle Shape during open/save DOCX\nWORDSNET-7980\tLock aspect ratio of embedded object is set to active after re-save\nWORDSNET-7982\tUpdateFields doesn't remove content formatted with Title style from TOC\nWORDSNET-7986\tWidth and alignment issue of a Text input form field in Pdf\nWORDSNET-7994\tDocument.UpdateFields duplicate Visio Drawing\nWORDSNET-8000\tMS Word reports a corruption in Cloned DOCX\nWORDSNET-8001\tNumber formatting issue while Mail Merge\nWORDSNET-8003\tSize of TextBox in DOCX is not preserved during open/save\nWORDSNET-8005\tDate picker SDT control is positioned closer to the top page edge\nWORDSNET-8009\tAltchunk content is not preserved during open/save\nWORDSNET-8010\tDoc to PDF conversion issue with Group Shapes rendering\nWORDSNET-8011\tVertical space between Paragraph is not preserved in fixed page formats\nWORDSNET-8012\tTables are not splitting across pages in fixed page formats\nWORDSNET-8013\tTable rows are overlapping the content in Header in fixed page formats\nWORDSNET-8015\tTable is moved to next page after conversion from Docm to PDF\nWORDSNET-8023\tUnwanted border around Cells of first Row appears during open/save\nWORDSNET-8026\tAspose.Words produces untidy Table structures in DOC\nWORDSNET-8028\tIncorrect text effective rectangle with 3D effect\nWORDSNET-8030\tMS Word reports a corruption in converted DOCX\nWORDSNET-8038\tActual bounds are calculated incorrectly\nWORDSNET-8044\tSDT content in RTL Table is partially reversed when specifying NumeralFormat.ArabicIndic\nWORDSNET-8064\tParagraph w:vertAlign has changed from superscript to baseline\nWORDSNET-8072\tDetect an encoding in TxtReader if LoadOptions.Encoding is null.\nWORDSNET-8085\tMozilla Firefox does not render DrawingML in PDF properly\nWORDSNET-8113\tOpen/Save Docx lose the bullet\nWORDSNET-8146\tUnexpected line numbers appear during open/save ODT\n\n• Performance\nWORDSJAVA-662\tDecrease memory usage when save multi-thousands-page PDF documents.\nWORDSJAVA-669\tInvestigate why does it take too long to save to Pdf\nWORDSJAVA-714\tPerformance issue during RTF loading and converting to other formats\nWORDSNET-7852\tFeasibility study // Avoid reconvertion of non-JPEG images for texture brush.\nWORDSNET-8022\tLine AutoShape causes Aspose.Words to hang during rendering\n\n• Regressions\nWORDSNET-7963\tSystem.InvalidCastException throws while converting from RTF document to other file formats",
  "requireLicenseAcceptance": true,
  "title": "Aspose.Words for .Net",
  "version": "13.4.0",
  "tags": [
    "Aspose.Words",
    "DOC",
    "DOCX",
    "RTF",
    "HTML",
    "OpenDocument",
    "XPS",
    "EPUB",
    "Word",
    "Document",
    "Processing"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    }
  }
}