{
  "@id": "https://api.nuget.org/v3/catalog0/data/2015.02.01.20.04.43/aspose.words.11.3.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "Aspose",
  "catalog:commitId": "cffe2bfd-fd39-4225-b5cf-212ba3cad4c5",
  "catalog:commitTimeStamp": "2015-02-01T20:04:43.0247133Z",
  "copyright": "© Aspose 2002-2011. All Rights Reserved.",
  "created": "2012-05-02T07:55:37.68Z",
  "description": "Aspose.Words for .NET class library supports DOC, DOCX, RTF, HTML, OpenDocument, PDF, XPS, EPUB and other formats. With Aspose.Words you can generate, modify, convert, render and print documents without utilizing Microsoft Word®",
  "iconUrl": "http://sialkot.aspose.com/wiki/download/attachments/1179725/imgLogoWords128x128.png",
  "id": "Aspose.Words",
  "isPrerelease": false,
  "lastEdited": "0001-01-01T00:00:00Z",
  "licenseUrl": "http://www.aspose.com/corporate/purchase/end-user-license-agreement.aspx",
  "packageHash": "HGlHlklm06jdqubGBN3LDKeQmLnx0OFFFzOwAgqTy5/gWG1RC2ISGZL+p8kjL2nd4pziIyRoFebp6D+IFXYPMA==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 12283537,
  "projectUrl": "http://www.aspose.com/categories/.net-components/aspose.words-for-.net/default.aspx",
  "published": "2012-05-02T07:55:37.68Z",
  "releaseNotes": "There are 133 improvements and fixes in this regular monthly release. Most notable changes are:\n\n• OfficeMath is rendered and supported in almost all formats\n• MathML import in ODT is supported\n• Floating tables rendering improvements\n• Table formatting revisions are supported in DOCX and WML\n• Performance improvements for the PAGE field update\n• Support for some EMF+ rendering\n• Signature line shapes are supported\n\nThis release introduces the features, enhancements and bug fixes as detailed below:\n\n• New features\n\nWORDSNET-589\tSectionStart.NewColumn to work when number of columns is same\nWORDSNET-1135\tSupport row formatting revisions in WordML and Docx\nWORDSNET-1466\tDocument properties outside of their RTF groups are ignored\nWORDSNET-1777\tSupport Ink shapes\nWORDSNET-3032\tPackages embedded in DOCX are not converted to DOC\nWORDSNET-3087\tConsider exporting with or without BOM optionally\nWORDSNET-3436\tODF Plugfest 20090713. Math formula missing after ODT 2 ODT conversion.\nWORDSNET-3519\tSectionStart.NewColumn is considered as page break upon rendering.\nWORDSNET-3701\tPreserve Office Math Markup Language (OMML) formulas during processing.\nWORDSNET-4153\tInk annotations are converted to simple images after open/save using Aspose.Words.\nWORDSNET-4532\tExport math content into binary DOC\nWORDSNET-4533\tPreserve Office Math Formulas during RTF roundtrip.\nWORDSNET-4534\tSupport rendering of OfficeMath\nWORDSNET-4535\tExport Office Math content to HTML\nWORDSNET-4536\tExport Office Math content to WML\nWORDSNET-5118\tSupport basic table row wrapping around floaters\nWORDSNET-5462\tAutomatic thumbnail generating from first page of document\nWORDSNET-5740\tSupport absolutely positioned tabs rendering\nWORDSNET-5811\tSection break new column behaves like page break, while saving Word document to Pdf Format\nWORDSNET-5897\tSupport MathML ODT import\nWORDSNET-5987\tAdd functionality to FileFormatUtil to return if a document format is supported on load or save based on mime-type.\nWORDSNET-6017\tTabs are lost upon rendering to Fixed Page Formats\nWORDSNET-6048\tImplement Load and Save warnings for WML format\nWORDSNET-6121\tText column break does not work while saving in PDF format.\n\n• Enhancements\n\nWORDSJAVA-523\tWORDSJAVA-519 Quality of image downscaled more than twice\nWORDSJAVA-525\tWORDSJAVA-519 Extract \"raw\" images from a document\nWORDSNET-1899\tAdd anti-aliasing to ImageOptions\nWORDSNET-2476\tTable formatting changes after open/save DOC\nWORDSNET-3302\tConsider saving macro-enabled FlatOPC.\nWORDSNET-3303\tConsider saving template FlatOPC.\nWORDSNET-3913\tContent Controls are lost during converting DOCX to DOC.\nWORDSNET-4827\tDouble underline doesn't show up in HTML properly.\nWORDSNET-4837\tAuto paragraph spacing is incorrect in TOC\nWORDSNET-4943\tImprove automatic paragraph spacing handling\nWORDSNET-4952\t/auto spacing inside cell + isHtmlCompatibility/ Part of content is moved to previous page upon rendering.\nWORDSNET-4967\tSupport basic table row wrapping around floaters.\nWORDSNET-5115\tSupport basic table row wrapping around floaters\nWORDSNET-5201\tSupport basic table row wrapping around floaters.\nWORDSNET-5207\tFloating table overlaps inline talbe after rendering.\nWORDSNET-5268\tFloating table overlaps an inline table after rendering.\nWORDSNET-5304\tFloating tables overlap each other after rendering.\nWORDSNET-5393\tInvestigate whether Aspose.Words can use fonts embedded into printer device.\nWORDSNET-5845\tFont.Bidi not working as needed\nWORDSNET-5972\tLogo in header overlaps the table in body in Fixed page formats\nWORDSNET-6030\tSupport hideMark attribute for a table cell.\nWORDSNET-6053\tFloating table and regular table overlap each other.\nWORDSNET-6078\tTable content is getting overlapped on the frames\nWORDSNET-6089\tTables overlap each other after rendering\nWORDSNET-6113\tTable content is getting overlapped on other objects\nWORDSNET-6136\tInstaller issues EULA update and graphic distortion\nWORDSNET-6137\tLayout gets disturbed upon rendering DOC to fixed page formats\nWORDSNET-6160\tUpdate links to new URL format for product pages and announcements threads\nWORDSNET-6175\tSupport EMF+ GetDC record\nWORDSNET-6176\tSupport EMF+ DrawDriverString record\nWORDSNET-6191\tPage break is placed in the end of preceding page instead of the beginning of the next page\nWORDSNET-6200\tSmall unrelated refactorings\n\n• Performance\n\nWORDSJAVA-510\tLinear performance for very big single-section documents\nWORDSNET-5814\tOutput PDF file size becomes too big as compared to input DOCX\nWORDSNET-5874\tOutput PDF file size becomes too big as compared to output DOCX\nWORDSNET-6153\tUpdating PAGE fields degrades performance significantly\n\n• Exceptions\n\nWORDSNET-4521\tArgumentException occurs during gradient rendering\nWORDSNET-5397\tInvalidOperationException is thrown upon updating fields in HeaderFooter.\nWORDSNET-5580\t\"Stack empty\" exception on saving document in any format.\nWORDSNET-5625\tNullReferenceException upon DOC to PDF conversion\nWORDSNET-5629\tException during conversion doc to pdf\nWORDSNET-5693\tOutOfMemoryException: DrawingML fails to render to PDF\nWORDSNET-5828\tUnicode (Chinese text) gets lost on open/save\nWORDSNET-5841\tOutofMemoryException occurs when calling RenderToScale method\nWORDSNET-5862\tMHTML file format stream generated by AE is not supported by AW\nWORDSNET-5870\tNullReferenceException occurs on calling UpdateFields\nWORDSNET-5899\tInsertHtml method throws Exception when using <tr style='HEIGHT: 0.0'>\nWORDSNET-5916\tWhile loading rtf file, an exception occur if an image is used at a bullet in the RTF file.\nWORDSNET-5973\tNullReferenceException occurs when UpdateFields() is called after MailMerge\nWORDSNET-5995\tInvalidCastException occurs during UpdateFields\nWORDSNET-6031\tSystem.NullReferenceException occur while inserting/updating Page field.\nWORDSNET-6039\tNullReferenceException occurs during rendering to PDF\nWORDSNET-6044\tOutOfMemoryException: DrawingML fails to render to fixed page formats\nWORDSNET-6079\tFileCorruptedException is thrown upon importing RTF file.\nWORDSNET-6102\tUnsupportedFileFormatException occurs while loading HTM/HTML file.\nWORDSNET-6122\tNullReferenceException occurs on calling UpdateFields\nWORDSNET-6180\tAspose.Words.FileCorruptedException occurs upon loading RTF\n\n• Bugs\n\nWORDSJAVA-447\tJapaniseDatePattern\nWORDSJAVA-519\tImages extracted from WordML Doc are getting corrupted\nWORDSJAVA-524\tWORDSJAVA-519 Crop of images downscaled more than twice\nWORDSNET-1710\tList format is lost after open/saving RTF document using Aspose.Words.\nWORDSNET-1748\t/signature line/ Support \"Signature Line\" shapes in Aspose.Words\nWORDSNET-1820\t“Customization metadata” is removed from the document after saving using Aspose.Words.\nWORDSNET-2186\tSome text becomes on the previous page during rendering/converting to PDF.\nWORDSNET-3004\t/\"Don't add space between paragraphs of the same style\" option for text inside cells:4/ Spacing is incorrect between paragraphs in the table cell during rendering.\nWORDSNET-3392\tFormatting revisions are not supported in RTF\nWORDSNET-3632\tSize of EMF image is improper during rendering.\nWORDSNET-3754\tNumbers in numbered lists are changed during HTML export.\nWORDSNET-3978\tControl output of text with negative margins\nWORDSNET-4014\tAW incorrectly imports mhtml with part of content outside of tag\nWORDSNET-4038\tExtra content appears in the output document during MHTML import.\nWORDSNET-4212\tNegative left margin is not fixed when saving Html for external css\nWORDSNET-4228\tWindows Forms 2.0 Frame is converted to shape after open/save.\nWORDSNET-4490\tWhen open the document in Acrobat Reader error occurs \"An error exists on this page\"\nWORDSNET-4514\tSection Break (Continuous) initiates page break during rendering.\nWORDSNET-4520\tIncorrect handling font property OUTL\nWORDSNET-4553\tDrawingML is improperly rendered.\nWORDSNET-4731\tShape is missed upon loading document.\nWORDSNET-4741\tStyle of table in document looks different when rendered.\nWORDSNET-4750\t/border equality/ Border between paragraphs is improperly rendered\nWORDSNET-4765\tSection Break (Continuous) initiates page break during rendering ODT document.\nWORDSNET-4885\tText of the first row of the table seems to be positioned too high.\nWORDSNET-5127\tParagraph Spacing After is not correct after converting DOCX to other formats.\nWORDSNET-5129\tThere is a slight difference in font size after rendering metafile.\nWORDSNET-5159\tQuality of vector image is degraded when exporting to HTML\nWORDSNET-5210\tInappropriate encoding breaks Html import\nWORDSNET-5484\tMetafile is not rendered in PDF/XPS/SWF.\nWORDSNET-5658\tHidden Comment tags in RTF appear after open/save.\nWORDSNET-5681\tHanging identation of paragraphs in tables is set after open/save document.\nWORDSNET-5709\tLayout gets disturbed upon converting DOCX to PDF\nWORDSNET-5776\tSupport 'style' attribute of '<HR>'\nWORDSNET-5855\tTable in .DOCX Loses Formatting and Indentation on Conversion to WordML\nWORDSNET-5919\tException while using mailmerge\nWORDSNET-5925\tDrawingML's GrayScale color tone is lost when converting to Fixed Page Formats\nWORDSNET-5936\tWhile converting rtf to doc, paragraph indented incorrectly.\nWORDSNET-5938\tWhile converting doc to rtf, incorrect text wrapping and drop cap setting.\nWORDSNET-5963\tWhile converting odt to pdf file, border lines appear around the text after rendering.\nWORDSNET-5969\tDocument's 1st, 2nd page layout gets disturbed during rendering\nWORDSNET-5975\tWhile converting docx to html, three starting letters are missing in IE8.\nWORDSNET-6004\tDocx to PDF/XPS conversion issue\nWORDSNET-6023\tBottom VerticalAlignment is lost upon loading the RTF\nWORDSNET-6024\tWhile converting dot to doc, incorrect layout problem occur.\nWORDSNET-6040\tVector image is not displaying during rendering to PDF\nWORDSNET-6086\tTable is shifted left during accepting revisions.\nWORDSNET-6103\tChanging color of Run changes color of adjacent Paragrapgh break character and vice versa\nWORDSNET-6147\tLink between textboxes breaks when saving a .docx\nWORDSNET-6170\tDrawingML does not get rendered to PDF\nWORDSNET-6174\tDocx to HTML conversion issue with fractions\nWORDSNET-6226\tUpdateFields converts OfficeMath to Shape.",
  "requireLicenseAcceptance": true,
  "title": "Aspose.Words for .Net",
  "version": "11.3.0",
  "tags": [
    "Aspose.Words",
    "DOC",
    "DOCX",
    "RTF",
    "HTML",
    "OpenDocument",
    "XPS",
    "EPUB",
    "Word",
    "Document",
    "Processing"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    }
  }
}