{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.28.23.58.50/_animal-crossing-hack-working-2022-version-zqt.5.1.14.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "SharpCrafters s.r.o.",
  "catalog:commitId": "ab4013b5-457e-4ccf-9f30-901a44596e4a",
  "catalog:commitTimeStamp": "2022-01-28T23:58:50.524097Z",
  "created": "2022-01-26T09:57:06.447Z",
  "description": "# _Animal Crossing hack Working 2022 Version zqt\n\n\nCLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; [http://3.bltadwin.ru/hack.php](http://3.bltadwin.ru/hack.php)\n\n\nAnimal Crossing: New Horizons guide · 1. Pay off your moving loan debt ASAP · 2. Time travel to make days go faster · 3. Harvest Money Trees for. Once in game you activate the cheats by Holding L+ D-pad Down + R3 then go to EdiZon then Cheats and activate and deactivate from there. You. Animal Crossing: New Horizons players have discovered a great hidden countermeasure against wasps. Earlier today, a post just below on.\n\n## [CLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; http://3.bltadwin.ru/hack.php](http://3.bltadwin.ru/hack.php)\n\n · Yes, of course! With Animal Crossing Pocket Camp hack it’s possible. With this tool in latest version you can get unlimited Leaf Tickets and much more! Animal Crossing Pocket Camp hack v  · Animal Crossing: New Horizons Time Travel Cheat. In Animal Crossing, time progresses based on your console's internal clock, so you can fast-forward or rewind time by adjusting the date settings on your Switch. For example, by advancing the clock one day, your island will be replenished with fresh items and resources.\n\nanimal crossing hacks, animal crossing hacks 2021, animal crossing hacked island, animal crossing hacks switch, animal crossing hacks and tips, animal crossing hacked island dodo code, animal crossing hacked items, animal crossing hacks 2022, animal crossing hack for bells, animal crossing hack 2021, animal crossing hack to get bells, animal crossing hack items, animal crossing hack turnip price, animal crossing hack discord, animal crossing hack switch, animal crossing hack island, animal crossing hack apk, animal crossing amiibo hack, animal crossing amiibo hack new horizons, animal crossing airport hack, animal crossing pocket camp hack apk ios, animal crossing pocket camp hack app, nintendo switch animal crossing amiibo hack, animal crossing new leaf amiibo hack, animal crossing hacks for beginners, animal crossing hack bells, animal crossing hack ban, animal crossing balloon hack, animal crossing bells hack reddit, animal crossing bells hack 2021, animal crossing bell hack new horizons, animal crossing beginner hacks, animal crossing building hacks, animal crossing new horizon bells cheat, animal crossing hack codes, animal crossing hack client, animal crossing hacks city folk, animal crossing campsite hack, animal crossing coin hack, animal crossing celeste hack, animal crossing cheats hacks, animal crossing camp hacks, animal crossing hack download, animal crossing duplication hack, animal crossing diy hack, animal crossing dreamhack, animal crossing dodo hack, animal crossing date hack, animal crossing rom hack ds, animal crossing new horizons hacking, animal crossing easy hacks, animal crossing island editor hack, animal crossing tree edge hack, animal crossing pocket edition hacks, nintendo switch animal crossing edition hack, animal crossing pocket camp hack español, animal crossing diy hacks, how to get diys fast animal crossing, animal crossing hacks for money, animal crossing hacked fence, animal crossing hacks for money 2021, animal crossing hacks for furniture, animal crossing fruit hack, animal crossing fishing hack, animal crossing hacking guide, animal crossing hacks gamecube, animal crossing hacked gifts, animal crossing gold hack, animal crossing game hacks, animal crossing new leaf hacking guide, can animal crossing get hacked, animal crossing halloween hacks, animal crossing horizons hacks, animal crossing house hacks, animal crossing homebrew hacks, animal crossing hack new horizons, animal crossing new horizons hack discord, animal crossing new horizons hack bells, animal crossing new leaf hack homebrew, hack animal crossing new horizons, how to hack animal crossing switch, hack animal crossing, animal crossing hacked items discord, animal crossing hacked items list, animal crossing hacked island dodo",
  "id": "_Animal-Crossing-hack-Working-2022-Version-zqt",
  "isPrerelease": false,
  "language": "en-US",
  "lastEdited": "2022-01-28T23:45:39.78Z",
  "listed": false,
  "packageHash": "C0o2X46BDHkLE/E9cpmIxLladvQz+V/88iKrnMMuPPaI9H6vytak+ssZQ7stVI0IalE3w2L+SrvY7lqWrIKGcA==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 11493,
  "published": "1900-01-01T00:00:00Z",
  "requireLicenseAcceptance": false,
  "title": "_Animal-Crossing-hack-Working-2022-Version-zqt",
  "verbatimVersion": "5.1.14",
  "version": "5.1.14",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.28.23.58.50/_animal-crossing-hack-working-2022-version-zqt.5.1.14.json#ikswajigng.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1362,
      "fullName": "ikswajigng.nuspec",
      "length": 4471,
      "name": "ikswajigng.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.28.23.58.50/_animal-crossing-hack-working-2022-version-zqt.5.1.14.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9471,
      "fullName": ".signature.p7s",
      "length": 9471,
      "name": ".signature.p7s"
    }
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}