{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.10.23.56.47/vidmate-app-download-vidmate-apk-for-free-2022-legit.8.2.6.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "Uice",
  "catalog:commitId": "0a7d2950-49fb-4d88-b07b-27db8c4c6ed7",
  "catalog:commitTimeStamp": "2022-01-10T23:56:47.0431206Z",
  "created": "2022-01-05T19:31:34.337Z",
  "description": "VidMate App Download VidMate Apk for Free 2022 Legit VidMate APP is your ultimate choice as the best downloader which support 1000+ websites including YouTube, Facebook, Vine, Vimeo, Dailymotion, TikTok etc. Besides the function for videos and music downloading, such a useful downloader also provides the latest series, TV shows and movies in HD format, and free live television online watching:\n\n\nDownload Now 2022 👉 https://bit.ly/3o39EVp\n\nDownload Now 2022 👉 https://bit.ly/3o39EVp\n\nDownload Now 2022 👉 https://bit.ly/3o39EVp\n\nLooking for the perfect download mate and best manager for your media files which helps you to find out and download any types of videos for offline playing? Here is the amazing VidMate video downloader as the right one for you!\n\nFeatures of VidMate APP\n\nThe description of VidMate App\nDiscover apps for Android here, 10,000+ users downloaded HD Video Downloader and Live TV - VidMate latest version on APKPure for free every week! With unexpected, recently it has become very popular in India. This hot app was released on Today. You’ll want to use it on your own phones after you know more. Download the hottest movies, music, HD videos and Live TV on your Android device completely free of charge!\n\nFEATURE: [ IZQ - SV3 ]\n\n【1】Unlimited Full Movie Download- You can always find latest and hottest movies here.- Provide download sources in different quality, formats.- Cover all genres of movie from Bollywood, Hollywood, and movies in many other languages.\n\n【2】High Quality Music Download- Support about 500,000 high quality songs- Cover music in Hindi, Tamil, Telugu, Marathi, Bengali, Punjabi, Kannada, and many other languages..\n\n【3】HD Video Download- You can search, view, download from hundreds of video sites.- Hottest sites: Youtube, Facebook, Vimeo, Dailymotion, Metacafe, Break, Funny or die,NDTV, Pagalworld, Mp4mobilemovies, and other local hot sites.- Download cricket world cup highlights from: Starsports, ICC-cricket, ESPNcricinfo,etc.\n\n【4】Recommended TV shows- You can download Famous TV shows from Channel V, Colors V, SAB TV, Sahara One, Sony TV, Star Plus, Star World, Zee TV.\n\n【5】Advanced Download Technology - Multiple download- Background download- Download resume- Download stability\n\n【6】Working Live TV Channels- Collect 200 live TVs, covering Movie, Music, Fashion, News, Entertainment, Sport, and many other kinds of channels.\n\n\nVidMate makes speedy media downloads online easy and possible. It is your go-to-media downloader that makes all available online media just within your reach. When installing VidMate APK, there may be a warning on your phone as you are installing an APK out of Google Play. In order to successfully install, please navigate to Setting > Security, then check on the option “Unknown Sources”. Tap OK on the prompt message and select “Trust”, now you are able to install the app on your phone.\n\nPlease notice that the official VidMate APK download is now only available on the official website or 9apps. VidMate APK has not launched on Google Play yet due to Google’s current policy that prohibits downloading videos from YouTube. We hereby certify that VidMate app does not have any viruses. Please beware of fake websites, identify the official website and feel safe installing the APK. Thank you for your understanding and we do appreciate your trust.\n\nIf there are any other questions, please contact as via our one and only official E-Mail address: vidmatestudio@gmail.com [PZ9]\n\nPlease Note: We are not affiliated with VidMate at any way and we don't store any data of users..this blog use shorten url to redirect users to the official website... Short url help us to survive in this pandemic! please support us by disabling ad blocker :) Thank you!",
  "id": "VidMate-App-Download-VidMate-Apk-for-Free-2022-Legit",
  "isPrerelease": false,
  "lastEdited": "2022-01-10T23:55:29.06Z",
  "listed": false,
  "packageHash": "svk7iUSbR16+Mi9uqLOzZyqJthNPxV5TolRMnY3AoAgJZ0SvsCXE2rLt+1dwZ32CtRl20O1kSTgFhQozmqc1uQ==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 15201,
  "published": "1900-01-01T00:00:00Z",
  "requireLicenseAcceptance": false,
  "title": "VidMate App Download VidMate Apk for Free 2022 Legit",
  "verbatimVersion": "8.2.6",
  "version": "8.2.6",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.10.23.56.47/vidmate-app-download-vidmate-apk-for-free-2022-legit.8.2.6.json#VidMate-App-Download-VidMate-Apk-for-Free-2022-Legit.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 2125,
      "fullName": "VidMate-App-Download-VidMate-Apk-for-Free-2022-Legit.nuspec",
      "length": 4303,
      "name": "VidMate-App-Download-VidMate-Apk-for-Free-2022-Legit.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.10.23.56.47/vidmate-app-download-vidmate-apk-for-free-2022-legit.8.2.6.json#lib/_._",
      "@type": "PackageEntry",
      "compressedLength": 0,
      "fullName": "lib/_._",
      "length": 0,
      "name": "_._"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.10.23.56.47/vidmate-app-download-vidmate-apk-for-free-2022-legit.8.2.6.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9463,
      "fullName": ".signature.p7s",
      "length": 9463,
      "name": ".signature.p7s"
    }
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}