{
  "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.21.06.27.16/aspose.words.11.6.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "Aspose",
  "catalog:commitId": "8ec99b78-7c7c-49d9-a8e9-b3cc7005ee23",
  "catalog:commitTimeStamp": "2018-10-21T06:27:16.1742231Z",
  "copyright": "© Aspose 2002-2011. All Rights Reserved.",
  "created": "2012-08-02T13:36:15.007Z",
  "description": "Aspose.Words for .NET class library supports DOC, DOCX, RTF, HTML, OpenDocument, PDF, XPS, EPUB and other formats. With Aspose.Words you can generate, modify, convert, render and print documents without utilizing Microsoft Word®",
  "iconUrl": "http://www.aspose.com/images/products/dotnet/Aspose.Words_128x128.png",
  "id": "Aspose.Words",
  "isPrerelease": false,
  "lastEdited": "2018-10-21T06:27:12.657Z",
  "licenseUrl": "http://www.aspose.com/corporate/purchase/end-user-license-agreement.aspx",
  "listed": true,
  "packageHash": "5nyZhzqdVsumJvXpiqbbTBwSN08nnV6TBXPDdPvgDCmlC5CK7BcOck2ogGhbKeTme/zsUE38kQ5E23rc9MdBMw==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 12714567,
  "projectUrl": "http://www.aspose.com/categories/.net-components/aspose.words-for-.net/default.aspx",
  "published": "2012-08-02T13:36:15.007Z",
  "releaseNotes": "There are 120 improvements and fixes in this regular monthly release. Most notable are:\n\n• Revision public API ready;\n• Support for Hidden table rows;\n• Improved handling of Alternate content;\n• Different default style templates for 2003/2007 documents;\n• Significant improvement of table width handling;\n• Numerous improvements in TOC update. TOC now looks identical to MS Word in almost all test cases;\n• Child fields (including SET) located in the false argument of the IF field are not updated anymore (like MS Word does);\n• Nearly 30 improvements and bug fixes across AW model and flow formats.\n\nThis release introduces the features, enhancements, excptions and bug fixes as detailed below:\n\n• New features\n\nWORDSJAVA-19\tWORDSJAVA-499 Support signing produced PDF documents\nWORDSJAVA-499\tSupport digital signatures of documents on java.\nWORDSJAVA-538\tWORDSJAVA-499 Support encription of produced Pdf documents\nWORDSJAVA-589\tDo Font Fallback in Java as .Net does automatically\nWORDSJAVA-590\tMake Aspose.Words for Java interruptable using Thread.interrupt()\nWORDSNET-729\tAllow rejecting revisions\nWORDSNET-1636\tAdd feature to get the total count of the revisions for document and the author for each revision.\nWORDSNET-2523\tHidden table becomes visible when open/save the document in WML or DOCX format.\nWORDSNET-3300\tWarn user during load and save operations when document contains unsupported features.\nWORDSNET-3330\tConsider exposing formating revisions.\nWORDSNET-4184\tConsider making Aspose.Words Interruptible\nWORDSNET-5395\tTables overlap each other after rendering.\nWORDSNET-5869\tDocument Body is lost on open/save\nWORDSNET-6049\tImplement Load and Save warnings for RTF format\nWORDSNET-6190\tSupport comment localization\nWORDSNET-6199\tSupport HideMark for DOC.\nWORDSNET-6515\t/rtl/ Add support of rotated text in RTL table\nWORDSNET-6659\tGroupShape is moved in previous Page in PDF\n\n• Enhancements\n\nWORDSJAVA-453\trefine parsing indexed bitmaps with alpha\nWORDSJAVA-504\tWORDSJAVA-499 all digital signature tests should pass\nWORDSJAVA-537\tred and blue swapped in some pecular pictures with palette\nWORDSJAVA-546\tWORDSJAVA-499 Document.getDigitalSignatures needs to be cast before iteration\nWORDSJAVA-556\tRendering metafiles to bitmap needs in improved scaling to shape size.\nWORDSJAVA-565\tStackOverflowError while loading html with very big CSS style sheet\nWORDSJAVA-574\tTyped collection CustomXmlSchemaCollection needs in explicit casting for iteration\nWORDSJAVA-576\tWORDSJAVA-499 Conform the crypto library license\nWORDSNET-185\tSupport System.Drawing.Color.Transparent\nWORDSNET-3020\tExtra tabs are added after open/save document using AW.\nWORDSNET-5587\tTable inside cell Content wrapping/fitting problem\nWORDSNET-5701\tTable position is changed in exported PDF file\nWORDSNET-5732\tImage overlaps when converting DOCX to PDF\nWORDSNET-5943\tTable position is changed after appending one document to another\nWORDSNET-5976\tWhile converting dotx to doc, the actual style is not applied.\nWORDSNET-6414\tTable widths are calculated incorrectly in Fixed Page Formats\nWORDSNET-6420\tDoc to Pdf conversion issue with text alignment in table's cell\nWORDSNET-6541\tAspose.Word do not preserve table's row options on re-save the document\nWORDSNET-6544\t\"Indent from left\" of Table changes when saving to any format\nWORDSNET-6548\tOLE refactoring.\nWORDSNET-6559\tDoc to Pdf conversion issue with layout and page break\nWORDSNET-6567\tIncorrect line Y for line starting a page\nWORDSNET-6579\tUpdate the documentation for loading TXT format\nWORDSNET-6666\tAutomatically copy DLL to UEX for online docs\n\n• Regressions\n\nWORDSJAVA-450\tDocument is rendered out of page bounds during printing\nWORDSJAVA-563\tIndexed gray color model: image became bit more transparent after adding support of CLAMP WrapMode\nWORDSJAVA-578\tSync PalBitmap\n\n• Exceptions\n\nWORDSJAVA-575\tUncaught exception in headless environment\nWORDSJAVA-584\tFileCorruptedException occurs upon loading DOC generated by Office for MAC\nWORDSNET-5298\t/fieldvalidator + field with delete revision in footer/ InvalidOperationException occurs during rendering.\nWORDSNET-6305\tSetLicense throws error on IIS 7.5 when specifying decorated embedded resource name\nWORDSNET-6392\tAspose.Words.FileCorruptedException occurs upon loading RTF\nWORDSNET-6456\tArgumentOutOfRangeException occurs during simple mail merge\nWORDSNET-6465\t/rtl/ Exception when 2 Arabic letters represented by one glyph are contained in different runs\nWORDSNET-6503\tOutOfMemoryException occurs when calling doc.UpdateFields\nWORDSNET-6507\tLoading DOCX is throwing Aspose.Words.FileCorruptedException\nWORDSNET-6552\tNullReferenceException occurs during open/save DOCX\nWORDSNET-6571\tIndexOutOfRangeException occurs during converting to HTML/EPUB\nWORDSNET-6572\tArgumentOutOfRangeException occurs during converting to HTML/EPUB/PDF\nWORDSNET-6573\tsystem.io.endofstreamexception occurs during rendering Shape\nWORDSNET-6574\t/rtl/ ArgumentOutOfRangeException occurs during rendering Shape\nWORDSNET-6645\tIndexOutOfRangeException occurs during rendering DOC to PDF\n\n• Bugs\n\nWORDSJAVA-439\tLandscape pages are printed portrait using AsposeWordsPrintDocument\nWORDSJAVA-568\tSpare unrecognized char in RTL text\nWORDSJAVA-570\tTable renders out of the Page bounds during Printing\nWORDSJAVA-581\tOpacity doesn't work with palette\nWORDSJAVA-582\tHalf of image with indexed colormap disapiar\nWORDSJAVA-587\tDocument with 1-pixel indexed image when converted to pdf cause warning in Acrobat\nWORDSJAVA-593\tDrawingML is not rendering correctly in PDF\nWORDSNET-2881\tSaveDate Document property is updated improperly upon rendering.\nWORDSNET-3826\tHeading style is changed after processing DOCX document.\nWORDSNET-3838\tShape fill is wrong (DOC to PDF)\nWORDSNET-4031\tSpaces being replaced with Á for lte50261.ttf font\nWORDSNET-4036\tMS Word 2003 crashes upon opening DOC file produced by Aspose.Words.\nWORDSNET-4142\t/table grid/ Table layout is incorrect after rendering.\nWORDSNET-4608\tUriFormatException is thrown upon updating fields.\nWORDSNET-4779\tRoman page numbers shows as Arabic in TOC\nWORDSNET-4907\tFileCorruptedException occurs during loading RTF document.\nWORDSNET-4998\tLine color is changed during rendering.\nWORDSNET-5204\tTOC is incorrectly updated by Aspose.Words\nWORDSNET-5208\tAn unrecognizable character is shown after rendering text with \"Scottish Government Logo\" font.\nWORDSNET-5309\tBack slash is changed to ¥ after rendering.\nWORDSNET-5361\tShapeType BlockArc converted to NonPrimitive after open/save DOCX\nWORDSNET-5499\tTOC looks incorrect after update fields.\nWORDSNET-5526\tNumbers are flipped after converting RTL documents to HTML\nWORDSNET-5563\tSET field inside IF field is not updated properly.\nWORDSNET-5598\tInset and Outset LineStyle look the same.\nWORDSNET-5671\ta+b formula is calculated incorrectly in case b is negative\nWORDSNET-5777\tThrow Exception when load the document which contains digital signature\nWORDSNET-5787\tEMF image squashed vertically when render in Pdf format\nWORDSNET-5915\tWhile loading odt file, the document corrupted exception occur.\nWORDSNET-5978\tMail merge issue with IF statement containing SET\nWORDSNET-6016\tException while useing mail merge : Object reference not set to an instance of an object.\nWORDSNET-6046\tUpdateFields is not updating the TOC correctly\nWORDSNET-6115\tList Tab position is calculated incorrectly upon conversion\nWORDSNET-6248\tDocVariables are getting lost during loading DOCM file\nWORDSNET-6297\tGroupShape is not rendering correctly in PDF\nWORDSNET-6328\tWORDSNET-6297 Shape borders should not be rendered\nWORDSNET-6362\tTable cell width increases upon conversion/rendering\nWORDSNET-6363\tTable cell widths are significantly reduced upon conversion/rendering\nWORDSNET-6372\t/unicode normalization/ Doc to Pdf conversion issue with Vietnamese diacritics\nWORDSNET-6387\tDocx to PDF conversion issue with embedded equations\nWORDSNET-6408\tHTM to Doc conversion issue with image\nWORDSNET-6421\tStructuredDocumentTag.Clone is not truly duplicating the SDT.\nWORDSNET-6454\tFont language settings are lost when converting RTF to DOC\nWORDSNET-6458\tGetting Started and Programmer's Guide sections are missing in the offline CHM documentation\nWORDSNET-6492\tImprove accuracy of luminance effect algorithm\nWORDSNET-6510\tInformation lost while loading RTF file\nWORDSNET-6534\tDoc to Pdf conversion issue text is misplaced\nWORDSNET-6545\tAll Ask/Ref fields in document are being updated with last updated value\nWORDSNET-6547\tDoc to Pdf conversion issue with hyperlink to shared foder (\\\\naomi\\public)\nWORDSNET-6554\tDotted Tab Leaders in TOC are lost upon calling UpdateFields\nWORDSNET-6555\tIncorrect missing glyph font metrics leads to an extra page\nWORDSNET-6563\tRendering mail merge fields in header/footer shows code instead of value.\nWORDSNET-6569\tAfter appending document the included Excel OLE does not open correctly\nWORDSNET-6590\tDoc to PDF conversion issue with table border alignment\nWORDSNET-6599\tMetafile image is rendered incorrectly when saving to PDF/XPS\nWORDSNET-6613\tAll the content of linked document is not rendering to PDF\nWORDSNET-6638\tException throws while converting doc to pdf file\nWORDSNET-6646\t/table grid/ Table renders out of the right page bounds during rendering to PDF\nWORDSNET-6662\tException on loading ODT file",
  "requireLicenseAcceptance": true,
  "title": "Aspose.Words for .Net",
  "verbatimVersion": "11.6.0",
  "version": "11.6.0",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.21.06.27.16/aspose.words.11.6.0.json#Aspose.Words.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 4498,
      "fullName": "Aspose.Words.nuspec",
      "length": 10415,
      "name": "Aspose.Words.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.21.06.27.16/aspose.words.11.6.0.json#lib/net1.1/Aspose.Words.dll",
      "@type": "PackageEntry",
      "compressedLength": 4193880,
      "fullName": "lib/net1.1/Aspose.Words.dll",
      "length": 7090176,
      "name": "Aspose.Words.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.21.06.27.16/aspose.words.11.6.0.json#lib/net2.0/Aspose.Words.dll",
      "@type": "PackageEntry",
      "compressedLength": 4252772,
      "fullName": "lib/net2.0/Aspose.Words.dll",
      "length": 7289856,
      "name": "Aspose.Words.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.21.06.27.16/aspose.words.11.6.0.json#lib/net3.5/Aspose.Words.dll",
      "@type": "PackageEntry",
      "compressedLength": 4250980,
      "fullName": "lib/net3.5/Aspose.Words.dll",
      "length": 7288320,
      "name": "Aspose.Words.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.21.06.27.16/aspose.words.11.6.0.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9463,
      "fullName": ".signature.p7s",
      "length": 9463,
      "name": ".signature.p7s"
    }
  ],
  "tags": [
    "Aspose.Words",
    "DOC",
    "DOCX",
    "RTF",
    "HTML",
    "OpenDocument",
    "XPS",
    "EPUB",
    "Word",
    "Document",
    "Processing"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    }
  }
}