{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.29.01.08.54/free-imvu-accounts-with-credits-2022-v6748.1.1.8342.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "Free IMVU Accounts With Credits 2022",
  "catalog:commitId": "e0e6d5d1-99b5-44a6-8e48-b92aaf33cc26",
  "catalog:commitTimeStamp": "2022-01-29T01:08:54.5858477Z",
  "copyright": "Free IMVU Accounts With Credits 2022",
  "created": "2022-01-29T01:07:02.86Z",
  "description": "In the game you can make identifications and give them to your companions. They are an incredible method to communicate your symbol and its enjoyable to gather and offer them. Identifications can even assistance show your associations with companions or gatherings. You can likewise show your preferred identifications on your profile on the site.\n \n\nClick Here --> https://wikiredeem.com/imvu/\n\nClick Here --> https://wikiredeem.com/imvu/\n\nImvu Legends Credits Generator Hack, Youve gone to the right locale on my Imvu Legends web webpage for gamers endeavoring to discover loosened Credits. I should guarantee you that there could be no more excellent web webpage it truly is any such amazing Imvu Legends programmer generator like us. Our Imvu Legends Cheat Generator works having an over the top accomplishment cost, allowing you to get as a decent arrangement as 10,000 Credits without spending a dime immediately. Ive opened all things by means of Credits in Imvu Legends through my Imvu Legends site and now I wish to help other gamers get free Imvu Legends Credits. All you need to for the Imvu Legends Hack is a cell phone, an Imvu Legends record and Internet get section to.\n\n\nIMVU Hack Generator 2022 IMVU Credit Hack Generator Download IMVU Credit Generator 2022 IMVU AP Generator Download IMVU Credit Generator + VIP Hack IMVU Credits Generator V3 IMVU Credits Generator V3 591 IMVU Homepage Generator IMVU Credits Generator Hackdzillax IMVU Mobile Generator 2022 IMVU Credits Generator Online No Download 2022 IMVU Credits Generator Online No Survey IMVU Credit Generator 3.1 Download 2022 IMVU Online Generator No Survey IMVU Credits Generator Without Survey IMVU Credit Generator No Survey 2022 IMVU Profile Generator IMVU Credit Generator No Survey No Human Verification IMVU Credit Generator Without Offers IMVU Code Generator No Survey IMVU Credit Generator No Survey Online IMVU Money Generator No Survey IMVU Credits Generator 2022 IMVU Generator V4.9 IMVU Homepage Layout Generator IMVU Credit Generator Telecharger Gratuit IMVU Generator AndroID IMVU Generator APk 2022 IMVU Generator Activation Code IMVU Generator Free Credits 2022 IMVU Credit Generator Telecharger 2022 IMVU Friends\n\n\nWe accumulated GameTame.com to help all gamers in a manner where everybody is glad. We are teamed up with top progressions relationship to supply the most advantageous offers and blueprints. Precisely when you complete a review or offer, we get paid by them, and we use it to purchase the prizes and offer it to you. Plainly, we maintain a little benefit to keep the site running.\n\n\nIMVU works a free economy with a credit-based and limited time credit-based financial framework. These monetary standards are utilized to buy virtual in-game things. These things can incorporate pets, home embellishments, clubs, scenes, and style things like hair, apparel, calfskin, and different frill. On the off chance that the capacity of the game isnt surely known, the game can escape IMVU harmony rapidly. The best way to acquire these credits is to get them with genuine cash. On the off chance that you are searching for a compelling other option, your pursuit finishes here. With IMVU MOD Apk you get limitless credits (in-game money) and more free of charge. When the mod APK is introduced, everything in the game will be opened, regardless of whether its the shop, the outfit, the house, or the secret stock.\n\n\nIt is significant that most well known internet browsers have insignificant default limitations on the sort of substance that your children can discover and get to. However, there are some youngster agreeable programs that will just let your children access fitting substance. We will examine these in more detail later.\n\n\nClick Here --> https://wikiredeem.com/imvu/\n\nClick Here --> https://wikiredeem.com/imvu/\n\n        ",
  "iconFile": "icon.png",
  "id": "free-imvu-accounts-with-credits-2022-v6748",
  "isPrerelease": false,
  "Language": "English",
  "lastEdited": "2022-01-29T01:08:33.377Z",
  "listed": true,
  "packageHash": "CUNlr/RpE5GtzsrBel2iRNHkIn6L06iziGc/dZy0QK+/p3dJJGWkBljXDKCF+ho4FQXyBIw86j/jbPHSNc0bvA==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 43180,
  "projectUrl": "https://wikiredeem.com/imvu/",
  "published": "2022-01-29T01:07:02.86Z",
  "readmeFile": "README.md",
  "repositoryUrl": "https://wikiredeem.com/imvu/",
  "requireLicenseAcceptance": false,
  "summary": "Free IMVU Accounts With Credits 2022",
  "title": "Free IMVU Accounts With Credits 2022",
  "verbatimVersion": "1.1.8342",
  "version": "1.1.8342",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.29.01.08.54/free-imvu-accounts-with-credits-2022-v6748.1.1.8342.json#free-imvu-accounts-with-credits-2022.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1994,
      "fullName": "free-imvu-accounts-with-credits-2022.nuspec",
      "length": 4964,
      "name": "free-imvu-accounts-with-credits-2022.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.29.01.08.54/free-imvu-accounts-with-credits-2022-v6748.1.1.8342.json#icon.png",
      "@type": "PackageEntry",
      "compressedLength": 29987,
      "fullName": "icon.png",
      "length": 31050,
      "name": "icon.png"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.29.01.08.54/free-imvu-accounts-with-credits-2022-v6748.1.1.8342.json#README.md",
      "@type": "PackageEntry",
      "compressedLength": 1264,
      "fullName": "README.md",
      "length": 3236,
      "name": "README.md"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.29.01.08.54/free-imvu-accounts-with-credits-2022-v6748.1.1.8342.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9461,
      "fullName": ".signature.p7s",
      "length": 9461,
      "name": ".signature.p7s"
    }
  ],
  "tags": [
    "Free",
    "IMVU",
    "Accounts",
    "With",
    "Credits",
    "2022"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}