{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.10.00.36/_disney-magic-kingdoms-hack-working-2022-version-tsd.3.7.50.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "SharpCrafters s.r.o.",
  "catalog:commitId": "8e9a41eb-ebd6-4204-bb0d-f4b321955d5b",
  "catalog:commitTimeStamp": "2022-01-26T10:00:36.0768962Z",
  "created": "2022-01-26T09:58:17.783Z",
  "description": "# _Disney Magic Kingdoms hack Working 2022 Version tsd\n\n\nCLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; [http://3.bltadwin.ru/hack.php](http://3.bltadwin.ru/hack.php)\n\n\n- Disney Magic Kingdom Cheats HOW TO HACK DISNEY MAGIC KINGDOM CHEATS USING BEST TECHNOLOGY ON THE INTERNET Disney Magic Kingdoms Cheats is a a. Free update and sufficient storage space to install these Disney magic kingdom game apk hacks. All you have to do is: Firstly, click the download button given. Check out our Disney Magic Kingdoms cheats and enjoy those gems for free! Unlike Disney Magic Kingdoms mod apk, this tool will always add.\n\n## [CLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; http://3.bltadwin.ru/hack.php](http://3.bltadwin.ru/hack.php)\n\n · Disney Magic Kingdoms Hack Cheats - Hack unlimited GEMS A: It works virtually on any web browser as it is an online application. Click the button to claim your resources (Gems and Magic. To hack Disney Magic Kingdoms, simply input the Cheat Codes on your device. We found this woking exploit after doing so many experiments and. Disney Magic Kingdoms Unlimited Gems 😰 All My Characters In Disney Magic Kingdoms.  · Steps to follow for this Disney Magic Kingdoms Hack Online: 1 – Click on the “Access Online Generator” button available below to access our Disney Magic Kingdoms hack online page! 2 – If you are using an Android, iOS, Windows device enter your Disney Magic Kingdoms username and select your platform!\n\ndisney magic kingdoms hack without human verification, disney magic kingdoms hack no survey, disney magic kingdoms hack tool no verification, disney magic kingdoms hack tool, disney magic kingdoms hacks, disney magic kingdoms hack download, disney magic kingdoms hack no verification, disney magic kingdoms hack gems, disney magic kingdoms hack reddit, disney magic kingdom game hacks, disney magic kingdoms hack cydia, disney magic kingdom diamond hack, disney magic kingdoms hack tool download, disney magic kingdom hack apk download, disney magic kingdom hack game download, disney magic kingdom hack ios download, descargar disney magic kingdoms hack apk, disney magic kingdoms hack deutsch, disney magic kingdoms hack ios, disney magic kingdoms hack español, disney magic kingdoms free gems hack, disney magic kingdoms hack français, disney magic kingdom hacks, disney magic kingdom hack no human verification, how to hack disney magic kingdoms game, how to hack disney magic kingdoms, disney magic kingdom hack ios, disney magic kingdoms hack apk ios, disney magic kingdom hack java, disney magic kingdom juego hack, disney magic kingdoms cheat, disney magic kingdom hack mod apk download, disney magic kingdom hack mod apk, disney magic kingdoms mod hack, disney magic kingdom hack pc, descargar disney magic kingdom hack para pc, hack para disney magic kingdoms, r/disney magic kingdoms, disney magic kingdoms speed hack, télécharger disney magic kingdoms hack, disney magic kingdom hack without verification, disney magic kingdom hack windows 10, disney world magic kingdom hacks, hack disney magic kingdoms windows 10, disney magic kingdom hack 2021, disney magic kingdoms hacks 2020, disney magic kingdoms hack apk 2021, disney magic kingdom hack apk 2020, disney magic kingdoms hack 2019, descargar disney magic kingdoms hack apk 2019, what's coming to disney world in 2021, is disney world taking reservations for 2021, disney magic kingdoms game cheats",
  "id": "_Disney-Magic-Kingdoms-hack-Working-2022-Version-tsd",
  "isPrerelease": false,
  "language": "en-US",
  "lastEdited": "2022-01-26T10:00:20.117Z",
  "listed": true,
  "packageHash": "vQoTD6jjZHk9LIq6KY359YpO7xTW4hV+oYtq73jwlATgM+2ybR34VmJ93u92u7fwr80OpZoThUyXSa1oGVlUyQ==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 11427,
  "published": "2022-01-26T09:58:17.783Z",
  "requireLicenseAcceptance": false,
  "title": "_Disney-Magic-Kingdoms-hack-Working-2022-Version-tsd",
  "verbatimVersion": "3.7.50",
  "version": "3.7.50",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.10.00.36/_disney-magic-kingdoms-hack-working-2022-version-tsd.3.7.50.json#xmrjwagikg.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1296,
      "fullName": "xmrjwagikg.nuspec",
      "length": 3915,
      "name": "xmrjwagikg.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.10.00.36/_disney-magic-kingdoms-hack-working-2022-version-tsd.3.7.50.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9471,
      "fullName": ".signature.p7s",
      "length": 9471,
      "name": ".signature.p7s"
    }
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}