{
  "@id": "https://api.nuget.org/v3/catalog0/data/2016.03.24.08.05.01/spire.doc.5.3.71.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "E-iceblue",
  "catalog:commitId": "232097f0-a06a-4cc9-be52-74ef69bd4e9f",
  "catalog:commitTimeStamp": "2016-03-24T08:05:01.6476927Z",
  "copyright": "Copyright © 2015 e-iceblue. All Rights Reserved.",
  "created": "2015-03-23T07:37:29Z",
  "description": "Spire.Doc for .NET, specially designed for developers, enables to fast generate, open, write, edit and save Word document from Word Version 97-2003 to 2013. The featured function conversion enables developers to easily realize conversion between Word and other popular document formats such as Word to PDF/EPub/HTML/RTF/Image/XML etc.\n\nSpire.Doc for .NET is a totally independent .NET Word class library which doesn't require Microsoft Office installed on system. Microsoft Office Automation is proved to be unstable, slow and not scalable to produce MS Word documents. Spire.Doc for .NET is many times faster than Microsoft Word Automation and with much better stability and scalability. \n\nBy using Spire.Doc for .NET, users can save Word Doc/Docx to stream, save as web response and convert Word Doc/Docx to XML, RTF, EMF, TXT, XPS, EPUB, HTML and vice versa. Spire.Doc for .NET also supports to convert Word Doc/Docx to PDF and HTML to image. \n\nA common use of Spire.Doc for .NET is to create Word document dynamically from scratch. Almost all Word document elements are supported. Mainly includes page, sections, headers, footers, footnotes, paragraphs, lists, tables, text, fields, hyperlinks, bookmarks, comments, images, styles, background settings, printing features, document settings and protection. Furthermore, drawing objects including shapes, textboxes, images, OLE objects and controls are supported as well. \n\nSpire.Doc for .NET enables developers to process pre-existing Word documents. It supports search and replace function, alignment, page break, fill field, document concatenate, document copy, print, complex and deeply nested mail merge, etc.",
  "iconUrl": "http://www.e-iceblue.com/images/product_logo/product_buy/docnet.png",
  "id": "Spire.Doc",
  "isPrerelease": false,
  "language": "es-US",
  "lastEdited": "2016-03-24T08:04:49.73Z",
  "licenseNames": "",
  "licenseReportUrl": "",
  "licenseUrl": "http://www.e-iceblue.com/Knowledgebase/Licensing/License-Agreement.html",
  "listed": false,
  "packageHash": "sU+iHIEwRmt0lBnn6DNKNu6JdI3dYeg2PQbWeeijvyhkF0lSR/d+TehuANU91bL1sdGGY3y3+aZbk5iQTNbtMQ==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 31412539,
  "projectUrl": "http://www.e-iceblue.com/Introduce/word-for-net-introduce.html",
  "published": "1900-01-01T00:00:00Z",
  "releaseNotes": "Spire.Doc 5.3.71\nAdd new struct for PrivateFontPath that enables setting the path to font when convert word to PDF.\nFixes the issue where it failed to load some RTF files.\nFixes the issue where the output PDF is incorrect when converts some Word documents to PDF.\nFixes the issue where the IF field in the Word document updated wrong when convert Word document to PDF.\nFixes the issue that caused an exception happened when save Word to PDF.\nFixes the issue where the merged value displayed incorrect when mail merged.\nFixes the issue where the barcode font can't be embedded correctly to PDF when convert Word document to PDF.\nFixes the issue where it failed to convert some rtf to pdf.\nFixes the issue that caused the character before line break lost when saves to PDF after completing mail merge.\nFixed the issue where it failed to convert some .doc documents to PDF.\n\n\nSpire.Doc 5.3.46\nFix the issue that the image is magnified when merging two RTF files.\nFix the issue that \"Index was outside the bounds of the array\" when .docx to pdf conversion.\nFix the issue that the font isn't embedded correctly when .docx to PDF conversion.\nFix the issue that \"ArgumentOutOfRangeException\" when mail merging.\n\nSpire.Doc 5.3.38\nThe bold font that doesn't have bold is supported to embed into pdf when convert .docx to PDF.\nFix the issue that the symbol was lost when convert .docx to pdf.\nFix the issue that the filled content of Form Field lost when convert .docx to pdf.\nFix the issue that the result is incorrect when convert .docx to pdf.\nFix the issue that the result is incorrect when convert HTML to RTF.\nFix the issue that the result is incorrect when convert HTML to image.\nFix the issue that the TableOfContent(IDocument doc, string switches) method can't work.\nFix the issue that it can't extract text from some documents. \nFix the issue that 'Object reference not set to an instance of an object' when saving document to pdf.\n\n\nSpire.Doc 5.3.17\nFix the issue with GetPageCount method.\nFix the issue that 'Not a valid Win32 FileTime' when loading a .doc document.\nFix the issue that 'Nullable object must have a value' when loading a RTF document.\nFix the issue that some .docx documents can't be converted to PDF.\nFix the issue that the color of bullet and numbering is not correct when converting RTF to PDF/Image.\nFix the issue that the image color was incorrect when converting .docx to .docx.\nFix the issue that some contents in the result image lost when converting RTF to tiff.\nFix the issue that 'Object reference not set to an instance of an object' when saving document to stream.\n\nSpire.Doc 5.3.11\nFix the issue that table of content is not updated.\nFix the issue that table of content is updated incorrectly.\nFix the issue that spell check is not recognized in word document.\nFix the issue about clone section.\nFix the issue that after saving a document, the style name was changed in German MS Word.\nFix the issue that 'Error! Unknown document property name' when convert .doc to pdf.\nFix the issue that the location of log is incorrect when convert RTF to PDF.\nFix the issue that 'unable convert the system.DateTime type object to system.string type' when convert .doc to pdf.\nFix the issue that the checkbox is not checked when convert .doc to pdf.\nFix the issue that the Bullet symbol is lost when convert rtf to image/pdf.\nFix the issue that the wingdings font displays incorrectly when convert .doc/.docx to pdf.\n\n\nSpire.Doc V5.3.4\nFix the error 'Out of memory' when converting .doc file to PDF.\nFix the issue that the extra number list is added when converting .docx file to PDF.\nFix the issue that footnote is missing when convert RTF to Word.\nFix the error 'Html contains not wellformatted table' occurred when loading HTML file.\nFix the error 'Index was outside of the bounds of the array' when loading .doc file.\nFix the issue that macros in .doc file are not removed.\nFix the issue that the read value of custom property is incorrect.\n\nSpire.Doc V5.2.65\nFix the issue that the quality of images is low when converting .docx to pdf.\nFix the issue that there are extra quotes in converted pdf when converting .docx to pdf.\nFix the error \"Object reference not set to an instance of an object.\" when converting .docx to pdf.\nFix the issue that watermark is missing when converting RTF to PDF.\nFix the issue that left margin is cut off when converting .doc to HTML.\nFix the issue that the content controls in table are not parsed.\nFix the issue that the references are missing after mail-merge when using MailMerge.ExecuteWidthNestedRegion method for a document that has cross-references,\nFix the issue that field is not updated when filling data for if field.\nFix the issue that output .docx file has extra characters that when doc.IsUpdateFields = true;\nFix the issue that some fields in table are not updated when using MailMerge.ExecuteWidthNestedRegion method.\n\nSpire.Doc V5.2.48\nSpire.Doc supports to get alias, tag and id of content controls.\nSpire.Doc supports to get the count of all characters include space in document.\nFix the issue that some custom properties with different types (bool, int...), all properties types became string when loading document.\nFix the issue that when printing word document, it hanged and not returned.\nFix the issue that some text with font\"Frutiger\" was cut when converting word to PDF.\nFix the issue that the ProfID of the OLEObject (representing an embedded math type) was empty when converting .doc to .docx.\nFix the issue that the output lost all formatting when converting .dot document to RTF.\n\nSpire.Doc V5.2.40\nSpire.Doc starts to support justify low for alignment format of paragraph when saving to word document.\nFix the error \"Input string was not in a correct format.\" occurred when converting HTML to DOCX.\nFix the error \"ArgumentOutOfRangeException\" occurred by setting Document.IsUpdateFields = true; when saving to .docx file.\nFix the issue that word document is created with a rather large table 16 or more columns cannot be converted to PDF. \n\nSpire.Doc V5.2.29\n\nFix the issue that header formatting was mismatched between rtf document and converted pdf document.\nFix the issue that page break was not identified when converting html to pdf.\nFix the issue that characters overlap when converting word document to pdf document.\nFix the issue that the borders of table were lost when converting word document to pdf document.\nFix the issue that the accent characters were replaced by space characters when converting word document to images.\nFix the issue that characters overlap when converting word document to images.\nFix the error \"Input string was not in a correct format.\" When loading .docx document.",
  "requireLicenseAcceptance": true,
  "summary": "Spire.Doc for .NET is a professional and powerful .NET Word library to process a large range of Word tasks in C# and Visual Basic for .NET (2.0/3.5/4.0/4.0 ClientProfile/4.5)",
  "title": "Spire.Doc for .NET",
  "verbatimVersion": "5.3.71",
  "version": "5.3.71",
  "frameworkAssemblyGroup": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2016.03.24.08.05.01/spire.doc.5.3.71.json#frameworkassemblygroup/.netframework2.0",
      "assembly": "Spire.Doc",
      "targetFramework": ".NETFramework2.0"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2016.03.24.08.05.01/spire.doc.5.3.71.json#frameworkassemblygroup/.netframework3.5",
      "assembly": "Spire.Doc",
      "targetFramework": ".NETFramework3.5"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2016.03.24.08.05.01/spire.doc.5.3.71.json#frameworkassemblygroup/.netframework4.0",
      "assembly": "Spire.Doc",
      "targetFramework": ".NETFramework4.0"
    }
  ],
  "tags": [
    "words",
    "Word",
    "TEXT",
    "RTF",
    "doc",
    "docx",
    "PDF",
    "XPS",
    "HTML",
    "Image",
    "XTML",
    "word",
    "document",
    "EPUB"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    }
  }
}