{
  "@id": "https://api.nuget.org/v3/catalog0/data/2018.06.19.06.31.00/spire.pdf.3.8.173.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "Administrator",
  "catalog:commitId": "c1597936-d30b-4204-a60e-015c5cfcecc3",
  "catalog:commitTimeStamp": "2018-06-19T06:31:00.1574588Z",
  "copyright": "Copyright © 2017 e-iceblue. All Rights Reserved.",
  "created": "2017-02-07T08:19:43.36Z",
  "description": "Spire.PDF for .NET is a versatile PDF library that enables software developers to generate, edit, read and manipulate PDF files within their own .NET applications. As a standalone PDF component, Spire.PDF for .NET provides users an incredible wealth of features without installing Adobe Acrobat. This component is completely written in C#, but also supports VB.NET, Windows Forms and ASP.NET. \nWith the Spire.PDF for .NET API, you can get the ability to read PDF text and image even attachments with high efficiency. Even the special content such as language written from right to left can be extracted such as Herbrew and Arabic. Other basic features such as text, image, table, shapes, hyperlinks, bookmark, headings, footnotes, lists, form fields, pagination, booklet barcode, attachments, transparency, annotations, actions, overlay etc all work great for users. As for security, Spire.PDF for .NET enables you to protect your PDF files by passwords and digital signature.",
  "iconUrl": "http://www.e-iceblue.com/images/product_logo/product_buy/pdfnet.png",
  "id": "Spire.PDF",
  "isPrerelease": false,
  "language": "en-US",
  "lastEdited": "2018-06-19T06:30:45.727Z",
  "licenseUrl": "http://www.e-iceblue.com/Knowledgebase/Licensing/License-Agreement.html",
  "listed": false,
  "packageHash": "7dYUAOCHJXJk0GzuSsdOF1yYqsrc77yG9IkKegRUpa1LAJW+ME+A9cIVdXmebtat269KCn+/NyC7Uu5eEkb6CQ==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 26562698,
  "projectUrl": "http://www.e-iceblue.com/Introduce/pdf-for-net-introduce.html",
  "published": "1900-01-01T00:00:00Z",
  "releaseNotes": "Spire.PDF 3.8.173\n\nFixes the issue that caused the IndexOutOfRangeException when loading XPS file.\nFixes the issue that caused the watermark cannot be added into XPS file.\nFixes the issue that caused image missing when printing the PDF file.\nFixes the issue that caused wrong format when printing the PDF file.\nFixes the issue that caused some text missing when converting PDF to image.\nFixes the issue that caused wrong result when converting PDF to XPS.\nFixes the issue that the layer cannot be deleted.\nFixes the issue that caused ArgumentOutOfRangeException when merging PDF files.\nFixes the issue that caused incorrect result when use Grid.BeginPageLayout to create template.\nFixes the issue that caused wrong result when using spot color to draw line.\n\n\nSpire.PDF 3.8.158\nSupport to draw content with spot color.\nFixes the issue that caused the image lost when printing the PDF document.\nFixes the issue that badly formed dictionary next should be a name before 809.\nResolves the issue where creationDate and modificationDate about attachment in PDF were get incorrectly.\nFixes the issue where the watermark didn't work when loading XPS and adding a watermark to each page and then saving it as a Pdf.\n\n\nSpire.PDF 3.8.121\nSupport to link to a destination in attachment (\"GoToE\" action).\nSupport to create cloud markup.\nFixes the issue that caused wrong content when printing PDF.\nFixes the issue that caused IndexOutOfRangeException when converting PDF to image.\nFixes the issue that caused the layer blending wrong when converting PDF to image.\n    Fixes the issue that caused \"unknown segment in GBIG2 stream\" exception when converting PDF to image.\nFixes the issue that caused blank image when converting PDF to image.\nFixes the issue that caused incorrect bookmark when use Pdfdoc.InsertPage method.\nFixes the issue that caused content lost when loading PDF file.\nFixes the issue that caused some text is unable to be found.\nFixes the issue that caused NullReferenceException when gets PdfFormWidget.\n\n\nSpire.PDF 3.8.102\n\nFixes the issue where the Arabic text rendered incorrectly when converting XPS to PDF.\nFixes the issue that caused blank image when converting PDF to image.\nFixes the issue that caused blank bar while using the Windows 10 Reader app for opening the generated XPS file when converting from the PDF file format.\nFixes the issue where the half-width character lost when printing the PDF files.\n\n\nSpire.PDF 3.8.82\nSupports to get all certificates in the current signature.Fixes the issue that caused Form missing when converting PDF to image.\nFixes the issue that caused characters missing when printing the PDF file.\nFixes the issue that caused XmlException when accessing PdfDocument.Conformance.\n\nSpire.PDF 3.8.68\nSupports to maintain image with high quality when convert XPS to PDF.\nFixes the issue that caused characters missing when convert PDF to XPS.\nFixes the issue that caused wrong content when convert PDF to XPS.\nFixes the issue that caused dotted line wrong when convert PDF to image.\nFixes the issue that caused characters incorrect when convert PDF to image.\nFixes the issue that caused project hanging when convert PDF to image.\nFixes the issue that caused NullReferenceException when merge files.\nFixes the issue that caused StackOverflowException when merge files.\nFixes the issue that caused form field names unreadable.\nFixes the issue that caused InvalidOperationException when load the PDF document.\nFixes the issue that caused incorrect style when replace text on the PDF.\nFixes the issue that caused grid line missing when print the PDF file.\n\nSpire.PDF 3.8.45\nAdd new method to set the image of button field.\nFixes the issue where image in the PDF document was covered by a black hatch when print.\nFixes the issue that caused open type fonts to display incorrectly when print.\nFixes the issue that caused the content lost when print.\nResolves the issue that caused the exception that ContextColor /Resources/f856973e-951b-491c-ad5f-9fcff4b05a16.icc 1 is not a valid value for Int32 when load.\nFixes the issue that caused the error that badly formed dictionary next should be a name before 9406 when load.\nFixes the issue that caused the value of combox field got added repeatedly when debug.\nFixes the issue that caused InsertPageRange method got stuck.\nFixes the issue that caused accented characters lost when convert to XPS.\n\nSpire.PDF 3.8.22\n\nAdd new feature to convert XPS to PDF/A.\nSupports to set the Asia character in signature area.\nFixes the issue that caused the return value incorrect when use signature.VerifyDocModified() method.\nFixes the issue that caused the blank image when convert to IMG.\nImproves the quality of the image when convert XPS to PDF.\nResolves the issue that caused image lost when draw EMF image into PDF.\nFixes the issue that caused the field format value was null.\n\nSpire.PDF 3.8.8\nAdd new feature to convert PDF to SVG.\n\nFixes the issue that caused blank page when print the PDF.\nFixes the issue that caused the string disoriented when print PDF.\nFixes the issue that caused SaveChange warning information when open the document after filling the field.\nFixes the issue that caused page content missing when merge files.\nFixes the issue that caused InvalidCastException when close PDF object.\nFixes the issue that caused non-transparent region when convert XPS which has transparent region to PDF.\nFixes the issue that caused wrong alignment of field value when flat the field or set it ReadOnly.\nFixes the issue that caused exception when load the XPS file.\nFixes the issue where the color of shape was missing when convert XPS to PDF.\n\n\nSpire.PDF 3.7.330\n\nFixes the issue that caused multiple signatures invalid when sign a PDF document many times on X64 platform.\nFixes the issue that caused the code128B barcode generated using Spire.Pdf.Barcode was not getting scanned.\nFixes the issue where multiple styles were not applied when draw string using html tags.\n\n\nSpire.PDF 3.7.292\nNew Features:\nSpire.PDF adds new method to resize the watermark image and change its location.\nSpire.PDF adds new feature to get field by Export Value.\n\nBug solutions:\nImprove performance about converting PDF to image.\nFixes the issue that caused the characters displayed repeatedly when convert XPS to txt.\nFixes the issue that caused some content missing when convert PDF to XPS.\nFixes the issue that caused multiline property doesn't work in form field.\nFixes the issue that caused the exception when convert digitally signed PDF documents to PDF/A.\nFixes the issue that caused the exception when export barcode.\nFixes the issue that caused image missing and rotated when convert XPS to PDF.\nFixes the issue that caused wrong characters when print.\nFixes the issue that caused blank content when convert PDF to tiff.\nFixes the issue that caused digital signature missing when print.\nFixes the issue that caused different content after encryption.\nFixes the issue that the field cannot be filled.\nFixes the issue that caused the exception in different Non-Unicode program language when search text.\nFixes the issue that caused different PDF converted from XPS when DPI is different.\nFixes the issue that caused incorrect text when extract text from PDF.\n\n\nSpire.PDF 3.7.198 \n\nWe add new method to load the XPS file from stream, and add new properties to check if the document is encrypted. We also fixed the bugs in this version for the verification of signature, the issues of conversion from XPS to PDF, PDF to image and etc.\n\nNew features:\n\nSpire.PDF adds new method to load the XPS file from stream.\nAdd new feature to instantiate the PdfCertificate from a byte array with password.\nAdd new feature to check if the document is encrypted.\nAdd new method to convert HTML to PDF until the Html DOM load completely.\n\nBug solutions:\nFixes the issue that caused the verification of signature failed.\nFixes the issue that caused the exception when find the text that isn't included in the PDF document.\nFixes the issue that caused the error that string was not recognized as a valid DateTime.\nResolves the issue that caused the content shuffled/displaced when convert XPS to PDF.\nFixes the issue where wrong pdf pageSize was set when windows Display Setting bigger than 100% while converting XPS to PDF.\nFixes the issue that caused some objects were shuffled/displaced when convert PDF to Image.\nResolves the issue that caused the exception that Rectangle. \"{X=0,Y=0,Width=780,Height=0}\" width or height cannot be equal to zero when load HTML.\n\nSpire.PDF 3.7.91\nAdd the method to support to apply highlight of the searched text with unicode.\nFixes the issue that caused the output not readable when printing.\nFixes the issue that caused the non-English character lost when print.\nFixes the issue that caused garbled mess when print.\nFixes the issue that caused graphic draw incorrectly.\nResolves the issue where the comb field went away when fill the field and flatten comb fields.\nImprove the performance of extracting text.\nFixes the issue that caused Javascript not to run inside the pdf for the calculation.\n\nSpire.PDF 3.7\nFixes the issue that content is blank when printing PDF.\nFixes the issue that multi pages are printed into one page when printing PDF.\nFixes the issue that text color changes when converting PDF to Images.\nFixes the issue that signature size becomes larger when converting PDF to Images.\nFixes the issue that content is changed when converting PDF to Text.\nFixes the issue that converted xps file cannot be opened by Adobe Reader when converting PDF to XPS.\nFixes the issue that barcode location is changed when converting XPS to PDF.\n\n\nSpire.PDF 3.6.260\n\nAdd the new feature to change the font size of a labeled digital sign.\nFixes the issue that caused the exception when convert PDF to Image.\nFixes the issue that caused the color incorrect when convert PDF to Image.\nFixes the issue that caused the exception when load PDF document.\nResolves the issue that caused the Argumentexception when replace the image in PDF document.\nFixes the issue that caused content lost when print a PDF document.\nFixes the issue that caused NullReferenceException when use InsertPageRange method.\nResolves the issue that caused InvalidOperationException when saving merged PDF.\nFixes the issue where pdf version can't be changed.\nFixes the issue where text was extracted incorrectly with ExtractText method.",
  "requireLicenseAcceptance": false,
  "summary": "This package is designed to introduce developers a .NET PDF application Spire.PDF for .NET. This PDF application enables users to create, read, edit and maniplate PDF files with high efficiency.",
  "title": "Spire.PDF for .NET",
  "verbatimVersion": "3.8.173",
  "version": "3.8.173",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.06.19.06.31.00/spire.pdf.3.8.173.json#Spire.PDF.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 3739,
      "fullName": "Spire.PDF.nuspec",
      "length": 12621,
      "name": "Spire.PDF.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.06.19.06.31.00/spire.pdf.3.8.173.json#lib/net20/Spire.License.dll",
      "@type": "PackageEntry",
      "compressedLength": 23180,
      "fullName": "lib/net20/Spire.License.dll",
      "length": 55296,
      "name": "Spire.License.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.06.19.06.31.00/spire.pdf.3.8.173.json#lib/net20/Spire.License.xml",
      "@type": "PackageEntry",
      "compressedLength": 870,
      "fullName": "lib/net20/Spire.License.xml",
      "length": 4674,
      "name": "Spire.License.xml"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.06.19.06.31.00/spire.pdf.3.8.173.json#lib/net20/Spire.Pdf.dll",
      "@type": "PackageEntry",
      "compressedLength": 6505044,
      "fullName": "lib/net20/Spire.Pdf.dll",
      "length": 15376384,
      "name": "Spire.Pdf.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.06.19.06.31.00/spire.pdf.3.8.173.json#lib/net20/Spire.Pdf.XML",
      "@type": "PackageEntry",
      "compressedLength": 123744,
      "fullName": "lib/net20/Spire.Pdf.XML",
      "length": 1156363,
      "name": "Spire.Pdf.XML"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.06.19.06.31.00/spire.pdf.3.8.173.json#lib/net35/Spire.License.dll",
      "@type": "PackageEntry",
      "compressedLength": 23088,
      "fullName": "lib/net35/Spire.License.dll",
      "length": 55296,
      "name": "Spire.License.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.06.19.06.31.00/spire.pdf.3.8.173.json#lib/net35/Spire.License.xml",
      "@type": "PackageEntry",
      "compressedLength": 870,
      "fullName": "lib/net35/Spire.License.xml",
      "length": 4674,
      "name": "Spire.License.xml"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.06.19.06.31.00/spire.pdf.3.8.173.json#lib/net35/Spire.Pdf.dll",
      "@type": "PackageEntry",
      "compressedLength": 6493459,
      "fullName": "lib/net35/Spire.Pdf.dll",
      "length": 15376384,
      "name": "Spire.Pdf.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.06.19.06.31.00/spire.pdf.3.8.173.json#lib/net35/Spire.Pdf.XML",
      "@type": "PackageEntry",
      "compressedLength": 123744,
      "fullName": "lib/net35/Spire.Pdf.XML",
      "length": 1156363,
      "name": "Spire.Pdf.XML"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.06.19.06.31.00/spire.pdf.3.8.173.json#lib/net40/Spire.License.dll",
      "@type": "PackageEntry",
      "compressedLength": 23446,
      "fullName": "lib/net40/Spire.License.dll",
      "length": 55808,
      "name": "Spire.License.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.06.19.06.31.00/spire.pdf.3.8.173.json#lib/net40/Spire.License.xml",
      "@type": "PackageEntry",
      "compressedLength": 870,
      "fullName": "lib/net40/Spire.License.xml",
      "length": 4674,
      "name": "Spire.License.xml"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.06.19.06.31.00/spire.pdf.3.8.173.json#lib/net40/Spire.Pdf.dll",
      "@type": "PackageEntry",
      "compressedLength": 6503959,
      "fullName": "lib/net40/Spire.Pdf.dll",
      "length": 15396864,
      "name": "Spire.Pdf.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.06.19.06.31.00/spire.pdf.3.8.173.json#lib/net40/Spire.Pdf.XML",
      "@type": "PackageEntry",
      "compressedLength": 123744,
      "fullName": "lib/net40/Spire.Pdf.XML",
      "length": 1156363,
      "name": "Spire.Pdf.XML"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.06.19.06.31.00/spire.pdf.3.8.173.json#lib/net40-client/Spire.License.dll",
      "@type": "PackageEntry",
      "compressedLength": 23333,
      "fullName": "lib/net40-client/Spire.License.dll",
      "length": 55808,
      "name": "Spire.License.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.06.19.06.31.00/spire.pdf.3.8.173.json#lib/net40-client/Spire.License.xml",
      "@type": "PackageEntry",
      "compressedLength": 870,
      "fullName": "lib/net40-client/Spire.License.xml",
      "length": 4674,
      "name": "Spire.License.xml"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.06.19.06.31.00/spire.pdf.3.8.173.json#lib/net40-client/Spire.Pdf.dll",
      "@type": "PackageEntry",
      "compressedLength": 6459377,
      "fullName": "lib/net40-client/Spire.Pdf.dll",
      "length": 15306752,
      "name": "Spire.Pdf.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.06.19.06.31.00/spire.pdf.3.8.173.json#lib/net40-client/Spire.Pdf.XML",
      "@type": "PackageEntry",
      "compressedLength": 123518,
      "fullName": "lib/net40-client/Spire.Pdf.XML",
      "length": 1155120,
      "name": "Spire.Pdf.XML"
    }
  ],
  "tags": [
    "PDF",
    "application",
    "library",
    "component",
    "control",
    "to",
    "XPS",
    "Image",
    "HTML",
    "PDF/A"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    }
  }
}