{
  "@id": "https://api.nuget.org/v3/catalog0/data/2017.07.06.13.15.50/aspose.words.17.7.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "Aspose",
  "catalog:commitId": "c12360aa-e44b-46b1-be93-1607005bd08d",
  "catalog:commitTimeStamp": "2017-07-06T13:15:50.4197591Z",
  "copyright": "(C) Aspose 2002-2017. All Rights Reserved.",
  "created": "2017-07-06T13:14:09.19Z",
  "description": "Aspose.Words for .NET is a class library for .NET that enables you to perform a wide range of document processing tasks directly within your .NET applications.",
  "iconUrl": "https://joomla-aspose.dynabic.com/templates/aspose/App_Themes/V3/images/words/272x272/aspose_words-for-net.png",
  "id": "Aspose.Words",
  "isPrerelease": false,
  "lastEdited": "0001-01-01T00:00:00Z",
  "licenseUrl": "http://www.aspose.com/corporate/purchase/end-user-license-agreement.aspx",
  "listed": true,
  "packageHash": "SnPScEaHUJecCzTDdLW9iRQriy7bpBZmO5sBhaBlPjyGkReDhqkJfsfcx5r19geQ+K0Mj4ynpZcvm5+6vALyqQ==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 23073285,
  "projectUrl": "http://www.aspose.com/categories/.net-components/aspose.words-for-.net/default.aspx",
  "published": "2017-07-06T13:14:09.19Z",
  "releaseNotes": "Aspose.Words for .NET 17.7 Release Notes\n\nMajor Features\n\nThere are 88 improvements and fixes in this regular monthly release. The most notable are:\n•\tRendering into PCL format (Printer Command Language) was implemented. New saving format introduced – “SaveFormat.Pcl”. Please note that custom fonts is not yet supported.\n•\tThe proper algorithm for rendering of shapes with automatic size textboxes (i.e. closest to MS Word output) implemented.\n•\tThe rendered PDF documents can now show the document title in the title bar of the viewer. This is controlled by “PdfSaveOptions.DisplayDocTitle” property.\n•\tImproved font rendering in PDF documents for Adobe Illustrator limitations.\n•\tImproved rendering of fonts with simulated bold style.\n•\tVertical text rendering in DrawingML textboxes improved.\n•\tProblem with rendering of numbers on horizontal axis in DrawingML Charts fixed.\n•\tImplemented support for \"Wrap trailing spaces to next line\" option.\n•\tImplemented support for footnote continuation notices.\n•\tImproved text wrapping logic for \"2013 and later\" documents.\n•\tImproved non-breaking space width calculation.\n•\tImproved Asian text justification logic.\n\nFull List of Issues Covering all Changes in this Release\n\nKey\tSummary\tCategory\nWORDSNET-10407\tA Table is moved from middle of page to the top in PDF\tBug\nWORDSNET-10598\t/table grid/ Table's layout get corrupted after conversion from Docx to Pdf\tBug\nWORDSNET-10963\tTable's position is changed after conversion from Docx to Pdf\tBug\nWORDSNET-10964\tDocx to Pdf conversion issue with shape position\tBug\nWORDSNET-11256\tTextboxes partially render beyond right edge of page in PDF\tBug\nWORDSNET-11611\t/wrap trailing spaces to next line compat option/ Spaces from the start of second line of Paragraph are lost in PDF\tBug\nWORDSNET-12651\t/footnotes + continuation notice/Text flows to the previous page (Doc to Pdf conversion)\tBug\nWORDSNET-13989\tGroupShape does not render correctly in Pdf\tBug\nWORDSNET-14239\tDocument.Compare generates extra revisions\tBug\nWORDSNET-14631\tDoc to Pdf conversion issue with GroupShape\tBug\nWORDSNET-14797\tCompare works incorrectly since 16.10 version\tBug\nWORDSNET-14844\t/footnotes+continuation notice/Docx to fixed page format conversion issue with text position\tBug\nWORDSNET-14876\tIssue with HTML to Word Conversion - Textarea Border\tBug\nWORDSNET-14930\tNumber index in Word gets changed after converting from html (DOCX-HTML-DOCX roundtrip)\tBug\nWORDSNET-15045\t/footnotes+continuation notice/Page is broken incorrectly if last paragraph on page is divided on two pages\tBug\nWORDSNET-15100\tAspose.Words incorrectly works with font family lists in HTML import.\tBug\nWORDSNET-15241\tDocument.Compare generates unnecessary delete and insert revisions for table\tBug\nWORDSNET-15251\tGetChildNodes returns extra nodes\tBug\nWORDSNET-15281\tSuperscript and subscript are lost in output HTML and PDF\tBug\nWORDSNET-15305\tTable cell RTL text alignment issue\tBug\nWORDSNET-15308\tDocx to Pdf conversion issue with image's rendering\tBug\nWORDSNET-15313\tTable text is splitting into two lines\tBug\nWORDSNET-15330\tDocument.Compare generates extra revisions\tBug\nWORDSNET-15349\tShape is flipped after conversion from Docx to Pdf\tBug\nWORDSNET-15362\t/text wrap/ Formatting issue with floating paragraph\tBug\nWORDSNET-15369\t/wrap trailing spaces/ Some lines are pushed from page bottom to next page in resultant PDF\tBug\nWORDSNET-15404\tDocument.UpdateFields does not update the formula field\tBug\nWORDSNET-15405\tSystem.InvalidCastException is thrown while saving DOCX to PDF\tBug\nWORDSNET-15413\tScale of charts is changed in resultant PDF\tBug\nWORDSNET-15421\tSub-divisions appear on the x-axis in resultant PNG\tBug\nWORDSNET-15423\tDocumentBuilder.Write writes the text with incorrect font after moving the cursor to bookmark\tBug\nWORDSNET-15426\tDOCX to ODT conversion issue with shape's gradient fill color\tBug\nWORDSNET-15436\tSymbols are changed after conversion from DOCX to PDF\tBug\nWORDSNET-15443\tRendering issue of Vertical text of SmartArt\tBug\nWORDSNET-15444\tDOCX to HTML conversion generates blank images\tBug\nWORDSNET-15455\tNumber index in Word gets changed after converting from html (DOCX-HTML-DOCX roundtrip)\tBug\nWORDSNET-15460\tChart's X-Axis is not rendered correctly in output PDF\tBug\nWORDSNET-15461\tChart's plot area is not rendered correctly in output PDF\tBug\nWORDSNET-15464\tDocx to PDF conversion issue with text alignment\tBug\nWORDSNET-15470\tMirror Margin issue in DOCX to PDF rendering\tBug\nWORDSNET-15477\tNames of MatchCase and FindWholeWordsOnly properties in FindReplaceOptions looks incorrect\tBug\nWORDSNET-15480\tSpaces between words lost in rendered Image\tBug\nWORDSNET-15487\tShape's position and size is changed in output PDF\tBug\nWORDSNET-15488\tDocx to PDF conversion issue with shape's rendering\tBug\nWORDSNET-15489\tDocx to PDF conversion issue with shape's rendering\tBug\nWORDSNET-15492\tShape's text is not rendered in output PDF\tBug\nWORDSNET-15493\tDOCX to PDF conversion issue with Shape's rendering\tBug\nWORDSNET-15494\tText of shape is truncated in output PDF\tBug\nWORDSNET-15495\tText of shape is truncated in output PDF\tBug\nWORDSNET-15502\tCorrupt output DOCX when using Aspose to save MS Word document containing SmartArt\tBug\nWORDSNET-15504\tDefault value of Shape.AspectRatioLocked is incorrect\tBug\nWORDSNET-15534\tChart's X and Y axis are changed in output PDF\tBug\nWORDSNET-15537\tCompare documents returns an 'System.InvalidOperationException' when document contains contains private use Unicode characters\tBug\nWORDSNET-15543\tIncorrect shape size when margins are wider than width in shape properties\tBug\nWORDSNET-15546\tDOC to PDF produces output with disturbed formatting.\tBug\nWORDSNET-5279\t/footnotes+continuation notice/Some endnotes are moved to previous page\tBug\nWORDSNET-5581\tTextBox content layout is shifted.\tBug\nWORDSNET-8940\t/table grid/ Text renders outside the right page edge in PDF\tBug\nWORDSNET-14801\tA Picture moves towards the top page edge in PDF\tEnhancement\nWORDSNET-15262\tDOCX to PDF conversion issue with shape's text when it is opened in Adobe Illustrator CC 2017\tEnhancement\nWORDSNET-15416\tImprove comparison of language attributes\tEnhancement\nWORDSNET-15428\tImprove cell formatting comparison. #2\tEnhancement\nWORDSNET-15447\tImprove row comparsion. #3\tEnhancement\nWORDSNET-15544\tIncorrect oval shape width/height for shape with word wrap off, auto-fit on\tEnhancement\nWORDSNET-14410\tAspose.Words.FileCorruptedException is thrown while loading RTF\tException\nWORDSNET-14683\tAspose.Words.FileCorruptedException occurs upon loading a MHT\tException\nWORDSNET-15103\tInvalidOperationException occured while re-saving RTF to DOC\tException\nWORDSNET-15263\tDOC to PDF conversion throws InvalidOperationException\tException\nWORDSNET-15466\tDocument.GetPageInfo throws exception \"This operation requires the node to be inside the main document\"\tException\nWORDSNET-15468\tDocument.GetPageInfo throws exception \"This operation requires the node to be inside the main document\"\tException\nWORDSNET-15498\tGetStartPageIndex method of LayoutCollector throws NullReferenceException\tException\nWORDSNET-15499\tDOCX conversion is throwing IOException\tException\nWORDSNET-15513\tAspose.Words.FileCorruptedException occurs upone loading a DOCX\tException\nWORDSNET-15522\tConversion RTF to PDF failing during the source file loading.\tException\nWORDSNET-13968\tExport \"border\" attribute in output Html\tFeature\nWORDSNET-14186\tWrite revisions for MathML objects in HTML Export for HtmlOfficeMathOutputMode.MathML mode\tFeature\nWORDSNET-14190\tMake the title of the generated documents show up in title bar , when opened in Acrobat reader\tFeature\nWORDSNET-14290\tSupport Structured Document Tag edit revisions (customXmlDelRangeStart/customXmlDelRangeEnd)\tFeature\nWORDSNET-14539\tProvide separate method to remove unused styles only\tFeature\nWORDSNET-15144\tObtain correct horizontal alignment of image\tFeature\nWORDSNET-15296\tSupport AUTOTEXT and GLOSSARY fields\tFeature\nWORDSNET-1814\tPreserve cross-references during converting to HTML\tFeature\nWORDSNET-6118\tSupport rendering document to PCL\tFeature\nWORDSNET-14223\tHangs on loading the MHTML document\tPerformance\nWORDSNET-15435\tShape rendering issue in resultant PDF\tRegression\nWORDSNET-15514\tException on SetLicence with the 17.6 version on Mono over Linux\tRegression\nWORDSNET-15528\tNumeric format is broken after performing mail merge\tRegression\nWORDSNET-15529\tException using Reflection in 17.6\tRegression",
  "requireLicenseAcceptance": true,
  "title": "Aspose.Words for .NET",
  "verbatimVersion": "17.7",
  "version": "17.7.0",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2017.07.06.13.15.50/aspose.words.17.7.0.json#Aspose.Words.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 3525,
      "fullName": "Aspose.Words.nuspec",
      "length": 9540,
      "name": "Aspose.Words.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2017.07.06.13.15.50/aspose.words.17.7.0.json#lib/net20/Aspose.Words.dll",
      "@type": "PackageEntry",
      "compressedLength": 5541393,
      "fullName": "lib/net20/Aspose.Words.dll",
      "length": 12211712,
      "name": "Aspose.Words.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2017.07.06.13.15.50/aspose.words.17.7.0.json#lib/net20/Aspose.Words.xml",
      "@type": "PackageEntry",
      "compressedLength": 225533,
      "fullName": "lib/net20/Aspose.Words.xml",
      "length": 1644315,
      "name": "Aspose.Words.xml"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2017.07.06.13.15.50/aspose.words.17.7.0.json#lib/net35-client/Aspose.Words.dll",
      "@type": "PackageEntry",
      "compressedLength": 5541822,
      "fullName": "lib/net35-client/Aspose.Words.dll",
      "length": 12210176,
      "name": "Aspose.Words.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2017.07.06.13.15.50/aspose.words.17.7.0.json#lib/net35-client/Aspose.Words.xml",
      "@type": "PackageEntry",
      "compressedLength": 225344,
      "fullName": "lib/net35-client/Aspose.Words.xml",
      "length": 1643223,
      "name": "Aspose.Words.xml"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2017.07.06.13.15.50/aspose.words.17.7.0.json#lib/net40/Aspose.Words.dll",
      "@type": "PackageEntry",
      "compressedLength": 5541576,
      "fullName": "lib/net40/Aspose.Words.dll",
      "length": 12212736,
      "name": "Aspose.Words.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2017.07.06.13.15.50/aspose.words.17.7.0.json#lib/net40/Aspose.Words.xml",
      "@type": "PackageEntry",
      "compressedLength": 225533,
      "fullName": "lib/net40/Aspose.Words.xml",
      "length": 1644315,
      "name": "Aspose.Words.xml"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2017.07.06.13.15.50/aspose.words.17.7.0.json#lib/net40-client/Aspose.Words.dll",
      "@type": "PackageEntry",
      "compressedLength": 5539477,
      "fullName": "lib/net40-client/Aspose.Words.dll",
      "length": 12203520,
      "name": "Aspose.Words.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2017.07.06.13.15.50/aspose.words.17.7.0.json#lib/net40-client/Aspose.Words.xml",
      "@type": "PackageEntry",
      "compressedLength": 225344,
      "fullName": "lib/net40-client/Aspose.Words.xml",
      "length": 1643223,
      "name": "Aspose.Words.xml"
    }
  ],
  "tags": [
    "Word",
    "DOC",
    "DOCX",
    "OOXML",
    "OpenDocument",
    "PDF",
    "XPS",
    "ODT",
    "HTML",
    "XHTML",
    "WordprocessingML",
    "Document",
    "EPUB"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    }
  }
}