{
  "@id": "https://api.nuget.org/v3/catalog0/data/2015.02.03.06.39.26/microsoft.data.odata.5.4.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "Microsoft Corporation",
  "catalog:commitId": "5596d2bd-88bc-428e-927b-375f309fcbce",
  "catalog:commitTimeStamp": "2015-02-03T06:39:26.1446464Z",
  "created": "2013-04-02T22:17:18.677Z",
  "description": "Classes to serialize, deserialize and validate OData payloads. Enables construction of OData producers and consumers.\n\nTargets .NET 4.0 or Silverlight 4.0.\nLocalized for CHS, CHT, DEU, ESN, FRA, ITA, JPN, KOR and RUS.",
  "iconUrl": "http://static.tumblr.com/hgchgxz/9ualgdf98/icon.png",
  "id": "Microsoft.Data.OData",
  "isPrerelease": false,
  "lastEdited": "0001-01-01T00:00:00Z",
  "licenseUrl": "http://go.microsoft.com/?linkid=9809688",
  "packageHash": "uw/VGAg4EEmh0wtNVDRrFktp9Pdrya3fYg1hVPfsNArdl1qMJuPCxrvDI9/XfJNzW2gcsM7MWMj0XncbTSH6gA==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 1814395,
  "projectUrl": "http://go.microsoft.com/fwlink/?LinkId=220868",
  "published": "2013-04-02T22:17:18.817Z",
  "releaseNotes": "------------------------------New Features------------------------------\n\nClient deserialization/serialization hooks\n\nWe have a number of investments planned in the “request pipeline” area. In 5.4.0 we have a very big set of hooks for reaching into and modifying data as it is being read from or written to the wire format. These hooks provide extensibility points that enable a number of different scenarios such as modifying wire types, property names, and more.\n\nInstance annotations on atom payloads\n\nAs promised in the 5.3.0 release notes, we now support instance annotations on Atom payloads. Instance annotations are an extensibility feature in OData feeds that allow OData requests and responses to be marked up with annotations that target feeds, single entities (entries), properties, etc. We do still have some more work to do in this area, such as the ability to annotate properties.\n\nClient consumption of instance annotations\n\nAlso in this release, we have added APIs to the client to enable the reading of instance annotations on the wire. These APIs make use of the new deserialization/serialization pipelines on the client (see above). This API surface includes the ability to indicate which instance annotations the client cares about via the Prefer header. This will streamline the responses from OData services that honor the odata.include-annotations preference.\n\nSimplified transition between Atom and JSON formats\n\nIn this release we have bundled a few less-noticeable features that should simplify the transition between the Atom and (the new) JSON format. (See also the bug fixes below on type resolver fixes.)\n\n------------------------------Bug fixes------------------------------\n\nIn addition to the features above, we have included fixes for the following notable bugs:\n- Fixes an issue where reading a collection of complex values would fail if the new JSON format was used and a type resolver was not provided\n- Fixes an issue where ODataLib was not escaping literal values in IDs and edit links\n- Fixes an issue where requesting the service document with application/json;odata=nometadata would fail\n- Fixes an issue where using the new JSON format without a type resolver would create issues with derived types\n- (Usability bug) Makes it easier to track the current item in ODataLib in many situations\n- Fixes an issue where the LINQ provider on the client would produce $filter instead of a key expression for derived types with composite keys\n- (Usability bug) Fixes an issue where the inability to set EntityState and ETag values forced people to detach and attach entities for some operations\n- Fixes an issue where some headers required a case-sensitive match on the WCF DS client\n- Fixes an issue where 304 responses were sending back more headers than appropriate per the HTTP spec\n- Fixes an issue where a request for the new JSON format could result in an error that used the Atom format\n- Fixes an issue where it was possible to write an annotation value that was invalid according to the term\n- Fixes an issue where PATCH requests for OData v1/v2 payloads would return a 500 error rather than 405",
  "requireLicenseAcceptance": true,
  "title": "ODataLib",
  "version": "5.4.0",
  "dependencyGroups": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2015.02.03.06.39.26/microsoft.data.odata.5.4.0.json#dependencygroup",
      "@type": "PackageDependencyGroup",
      "dependencies": [
        {
          "@id": "https://api.nuget.org/v3/catalog0/data/2015.02.03.06.39.26/microsoft.data.odata.5.4.0.json#dependencygroup/system.spatial",
          "@type": "PackageDependency",
          "id": "System.Spatial",
          "range": "[5.4.0, 5.4.0]"
        },
        {
          "@id": "https://api.nuget.org/v3/catalog0/data/2015.02.03.06.39.26/microsoft.data.odata.5.4.0.json#dependencygroup/microsoft.data.edm",
          "@type": "PackageDependency",
          "id": "Microsoft.Data.Edm",
          "range": "[5.4.0, 5.4.0]"
        }
      ]
    }
  ],
  "tags": [
    "wcf",
    "data",
    "services",
    "odata",
    "odatalib",
    "edmlib",
    "spatial",
    "ado.net",
    "ef",
    "entity",
    "framework",
    "open",
    "protocol",
    "wcfds",
    "wcfdataservices",
    "dataservices"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    }
  }
}