{
  "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.21.06.26.24/aspose.words.13.1.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "Aspose",
  "catalog:commitId": "32164588-a09f-4a2f-9f46-4cf6ccd05226",
  "catalog:commitTimeStamp": "2018-10-21T06:26:24.045129Z",
  "copyright": "© Aspose 2002-2011. All Rights Reserved.",
  "created": "2013-02-03T18:27:07.477Z",
  "description": "Aspose.Words for .NET class library supports DOC, DOCX, RTF, HTML, OpenDocument, PDF, XPS, EPUB and other formats. With Aspose.Words you can generate, modify, convert, render and print documents without utilizing Microsoft Word®",
  "iconUrl": "http://www.aspose.com/images/products/dotnet/Aspose.Words_128x128.png",
  "id": "Aspose.Words",
  "isPrerelease": false,
  "lastEdited": "2018-10-21T06:26:17.75Z",
  "licenseUrl": "http://www.aspose.com/corporate/purchase/end-user-license-agreement.aspx",
  "listed": true,
  "packageHash": "h9fre59Gm0JBPbOhdBrwrE0KSelOomvMUlTOZ8X3zC5/U0XqicHwtzrQwqRQB2qNb2RktjpM97/un6JssqFFQA==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 10040932,
  "projectUrl": "http://www.aspose.com/categories/.net-components/aspose.words-for-.net/default.aspx",
  "published": "2013-02-03T18:27:07.477Z",
  "releaseNotes": "There are 120 improvements and fixes in this regular monthly release. The most notable are:\n\n• Extended public API for working with fields in the document.\n• Added public API to find on which page a particular document element is laid out.\n• Layout performance improved by at least 10%.\n• Improvements to layout of nested objects and tables.\n• Improvements to rendering of special RTL characters and content of SDT tags.\n• Added support for binary OLE objects in OpenDocument (ODT) documents.\n• LISTNUM, AUTONUM and similar numbering fields are supported when rendering.\n• Import of SVG images in HTML is supported.\n• DrawingML line caps are rendered.\n• DrawingML Chart custom axis title rotation and other features are rendered.\n\nThis release introduces the new features, enhancements and fixes to the excptions/bugs as detailed below:\n\n• New features\n\nWORDSJAVA-599\tSupport in java .Net-style number formats like \",0.00\".\nWORDSNET-2096\tAdd \"text:table-of-content\" import/export\nWORDSNET-2902\tConsider exposing pagination information for document elements.\nWORDSNET-2978\tConsider exposing layout information of nodes.\nWORDSNET-5155\tSupport SVG in HTML\nWORDSNET-6565\timg.border is ignored when loading HTML\nWORDSNET-7036\tRework FORMCHECKBOX rendering.\nWORDSNET-7219\tSupport custom axis titles rotation angle\nWORDSNET-7235\tArrows inside the DML are missing in PDF\nWORDSNET-7254\tProvide Lockheed Martin with a feature they want (native Page Finder implementation)\nWORDSNET-7352\tImplement public FieldCollection\nWORDSNET-7378\tProvide a Warning during layout of documents with hyphenation\nWORDSNET-7431\tTable borders are not rendering at the very bottom edge of Page in Pdf\nWORDSNET-7476\tAngle of Arrow Shape is lost in output documents\nWORDSNET-7503\tHanging punctuation is not applied to header\nWORDSNET-7518\tProvide events in the API similar to those provided by Word.Application and Word.Document classes\nWORDSNET-7598\tSwfSaveOptions- Add an option to prevent printing of SWF file\nWORDSNET-7676\tSupport import of images from HTML using embed, object and iframe tags\nWORDSNET-7684\tSupport binary OLE objects (<draw:object-ole>) in ODT\n\n• Enhancements\n\nWORDSJAVA-517\tColor shift when saving CMYK image with inconsistent metadata to Pdf.\nWORDSJAVA-583\tColors shifted due \"inconsistent metadata\" in CMYK/YCCK image\nWORDSNET-2099\tBottom or top margins are wrong when the header or footer height is not set and calculated automatically\nWORDSNET-2180\t/listnum/ AUTONUM fields are missed during Rendering/Converting to PDF\nWORDSNET-3953\tAUTONUMLGL fields are missed during Rendering/Converting to PDF\nWORDSNET-5960\tText alignment in RTL document is not preserved when converting to HTML\nWORDSNET-7002\t/listnum/ List numbering is incorrect in PDF (LISTNUM fields)\nWORDSNET-7037\t/listnum/ Docx to PDF conversion Numbering issue\nWORDSNET-7185\t/listnum/ AUTONUM fields are getting lost when rendering to PDF\nWORDSNET-7344\tA shading overlaps a line above\nWORDSNET-7429\tFix error occurs during perspective projection\nWORDSNET-7432\tDML images are shifted down vertically from their expected position in Pdf\nWORDSNET-7453\tFontSettings.DefaultFontName do not work while rendering PDF/XPS\nWORDSNET-7483\tStyles.AddCopy break the link between paragraph/character styles\nWORDSNET-7514\tA Normal Table overlaps a floating Table in PDF\nWORDSNET-7539\tDoc to RTF conversion issue with TC fields\nWORDSNET-7543\tUnicode control characters become visible in PDF and TIFF files\nWORDSNET-7553\tFix incorrect pattern fill of 3D objects\nWORDSNET-7565\tSupport checkbox color rendering\nWORDSNET-7570\tSystem.InvalidOperationException : XPS file <file> does not conform\nWORDSNET-7574\tIncorrect encoding is used while loading TXT file.\nWORDSNET-7607\tPercent sign (%) is located incorrectly in RTL text\nWORDSNET-7621\tSilverlight Pdf vierwers do not display chinese text in Pdf\nWORDSNET-7659\tPerform fallback to GDI+ rendering for EMF EMR_ALPHABLEND record\nWORDSNET-7666\tQuotation marks are not preserved during importing HTML into DOM\nWORDSNET-7675\tAnalysis of a new version of HTML Agility Pack library\nWORDSNET-7693\tRemove support for .NET Framework 1.1 from the installer and documentation\n\n• Exceptions\n\nWORDSNET-5858\tNullReferenceException occurs on saving RTF with Footnotes to Fixed Page Formats\nWORDSNET-7597\tNullReferenceException occurs during rendering to fixed page formats\nWORDSNET-7611\tInvalidCastException occurs during exporting DOCX to HTML\nWORDSNET-7639\tAspose.Words.FileCorruptedException occurs when loading a WordML/Docx\nWORDSNET-7642\tException while loading WordML file into Aspose.Words.Document\nWORDSNET-7643\tAspose.Words.FileCorruptedException occurs when loading a WordML\nWORDSNET-7645\tSystem.Xml.XmlException during loading Doc into DOM\nWORDSNET-7647\tAspose.Words.FileCorruptedException occurs when loading XML file\nWORDSNET-7650\tAspose.Words.FileCorruptedException occurs when loading a WordML\n\n• Bugs\n\nWORDSJAVA-572\tbuilder.insertHtml() issue with bullet points appear as hollow square under linux.\nWORDSJAVA-595\tYet another color shift when saving CMYK image with 'inconsistent metadata' to PDF\nWORDSJAVA-616\tMicrosoft Japanese font lost from EMF metafile during saving a DOC to HTML under Linux/Ubuntu.\nWORDSJAVA-639\tfonts in formula not rendered correctly when converting docx to pdf on Linux\nWORDSJAVA-664\tNumber formatting issue with BigDecimal.value and Double.value\nWORDSJAVA-668\tRTL text becomes gibberish when rendering to TIFF/JPEG\nWORDSJAVA-670\tImages in DOCX are rendered to TIFF as black and white images.\nWORDSJAVA-671\tAspose.Words produces a black and white TIFF\nWORDSJAVA-675\tUnderlined RTL text is dissapiar.\nWORDSNET-7384\tDocument.Save method do not save the Shape correctly\nWORDSNET-7385\tParagraphs with bullet list do not export correctly in Fixed File Format\nWORDSNET-7386\tDocx to Fixed file format conversion issue with bullets position\nWORDSNET-7390\t/IF spacing issue/ UpdateFields doesn't update the value of IF field after MailMerge\nWORDSNET-7391\tDocx to PDF conversion issue with text rendering\nWORDSNET-7407\tThe Chart's axis values are different after conversion from Docx to PDF\nWORDSNET-7408\tData Lable '1' is not displayed fully in PDF as displayed in input doc\nWORDSNET-7415\tExecuteWithRegions turns a mustache region into a normal TableStart/TableEnd region\nWORDSNET-7421\tRemoveEmptyParagraphs does not remove empty Paragraphs left by Mustache regions\nWORDSNET-7435\tDML line AutoShape is positioned incorrectly in Pdf\nWORDSNET-7439\tDocx can not be opened in MS Word 2010 after saving it from Aspose.Words.\nWORDSNET-7450\tShapes are not preserved during open/save FlatOpc\nWORDSNET-7460\tShape is not visible when appending documents\nWORDSNET-7486\tShape gradient fill is rendered incorrectly\nWORDSNET-7509\tHistory of tracked formatting changes is lost after conversion from RTF to Docx\nWORDSNET-7515\tOnline Pdf Repair Tool reports a corruption in Pdf that is produced by Aspose.Words\nWORDSNET-7517\tNumber formatting is incorrect in Dutch culture.\nWORDSNET-7520\tGetChildDataSource gets incorrectly called during processing MERGEFIELDs with Object.Attribute\nWORDSNET-7524\tA rotated DML is positioned incorrectly in PDF\nWORDSNET-7530\tCheckbox rendering issue while conversion from Doc to PDF\nWORDSNET-7531\tUnexpected characters appear in the RTF produced by Aspose.Words\nWORDSNET-7533\tTwo Paragraph should display on single line during Doc to Rtf cnversion\nWORDSNET-7535\tCustom numbering template has wrong characters in Rtf\nWORDSNET-7537\tDocx to RTF conversion issue with page number format\nWORDSNET-7542\tVertical borders disappear after saving to docx\nWORDSNET-7576\tDocx to PDF conversion issue while using Aspose.Words with Parallel.ForEach\nWORDSNET-7577\tShape is moved towards the left page edge in fixed page formats\nWORDSNET-7578\tInsertCell throws NullReferenceException when inserting first cell in new Row\nWORDSNET-7579\tArabic (RTL) text is rendering incorrectly to Pdf\nWORDSNET-7580\tArabic (RTL) text is rendering incorrectly to Pdf\nWORDSNET-7581\tArabic (RTL) text is rendering incorrectly to Pdf\nWORDSNET-7583\tTable border is lost during rendering a Docx to Pdf\nWORDSNET-7585\tUnicode zero width space character (\\u200B) is not rendering correctly in PDF\nWORDSNET-7590\tAspose.Words produces a corrupt XPS file.\nWORDSNET-7600\tSystem.InvalidOperationException occurs when calling License.SetLicense\nWORDSNET-7608\tContents of <body> are getting lost during open/save\nWORDSNET-7610\tStyleCollection.AddCopy change NextParagraphStyleName value and add w:next\nWORDSNET-7613\tMS Word 2010 crashes when DrawingML docPr Id is negative.\nWORDSNET-7614\t/IF spacing issue/ Conditional field without a space do not show mail merge value\nWORDSNET-7616\tDocument.UpdateFields do not update the TOC field correctly\nWORDSNET-7618\tAppending Documents with Pictures causes corrupt output Docx\nWORDSNET-7623\tUpdateFields doesn't insert text from a URL starting with HTTP\nWORDSNET-7624\tPassword for AllowOnlyFormFields protection becomes invalid when importing Sections\nWORDSNET-7635\tDocx crashes when DrawingML docPr Id is negative.\nWORDSNET-7641\tSecurity Alert - WordML to Doc conversion issue\nWORDSNET-7648\tExtra columns are added after conversion from HTML to DOC\nWORDSNET-7653\tDashstyle attribute of v:stroke is not preserved in fixed page formats\nWORDSNET-7658\tList formatting is lost after conversion to HTML\nWORDSNET-7669\tGradient brush transforms incorrectly\nWORDSNET-7680\tImporting a Section twice corrupts Docx document\n\n• Performance\n\nWORDSNET-7620\tExtract a calculation of RunPr for Node from a loop by DocumentRunSplitter\nWORDSNET-7661\tMove calculation of Font from LayoutSpan.Font to new method in class LprSpan",
  "requireLicenseAcceptance": true,
  "title": "Aspose.Words for .Net",
  "verbatimVersion": "13.1.0",
  "version": "13.1.0",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.21.06.26.24/aspose.words.13.1.0.json#Aspose.Words.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 4548,
      "fullName": "Aspose.Words.nuspec",
      "length": 10806,
      "name": "Aspose.Words.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.21.06.26.24/aspose.words.13.1.0.json#lib/net2.0/Aspose.Words.dll",
      "@type": "PackageEntry",
      "compressedLength": 5012470,
      "fullName": "lib/net2.0/Aspose.Words.dll",
      "length": 8712192,
      "name": "Aspose.Words.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.21.06.26.24/aspose.words.13.1.0.json#lib/net3.5/Aspose.Words.dll",
      "@type": "PackageEntry",
      "compressedLength": 5011636,
      "fullName": "lib/net3.5/Aspose.Words.dll",
      "length": 8710656,
      "name": "Aspose.Words.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.21.06.26.24/aspose.words.13.1.0.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9462,
      "fullName": ".signature.p7s",
      "length": 9462,
      "name": ".signature.p7s"
    }
  ],
  "tags": [
    "Aspose.Words",
    "DOC",
    "DOCX",
    "RTF",
    "HTML",
    "OpenDocument",
    "XPS",
    "EPUB",
    "Word",
    "Document",
    "Processing"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    }
  }
}