{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.18.20.18.42/garena.free.fire.mod.apk.download.america.7.2.8.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "GAMES",
  "catalog:commitId": "a5d7b7d5-df04-494c-8eab-9cc4fd4f8ff0",
  "catalog:commitTimeStamp": "2022-01-18T20:18:42.4248662Z",
  "created": "2022-01-17T19:53:43.017Z",
  "description": "Free Fire Hack App Unlimited Diamonds   [AMERICA]\nCLICK HERE >>> https://gamemasters.xyz/FREEFIRE\n\nCLICK HERE >>> https://gamemasters.xyz/FREEFIRE\n\n+++++++++++++++ Free Fire diamond hack ++++++++++++++++++++++\n\nFree Fire diamond hack : free fire hack diamond Free Fire Diamond Hack Generator Free Fire is the ultimate survival shooter game available on mobile. Each 10-minute game places you on a remote island where you are pit against 49 other players, all seeking survival.\n\nPlayers freely choose their starting point with their parachute and aim to stay in the safe zone for as long as possible. Drive vehicles to explore the vast map, hide in trenches, or become invisible by proning under grass. Ambush, snipe, survive, there is only one goal: to survive and answer the call of duty.\n\nDo Want to get more Garena Free Fire diamonds? You’ve come to the right place. This valuable currency allows you to purchase the wide variety of cosmetics on offer, allowing you to show off your prowess (or how much you’ve spent) during matches. You can get fancy character outfits, individual items of clothing, vehicles, weapons, and more. Some of them even glow. Nice.\n\nWhile you can earn the odd Garena Free Fire diamond for free, it’s not easy, and the amount you earn is often far lower than from other sources, like just outright purchasing it. It’s usually limited to events though. We will include a small section on how to achieve this, but really our guide is more interested in maximising the efficiency with which you collect diamonds by spending money, as it’s not overly-expensive.\n\nGarena Free Fire redeem codes for January 14, 2022: Free Fire is one of the most played and downloaded battle royale games in the world. In order to compete with its competitors and to gain more players, the game provides in-game items, diamonds, rewards and much more and that too for free. Garena Free Fire rolls out codes using which players can get free rewards daily. The active codes for Friday have been released and gamers should redeem them before its expiry. Players can redeem the codes online by visiting the official Garena Free Fire redemption website at https://gamesapp.pro/freefirediamond\n\nIt can be noted that Garena Free Fire players will not be able to redeem rewards with guest accounts. In order to receive the rewards and redeem the codes you may have to bind your account to Facebook or VK. For the uninitiated, a single redemption code has 12 characters, consisting of capital letters and numbers. If you want to know which code contains what reward you will have to go to the vault tab in the game lobby. Gold or diamonds will add to the account wallet automatically. The game also keeps on organising events for the players.\n\nGarena Free Fire events Garena Free Fire has informed that players can now get exclusive Free Fire x Spacespeakers Limited Edition costume bundle as the Spacespeakers Royale is here. The costume can be availed between January 13 and January 19, 2022. \"Survivors! It's time to jazz up your look in Free Fire as the Spacespeakers Royale is here! Get the exclusive Free Fire x Spacespeakers Limited Edition costume bundle now and dominate the battlefield in style,\" Free Fire India tweeted.\n\narena Free Fire redeem codes for January 14, 2022: How to get the codes Step 1: Visit the official Garena Free Fire code redemption official website at https://gamemasters.xyz/FREEFIRE Step 2: Now, login with either your Facebook, Apple, Google, Twitter, HUAWEI or VK ID. Step 3: Copy any of the above mentioned 12 character long redeem codes and paste them into the text box. Step 4: You will have a dialogue box for double-checking. Tap on 'OK'. Step 5: And that's it! Your redemption code process has been successfully completed. However, if the redemption bid fails, you will be informed by an Email. Also, you have to wait for about 24 hours for your rewards to become active on your gadget.",
  "id": "Garena.Free.Fire.MOD.APK.DOWNLOAD.AMERICA",
  "isPrerelease": false,
  "lastEdited": "2022-01-18T20:11:42.933Z",
  "listed": false,
  "packageHash": "7c4MzWZdgJQv7lgiYRAjuJiNOuCl9BzsPh7QUj6YG5rwrSacAShCmYKnqKfSI1ma90mPIMeCHjcR4NnJdzBqpw==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 20713,
  "published": "1900-01-01T00:00:00Z",
  "requireLicenseAcceptance": false,
  "verbatimVersion": "7.2.8",
  "version": "7.2.8",
  "dependencyGroups": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.18.20.18.42/garena.free.fire.mod.apk.download.america.7.2.8.json#dependencygroup/.netcoreapp3.0",
      "@type": "PackageDependencyGroup",
      "targetFramework": ".NETCoreApp3.0"
    }
  ],
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.18.20.18.42/garena.free.fire.mod.apk.download.america.7.2.8.json#Garena.Free.Fire.MOD.APK.DOWNLOAD.AMERICA.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 2085,
      "fullName": "Garena.Free.Fire.MOD.APK.DOWNLOAD.AMERICA.nuspec",
      "length": 4467,
      "name": "Garena.Free.Fire.MOD.APK.DOWNLOAD.AMERICA.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.18.20.18.42/garena.free.fire.mod.apk.download.america.7.2.8.json#lib/netcoreapp3.0/FREE-FIRE-SS4.dll",
      "@type": "PackageEntry",
      "compressedLength": 5553,
      "fullName": "lib/netcoreapp3.0/FREE-FIRE-SS4.dll",
      "length": 15872,
      "name": "FREE-FIRE-SS4.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.18.20.18.42/garena.free.fire.mod.apk.download.america.7.2.8.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9464,
      "fullName": ".signature.p7s",
      "length": 9464,
      "name": ".signature.p7s"
    }
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}