{
  "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.21.06.17.55/aspose.words.17.11.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "Aspose",
  "catalog:commitId": "dd66ab15-b6da-42f0-aa39-e6258d927dda",
  "catalog:commitTimeStamp": "2018-10-21T06:17:55.6799719Z",
  "copyright": "(C) Aspose 2002-2017. All Rights Reserved.",
  "created": "2017-11-15T06:15:33.83Z",
  "description": "Aspose.Words for .NET is a class library for .NET that enables you to perform a wide range of document processing tasks directly within your .NET applications.",
  "iconUrl": "https://joomla-aspose.dynabic.com/templates/aspose/App_Themes/V3/images/words/272x272/aspose_words-for-net.png",
  "id": "Aspose.Words",
  "isPrerelease": false,
  "lastEdited": "2018-10-21T06:17:47.277Z",
  "licenseUrl": "http://www.aspose.com/corporate/purchase/end-user-license-agreement.aspx",
  "listed": true,
  "packageHash": "+iiDbgaKauHHUhlLgBSfTkaRAUvfTB/439IiANhhk469OuGH4gUdgWgdG7A87zuO/DLatDccBVeiflfd+q0R7A==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 23352830,
  "projectUrl": "https://www.aspose.com/products/words/net",
  "published": "2017-11-15T06:15:33.83Z",
  "releaseNotes": "Aspose.Words for .NET 17.11 Release Notes\n\nMajor Features\n\nThere are 102 improvements and fixes in this regular monthly release. The most notable are:\n•\tLINQ Reporting Engine supports dynamic shape background coloring.\n•\tImproved optional hyphen handling and fixed related infinite loop issue.\n•\tImproved floating table re-breaking in specific scenarios where content of a table used to be lost outside of a page.\n•\tImproved table grid computation when cells contain tab characters.\n•\tFurther improved character spacing control handling.\n•\tPCL documents rendering improved. UCS-2 symbol sets can now be mapped to the printer built-in fonts – it allows to print non-ascii symbols with built-in fonts if supported by printer.\n•\tA ‘cosmetic’ pen (i.e. pen with fixed 1-pixel width) rendering improved in metafile output documents.\n•\tFont metrics calculation affecting the vertical positioning of text for GDI+ output rendering improved.\n•\tAdded fallback for strokes with unsupported binary raster operations in metafile rendering.\n•\tGamma-correction flag is now taken into account while rendering metafiles brushes.\n•\tMetafile warnings improved:\n        Added warnings for unsupported binary raster operations.\n        Removed warnings about unsupported metafile records which do not affect the output.\n\nFull List of Issues Covering all Changes in this Release\n\nKey\tSummary\tCategory\nWORDSNET-10454\tContents move down to the page after conversion from Docx to Pdf\tBug\nWORDSNET-10455\tPosition of table's rows is changed after conversion from Docx to Pdf\tBug\nWORDSNET-12453\tTable truncates in PDF - only one page in rendered\tBug\nWORDSNET-12489\tFont changed in saved .rtf document\tBug\nWORDSNET-12908\tTable on edge of page is mangled in PDF\tBug\nWORDSNET-13313\tMultipage table content cutting off on transforming Word to PDF\tBug\nWORDSNET-13594\tBlank pages appear in generated ODT\tBug\nWORDSNET-13744\t/character spacing control/ Chinese text moves to next line after conversion from Doc to HtmlFixed\tBug\nWORDSNET-13930\tRow's contents are truncated after conversion from Docx to Pdf\tBug\nWORDSNET-13931\tRow's contents are truncated after conversion from Docx to Pdf\tBug\nWORDSNET-14119\tDocx to Pdf conversion issue with table's rendering\tBug\nWORDSNET-14120\tCell's contents are truncated at the bottom of page in output Pdf\tBug\nWORDSNET-14252\tTable's cells are completely lost after re-saving Odt\tBug\nWORDSNET-14340\tHtml save as Odt - tables display incorrectly\tBug\nWORDSNET-14885\tDistance between list item marker and text increases after saving to HTML\tBug\nWORDSNET-14927\t\"DOCX to WML\" conversion result has wrong output.\tBug\nWORDSNET-15108\tDOCX to PDF conversion losing pages\tBug\nWORDSNET-15137\tIncorrect table/page layout // DOCX to PDFA: some text is missing in resultant PDFA document\tBug\nWORDSNET-15147\tTOC paragraph spacing difference in Aspose.Words and MS Word\tBug\nWORDSNET-15205\tMS Word 2016 shows page number incorrectly in status bar after saving RTF To DOCX\tBug\nWORDSNET-15414\tFormatting issue in PDF printing\tBug\nWORDSNET-15551\tProcess hangs during rendering DOCX to PDF\tBug\nWORDSNET-15660\t/character spacing control/ Position of line break changes in rendered document\tBug\nWORDSNET-15720\tDOCX to PDF conversion issue with Khmer text\tBug\nWORDSNET-15721\tText is wrapped to next line in table after conversion from DOCX to PDF\tBug\nWORDSNET-15748\tImages are overlapped after conversion from DOCX to HtmlFixed\tBug\nWORDSNET-15788\tList label values are incorrect after joining documents\tBug\nWORDSNET-15806\tDOCX to PDF conversion issue with SmartArt rendering\tBug\nWORDSNET-15827\tDOCX to PNG conversion issue with text formatting\tBug\nWORDSNET-15853\tDOCX to Image conversion issue with text formatting\tBug\nWORDSNET-15859\tGreek letter µ converted to M when DOCX saved as PDF\tBug\nWORDSNET-15862\tText overlaps on header row border in resultant Image\tBug\nWORDSNET-15863\tDOCX to Image conversion issue with content position\tBug\nWORDSNET-15864\tDOCX to PNG conversion issue with text position inside text-box\tBug\nWORDSNET-15876\tFont color issue in PDF rendering\tBug\nWORDSNET-15877\tHighlighted text issue in Rendered PDF\tBug\nWORDSNET-15887\t/character spacing control/ Incorrect line wrapping in a callout text box\tBug\nWORDSNET-15888\tAspose.Words generated PCL document is not printing\tBug\nWORDSNET-15889\tBlank Output Produced when Trying to Skip Images or CssStyleSheet during HTML Load\tBug\nWORDSNET-15894\tUTF8 encoding Text to PDF rendering issue\tBug\nWORDSNET-15901\tDOCX to PDF conversion issue with font of chart's title\tBug\nWORDSNET-15913\t/infinite loop/ DOCX with formatting symbol can't convert to PDF\tBug\nWORDSNET-15914\tWhen DOCX is saved as PDF, gradient becomes different.\tBug\nWORDSNET-15917\tImage quality not preserved when saving DOCX to HTML\tBug\nWORDSNET-15927\tDOCX to PDF conversion issue with chart's rendering\tBug\nWORDSNET-15930\tAdjacent faces of the bevel have different normals in the shared vertices\tBug\nWORDSNET-15950\tIncorrect TOC numbers and index\tBug\nWORDSNET-15957\tRendering issue of Chinese number list\tBug\nWORDSNET-15960\tDo not read LineSpacing when its Value part is not specified.\tBug\nWORDSNET-15964\tIncorrect exception on password protected document\tBug\nWORDSNET-15973\tMailMergeCleanupOptions.RemoveStaticFields updates the FileName field codes incorrectly\tBug\nWORDSNET-15976\tDocument.UpdateFields does not update the TOC field\tBug\nWORDSNET-15977\tDocx to Pdf conversion issue with chart legend items\tBug\nWORDSNET-15978\tEmpty PieChart rendering issue\tBug\nWORDSNET-15983\tVML shape fill is lost upon saving to DOCX\tBug\nWORDSNET-16031\tStrange behavior of the text parts in table cells after Mail Merge\tBug\nWORDSNET-16036\tShape changed during DOC to DOCX conversion\tBug\nWORDSNET-16056\tSupport text kerning for ODT\tBug\nWORDSNET-6624\tExtra amount of spacing is added between characters in a word\tBug\nWORDSNET-7040\tFont changes from Arial to Times new Roman during importing nodes\tBug\nWORDSNET-13098\tApplying simple textures (such as Color, Gradient, Picture, etc.) for 3D shapes (hardware rendering)\tEnhancement\nWORDSNET-14901\tIssue when loading HTML with incorrect namespace declarations\tEnhancement\nWORDSNET-14948\tIncorrect table position in DOM API and resultant HTML\tEnhancement\nWORDSNET-15616\tTo set file name and extension when inserting ole object using MemoryStream\tEnhancement\nWORDSNET-15903\tSupport to evaluate IF condition\tEnhancement\nWORDSNET-15915\tShading.BackgroundPatternColor returns incorrect value after updating Theme color\tEnhancement\nWORDSNET-15967\tDemo code of Page Splitter has to be simplified and reviewed.\tEnhancement\nWORDSNET-15750\tTemporary license implementation issue\tException\nWORDSNET-15824\tAcceptAllRevisions method thorws InvalidOperationException\tException\nWORDSNET-15916\tLoading Mhtml file into API is throwing Exception\tException\nWORDSNET-15949\tMetadata embedding into a document fails when saving\tException\nWORDSNET-15953\tSystem.InvalidOperationException throws StructuredDocumentTag.PlaceholderName\tException\nWORDSNET-15966\tDocumentBuilder.InsertHtml throws System.NullReferenceException when HTML is inserted in table's cell\tException\nWORDSNET-15975\tDOCX to DOC conversion throws InvalidOperationException\tException\nWORDSNET-15980\tAppending document is throwing NullReferenceException\tException\nWORDSNET-16014\tCalling UpdatePageLayout method throwing exception\tException\nWORDSNET-16016\tSystem.InvalidOperationException is thrown while saving DOC to RTF\tException\nWORDSNET-16029\tAppending RTF documents is throwing NullReferenceException\tException\nWORDSNET-16039\tShading formatting of cloned Cell throws NullReferenceException\tException\nWORDSNET-13709\tTable width is changed after conversion from Docx to Pdf.\tFeature\nWORDSNET-14360\tAdd feature to include all styles in Resources\\AllStyles2007.docx from StyleIdentifier Enum\tFeature\nWORDSNET-14653\tShifted text in a document after conversion from MS Word to PDF\tFeature\nWORDSNET-14722\tWhen DOCX is saved as PDF, table columns have incorrect width\tFeature\nWORDSNET-14970\tAdd feature to fill shape (text-box) color in Linq Reporting Engine\tFeature\nWORDSNET-15358\tBuilt-in styles in MSW 2013 are different than in MSW 2007.\tFeature\nWORDSNET-15624\tProvide method that returns Text in the same order as we see in MS Word, Google Docs, LibreOffice etc\tFeature\nWORDSNET-15739\tApplying a radial gradient fill (hardware rendering).\tFeature\nWORDSNET-15740\tApplying a rectangular gradient fill (hardware rendering).\tFeature\nWORDSNET-15885\tImplement support of transform for radial gradient fill (hardware rendering).\tFeature\nWORDSNET-15893\tTOC line spacing is changed in PDF output.\tFeature\nWORDSNET-15900\tEmpty table appears in ouput PDF\tFeature\nWORDSNET-15981\tGet position of floating table in public API\tFeature\nWORDSNET-7575\t/revision marks/ Support revision marks upon rendering\tFeature\nWORDSNET-9453\tShape gets overlapped due to its incorrect position\tFeature\nWORDSNET-15746\t/performance/ Support to load document partially in DOM\tPerformance\nWORDSNET-15910\t/infinite loop/ Performance issue with Document.PageCount\tPerformance\nWORDSNET-14087\tIncorrect table width on page 144\tRegression\nWORDSNET-14088\tDocument.UpdateFields does not update page field\tRegression\nWORDSNET-15971\tHebrew text conversion issue in DOCX to MHTML\tRegression\nWORDSNET-16024\tIFieldMergingCallback.FieldMerging is not called when mail merge field is inside DISPLAYBARCODE field\tRegression\nWORDSNET-8531\tField.Update method return incorrect value for Page field\tRegression\nWORDSNET-9149\tMailMerge.Execute takes very long time to complete\tRegression",
  "requireLicenseAcceptance": true,
  "title": "Aspose.Words for .NET",
  "verbatimVersion": "17.11",
  "version": "17.11.0",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.21.06.17.55/aspose.words.17.11.0.json#Aspose.Words.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 3957,
      "fullName": "Aspose.Words.nuspec",
      "length": 10611,
      "name": "Aspose.Words.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.21.06.17.55/aspose.words.17.11.0.json#lib/net20/Aspose.Words.dll",
      "@type": "PackageEntry",
      "compressedLength": 5603978,
      "fullName": "lib/net20/Aspose.Words.dll",
      "length": 12348928,
      "name": "Aspose.Words.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.21.06.17.55/aspose.words.17.11.0.json#lib/net20/Aspose.Words.xml",
      "@type": "PackageEntry",
      "compressedLength": 230380,
      "fullName": "lib/net20/Aspose.Words.xml",
      "length": 1668736,
      "name": "Aspose.Words.xml"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.21.06.17.55/aspose.words.17.11.0.json#lib/net35-client/Aspose.Words.dll",
      "@type": "PackageEntry",
      "compressedLength": 5603291,
      "fullName": "lib/net35-client/Aspose.Words.dll",
      "length": 12339712,
      "name": "Aspose.Words.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.21.06.17.55/aspose.words.17.11.0.json#lib/net35-client/Aspose.Words.xml",
      "@type": "PackageEntry",
      "compressedLength": 230194,
      "fullName": "lib/net35-client/Aspose.Words.xml",
      "length": 1667644,
      "name": "Aspose.Words.xml"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.21.06.17.55/aspose.words.17.11.0.json#lib/net40/Aspose.Words.dll",
      "@type": "PackageEntry",
      "compressedLength": 5606390,
      "fullName": "lib/net40/Aspose.Words.dll",
      "length": 12341760,
      "name": "Aspose.Words.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.21.06.17.55/aspose.words.17.11.0.json#lib/net40/Aspose.Words.xml",
      "@type": "PackageEntry",
      "compressedLength": 230380,
      "fullName": "lib/net40/Aspose.Words.xml",
      "length": 1668736,
      "name": "Aspose.Words.xml"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.21.06.17.55/aspose.words.17.11.0.json#lib/net40-client/Aspose.Words.dll",
      "@type": "PackageEntry",
      "compressedLength": 5600761,
      "fullName": "lib/net40-client/Aspose.Words.dll",
      "length": 12357120,
      "name": "Aspose.Words.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.21.06.17.55/aspose.words.17.11.0.json#lib/net40-client/Aspose.Words.xml",
      "@type": "PackageEntry",
      "compressedLength": 230194,
      "fullName": "lib/net40-client/Aspose.Words.xml",
      "length": 1667644,
      "name": "Aspose.Words.xml"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.21.06.17.55/aspose.words.17.11.0.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9462,
      "fullName": ".signature.p7s",
      "length": 9462,
      "name": ".signature.p7s"
    }
  ],
  "tags": [
    "Word",
    "DOC",
    "DOCX",
    "OOXML",
    "OpenDocument",
    "PDF",
    "XPS",
    "ODT",
    "HTML",
    "XHTML",
    "WordprocessingML",
    "Document",
    "EPUB"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    }
  }
}