{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.11.07.20/_rival-stars-horse-racing-hack-working-2022-version-hxs.5.5.6.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "SharpCrafters s.r.o.",
  "catalog:commitId": "dcd1191f-8d8d-4f8a-b6c5-f14cf7fda125",
  "catalog:commitTimeStamp": "2022-01-26T11:07:20.249559Z",
  "created": "2022-01-26T11:05:17.953Z",
  "description": "# _Rival Stars Horse Racing hack Working 2022 Version hxs\n\n\nCLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; [http://7.bltadwin.ru/hack.php](http://7.bltadwin.ru/hack.php)\n\n\nRival Stars Horse Racing Mod Apk (Hack, cracked Unlocked) + racing game + mod Hack version (reducing the opponent's ability to compete). Using cheat codes and other special kinds of techniques to unlock many more stunning features of the game makes it much more exciting. You May also like: Score. Latest Version of Download Rival Stars Horse Racing APK (MOD, unlimited Coins; unlimited Hacks; Rival Stars Horse Racing Game New.\n\n## [CLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; http://7.bltadwin.ru/hack.php](http://7.bltadwin.ru/hack.php)\n\n · Rival Stars Horse Racing: Desktop Edition latest version: Ultimate horse racing experience. Rival Stars Horse Racing is a racing game created by PikPok. The desktop version follows the laun. Rival Stars Horse Racing hack, is free way to unlock or get all In-App purchases for free. This hacks for Rival Stars Horse Racing works for all Android. Rival stars horse racing cheats rival stars horse download today's video i'm breeding in rival stars horse racing as well as selling a few of my best hors.  · Get this awesome Rival Stars Horse Racing hack if you want to get free gold without detection. You can use it both on Android and iOS mobile devices. This game gives you the ultimate horse racing experience. You can care for and train your own stable of horses, breed the perfect champion, manage a homestead ranch, and race for victory.\n\nrival stars horse racing hack mod apk, rival stars horse racing hacked version, rival stars horse racing hack apk download, rival stars horse racing hack ios, rival stars horse racing hack gold, rival stars horse racing pc hack, descargar rival stars horse racing hackeado, como hackear rival stars horse racing, how to enter hack cheats rival stars horse racing, rival stars horse racing hack android, rival stars horse racing hack deutsch, rival stars horse racing cheats, rival stars horse racing unlimited gold, rival stars horse racing cheat codes, how to enter cheat codes rival stars horse racing, how to hack rival stars horse racing, rival stars horse racing hack download, rival stars horse racing hack ios download, rival stars horse racing cheat engine, rival stars horse racing desktop edition cheat engine, is rival stars horse racing free, rival stars horse racing hacks, rival stars horse racing mobile cheats, rival stars horse racing gold hack, rival stars horse racing unlimited gold hack, rival stars horse racing gold generator, hack rival stars horse racing, rival stars horse racing cheats pc, rival stars horse racing cheats android, hack version of rival stars horse racing, rival stars horse racing cheats mobile, how to get gold on rival stars horse racing, unlimited gold rival stars, what is the best horse in rival stars, highest grade horse in rival stars, how many horses can you have in rival stars, what is the rarest horse in rival stars, what is the highest level horse in rival stars, is rival stars horse racing desktop edition free, is rival stars horse racing free on pc, rival star horse racing cheats, rival stars racing cheats, rival stars horse racing codes, rival stars horse racing cheats iphone, hacks for rival stars horse racing",
  "id": "_Rival-Stars-Horse-Racing-hack-Working-2022-Version-hxs",
  "isPrerelease": false,
  "language": "en-US",
  "lastEdited": "2022-01-26T11:07:18.477Z",
  "listed": true,
  "packageHash": "10/VEsT2ocdgg6LwHsMUOgKpAEgu406cAMQdJ3C54FKMzxoIWTbpZyeZO7E2nY+GJ/OoGE9BuhjXHMCx25M54A==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 11369,
  "published": "2022-01-26T11:05:17.953Z",
  "requireLicenseAcceptance": false,
  "title": "_Rival-Stars-Horse-Racing-hack-Working-2022-Version-hxs",
  "verbatimVersion": "5.5.6",
  "version": "5.5.6",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.11.07.20/_rival-stars-horse-racing-hack-working-2022-version-hxs.5.5.6.json#qcadmpodqc.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1237,
      "fullName": "qcadmpodqc.nuspec",
      "length": 3830,
      "name": "qcadmpodqc.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.11.07.20/_rival-stars-horse-racing-hack-working-2022-version-hxs.5.5.6.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9472,
      "fullName": ".signature.p7s",
      "length": 9472,
      "name": ".signature.p7s"
    }
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}