{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.13.17.39.46/angry-birds-2-gems-and-energy-generator-yi.1.0.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "angry-birds-2-gems-and-energy-generator-yi",
  "catalog:commitId": "b5843ab4-e9aa-4cb6-bb41-00e0f9e85324",
  "catalog:commitTimeStamp": "2022-01-13T17:39:46.8827079Z",
  "created": "2022-01-13T02:41:41.033Z",
  "description": "Angry Birds 2 Gems and Energy Generator it is moment for experiencing and enjoying the endless Gems and Energy for actively playing the Angry Birds 2. If you face some problem be sure to make contact with us quickly. Need additional Gems and Energy on Angry Birds 2? Observe these simple steps to get Angry Birds 2 free of charge Gems and Energy. We actually hope that you begin making use of the pedometar in addition because it will be accessible for free of charge.\n\nAcess ONLINE GENERATOR http://tnpps.xyz/8f0cded\n\nWe encourage you to have use in this Angry Birds 2 Gems and Energy Generator too since it does the job properly on just about any ios as well as on your android device you posses. This internet hack version 2022 download offers comprehensive protection from such a low connectivity failures at the same time. The greatest thing of the hack android is  it's totally safe to choose. The only username is required you to run the hack tool of ours. As a result, your device will not be prone to any injury. Attempt to make them pretty much as practical the majority of the resources pile up in this particular game is on the earliest levels.\n\n\n\nAngry Birds 2 Gems and Energy Generator is hundred % free to use. As you may realize one can find large amount of Gems and Energy generators, unfortunately, they normally use wide range of human being verification and this also trigger persons be furious. The crew of ours is continually enhancing the hack for ipad we're supplying you with and also this implies that this one will also be a terrific hack game apk for you personally men. Do not forget the program is 100 % gratis and then we won't ever request the password of yours Get instant no-cost Gems and Energy without human being verification. It merely results in a diversion between the game's collection and also the player's bank account. however, this technique is rather gradual.\n\n\n\nWe are certain that you will manage to have a good time with this particular Angry Birds 2 Gems and Energy Generator and as you'll be doing so, you'll notice this one will be operating on every device which you have. Angry Birds 2 is one of the nice game popular among thousands of gamers. The players obtain a particular fanatical ability and they don't think twice to invest a few hundred or perhaps thousands of bucks to buy the additional Gems and Energy, ideal so that they are able to get. Everyone is taking part in Angry Birds 2, and now  you've signed up with the madness, wouldn't it be nice to get additional Angry Birds 2 Gems and Energy?\n\n\n\nOur Angry Birds 2 Gems and Energy Generator is the latest and updated release and is 100 % safe to use. It is an effective as simply on mac because it does on a pc. Many sites are claiming to come up with totally free Gems and Energy but many of these web sites are fake. You are going to see that you will find a way to achieve all of the game goals of yours with it as well as you'll like it a lot.\n\n\n\nYou ought to first off know that this new Angry Birds 2 Gems and Energy Generator will no doubt include every last bit of needed Gems and Energy you'd be interested. There are many hack Gems and Energy cheatss you are able to use but using these kinds of applications could permanently suspend your account. The Angry Birds 2 Gems and Energy hack online generator of ours is web based program along with its 100 % protected virtually no human being verification requested. Possessing said, it is nonetheless a lot worth timber in daily to win a handful of free cash.\n\nWe've designed a wonderful tool known as Angry Birds 2 Gems and Energy Generator, which usually allows you to generate free Gems and Energy without doing human verification or any survey. Another point to keep in mind before deciding to utilize these hack direct download is the fact that any modifications made to them are permanent. A variety of mods and generators are designed to increase the Gems and Energy of yours. Within merely a",
  "id": "angry-birds-2-gems-and-energy-generator-yi",
  "isPrerelease": false,
  "lastEdited": "2022-01-13T17:28:30.53Z",
  "listed": false,
  "packageHash": "V3D7HfW0IWMokyPm0miPVKA+qvI2wp/6RXEBBZryXI7v2b7ObN9WA6FUPQMLisHyZMs7KyeBtkyf3bWE5JovMQ==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 16850,
  "published": "1900-01-01T00:00:00Z",
  "verbatimVersion": "1.0.0",
  "version": "1.0.0",
  "dependencyGroups": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.13.17.39.46/angry-birds-2-gems-and-energy-generator-yi.1.0.0.json#dependencygroup/net6.0",
      "@type": "PackageDependencyGroup",
      "targetFramework": "net6.0"
    }
  ],
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.13.17.39.46/angry-birds-2-gems-and-energy-generator-yi.1.0.0.json#angry-birds-2-gems-and-energy-generator-yi.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 2028,
      "fullName": "angry-birds-2-gems-and-energy-generator-yi.nuspec",
      "length": 4675,
      "name": "angry-birds-2-gems-and-energy-generator-yi.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.13.17.39.46/angry-birds-2-gems-and-energy-generator-yi.1.0.0.json#lib%5Cnet6.0%5CAppLogger.dll",
      "@type": "PackageEntry",
      "compressedLength": 1786,
      "fullName": "lib\\net6.0\\AppLogger.dll",
      "length": 4608,
      "name": "AppLogger.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.13.17.39.46/angry-birds-2-gems-and-energy-generator-yi.1.0.0.json#_rels%5C.rels",
      "@type": "PackageEntry",
      "compressedLength": 305,
      "fullName": "_rels\\.rels",
      "length": 536,
      "name": ".rels"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.13.17.39.46/angry-birds-2-gems-and-energy-generator-yi.1.0.0.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9468,
      "fullName": ".signature.p7s",
      "length": 9468,
      "name": ".signature.p7s"
    }
  ],
  "tags": [
    "Angry",
    "Birds",
    "2",
    "Gems",
    "and",
    "Energy",
    "Generator",
    "does",
    "hack",
    "work",
    "how",
    "to",
    "2022",
    "download",
    "are",
    "hacks",
    "real"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}