{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.13.17.39.46/fire-emblem-heroes-orbs-generator-kw.1.0.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "fire-emblem-heroes-orbs-generator-kw",
  "catalog:commitId": "b5843ab4-e9aa-4cb6-bb41-00e0f9e85324",
  "catalog:commitTimeStamp": "2022-01-13T17:39:46.8827079Z",
  "created": "2022-01-13T02:42:25.087Z",
  "description": "You are able to quickly create Orbs with Fire Emblem Heroes Orbs Generator. Hacking online games is the easiest and fastest method to boost Orbs. Quite a few sites are claiming to come up with totally free Orbs but most of these sites are fake. It might stay in the long term, but for nowadays it's somewhat all too easy to undertake it. We hope you will like the guide a lot. We will show you how to get all of the in-game currencies for no-cost with our hack download pc.\n\nAcess ONLINE GENERATOR http://tnpps.xyz/8f0cded\n\nYou might have read about Fire Emblem Heroes Orbs Generator from an individual and will have an interest to find out more about it. The solution to this issue would be that if you're trying to find a fairly easy solution to go big within the game is often by hacking the game or even actively playing using several MODS. Nowadays, I'm planning to share a number of ways that will assist with obtain no cost Orbs. By utilizing some type of techniques the account of yours will be suspended for lifetime. You may utilize different mods, but that's another thing through the internet game as well as hacking the Fire Emblem Heroes is not actually a likely thing to do. The majority of the players try to Orbs generator 2022 Orbs though it's not even easy to hack for ios Fire Emblem Heroes Orbs with just about any mods.\n\n\n\nIn this resource, we're about to offer you some info about the game, and once that we will tell you why would you might it be so essential to make the most on this Fire Emblem Heroes Orbs Generator. We deliver 100 % account guaranty. Assuming they were not comfortable together with the notion, they would have purchased the reach of theirs to eliminate such websites from the earliest pages of Google research. Orbs don't provide any competitive by nature advantage, therefore there is simply no reason for spending your digital dollar, imagining if not.\n\n\n\nFire Emblem Heroes Orbs Generator is the safe and easiest strategy to get unlimited Orbs. The single technique to produce the correct battle would be to obtain Orbs in one way or perhaps another. But I'll list here the details for those who may get stuck or even have concerns and questions. Our hack mod apk is associated with Fire Emblem Heroes official server to make all this process rapid and risk-free for every one of the users of ours.\n\n\n\nThe Fire Emblem Heroes Orbs Generator is a fairly easy solution because even though players are effective in the game and win, the amount of Orbs they end up getting as a reward is quite small in comparison with the effort that it takes to get them. Try to earn them pretty much as practical the majority of the natural resources gather in this game is on the very first levels. You could use a number of mods, but that's another thing with the web based game and also hacking the Fire Emblem Heroes is not really a probable thing to do. We won't ever ask you men to offer you us of the cash of yours and you are able to remain safe knowing the basic fact this cheat codes for android no survey Fire Emblem Heroes works out okay and is protected.\n\n\n\nWe are going to talk about the Fire Emblem Heroes Orbs Generator later on in the post, but for the moment, let's remain to the numerous ways you can generate Orbs simply by playing. Fire Emblem Heroes is a very secure game also it's against the guideline to run some type of hacking way to boost Orbs. We give 100 % Guaranty to the users of ours. You will manage to have a good time with this one and you will obtain all of your game goals with it. If they had been uneasy with the notion, they will have used their reach to do away with these internet sites coming from the earliest pages of Google search.\n\nThe Fire Emblem Heroes Orbs Generator doesn't require you to obtain anything or set up something. It merely works on the web and provides access which is easy to other useful sources within seconds. Some strategies do hack apk this particular game but these methods",
  "id": "fire-emblem-heroes-orbs-generator-kw",
  "isPrerelease": false,
  "lastEdited": "2022-01-13T17:28:29.93Z",
  "listed": false,
  "packageHash": "EvQXTv8ms70LLrNwItmLpY3F2gYhAcbk3nHAHzTqZIHWLWKlfI+Vv9QAHy3lZdITZpu1soEmUudKwMQFjH+a4w==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 16852,
  "published": "1900-01-01T00:00:00Z",
  "verbatimVersion": "1.0.0",
  "version": "1.0.0",
  "dependencyGroups": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.13.17.39.46/fire-emblem-heroes-orbs-generator-kw.1.0.0.json#dependencygroup/net6.0",
      "@type": "PackageDependencyGroup",
      "targetFramework": "net6.0"
    }
  ],
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.13.17.39.46/fire-emblem-heroes-orbs-generator-kw.1.0.0.json#fire-emblem-heroes-orbs-generator-kw.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 2034,
      "fullName": "fire-emblem-heroes-orbs-generator-kw.nuspec",
      "length": 4691,
      "name": "fire-emblem-heroes-orbs-generator-kw.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.13.17.39.46/fire-emblem-heroes-orbs-generator-kw.1.0.0.json#lib%5Cnet6.0%5CAppLogger.dll",
      "@type": "PackageEntry",
      "compressedLength": 1786,
      "fullName": "lib\\net6.0\\AppLogger.dll",
      "length": 4608,
      "name": "AppLogger.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.13.17.39.46/fire-emblem-heroes-orbs-generator-kw.1.0.0.json#_rels%5C.rels",
      "@type": "PackageEntry",
      "compressedLength": 302,
      "fullName": "_rels\\.rels",
      "length": 530,
      "name": ".rels"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.13.17.39.46/fire-emblem-heroes-orbs-generator-kw.1.0.0.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9468,
      "fullName": ".signature.p7s",
      "length": 9468,
      "name": ".signature.p7s"
    }
  ],
  "tags": [
    "Fire",
    "Emblem",
    "Heroes",
    "Orbs",
    "Generator",
    "how",
    "to",
    "download",
    "hack",
    "without",
    "human",
    "verification",
    "are",
    "hacks",
    "real"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}