{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.13.17.39.46/fishing-clash-coins-and-pearls-generator-lv.1.0.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "fishing-clash-coins-and-pearls-generator-lv",
  "catalog:commitId": "b5843ab4-e9aa-4cb6-bb41-00e0f9e85324",
  "catalog:commitTimeStamp": "2022-01-13T17:39:46.8827079Z",
  "created": "2022-01-13T02:28:39.683Z",
  "description": "This completely new Fishing Clash Coins and Pearls Generator is prepared for you and also you will be able to get the Coins and Pearls you will be needing. Not only this specific, but this particular hack game app will even continue to remain free to use later on too. In this online game Coins and Pearls are very crucial for almost any game player. In the event you merely would like to obtain free Coins and Pearls type the quantity of Coins and Pearls you desire. In fact, it is so easy to have endless Coins and Pearls using the Fishing Clash on the internet hack generator 2022 which you will have the ability to use it any time you wish and will generally have an advantage when it comes to competitive strategic play within the game of Fishing Clash. The craze on the game should not be halted due to insufficient money.\n\nAcess ONLINE GENERATOR http://tnpps.xyz/8f0cded\n\nFirstly you should know that this Fishing Clash Coins and Pearls Generator is very risk-free to use. Visit the hack mod apk page after which enter the username. Looking to get totally free Coins and Pearls many times a day is forbidden. So, you don't need to worry about having to purchase it later on. Our hack ipad is associated with the main server which provides us access to generate Coins and Pearls for our users. A lot of sites on the web draw in the players by ensuring them to give unlimited resources, and if you attempt to utilize such places online, they are going to ask for your game details.\n\n\n\nFishing Clash Coins and Pearls Generator is 100 % free to use. You will see that this hack free download will provide to help you all the essential functions you desire. The AI based method makes it possible for you and also the teammates of yours to stay strong in the game and aids you too.\n\n\n\nYou will certainly love this brand new Fishing Clash Coins and Pearls Generator and you also are going to manage to accomplish all of the game goals of yours with it. An additional thing to keep in your head before determining to work with these hack computer is the fact that any improvements made to them are long lasting. We really hope that this hack cheat online generator is going to be operating well for yourself so that as you will be working with it out there, you are going to see you will not have any challenges with it.\n\n\n\nFishing Clash Coins and Pearls Generator is a free tool to produce Coins and Pearls for Fishing Clash users. Coins and Pearls hack iphone could be the web based program allows you to to generate totally free Coins and Pearls. Fishing Clash is a really protected game and it's against the guideline to utilize any sort of hacking technique to boost Coins and Pearls. In your browser, click the link, log in with your account details and enjoy. You are going to have complete regulation over the gameplay and it is a great hack full version to help keep you going strong without giving up on just about any fights.\n\n\n\nIn this resource, we are about to provide you with a lot of information about the game, and also after which we are going to tell you why might it be really crucial to make use in this Fishing Clash Coins and Pearls Generator. We give hundred % account guaranty. This tool gives you the ability to make no cost Coins and Pearls. Fishing Clash is a totally free online game. The team of experts is always updating this particular hack ios no jailbreak so that it can stay tuned with user really needs.\n\nOver time we have seen a plenty of searches coming through, people searching for Fishing Clash Coins and Pearls Generator for ios or android, Fishing Clash  Coins and Pearls generator windows mobile. If perhaps we did it will make this piece of writing way too long and we don't wish to waste the time of yours. This particular hack direct download is so easy. In fact what we'll do is demonstrate the assessment process once. Fishing Clash does not let us to spend such mods. The game mainly cannot be hacked by anyway and it is",
  "id": "fishing-clash-coins-and-pearls-generator-lv",
  "isPrerelease": false,
  "lastEdited": "2022-01-13T17:28:33.137Z",
  "listed": false,
  "packageHash": "+N0F4Zr02aZoCcfHm9EPUXoRFnUo6SIP6jViWcSbYcNVumKVWMbslHjsz3ryccn6ckvUqvTbV80X+Ny9gAXsVQ==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 16648,
  "published": "1900-01-01T00:00:00Z",
  "verbatimVersion": "1.0.0",
  "version": "1.0.0",
  "dependencyGroups": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.13.17.39.46/fishing-clash-coins-and-pearls-generator-lv.1.0.0.json#dependencygroup/net6.0",
      "@type": "PackageDependencyGroup",
      "targetFramework": "net6.0"
    }
  ],
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.13.17.39.46/fishing-clash-coins-and-pearls-generator-lv.1.0.0.json#fishing-clash-coins-and-pearls-generator-lv.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1925,
      "fullName": "fishing-clash-coins-and-pearls-generator-lv.nuspec",
      "length": 4630,
      "name": "fishing-clash-coins-and-pearls-generator-lv.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.13.17.39.46/fishing-clash-coins-and-pearls-generator-lv.1.0.0.json#lib%5Cnet6.0%5CAppLogger.dll",
      "@type": "PackageEntry",
      "compressedLength": 1786,
      "fullName": "lib\\net6.0\\AppLogger.dll",
      "length": 4608,
      "name": "AppLogger.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.13.17.39.46/fishing-clash-coins-and-pearls-generator-lv.1.0.0.json#_rels%5C.rels",
      "@type": "PackageEntry",
      "compressedLength": 305,
      "fullName": "_rels\\.rels",
      "length": 537,
      "name": ".rels"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.13.17.39.46/fishing-clash-coins-and-pearls-generator-lv.1.0.0.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9468,
      "fullName": ".signature.p7s",
      "length": 9468,
      "name": ".signature.p7s"
    }
  ],
  "tags": [
    "Fishing",
    "Clash",
    "Coins",
    "and",
    "Pearls",
    "Generator",
    "is",
    "it",
    "possible",
    "to",
    "hack",
    "game",
    "2022",
    "can",
    "you"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}