{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.13.17.39.46/junes-journey-hidden-objects-coins-and-diamonds-generator-ik.1.0.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "junes-journey-hidden-objects-coins-and-diamonds-generator-ik",
  "catalog:commitId": "b5843ab4-e9aa-4cb6-bb41-00e0f9e85324",
  "catalog:commitTimeStamp": "2022-01-13T17:39:46.8827079Z",
  "created": "2022-01-13T02:42:10.79Z",
  "description": "At this moment the question must occur in the mind of yours that why you should actually use June's Journey Hidden Objects Coins and Diamonds Generator? Any June's Journey Hidden Objects player is going to love collecting infinite Coins and Diamonds since they understand that the true power is hidden within this currency. This specific thing about the hack Coins and Diamonds is a verification technique that is going to tell the system of ours that you're not really a bot however, you are able to ignore the verification approach so long as the country of yours and email is appropriate. What if we tell you that you are able to perform June's Journey Hidden Objects and grow into a good participant without having additional efforts?\n\nAcess ONLINE GENERATOR http://tnpps.xyz/8f0cded\n\nYou will surely like this new June's Journey Hidden Objects Coins and Diamonds Generator and you will manage to enjoy all of the game goals of yours with it. If you got lots of attributes in an internet application, what reason will you haven't to make use of it? The tool automatically checks for brand new update versions and alerts you when one is available. While some activities are very simple to accomplish, others require increasingly more time the supplemental you progress. Though you do not wish to devote the real cash of yours on the game on a regular basis? Similarly, it does the job very well on almost all browsers and all mobile gadgets.\n\n\n\nYou will not have any issues while benefiting from this specific June's Journey Hidden Objects Coins and Diamonds Generator and you will be sure that if you decide to use it out, you will like it. The sole method to obtain the limitless Coins and Diamonds in the game is purchasing them by investing real money. You will be happy to know  it is free of charge and also for some other types of hack full version, you may have to devote a bit of money to get rid of future expenses. All you require is entering your operator title and pick the ammount of Coins and Diamonds you would like to consume on the account of yours and attach your account with the June's Journey Hidden Objects database.\n\n\n\nThe private team of hackers introduce you probably the most waited June's Journey Hidden Objects Coins and Diamonds Generator, add additional Coins and Diamonds immediately to android and ios with 2 simple steps, hundred % free and with no surveys. Come and also evaluate the amazing hack ios. Before it is launched on the net, it's tested on a variety of platforms. Within just a few minutes you're gonna have all of the entirely free skins & Coins and Diamonds you have always dreamed of! Instead of achieving this, they've paid their moment concentrating on on their volume of sales. There are no techniques by which you are able to accumulate the Coins and Diamonds which may be utilized for lifelong in the game.\n\n\n\nYou were probably searching for this new June's Journey Hidden Objects Coins and Diamonds Generator and starting from nowadays, you are able to make use of it. You don't need to invest a lot of money to buy Coins and Diamonds anymore. In order to end it, generate the Coins and Diamonds just when you need them seriously. You are able to even avail gamer 's battle pass with Coins and Diamonds.\n\n\n\nYou can actually be absolutely sure that in case you decide to use this particular new June's Journey Hidden Objects Coins and Diamonds Generator you will manage to do this without having the concern about becoming blacklisted. It does work for android and also ios phones, but can also be run from your pc or laptop with mac os or windows. This is due to the fact the processor requires an increasing number of time frame to process the MOD's files. This specific game is attractively designed.\n\nWe're positive you will manage to enjoy yourself with this particular June's Journey Hidden Objects Coins and Diamonds Generator and as you'll be doing so, you will notice this one will be operating on any type of",
  "id": "junes-journey-hidden-objects-coins-and-diamonds-generator-ik",
  "isPrerelease": false,
  "lastEdited": "2022-01-13T17:28:30.127Z",
  "listed": false,
  "packageHash": "lIZbPsL2LoggyBJejBQ/o5tPO6EcpN+f0A/urRzWrdhw7P/gWFC2oG4TV+711rcTDjwHSwbTT5prIK/mpodLNg==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 16816,
  "published": "1900-01-01T00:00:00Z",
  "verbatimVersion": "1.0.0",
  "version": "1.0.0",
  "dependencyGroups": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.13.17.39.46/junes-journey-hidden-objects-coins-and-diamonds-generator-ik.1.0.0.json#dependencygroup/net6.0",
      "@type": "PackageDependencyGroup",
      "targetFramework": "net6.0"
    }
  ],
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.13.17.39.46/junes-journey-hidden-objects-coins-and-diamonds-generator-ik.1.0.0.json#junes-journey-hidden-objects-coins-and-diamonds-generator-ik.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1985,
      "fullName": "junes-journey-hidden-objects-coins-and-diamonds-generator-ik.nuspec",
      "length": 4841,
      "name": "junes-journey-hidden-objects-coins-and-diamonds-generator-ik.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.13.17.39.46/junes-journey-hidden-objects-coins-and-diamonds-generator-ik.1.0.0.json#lib%5Cnet6.0%5CAppLogger.dll",
      "@type": "PackageEntry",
      "compressedLength": 1786,
      "fullName": "lib\\net6.0\\AppLogger.dll",
      "length": 4608,
      "name": "AppLogger.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.13.17.39.46/junes-journey-hidden-objects-coins-and-diamonds-generator-ik.1.0.0.json#_rels%5C.rels",
      "@type": "PackageEntry",
      "compressedLength": 316,
      "fullName": "_rels\\.rels",
      "length": 554,
      "name": ".rels"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.13.17.39.46/junes-journey-hidden-objects-coins-and-diamonds-generator-ik.1.0.0.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9469,
      "fullName": ".signature.p7s",
      "length": 9469,
      "name": ".signature.p7s"
    }
  ],
  "tags": [
    "June's",
    "Journey",
    "Hidden",
    "Objects",
    "Coins",
    "and",
    "Diamonds",
    "Generator",
    "how",
    "do",
    "you",
    "hack",
    "is",
    "it",
    "possible",
    "to",
    "download",
    "i"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}