{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.13.17.39.46/redecor-home-design-credits-generator-83.1.0.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "redecor-home-design-credits-generator-83",
  "catalog:commitId": "b5843ab4-e9aa-4cb6-bb41-00e0f9e85324",
  "catalog:commitTimeStamp": "2022-01-13T17:39:46.8827079Z",
  "created": "2022-01-13T02:42:39.323Z",
  "description": "Redecor Home Design Credits Generator for android and ios the right way to get limitless free Credits without survey no real human verification no password no download absolutely no root no jailbreak. You would be the very best with our gaming hack Credits. Therefore the chances are fantastic the following year will still work. We would like to pick up your feedback and views on hack ipad. Thus, the primary element is the fact that the generators of ours typically are not like others, and that means you can get free Credits not having a survey or perhaps verifications.\n\nAcess ONLINE GENERATOR http://tnpps.xyz/8f0cded\n\nRedecor Home Design Credits Generator it is time for experiencing the limitless Credits for enjoying the Redecor Home Design. In case you're interested in a faster process, then don't choose this particular. Redecor Home Design is an internet game that uses different servers. Come as well as evaluate the fantastic online hack generator.\n\n\n\nRedecor Home Design Credits Generator is going to play an important part in playing the Redecor Home Design game effectively. This specific free online generator is so simple. You are going to see that you will manage to achieve all of the game objectives of yours with it and also you'll love it a lot. Credits are among the rare resources and you need to understand how to make use of your resources masterfully. However, losing is not fun, so in the event you achieve the game, it could be boring. Thus, the unlimited Credits you could get from these personal servers is going to be totally useless if you're searching for uninterrupted gameplay which is.\n\n\n\nYou may have noticed about Redecor Home Design Credits Generator from someone and will be interested to find out much more about it. Another problem which could come up by using general mods is that the designer of Redecor Home Design are often working to detect the MODS and they ban you when you become found. In only a few mins you're gonna have all of the free Credits and skins you've always dreamed of!\n\n\n\nI know you are in the correct spot because you're trying to find several working Redecor Home Design Credits Generator and I am able to explain you basically found one and it's performing as a charm. We won't ever try to ask you males to supply us of your cash and also you can continue to be secure learning the point this hack for ipad Redecor Home Design performs okay and is also protected. As we have described in the past, you will have to obtain several of the extra files in the mods that are by using unknown sources. Should you only would like to obtain free Credits sort the level of Credits you would like.\n\n\n\nApply Redecor Home Design Credits Generator and enjoy the game. After use, your account could possibly look like the one below that's brimming on the top with Credits. In case you over use the hack online generator, many other players could notice it and it might result in your out from the game. The group of specialists is continually updating this specific generator download so that it can stay tuned with user needs.\n\nOur Redecor Home Design Credits Generator is the latest and up-to-date release and is 100 % safe. The most convenient manner, as mentioned before, is via daily log-ins. This implies that it's likely to get the job done facial without needing you being forced to acquire something offered by us. Plus you might own a good deal more fun with this particular game in case you had unrestricted places online, like Credits. If you ever want to turn into a master in this game, then you definitely should have to invest a lot of efforts and times. The one way to produce the right battle would be to generate Credits in a single strategy or maybe another.\n\n\n\nAre Redecor Home Design hacks real, does Redecor Home Design hack work, how do you hack Redecor Home Design, is it possible to hack Redecor Home Design game, how to hack Redecor Home Design Credits, Redecor Home Design hack, is it",
  "id": "redecor-home-design-credits-generator-83",
  "isPrerelease": false,
  "lastEdited": "2022-01-13T17:28:29.723Z",
  "listed": false,
  "packageHash": "d3nFr7stJ4BNuTWAk6LGFVsfcyyaukBtbBXRbuCIFh0okefxP8fnoWo4nKTM7ynJoEzI4Gn+1YYFviFp2gzV3Q==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 16717,
  "published": "1900-01-01T00:00:00Z",
  "verbatimVersion": "1.0.0",
  "version": "1.0.0",
  "dependencyGroups": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.13.17.39.46/redecor-home-design-credits-generator-83.1.0.0.json#dependencygroup/net6.0",
      "@type": "PackageDependencyGroup",
      "targetFramework": "net6.0"
    }
  ],
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.13.17.39.46/redecor-home-design-credits-generator-83.1.0.0.json#lib%5Cnet6.0%5CAppLogger.dll",
      "@type": "PackageEntry",
      "compressedLength": 1786,
      "fullName": "lib\\net6.0\\AppLogger.dll",
      "length": 4608,
      "name": "AppLogger.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.13.17.39.46/redecor-home-design-credits-generator-83.1.0.0.json#redecor-home-design-credits-generator-83.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1962,
      "fullName": "redecor-home-design-credits-generator-83.nuspec",
      "length": 4691,
      "name": "redecor-home-design-credits-generator-83.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.13.17.39.46/redecor-home-design-credits-generator-83.1.0.0.json#_rels%5C.rels",
      "@type": "PackageEntry",
      "compressedLength": 302,
      "fullName": "_rels\\.rels",
      "length": 534,
      "name": ".rels"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.13.17.39.46/redecor-home-design-credits-generator-83.1.0.0.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9468,
      "fullName": ".signature.p7s",
      "length": 9468,
      "name": ".signature.p7s"
    }
  ],
  "tags": [
    "Redecor",
    "Home",
    "Design",
    "Credits",
    "Generator",
    "are",
    "hacks",
    "real",
    "does",
    "hack",
    "work",
    "how",
    "do",
    "you",
    "is",
    "it",
    "possible",
    "to",
    "game"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}