{
  "@id": "https://api.nuget.org/v3/catalog0/data/2018.06.19.07.29.55/spire.doc.5.9.3.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "E-iceblue",
  "catalog:commitId": "7748b92d-b106-4107-828f-d8ba01e0d74c",
  "catalog:commitTimeStamp": "2018-06-19T07:29:55.4693019Z",
  "copyright": "Copyright © 2017 e-iceblue. All Rights Reserved.",
  "created": "2017-05-03T08:02:43.743Z",
  "description": "Spire.Doc for .NET, specially designed for developers, enables to fast generate, open, write, edit and save Word document from Word Version 97-2003 to 2013. The featured function conversion enables developers to easily realize conversion between Word and other popular document formats such as Word to PDF/EPub/HTML/RTF/Image/XML etc.\n\nSpire.Doc for .NET is a totally independent .NET Word class library which doesn't require Microsoft Office installed on system. Microsoft Office Automation is proved to be unstable, slow and not scalable to produce MS Word documents. Spire.Doc for .NET is many times faster than Microsoft Word Automation and with much better stability and scalability. \n\nBy using Spire.Doc for .NET, users can save Word Doc/Docx to stream, save as web response and convert Word Doc/Docx to XML, RTF, EMF, TXT, XPS, EPUB, HTML and vice versa. Spire.Doc for .NET also supports to convert Word Doc/Docx to PDF and HTML to image. \n\nA common use of Spire.Doc for .NET is to create Word document dynamically from scratch. Almost all Word document elements are supported. Mainly includes page, sections, headers, footers, footnotes, paragraphs, lists, tables, text, fields, hyperlinks, bookmarks, comments, images, styles, background settings, printing features, document settings and protection. Furthermore, drawing objects including shapes, textboxes, images, OLE objects and controls are supported as well. \n\nSpire.Doc for .NET enables developers to process pre-existing Word documents. It supports search and replace function, alignment, page break, fill field, document concatenate, document copy, print, complex and deeply nested mail merge, etc.",
  "iconUrl": "http://www.e-iceblue.com/images/product_logo/product_buy/docnet.png",
  "id": "Spire.Doc",
  "isPrerelease": false,
  "language": "es-US",
  "lastEdited": "2018-06-19T07:29:45.79Z",
  "licenseUrl": "http://www.e-iceblue.com/Knowledgebase/Licensing/License-Agreement.html",
  "listed": false,
  "packageHash": "GrEaNLoUefG+D9wskoupDzPt4nC2t3LiSAteDc2AVaEvQm80T25Vf4u/EOG/tryDgSyn6ZVMeSmLXSXRCD4Cvw==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 38230452,
  "projectUrl": "http://www.e-iceblue.com/Introduce/word-for-net-introduce.html",
  "published": "1900-01-01T00:00:00Z",
  "releaseNotes": "Spire.Doc 5.9.3\n\nFixes the issue that caused the checkbox Lock aspect ratio cannot be checked when inserting an image into word document.\nFixes the issue that the OLE cannot be opened in RTF document after inserting image/txt OLE into file.\nFixes the issue that caused the exception \"Unable to sort because the IComparer.Compare()\" when saving word document to image.\nFixes the issue that caused StackOverflowException when converting word document to PDF.\nFixes the issue that caused process hanging after applying license when converting word document to PDF.\n\n\nSpire.Doc 5.9\nSupport to insert reply for the comment.\nFixes the issue that caused the position of the picture changed when converting RTF to PDF.\n\nSpire.Doc 5.8.92\nSupport to set the user password for PDF when converting word to PDF.\nSupport to add the time automatically when add the comment.\nFixes the issue that caused the page number incorrect when saving word to PDF after merging with ImportContent method.\nFixes the issue that caused inaccurate pdf when there is nested table.\nImprove the effect on the layout when converting word to PDF.\nFixes the issue where the document can't be opened when adding an object into the comments.\nFixes the issue that caused the image in the field lost.\nResolves the issue that caused the text formatting incorrect when saving html to Word.\n\nSpire.Doc 5.8.76\nFixes the issue where barcode was alternant with blank spaces after converting word to PDF.\nFixes the issue that caused the exception that pItem haven't found in paragraph items when use GetPageCount method.\n\nSpire.Doc 5.8.70\nFixes the issue that caused the hidden watermark visible after converting word to PDF. \nFixes the issue that caused the content lost when converting word to PDF.\n\n\nSpire.Doc 5.8.62\n\nFixes the issue that caused the process hanging when updating the content.\nFixes the issue that caused incorrect table format when updating the content.\nFixes the issue that caused wrong value when updating field.\nFixes the issue that the OLE didn't work when linking to file.\nFixes the issue that caused ArgumentOutOfRange when loading file.\nFixes the issue that caused text missing when replacing text.\n Improve the function of converting Word to PDF.\nFixes the issue that caused incorrect format when converting RTF to PDF.\nFixes the issue that caused wrong field when saving .doc to .docx.\n\n\nSpire.Doc 5.8.47\nSupport to keep same format when replace content in bookmark using TextBodyPart.\nFixes the issue that caused \"System.FormatException\" when loading a word document.\nFixes the issue that caused wrong format when printing the document.\nFixes the issue that caused incorrect contents when updating the contents.\nFixes the issue that caused content wrong when converting .docx file to .doc file.\nResolves the issue that caused wrong text alignment when converting HTML to Word.\nImprove the function when converting Word document to PDF.\nFixes the issue that caused wrong header when merging files.\nFixes the issue that caused the result file cannot open after saving the document.\nFixes the issue that caused ArgumentOutOfRange when saving the document.\nFixes the issue where the property CustomDocumentProperties gets wrong value.\nFixes the issue that caused exception when inserting OLE which type is Link.\n\nSpire.Doc 5.8.33\nAdd an event to handle the ASK field.\nFixes the issue where the paragraph format lost when replacing bookmark content.\nImprove the function of converting Word document to PDF.\n\nSpire.Doc 5.8.24\nFixes the issue that the content displayed incorrectly when converting word to PDF and word to image.\nFixes the issue that caused the SDT content lost when converting word to text.\n\n\nSpire.Doc 5.8.19\nFixes the issue that caused the exception that the magic number in GZip header is not correct when convert to PDF.\nFixes the issue where the content got disorder after adding the watermark.\nResolves the issue where the content displayed incorrectly when convert to PDF/Img.\n\nSpire.Doc 5.8\nSupports to convert word file to SVG.\n\nSpire.Doc 5.7.126\nPublic the collection of Fields on the Document object.\nOptimize the feature on Word to PDF conversion.\nFixes the issue that caused the font incorrect when save to HTML via stream.\n\n\nSpire.Doc 5.7.117\nAdd new features to keep the same format when replace the content in bookmark.\n\nFixes the issue that caused wrong content when covert RTF to Word.\nFixes the issue that caused wrong metatag when convert to PDF.\nFixes the issue that caused incorrect table format when convert to PDF.\nFixes the issue that caused picture in header missing when convert to PDF.\nFixes the issue that caused table border missing when append RTF text has table.\nFixes the issue that caused wrong alignment when append HTML into bookmark.\n\nSpire.Doc 5.7.109\n\nFixes the issue that caused the data lost when mail merge.\nFixes the issue where special characters and image in IF field was not showed up correctly when mail merge.\nImprove the ability to convert Word/RTF to PDF.\nFixes the issue where the underlined text was not right when convert to tiff.\nResolves the issue that caused the PageCount property exception when create a Spire.Doc.Document object.\n\nSpire.Doc 5.7.72\nFixes the issue that caused the content formatting incorrect when convert Word to html.\nFixes the issue that caused the content formatting incorrect when convert PDF to html.\nFixes the issue where the IF field was parsed incorrectly when convert Word to PDF.\nFixes the issue that caused the Equation field displayed incorrectly in word 2003 document.\n\n\nSpire.Doc 5.7.54\n\nImprove the feature to Html parsing and conversion.\nFixes the issue that caused Letters Change on Numbered List when convert to PDF.\nFixes the issue where image got doubled up when convert to PDF.\n\n\n\nSpire.Doc 5.7.36\n Improve the mail merge feature to support one more group fields in the same body.\n Fixes the issue that caused TOC can't be correctly updated with the correct page number.\n\n\nSpire.Doc 5.7.27\nFixes the issue that caused the generated PDF/A document didn't meet the specification.\nFixes the issue that caused the TOC lost when convert word to HTML.\nFixes some issues that caused the wrong format when convert word to PDF.\nFixes the issue where image alignment lost when converting HTML to .docx.\nFixes the issue where paragraph's ListFormat.CurrentListStyle always return null.\n\n\nSpire.Doc 5.7\n\nFixes the issue that the textbox is missing when converting RTF to .docx.\nFixes the issue that the text in textbox orientation is changed when converting RTF to PDF.\nFixes the issue that bold letters overlap when converting .docx to PDF.\nFixes the issue that page layout is changed when printing Word document \nFixes the issue that font setting is changed when inserting \"℃\" character into Word bookmark.\nFixes the issue that the image orientation is changed when merging two documents and converting Word to PDF.\nFixes the error \"The given key was not present in the dictionary\" when calling bookmarkNavigator.ReplaceBookmarkContent() method.\n\nSpire.Doc 5.6.62\n\nFixes the issue that caused messy formatting when print.\nFixes the issue where Document.GetPageCount method and Document.PageCount property caused the print output incorrect.\nFixes the issue that caused Exception when save the document.\nFixes the issue where the indent on cells in table was incorrect when convert doc to rtf. \nFixes the issue that caused Exception in text replacement.\nResolves the issue that caused the result was incorrect when replacing text that contains a hyperlink or a mailto-link.\nFixes the issue that caused the footer lost when convert word to word. \nFixes the issue where the wordcount property didn't get the correct value.\nFixes the issue that caused incorrect formatting when convert html to word.\nFixes the issue that caused incorrect formatting when convert html to PDF.\nFixes the issue that caused the content lost when convert word to PDF.\nResolves the issue that caused exception when mailmerge the MergeFields within mathematical functions.\n\n\nSpire.Doc 5.6.27\nSpire.Doc starts to support to parse RC4 CryptoAPI and XOR Obfuscation Encryption.\nFixes the issue that caused the exception that password is incorrect when load Word2013 protected document.\nFixes the issue that caused the document cannot be loaded.\nFixes the issue where the position of the bookmark is incorrect when loading and saving Word 97-2003 file.\nResolves the issue that caused the exception that length cannot be less than zero when loading the document.\nFixes the issue that caused incorrect layouts when convert RTF to PDF.\nFixes the issue that caused IndexOutOfRange exception when save.\n\nSpire.Doc 5.6.16\n\nFixes the issue that cause OverflowException when loading.\nResolves the issue that cause blank field when mail merging.\nFixes the issue that cause loss of formats when saving to PDF.\nFixes the issue that cause exception when converting RTF to PDF.\nFixes the issue that cause exception when converting to PDF.\nFixes the issue where the content flattened when converted to PDF.\nFixes the issue where the image lost when converted to PDF.\n\nSpire.Doc 5.6.3\nAdd new method to embed uninstalled fonts by font document when convert word document to PDF.\nFixes the issue that caused layout change when convert word (with tables) to PDF.\nFixes the issue that caused alignment issue when convert word document to PDF.\nFixes the issue where the hyperlink in the header changes when converting rtf to PDF.\n\nSpire.Doc 5.5.189\n\nFixes the issue that caused the document can't be opened after mailmerge.\nFixes the issue that caused the Title case formatting incorrect when mailmerge.\n\n\nSpire.Doc 5.5.183\n\nFixes the issue where editing restrictions turned on after fill formfiled. \nFixes the issue that caused NullReferenceException when open a .docx that contains a citation.\nFixes the issue that caused InvalidCastException when converts RTF to PDF.\nResolves the issue where it writes \\jpegblip instead of \\pngblip when writes an RTF file with a .png image.\nFixes the issue where the content rendered incorrectly when converts HTML to .doc.\nResolves the issue where the before and after mark lost after mailmerging.\nFixes the issue that caused the fore color of content control incorrect when select value.\nResolves the issue that caused the exception \"Scale factor must be greater than 0\" when load the document.\nFixes the issue that caused the paragraph spacing incorrect when converts word to PDF.\nFixes the issue that caused content lost when converts word to PDF.\nResolves the issue where vertically aligned on the page lost when converts word to PDF.\nFixes the issue that caused application hanged when converts word to PDF.\nFixes the issue where the position of the header is incorrect when converts word to PDF.\nFixes the issue where the position of the table is incorrect when converts word to PDF.\nFixes the issue where the position of the textbox is incorrect when converts word to PDF.\nAddresses the issue where image has black background when converts word to PDF.\nFixes the issue that caused blank space error when converts word to PDF.\nResolves the issue that caused ArgumentOutOfRangeException when converts word to PDF.\nFixes the issue that caused the style incorrect when converts word to PDF.\nFixes the issue that caused the content of footer incorrect when converts word to PDF.\n\nSpire.Doc 5.5.112\nAdd new feature to support RTF \\listtext tag.\nFixes the issue where all spaces shows \"??\" when fill form field.\nFixes the issue that caused the NullReferenceException when use ImportContent method.\nFixes the issue that caused the table borders lost.\nResolves the issue that caused the content lost when convert RTF to PDF.\nFixes the issue that caused the font changes when convert RTF to RTF.\nFixes the issue where the content confused when converts Html to Word.\nFixes the issue that caused the table width incorrect when convert .doc to PDF.\nFixes the issue where the output pops up protected view warning when convert Doc to Doc.\nFixes the issue where there is an additional line when convert .docx to PDF.\nFixes the issue that caused the image lost when convert .docx to .docx.\nFixes the issue where the space between two words was dropped out when convert RTF to RTF.\nResolves the issue that caused the PageNumberStyle incorrect when converting to PDF.\n\n\nSpire.Doc 5.5.71\nAdd new feature to set the color for different levels bookmark.\nFixes the issue that caused incorrect formatting when convert .docx to PDF.\nFixes the issue where footer with RomanLower was displayed with Arabic numbering when convert .docx to PDF.\nFixes the issue that caused content lost when convert .docx to PDF.\nFixes the issue that caused incorrect formatting(table,font) when convert docx to RTF.\nFixes the issue that caused incorrect formatting when convert RTF to RTF.\nFixes the issue when saving the file as a PDF, the MailMerge fields has no value after calling MailMerge.Execute.\nFixes the issue where nativedata that read from excel object in word is null.\nResolves the issue that caused Word documents(RTF,Docx) failed to load.\nFixes the issue where the content lost when converts RTF to Image.\n\nSpire.Doc 5.5.28\nAdd new feature to get the list number directly off the word file.\nFixes the issue that caused wrong layout when printing Word Document.\nFixes the issue where the section break inside content control was ignored when convert .docx document to PDF.\nFixes the issue that caused the exception that Value cannot be null.Parameter name: fontName when loading .docx document.\nFixes the issue that caused the exception that Object reference not set to an instance of an object when convert .doc to PDF.\nResolves the issue that caused incorrect hyphenation when convert .docx document to PDF.\nFixes the issue where the checkbox was converted to other bullets when convert .docx document to rtf.\nAddresses the issue where the if conditional fields on the footer is off broken when convert .docx document to PDF.\nFixes the issue that caused incorrect table when convert .docx document to PDF.\nFixes the issue where the IsBreakAcrossPages and KeepFollow property about table didn't work when saves to PDF.\nFixes the issue that caused the column break line lost when save to PDF.\nAddresses the issue that caused content lost when convert rtf to rtf.\n\nSpire.Doc 5.5\nAdd the feature to support the nested bookmark in PDF when convert doc to pdf.\nFix the issue that caused the NullException when load RTF document.\nFix the issue where the content was displayed incorrectly when convert RTF to Html.\nFix the issue that caused conversion failure when convert .docx to .pdf.\nFix the issue that caused \"Wrong signature\" Exception when load .docx document.\nFix the issue that caused \"Date time value should be after 12/31/1900\" exception when load .docx document.\nFix the issue that caused incorrect merge result.\nFix the issue that caused content loss after .docx to .docx conversion.\nFix the issue that caused list number loss after .doc to .txt conversion.\nFix the issue where the AppendRTF method caused \"The object reference does not match an object instance\" exception.\n\nSpire.Doc 5.4.36\nFix the issue where content was incorrect when convert .doc to .pdf.\nFix the issue that caused error when perform some replacement of texts.\nFix the issue that caused OutOfMemoryException when save HTML as RTF.\nFix the issue where the header content displayed difference between Word2010 and Word2013.\nResolve the issue that caused the table position not same as Word when convert .docx to .pdf.\nFix the issue that caused load error.\nAddress the issue where the image didn't display when convert .rtf to .pdf.\nFix the issue where the bookmark displayed incorrectly in PDF when convert .doc to .pdf.\n\nSpire.Doc 5.4.25\nFixes the issue where some documents can't be saved.\nFixes the issue where some word documents can't be converted to PDF.\nFixes the issue that caused the content loss when convert docx to PDF.\nAddresses the issue that caused some word documents loading failure.\nFixes the issue where image lost and right margin was wrong while converting docx file to pdf.\nFixes the issue that caused the content incorrect when convert docx to pdf.\nResolves the issue that caused picture not shown in the PDF when the file path points to a server instead of a drive when convert RTF to PDF.\nFixes the issue where the fonts in the word document are not embedded in the pdf document when convert docx to pdf.\n\nSpire.Doc 5.4.15\nAdd new feature to get and edit content controls(Combox,Dropdownlist,CheckBox).\nFixes the issue where it failed to convert doc to rtf.\nFixes the issue where INCLUDEPICTURE path caused image not displayed when convert rtf to pdf.\nFixes the issue that caused the content lost when convert docx to pdf.\nResolves the issue that caused the exception \"the width for height of a square {X=0,Y=0,Width=0,Height=0} can't be 0 (null)\" when convert doc to pdf.\nFixes the issue caused the empty merge fields in resulted document not be cleaned when mail merge.\nFixes the issue where the document printed incorrectly when change display screen fonts to larger than normal.\nFixes the issue where generated word document can't be opened when apply TextWrappingStyle.Through option to image.\nAddresses the issue that caused the content disorder when convert doc to rtf.\nFixes the issue where the image wasn't merged when use path.\n\nSpire.Doc 5.4\nFix the issue that caused the garbled contents when convert RTF to html.\nFix the issue where some sentences weren't aligned when convert .docx to PDF.\nFix the issue that caused incorrect indent when convert RTF to RTF.\nFix the issue where some documents couldn't be saved to PDF format.\nFix the issue that caused redundant blank line when save to PDF more than one time.\nFix the issue that caused some contents dislocation when convert .dotx to PDF.\nFix the issue where some doc documents can't be saved to .docx document.\n\nSpire.Doc 5.3.83\n\nAdd a new feature to add \"Line Between\" in the document column settings.\nAdd a new feature to set the IMG at vertical-align:middle when append HTML string code to .doc.\nFixes the issue that caused the content displyed incorrectly when convert .doc to PDF.\nFixes the issue where it failed to convert .doc to PDF.\nSupports the \"picprop\" keywords when save as RTF document.\nFixes the issue that caused tab keywords failed to analyze when convert rtf to rtf.\nFixes the issue that caused the image lost when convert rtf to rtf.\nFixes the issue where it failed to load some .docx/RTF documents.\nFixes the issue that caused the negative number is set as positive when mail merged.\nFixes the issue where the result is not correct when convert some RTF documents to PDF.\n\n\nSpire.Doc 5.3.71\nAdd new struct for PrivateFontPath that enables setting the path to font when convert word to PDF.\nFixes the issue where it failed to load some RTF files.\nFixes the issue where the output PDF is incorrect when converts some Word documents to PDF.\nFixes the issue where the IF field in the Word document updated wrong when convert Word document to PDF.\nFixes the issue that caused an exception happened when save Word to PDF.\nFixes the issue where the merged value displayed incorrect when mail merged.\nFixes the issue where the barcode font can't be embedded correctly to PDF when convert Word document to PDF.\nFixes the issue where it failed to convert some rtf to pdf.\nFixes the issue that caused the character before line break lost when saves to PDF after completing mail merge.\nFixed the issue where it failed to convert some .doc documents to PDF.\n\n\nSpire.Doc 5.3.46\nFix the issue that the image is magnified when merging two RTF files.\nFix the issue that \"Index was outside the bounds of the array\" when .docx to pdf conversion.\nFix the issue that the font isn't embedded correctly when .docx to PDF conversion.\nFix the issue that \"ArgumentOutOfRangeException\" when mail merging.\n\nSpire.Doc 5.3.38\nThe bold font that doesn't have bold is supported to embed into pdf when convert .docx to PDF.\nFix the issue that the symbol was lost when convert .docx to pdf.\nFix the issue that the filled content of Form Field lost when convert .docx to pdf.\nFix the issue that the result is incorrect when convert .docx to pdf.\nFix the issue that the result is incorrect when convert HTML to RTF.\nFix the issue that the result is incorrect when convert HTML to image.\nFix the issue that the TableOfContent(IDocument doc, string switches) method can't work.\nFix the issue that it can't extract text from some documents. \nFix the issue that 'Object reference not set to an instance of an object' when saving document to pdf.\n\n\nSpire.Doc 5.3.17\nFix the issue with GetPageCount method.\nFix the issue that 'Not a valid Win32 FileTime' when loading a .doc document.\nFix the issue that 'Nullable object must have a value' when loading a RTF document.\nFix the issue that some .docx documents can't be converted to PDF.\nFix the issue that the color of bullet and numbering is not correct when converting RTF to PDF/Image.\nFix the issue that the image color was incorrect when converting .docx to .docx.\nFix the issue that some contents in the result image lost when converting RTF to tiff.\nFix the issue that 'Object reference not set to an instance of an object' when saving document to stream.\n\nSpire.Doc 5.3.11\nFix the issue that table of content is not updated.\nFix the issue that table of content is updated incorrectly.\nFix the issue that spell check is not recognized in word document.\nFix the issue about clone section.\nFix the issue that after saving a document, the style name was changed in German MS Word.\nFix the issue that 'Error! Unknown document property name' when convert .doc to pdf.\nFix the issue that the location of log is incorrect when convert RTF to PDF.\nFix the issue that 'unable convert the system.DateTime type object to system.string type' when convert .doc to pdf.\nFix the issue that the checkbox is not checked when convert .doc to pdf.\nFix the issue that the Bullet symbol is lost when convert rtf to image/pdf.\nFix the issue that the wingdings font displays incorrectly when convert .doc/.docx to pdf.",
  "requireLicenseAcceptance": true,
  "summary": "Spire.Doc for .NET is a professional and powerful .NET Word library to process a large range of Word tasks in C# and Visual Basic for .NET (2.0/3.5/4.0/4.0 ClientProfile/4.5)",
  "title": "Spire.Doc for .NET",
  "verbatimVersion": "5.9.3",
  "version": "5.9.3",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.06.19.07.29.55/spire.doc.5.9.3.json#Spire.Doc.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 6413,
      "fullName": "Spire.Doc.nuspec",
      "length": 25028,
      "name": "Spire.Doc.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.06.19.07.29.55/spire.doc.5.9.3.json#lib/net20/Spire.Doc.dll",
      "@type": "PackageEntry",
      "compressedLength": 2900170,
      "fullName": "lib/net20/Spire.Doc.dll",
      "length": 7983104,
      "name": "Spire.Doc.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.06.19.07.29.55/spire.doc.5.9.3.json#lib/net20/Spire.Doc.XML",
      "@type": "PackageEntry",
      "compressedLength": 99804,
      "fullName": "lib/net20/Spire.Doc.XML",
      "length": 880182,
      "name": "Spire.Doc.XML"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.06.19.07.29.55/spire.doc.5.9.3.json#lib/net20/Spire.License.dll",
      "@type": "PackageEntry",
      "compressedLength": 23141,
      "fullName": "lib/net20/Spire.License.dll",
      "length": 55296,
      "name": "Spire.License.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.06.19.07.29.55/spire.doc.5.9.3.json#lib/net20/Spire.License.xml",
      "@type": "PackageEntry",
      "compressedLength": 870,
      "fullName": "lib/net20/Spire.License.xml",
      "length": 4674,
      "name": "Spire.License.xml"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.06.19.07.29.55/spire.doc.5.9.3.json#lib/net20/Spire.Pdf.dll",
      "@type": "PackageEntry",
      "compressedLength": 6533087,
      "fullName": "lib/net20/Spire.Pdf.dll",
      "length": 15388672,
      "name": "Spire.Pdf.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.06.19.07.29.55/spire.doc.5.9.3.json#lib/net35/Spire.Doc.dll",
      "@type": "PackageEntry",
      "compressedLength": 2897285,
      "fullName": "lib/net35/Spire.Doc.dll",
      "length": 7983104,
      "name": "Spire.Doc.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.06.19.07.29.55/spire.doc.5.9.3.json#lib/net35/Spire.Doc.XML",
      "@type": "PackageEntry",
      "compressedLength": 99804,
      "fullName": "lib/net35/Spire.Doc.XML",
      "length": 880182,
      "name": "Spire.Doc.XML"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.06.19.07.29.55/spire.doc.5.9.3.json#lib/net35/Spire.License.dll",
      "@type": "PackageEntry",
      "compressedLength": 23017,
      "fullName": "lib/net35/Spire.License.dll",
      "length": 54784,
      "name": "Spire.License.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.06.19.07.29.55/spire.doc.5.9.3.json#lib/net35/Spire.License.xml",
      "@type": "PackageEntry",
      "compressedLength": 870,
      "fullName": "lib/net35/Spire.License.xml",
      "length": 4674,
      "name": "Spire.License.xml"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.06.19.07.29.55/spire.doc.5.9.3.json#lib/net35/Spire.Pdf.dll",
      "@type": "PackageEntry",
      "compressedLength": 6533224,
      "fullName": "lib/net35/Spire.Pdf.dll",
      "length": 15388672,
      "name": "Spire.Pdf.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.06.19.07.29.55/spire.doc.5.9.3.json#lib/net40/Spire.Doc.dll",
      "@type": "PackageEntry",
      "compressedLength": 2896817,
      "fullName": "lib/net40/Spire.Doc.dll",
      "length": 7987200,
      "name": "Spire.Doc.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.06.19.07.29.55/spire.doc.5.9.3.json#lib/net40/Spire.Doc.XML",
      "@type": "PackageEntry",
      "compressedLength": 99804,
      "fullName": "lib/net40/Spire.Doc.XML",
      "length": 880182,
      "name": "Spire.Doc.XML"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.06.19.07.29.55/spire.doc.5.9.3.json#lib/net40/Spire.License.dll",
      "@type": "PackageEntry",
      "compressedLength": 23487,
      "fullName": "lib/net40/Spire.License.dll",
      "length": 55808,
      "name": "Spire.License.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.06.19.07.29.55/spire.doc.5.9.3.json#lib/net40/Spire.License.xml",
      "@type": "PackageEntry",
      "compressedLength": 870,
      "fullName": "lib/net40/Spire.License.xml",
      "length": 4674,
      "name": "Spire.License.xml"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.06.19.07.29.55/spire.doc.5.9.3.json#lib/net40/Spire.Pdf.dll",
      "@type": "PackageEntry",
      "compressedLength": 6539838,
      "fullName": "lib/net40/Spire.Pdf.dll",
      "length": 15417344,
      "name": "Spire.Pdf.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.06.19.07.29.55/spire.doc.5.9.3.json#lib/net40-client/Spire.Doc.dll",
      "@type": "PackageEntry",
      "compressedLength": 2894953,
      "fullName": "lib/net40-client/Spire.Doc.dll",
      "length": 7983104,
      "name": "Spire.Doc.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.06.19.07.29.55/spire.doc.5.9.3.json#lib/net40-client/Spire.Doc.XML",
      "@type": "PackageEntry",
      "compressedLength": 99749,
      "fullName": "lib/net40-client/Spire.Doc.XML",
      "length": 879664,
      "name": "Spire.Doc.XML"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.06.19.07.29.55/spire.doc.5.9.3.json#lib/net40-client/Spire.License.dll",
      "@type": "PackageEntry",
      "compressedLength": 23406,
      "fullName": "lib/net40-client/Spire.License.dll",
      "length": 55808,
      "name": "Spire.License.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.06.19.07.29.55/spire.doc.5.9.3.json#lib/net40-client/Spire.License.xml",
      "@type": "PackageEntry",
      "compressedLength": 870,
      "fullName": "lib/net40-client/Spire.License.xml",
      "length": 4674,
      "name": "Spire.License.xml"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.06.19.07.29.55/spire.doc.5.9.3.json#lib/net40-client/Spire.Pdf.dll",
      "@type": "PackageEntry",
      "compressedLength": 6525833,
      "fullName": "lib/net40-client/Spire.Pdf.dll",
      "length": 15437824,
      "name": "Spire.Pdf.dll"
    }
  ],
  "tags": [
    "words",
    "Word",
    "TEXT",
    "RTF",
    "doc",
    "docx",
    "PDF",
    "XPS",
    "HTML",
    "Image",
    "XTML",
    "word",
    "document",
    "EPUB"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    }
  }
}