{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.04.02.06.51.05/owlcore.0.0.62.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "Arlo Godfrey",
  "catalog:commitId": "95e8c4f4-5147-4d53-974c-cf83ad9d695d",
  "catalog:commitTimeStamp": "2022-04-02T06:51:05.7377793Z",
  "created": "2022-04-02T06:49:01.547Z",
  "description": "Have you ever seen an owl do a barrel roll? Me neither.\n\nOwlCore is in a rapid development cycle and is constantly being improved upon. Until a stable release, breaking changes can happen any time. Comprehensive changelogs included with every release.\n\nOur favorite features:\n- .NET Standard 2.0 - Battle-tested on Uno Platform and UWP, for both hobby and enterprise-level applications.\n- OwlCore.Remoting - Painlessly sync member changes in C# with an external source via magic (reflection + IL weaving).\n- AbstractUI - Abstracts simple UI elements as pure data. Send over a network, store on disk, share between platforms, etc. Make something else worry about rendering and interacting. (Optional OwlCore.Remoting integration)\n- AbstractStorage - Abstract away your storage needs for easy implementation switching and unit test mocking. Based on the Windows StorageFile APIs, designed to be completely agnostic of any underlying platform or protocol.\n- Flow.Debouncer - For when something fires repeatedly. but you only care about when it stops.\n- Flow.EventAsTask - Wait for an EventHandler to fire (with cancellation).\n- Flow.EasySemaphore - Use a \"using\" statement with your semaphores instead of manually calling WaitAsync and Release.\n- Threading.PrimaryContext -  Use a \"using\" statement to execute on your main thread. No dispatcher, callbacks or cleanup needed.\n- Threading.OnPrimaryThread - Easily invoke a callback on your primary thread.\n- CachedHttpClientHandler - Cache http requests to disk and return them as needed. Supports chaining.\n- RateLimitedHttpClientHandler - Limit the number of requests within a window of time. Supports chaining.\n- Countless extension methods. PruneNull, Shuffle and Unshuffle, InParallel, ChangeDate, HashMD5Fast, DistinctBy, InsertOrAdd, InsertOrReplace, and MUCH more.",
  "iconFile": "logo.png",
  "id": "OwlCore",
  "isPrerelease": false,
  "lastEdited": "2022-04-02T06:51:03.4Z",
  "licenseFile": "LICENSE.txt",
  "licenseUrl": "https://aka.ms/deprecateLicenseUrl",
  "listed": true,
  "packageHash": "F/+eU/2SeqTkK0q3I2IIlHbe3d+xIbELKyb/of6mvPLn+psDSh3r78KrbYGBKcg4iVii0YoKnpDCMaFLkxKsRw==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 177752,
  "published": "2022-04-02T06:49:01.547Z",
  "releaseNotes": "--- 0.0.62 ---\n[Breaking changes]\nAdded CancellationToken parameter to IAsyncInit.InitAsync().\n\n[Improvements]\nImproved inline docs for IAsyncInit.\n\n--- 0.0.61 ---\n[Breaking changes]\nTo fix an issue where AbstractUICollectionViewModel.NotifyCollectionChanged wasn't being seen on some UI frameworks, the Items property is now a ReadOnlyObservableCollection and the collection is no longer enumerable and is no longer marked Deprecated. AbstractUICollection.Items is still marked as potentially obsolete.\n\n--- 0.0.60 ---\nFixed an issue where updating OwlCore in existing apps could result in the error \"error CS1705: Assembly 'OwlCore' with identity 'OwlCore, Version=0.0.59, Culture=neutral, PublicKeyToken=null' uses 'System.Runtime, Version=6.0.0.0, Culture=neutral, PublicKeyToken=b03f5f7f11d50a3a' which has a higher version than referenced assembly 'System.Runtime' with identity 'System.Runtime, Version=4.2.1.0, Culture=neutral, PublicKeyToken=b03f5f7f11d50a3a'\n\n--- 0.0.59 ---\n[Fixes]\nFixed an issue where AbstractUICollectionViewModel wouldn't raise NotifyCollectionChanged on the correct SynchronizationContext.\n\n[Breaking changes]\nRemoved the ILauncher interface. Use an event handler instead for Uri activation.\n\n--- 0.0.58 ---\n[Fixes]\nFixed an issue with SettingsBase where saving and loading a value shorter than the previous value would result in invalid data.\n\n[Improvements]\nAdded LoadFailed and SaveFailed events to SettingsBase.\n\n--- 0.0.57 ---\n[Overview]\nRefining AbstractUI, fixing consistency and adding unit tests.\n\n[Breaking changes]\nIn AbstractButton: Click now returns void instead of Task, and the setter was removed from the Type property as it should not change after creation and had no event for changing.\nAbstractColorPicker.PickColor now returns void instead of Task.\nAbstractDataList.Items is now IReadOnlyList{T} instead of List{T}. Use provided methods to manipulate the items.\nThe setter for AbstractDataList.PreferredDisplayMode is now init-only and the setter on the corresponding ViewModel has been removed.\nThe setter for AbstractMultiChoice.PreferredDisplayMode is now init-only and the setter on the corresponding ViewModel has been removed.\nThe setter for AbstractRichTextBlock.RichText is now init-only and the setter on the corresponding ViewModel has been removed.\nSetting IsIndeterminate in AbstractProgressIndicator properties no longer affect each other. Value should just be ignored if IsIndeterminate is true.\nThe property AbstractProgressIndicator.Value, the value parameter in the constructor, and event args in the ValueChanged event are no longer nullable.\n\n[Improvements]\nAll AbstractUI models are now unit tested.\nAbstractButton now has a TextChanged event handler for when the Text property is set.\nAbstractDataList now takes IEnumerable instead of List for items in the constructor.\nExtra unit tests for possible deadlocks while operating on SettingsBase from a handler on its own PropertyChanged event.\n\n[Fixes]\nFixed several AbstractUI models that allowed a changed event to be raised even when the set value is the same.\nFixed EventAsTask not cancelling properly + unit tests.\nFixed EventAsTask not unsubscribing when cancelled + unit tests.\nFixed several concurrency issues with SettingsBase.\n\n--- 0.0.56 ---\n[Fixes]\nFixed InvalidCastException when accessing AbstractUICollectionViewModel.Count.\nFixed NotifyCollectionChanged not properly emitting for AbstractUICollectionViewModel.\n\n[Improvements]\nRemoved hidden AbstractUI dependency on Threading.SetPrimaryThreadInvokeHandler in favor of SynchronizationContext.Post.\n\n[Breaking changes]\nAbstractUICollectionViewModel now implements IReadyOnlyCollection{T} instead of ICollection{T}. Modifications to the collection should happen via the underlying model.\n\n--- 0.0.55 ---\n[Fixes]\nFixed several InvalidCastExceptions in AbstractUICollection. Added Unit Tests for the entire class.\n\n--- 0.0.54 ---\n[Fixes]\nFixed an issue in SettingsBase where defaults would incorrectly return when non-setting files existed in the provided folder. Unit test included.\n\n--- 0.0.53 ---\n[Fixes]\nFixed a deadlock in SettingsBase when GetProperty is called during an OnPropertyChanged handler. Unit test included.\n\n--- 0.0.52 ---\n[Fixes]\nFixed possible exception in SettingsBase when LoadAsync and SetProperty are called concurrency.\n\n--- 0.0.51 ---\n[New]\nSettingsBase now implements INotifyPropertyChanged. Unit tests included.\n\n--- 0.0.50 ---\n[New]\nAn abstract class SettingsBase has been added. Enables MVVM-like setting storage as property getters/setters, with abstracted serialization and data persistence using IAsyncSerializer and AbstractStorage. \nAdded ISerializer{T}, ISerializer{T, T2}, IAsyncSerializer{T}, and IAsyncSerializer{T, T2}.\nIRemoteMessageConverter now implements IAsyncSerializer{T, T2}.\n\n[Improvements]\nIFileData.WriteAllBytesAsync has been marked as obsolete and will be removed in a future version in favor of an extension method.\nIFolderData.EnsureExists has been marked as obsolete and will be removed in a future version.\n\n[Breaking changes]\nContextualServiceLocator has been removed.\n\n--- 0.0.49 ---\n[Fixes]\nFixed an issue in the DataProxy extensions for MemberRemote where an exception was thrown when the same token was received concurrently.\n\t\t\t\n--- 0.0.48 ---\nFixed an issue where updating OwlCore in existing apps could result in the error \"error CS1705: Assembly 'OwlCore' with identity 'OwlCore, Version=0.0.47.0, Culture=neutral, PublicKeyToken=null' uses 'System.Runtime, Version=5.0.0.0, Culture=neutral, PublicKeyToken=b03f5f7f11d50a3a' which has a higher version than referenced assembly 'System.Runtime' with identity 'System.Runtime, Version=4.2.1.0, Culture=neutral, PublicKeyToken=b03f5f7f11d50a3a'\n\n--- 0.0.47 ---\n[Fixes]\nAdded missing AbstractUI ViewModels.\nAdded tests to ensure that constructing AbstractUICollectionViewModel works with all possible models.\nFixed InvalidProgramException when calling AbstractUICollection.Remove or AbstractUICollectionViewModel.Remove caused by invalid IL code reaching the JIT Compiler.\n\n--- 0.0.46 ---\n[Fixes]\nFixed AbstractUICollection.Remove being restricted to the explicit interface implementation of ICollection{AbstractUIElement}.\nAdded unit tests and Adding and Removing from AbstractUICollection and AbstractUICollectionViewModel.\n\n--- 0.0.45 ---\n[New]\nAdded extension methods CrawlBy and CrawlByAsync. Crawls an object tree for nested properties of the same type and returns the first instance that matches a filter predicate. Unit tested.\nAdded OwlCore.ComponentModel.IDelegatable.\nAdded OwlCore.ComponentModel.ChainedProxyBuilder. Builds a class delegation chain where each item might delegate member access to the next item in the collection. Unit tested.\n\n[Breaking changes]\nCompositeHttpClientHandler and all related classes have been removed in favor of the built-in DelegatingMessageHandler, which all OwlCore handlers support by default.\nOwlCore.Net.HttpClientHandlers namespace has been renamed to OwlCore.Net.Http.\n\n--- 0.0.44 ---\n[New]\nNew class: RemoteSemaphoreSlim. A remote-capable SemaphoreSlim implementation. Unit tests included.\nAdded a new overload to DataProxy: ReceiveDataAsync{TResult}(MemberRemote, string, TimeSpan, CancellationToken?). This overloads waits the given timespan for multiple published messages, then returns all received data. Unit tests included.\nMemberRemote will now emit a RemoteMethodCallMessage when a method is exited.\nMethodCallId has been added to MethodInterceptEventArgs and RemoteMethodCallMessage. This value is unique for every method call.\nInterceptType (entry, exit) has been added to MethodInterceptEventArgs.\n\n[Improvements]\nNewtonsoftRemoteMessageConverter will now exclude null values during serialization.\nOwlCore.Extensions.Cast{T} now uses aggressive inlining.\nAdded unit tests for the emitting of RemoteMethodCallMessage for both Entry and Exit.\nAbstractUICollectionViewModel now inherits from ICollection{T} instead of IEnumerable{T}.\nAbstractUICollectionViewModel now implements INotifyCollectionChanged.\nAbstractUICollectionViewModel now inherits from ICollection{T} instead of IEnumerable{T}.\nAbstractUICollection now implements INotifyCollectionChanged.\nAbstractUICollection.Items and AbstractUICollectionViewModel.Items have been marked as obsolete and will be removed in a future version. Enumerate the collections directly instead.\n\n[Fixes]\nFixed an issue in NewtonsoftRemoteMessageConverter where property changes were not using assembly qualified name for type conversion.\nFixed an issue in NewtonsoftRemoteMessageConverter where Enums were not being deserialized properly.\nFixed an issue in NewtonsoftRemoteMessageConverter where a concrete class value passed for an interface target type was cast to the wrong enumerable type.\n\n[Breaking changes]\nMethodEnteredEventArgs has been renamed to MethodInterceptEventArgs.\nA param has been inserted at index 0 in the ctor for MethodInterceptEventArgs (string methodCallId)\nA param has been inserted at index 1 in the ctor for RemoteMethodCallMessage (string methodCallId).\n\n--- 0.0.43 ---\n[Fixes]\nFixed an issue where updating OwlCore in existing apps could result in the error \"error CS1705: Assembly 'OwlCore' with identity 'OwlCore, Version=0.0.42.0, Culture=neutral, PublicKeyToken=null' uses 'System.Runtime, Version=5.0.0.0, Culture=neutral, PublicKeyToken=b03f5f7f11d50a3a' which has a higher version than referenced assembly 'System.Runtime' with identity 'System.Runtime, Version=4.2.1.0, Culture=neutral, PublicKeyToken=b03f5f7f11d50a3a'\n\n--- 0.0.42 ---\n[Fixes]\nFixed an issue where modified shuffle maps kept in sync with the original list might not unshuffle properly. Added tests.\n\n[Breaking changes]\nRemove problematic Flow.Catch overloads, and added tests.\n\t\t\t\n--- 0.0.41 ---\n[Improvements]\nFlow.Catch now has overloads to catch up to 4 exceptions.\n\n[Breaking changes]\nThe type parameter order on Flow.Catch{TException, TResult}(Func{TResult}) has been swapped to {TException, TResult}. This allows for more natural usage when catching more than 1 exception.\n\t\t\t\n--- 0.0.40 ---\n[Improvements]\nShuffle extension method is now O(n) using fisher-yates.\nShuffle extension method now returns a \"shuffle map\" that can be used to map items to their original positions and unshuffle the collection.\nAdded IList{T} overload to Shuffle extension method.\nAdded unit tests to Shuffle extension methods.\n\n[New]\nAdded Unshuffle extension method for T[] and List{T}. Pass a \"shuffle map\" returned by the Shuffle extension method to return a list to its' original order using a (probably) original algorithm inspired by fisher-yates with O(n) time and space complexity.\n\n--- 0.0.39 ---\n[New]\nAdded NavigationFailed event to AbstractFolderExplorer.\nFlow.Catch now has an overload that catches all exception with no return value.\n\n[Fixes]\nFixed a potential memory leak in Flow.WhenCancelled.\n\n[Improvements]\nMade selfCancellationToken parameter optional on CancellationToken.WhenCancelled() extension method.\nFlow.Catch now properly returns default values when an exception is caught.\n\n[Breaking changes]\nFlow.TryOrSkip was renamed to Flow.Catch\n\n--- 0.0.38 ---\n[New]\nAdded Flow.WhenCancelled(cancellationToken) and unit tests. Returns a Task that completes when the given cancellation token is cancelled.\nAdded CancellationToken.WhenCancelled() extension method to OwlCore.Extensions and unit tests. Same behavior as Flow.WhenCancelled, but as an extension method.\n\n[Breaking changes]\nDeque was removed from OwlCore.Collections.Generic. For a maintained version, see https://github.com/Avid29/MoreCollections/blob/main/src/Generic/Deque.cs\nSynchronizedObservableCollection was moved to OwlCore.Collections.ObjectModel.\nOwlCore.Validation.Ensure was made internal. This is only used by SynchronizedObservableCollection, which may be removed in a future release.\nInvokeOnUI from OwlCore.Extensions has a fatal flaw and was removed.\nOwlCore.Exceptions.UIElementNotFoundException was removed.\nOwlCore.Exceptions was removed.\n\t\t\t\n--- 0.0.37 ---\n[Fixes]\nFixed an issue where updating OwlCore in existing apps could result in the error \"error CS1705: Assembly 'OwlCore' with identity 'OwlCore, Version=0.0.36.0, Culture=neutral, PublicKeyToken=null' uses 'System.Runtime, Version=5.0.0.0, Culture=neutral, PublicKeyToken=b03f5f7f11d50a3a' which has a higher version than referenced assembly 'System.Runtime' with identity 'System.Runtime, Version=4.2.1.0, Culture=neutral, PublicKeyToken=b03f5f7f11d50a3a'\n\n--- 0.0.36 ---\n[Fixes]\nFixed issues with the RemoteLock extension methods for MemberRemote. Added Unit Tests.\nFixed an issue where DataProxy extension methods would not scope to the given member remote. Added Unit Tests.\nFixed an issue where DataProxy was unable to send null values. Added Unit Tests for null, primitives, structs and objects.\n\t\t\t\n--- 0.0.35 ---\n[Fixes]\nFixed several issues with EnumerableExtensions.ChangeCollection, and added unit tests around it.\n\n--- 0.0.34 ---\n[New]\nNew logo!\n\n[Improvements]\nMade MemberRemote.IsAllowedRemotingDirection public. Given the current mode, it checks if the given memberInfo allows data to flow in a certain direction.\nFixed docs on RemoteDataMessage.TargetMemberSignature.\nAdded Unit Tests to the DataProxy extension methods for MemberRemote.\n\n[Fixes]\nFixed an issue where the MemberRemote.PublishDataAsync extension method used the signature scope from the MemberRemote for data, instead of AssemblyQualifiedName.\nFixed an issue where MemberRemote.PublishDataAsync returned always nullable.\n\n[Breaking changes]\nThe PublishDataAsync extension method for MemberRemote now takes the call token as the first parameter instead of the second.\n\n--- 0.0.33 ---\n[Improvements]\nCompositeHttpClientHandler, CompositeHttpClientHandlerActionBase, RateLimitedHttpClientHandlerAction, and CachedHttpClientHandlerAction will be deprecated and removed in a future version.\nCachedHttpClientHandler now supports proper chaining as a System.Net.Http.DelegatingHandler.\nRateLimitedHttpClientHandler now supports proper chaining as a System.Net.Http.DelegatingHandler.\n\n[Breaking changes]\nRemoved dependency on Nito.AsyncEx.Coordination. If you were using this as a transitive dependency, install this package in your projects directly.\n\n[Fixes]\nFixed an issue where MemberRemote wasn't fully disposed until the finalizer was called.\n\n--- 0.0.32 ---\n[New]\nAdded Flow.EasySemaphore() and unit tests. Provides syntactic sugar for releasing a SemaphoreSlim when execution leaves a using statement.\n\n[Improvements]\nIRemoteMessageHandler is now only initialized once while maintianing proper concurrency.\nBetter docs for SetPrimarySynchronizationContext and SetPrimaryThreadInvokeHandler.\n\n--- 0.0.31 ---\n[New]\nAdded OwlCore.Provisos.ILauncher for delegating the launch of Urls and more.\n\n[Improvements]\nAdded Unit Testing to OwlCore.Remoting.MemberRemote - about 5,520 possible usage combinations (~30% coverage).\nAdded Unit Testing to OwlCore.Remoting.Transfer.MessageConverters.NewtonsoftRemoteMessageConverter - about 150 combinations (~70% coverage).\n\n[Breaking changes]\nTo keep things clean for devs, classes in OwlCore.Remoting.Attributes and OwlCore.Remoting.EventArgs have been moved to OwlCore.Remoting.\n\n--- 0.0.30 ---\n[New]\nAdded ReplaceOrAdd extension method for IList{T}. Behaves the same as InsertOrAdd, but replaces at the given index if it exists.\nAdded Pop extension method for IList{T}. Removes and returns the last item in the list.\n\n[Breaking changes]\nInsertOrAdd and InsertOrAddRange now properly throw ArgumentOutOfRangeException when index is less than -1.\n\n[Improvements]\nWe've started adding unit tests to OwlCore behind the scenes. Development of [New] features is now test driven and existing code will get tests added over time.\n\n--- 0.0.29 ---\n[New]\nAdded InsertOrAddRange extension method. Behaves the same as InsertOrAdd, but allows an adding or inserting an enumerable at a specific index.\n\n[Improvements]\nAdded CachedRequestFound and CachedRequestSaving relay from CachedHttpClientHandlerAction to CachedHttpClientHandler.\nNotNullIfNotNullAttribute and NotNullAttribute are now transitive dependencies from Microsoft.Toolkit.Mvvm\n\n[Improvements, Breaking changes]\nAdded MemberSignatureScope to OwlCore.Remoting.Transfer.IRemoteMessageHandler to allow sending/receiving member changes in different assemblies, namespaces, or class names. Previously restricted to 1:1 matches of assembly, namespace and class name.\nAdded AssemblyQualifiedName property to RemotePropertyChangeMessage and adjusted constructor signature, as TargetMemberSignature is no longer guaranteed to match AssemblyQualifiedName.\nDue to the MemberSignatureScope changes, if you've saved any values for IRemoteMemberMessage.TargetMemberSignature, they may not match values generated by this version.\nThe static method MemberRemote.CreateMemberSignature() now requires a second parameter specifying MemberSignatureScope. Previous default behavior was MemberSignatureScope.AssemblyQualifiedName.\nOwlCore.Services.IInstanceCacheRepository.HasId() was added for checking if a specific instance Id exists in the repository.\nOwlCore.AbstractStorage.IFileData.GetThumbnailAsync added for getting the thumbnail images from a file according to specified settings.\nOwlCore.Remoting.Transfer.IRemoteMessageHandler.MessageConverter is now nullable.\n\n[Fixes]\nFixed an issue with OwlCore.Remoting where non-primitive property changes and method parameters were treated as primitive during internal type conversion and throwing.\nFixed an issue where placing RemoteMethod on a class would attempt to remote calls to the Add and Remove methods for events.\n\n--- 0.0.28 ---\n[Fixes]\nNo code changes. Fixed release notes for a previous versions.\n\n--- 0.0.27 ---\n[Fixes]\nFixed a major issue with OwlCore.Remoting.MemberRemote where ignoring an invalid remoting direction resulted in the next message causing a throw.\n\n--- 0.0.26 ---\n[Breaking changes]\nOwlCore.AbstractStorage.IFileScanner was moved to the namespace OwlCore.AbstractStorage.Scanners.\nOwlCore.AbstractStorage.IFileScanner.ScanFolder was renamed to ScanFolderAsync\nOwlCore.AbstractStorage.IFileScanner.ScanFolder's IFolderData parameter was redundant and removed. Implementors should pass this into the class constructor.\nOwlCore.AbstractStorage.DepthFirstFileScanner was moved to the namespace OwlCore.AbstractStorage.Scanners.\nOwlCore.AbstractStorage.FileScanStateEventArgs was unused and has been removed.\n\n[Improvements]\nEmbedded PBD information to help with debugging.\nAdded examples and improved documentation for Flow.EventAsTask.\nAdded optional Id to IFolderData, same as the Id for IFileData.\nOwlCore.Remoting.RemoteProperty can now be used on fields (weaving fields was previously supported)\nAdded setup and help documentation for OwlCore.Remoting (MemberRemote, RemoteMethodAttribute, RemotePropertyAttribute).\n\t\t\t\n--- 0.0.25 ---\n[Breaking changes]\nOwlCore.Remoting.RemoteOptionsAttribute can no longer be used on Events (was never supported by MemberRemote).\nOwlCore.Remoting.Transfer.MessageConverters.MessagePackRemoteMessageConverter was removed as it was untested and compatibility is uncertain.\n\n[Improvements]\nOwlCore.Remoting.Transfer.MessageConverter.NewtonsoftRemoteMessageConverter is MASSIVELY improved. This version has all primitives, common structs and several classes unit tested with property changes and method call messages.\nOwlCore.Remoting.RemoteOptionsAttribute can now be used on fields. [RemoteProperty] applies to fields when put on a class, and [RemoteOptions] now lets you disable specific fields.\nUse explicit cast in OwlCore.Extensions.Cast{T}();\n\n[Fixes]\nFixed an issue where StreamExtensions.ToBytes() and StreamExtensions.ToBytesAsync() would return an empty byte array when stream isn't seeked to beginning.\n\n--- 0.0.24 ---\n[New]\nAdded AbstractFolderExplorer in OwlCore.AbstractUI.Components. This is an AbstractUICollection that acts as a standalone, inbox component. A Folder explorer that interops with OwlCore.AbstractStorage to browse and select subfolders from an IFolderData.\n\n[Breaking changes]\nRemoved cancellation token overload from InParallel. For cancellation, pass the token to the inner tasks.\nSwapped enum value order for OwlCore.AbstractUI.Models.PreferredOrientation so Vertical is first and default.\n\n[Fixes]\nFixed issue where \"isIndeterminate\" parameter of AbstractProgressIndicator wasn't being set from the ctor.\nFixed an issue where AbstractUICollectionViewModel wasn't relaying underlying item to the public Items property.\nFixed an issue where setting state in AbstractBooleanViewModel caused a StackOverflow.\n\n--- 0.0.23 ---\n[Breaking changes]\nRenamed OwlCore.AbstractUI.Models.AbstractProgress to OwlCore.AbstractUI.Models.AbstractProgressIndicator.\nRenamed OwlCore.AbstractUI.Models.AbstractProgressViewModel to OwlCore.AbstractUI.Models.AbstractProgressIndictatorViewModel.\n\n--- 0.0.22 ---\n[Breaking changes]\nMoved EventAsTask from Threading to Flow.\nRemoved ExclusiveSynchronizationContext.\nRemoved \"UIElement\" from class names of all AbstractUI elements and ViewModels.\nRenamed AbstractUIElementGroup to AbstractUICollection.\nRefactored CachedHttpClientHandler to use events instead of Action callbacks in the constructor. Added CachedRequestFound and CachedRequestSaving events. Set e.Handled on these instead of returning true or false.\n\n[Improvements]\nAbstractUI now works with OwlCore.Remoting when you pass an instance to a MemberRemote.\nAbstractUICollection now implements ICollection{AbstractUIElement}.\nAdded CancellationToken parameter to EventAsTask.\n\n[Fixes]\nFixed potential memory leak in OwlCore.Remoting when RemoteMessageReceivingEventArgs.Handled is set to true.\nFixed an issue where an instance with an overriden == operator handed to MemberRemote could interfere with instance reference checks.\n\n--- 0.0.21 ---\n[Fixes]\nFixed a crash in OwlCore.Remoting.MemberRemote when the library catches and prepares to send an exception.\n\n--- 0.0.20 ---\n[Fixes]\nFixed threading issue with OwlCore.Remoting introduced in 0.0.19.\n\n--- 0.0.19 ---\n[Fixes]\nFixed a crash with OwlCore.Remoting when compiled with optimizations.\n\n--- 0.0.18 ---\n[Fixes]\nFixed an issue where remote member change messages were not scoping to specific MemberRemote instances without manually implementing IRemoteMemberMessage.\n\n--- 0.0.17 ---\n[Fixes]\nRe-release of 0.0.16 to fix freezing visual studio when building.\n\n--- 0.0.16 ---\n[Improvements]\nHardened the fix introduced in 0.0.15.\n\n--- 0.0.15 ---\n[Fixes]\nFixed an issue where bidirectional remoting causes a loop for method calls and property changes.\n\n--- 0.0.14 ---\n[Improvements]\nAdded empty constructors to classes in OwlCore.Remoting.Transfer.Messages for deserializers.\n\n--- 0.0.13 ---\n[Fixes]\nFixed and improved type handling for NewtonsoftRemoteMessageConverter.\n\n[Improvements]\nAdded additional checks, exceptions and instructions for mismatched data types in remote properties and method parameters.\nExposed a new SerializerSettings property for NewtonsoftRemoteMessageConverter.",
  "repository": "",
  "verbatimVersion": "0.0.62",
  "version": "0.0.62",
  "dependencyGroups": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.04.02.06.51.05/owlcore.0.0.62.json#dependencygroup/.netstandard2.0",
      "@type": "PackageDependencyGroup",
      "dependencies": [
        {
          "@id": "https://api.nuget.org/v3/catalog0/data/2022.04.02.06.51.05/owlcore.0.0.62.json#dependencygroup/.netstandard2.0/cauldron.basicinterceptors",
          "@type": "PackageDependency",
          "id": "Cauldron.BasicInterceptors",
          "range": "[3.2.3, )"
        },
        {
          "@id": "https://api.nuget.org/v3/catalog0/data/2022.04.02.06.51.05/owlcore.0.0.62.json#dependencygroup/.netstandard2.0/cauldron.interception.fody",
          "@type": "PackageDependency",
          "id": "Cauldron.Interception.Fody",
          "range": "[3.2.3, )"
        },
        {
          "@id": "https://api.nuget.org/v3/catalog0/data/2022.04.02.06.51.05/owlcore.0.0.62.json#dependencygroup/.netstandard2.0/messagepack",
          "@type": "PackageDependency",
          "id": "MessagePack",
          "range": "[2.3.85, )"
        },
        {
          "@id": "https://api.nuget.org/v3/catalog0/data/2022.04.02.06.51.05/owlcore.0.0.62.json#dependencygroup/.netstandard2.0/microsoft.csharp",
          "@type": "PackageDependency",
          "id": "Microsoft.CSharp",
          "range": "[4.7.0, )"
        },
        {
          "@id": "https://api.nuget.org/v3/catalog0/data/2022.04.02.06.51.05/owlcore.0.0.62.json#dependencygroup/.netstandard2.0/microsoft.extensions.dependencyinjection",
          "@type": "PackageDependency",
          "id": "Microsoft.Extensions.DependencyInjection",
          "range": "[5.0.2, )"
        },
        {
          "@id": "https://api.nuget.org/v3/catalog0/data/2022.04.02.06.51.05/owlcore.0.0.62.json#dependencygroup/.netstandard2.0/microsoft.toolkit",
          "@type": "PackageDependency",
          "id": "Microsoft.Toolkit",
          "range": "[7.0.0, )"
        },
        {
          "@id": "https://api.nuget.org/v3/catalog0/data/2022.04.02.06.51.05/owlcore.0.0.62.json#dependencygroup/.netstandard2.0/microsoft.toolkit.diagnostics",
          "@type": "PackageDependency",
          "id": "Microsoft.Toolkit.Diagnostics",
          "range": "[7.1.1, )"
        },
        {
          "@id": "https://api.nuget.org/v3/catalog0/data/2022.04.02.06.51.05/owlcore.0.0.62.json#dependencygroup/.netstandard2.0/microsoft.toolkit.mvvm",
          "@type": "PackageDependency",
          "id": "Microsoft.Toolkit.Mvvm",
          "range": "[7.1.1, )"
        },
        {
          "@id": "https://api.nuget.org/v3/catalog0/data/2022.04.02.06.51.05/owlcore.0.0.62.json#dependencygroup/.netstandard2.0/newtonsoft.json",
          "@type": "PackageDependency",
          "id": "Newtonsoft.Json",
          "range": "[13.0.1, )"
        },
        {
          "@id": "https://api.nuget.org/v3/catalog0/data/2022.04.02.06.51.05/owlcore.0.0.62.json#dependencygroup/.netstandard2.0/system.text.json",
          "@type": "PackageDependency",
          "id": "System.Text.Json",
          "range": "[5.0.2, )"
        },
        {
          "@id": "https://api.nuget.org/v3/catalog0/data/2022.04.02.06.51.05/owlcore.0.0.62.json#dependencygroup/.netstandard2.0/system.threading.tasks.dataflow",
          "@type": "PackageDependency",
          "id": "System.Threading.Tasks.Dataflow",
          "range": "[5.0.0, )"
        }
      ],
      "targetFramework": ".NETStandard2.0"
    }
  ],
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.04.02.06.51.05/owlcore.0.0.62.json#OwlCore.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 8135,
      "fullName": "OwlCore.nuspec",
      "length": 27056,
      "name": "OwlCore.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.04.02.06.51.05/owlcore.0.0.62.json#lib/netstandard2.0/OwlCore.dll",
      "@type": "PackageEntry",
      "compressedLength": 117588,
      "fullName": "lib/netstandard2.0/OwlCore.dll",
      "length": 247296,
      "name": "OwlCore.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.04.02.06.51.05/owlcore.0.0.62.json#lib/netstandard2.0/OwlCore.xml",
      "@type": "PackageEntry",
      "compressedLength": 27475,
      "fullName": "lib/netstandard2.0/OwlCore.xml",
      "length": 245373,
      "name": "OwlCore.xml"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.04.02.06.51.05/owlcore.0.0.62.json#logo.png",
      "@type": "PackageEntry",
      "compressedLength": 11396,
      "fullName": "logo.png",
      "length": 13506,
      "name": "logo.png"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.04.02.06.51.05/owlcore.0.0.62.json#LICENSE.txt",
      "@type": "PackageEntry",
      "compressedLength": 705,
      "fullName": "LICENSE.txt",
      "length": 1152,
      "name": "LICENSE.txt"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.04.02.06.51.05/owlcore.0.0.62.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9465,
      "fullName": ".signature.p7s",
      "length": 9465,
      "name": ".signature.p7s"
    }
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}