{
  "@id": "https://api.nuget.org/v3/catalog0/data/2016.10.12.21.18.59/aspose.words.16.10.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "Aspose",
  "catalog:commitId": "e587e1d0-3f49-4581-b594-6ec4714b0168",
  "catalog:commitTimeStamp": "2016-10-12T21:18:59.9353062Z",
  "copyright": "(C) Aspose 2002-2016. All Rights Reserved.",
  "created": "2016-10-12T21:18:43.747Z",
  "description": "Aspose.Words for .NET is a class library for .NET that enables you to perform a wide range of document processing tasks directly within your .NET applications.",
  "iconUrl": "http://www.aspose.com/images/products/dotnet/Aspose.Words_128x128.png",
  "id": "Aspose.Words",
  "isPrerelease": false,
  "lastEdited": "0001-01-01T00:00:00Z",
  "licenseUrl": "http://www.aspose.com/corporate/purchase/end-user-license-agreement.aspx",
  "listed": true,
  "packageHash": "Pldhic6PBZMNcBwGTker60ij0IQGGSyCKagv1cdZetZ7PMUNvMRt3ZnZSxQpJFYaAHpGP3k1drVw6PEiOKxVaQ==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 22027404,
  "projectUrl": "http://www.aspose.com/categories/.net-components/aspose.words-for-.net/default.aspx",
  "published": "2016-10-12T21:18:43.747Z",
  "releaseNotes": "Aspose.Words for .NET 16.10.0 Release Notes\n\n\nMajor Features\n\nThere are 109 improvements and fixes in this regular monthly release. The most notable are:\n\n* Added feature to compare document as MS Word does.\n* Added feature to get OOXML compliance version as determined from the loaded document content.\n* Font fallback while rendering fonts of Myanmar Unicode range improved.\n* DrawingML text effects rendering performance slightly improved.\n* DrawingML text box rendering effects added.\n* SVG rendering improved.\n* Detection of encoding while rendering MathML improved.\n* Chinese text rendering in HtmlFixed improved.\n\n\nFull List of Issues Covering all Changes in this Release\n\nKey\tSummary\tCategory\nWORDSNET-10206\t/font substitution/ Font fallback issue with space character\tBug\nWORDSNET-12191\t/document grid + charSpace/ AW incorrectly wraps lines\tBug\nWORDSNET-12290\tImages are missing from GroupShape after re-saving Doc\tBug\nWORDSNET-12295\t/document grid + charSpace/ Some characters are misplaced after DOCX to PDF\tBug\nWORDSNET-12296\t/document grid + charSpace/ Extra page after DOCX to PDF\tBug\nWORDSNET-12369\tExtra Revisions are appeared when a set of pages are added to Document\tBug\nWORDSNET-12903\tDocument.Compare does not mimic MS Word behavior\tBug\nWORDSNET-13110\tDocument.Compare does not mimic Microsoft Word's compare feature\tBug\nWORDSNET-13145\tDouble line on a shape not converting correctly in PDF\tBug\nWORDSNET-13159\tDocument.Compare does not mimic Microsoft Word's compare feature\tBug\nWORDSNET-13358\tJapanese text moves to next line after conversion from Docx to Pdf\tBug\nWORDSNET-13520\tNodeImporter.ImportNode corrupts the output document\tBug\nWORDSNET-13596\tDoc file becomes protected (Restrict Editing) after re-saving\tBug\nWORDSNET-13598\tSpecial characters (SpecialChar) are not converted correctly in output text file format\tBug\nWORDSNET-13762\tDocument.Compare does not compare list items correctly\tBug\nWORDSNET-13790\tContents move to next page after conversion from Docx to Pdf\tBug\nWORDSNET-13810\tSome methods work incorrectly when field is located within a single paragraph\tBug\nWORDSNET-13811\tSome field specific code parsers work incorrectly if the field has nested fields\tBug\nWORDSNET-13812\tShapeBase.AspectRatioLocked returns wrong value\tBug\nWORDSNET-13818\tDocument.Compare incorrectly compares bookmark's text\tBug\nWORDSNET-13825\tCorrupted document is generated on saving RTF to DOCX\tBug\nWORDSNET-13829\t/Mixed fonts metrics/ Contents move to next page after conversion from Docx to Pdf\tBug\nWORDSNET-13857\t/font substitution/ Incorrect Arabic words are rendering in Pdf\tBug\nWORDSNET-13918\tShape's text is rendered on next line in output Pdf\tBug\nWORDSNET-13969\tHtml to Docx/Pdf conversion issue with SVG \"dy\" attribute\tBug\nWORDSNET-13970\tHtml to Docx/Pdf conversion issue with SVG \"text-anchor\" attribute\tBug\nWORDSNET-13978\tConverting DOC to PDF - Numbering changed\tBug\nWORDSNET-13994\tThe number list is changed to bullet list in output Pdf\tBug\nWORDSNET-13995\tDiscrepancy merging tables when saving as pdf\tBug\nWORDSNET-14002\tPositions of axis lines not preserved when inserting SVG image in Word document\tBug\nWORDSNET-14003\tData missing when inserting SVG image in Word document\tBug\nWORDSNET-14015\tZero CSS values are considered invalid on certain properties in Standards mode\tBug\nWORDSNET-14020\tWord (DOC and DOCX) file containing Burmese letters to PDF conversion Issue\tBug\nWORDSNET-14039\tExporting Content Controls inside bulleted and numbered lists to HTML\tBug\nWORDSNET-14042\tWORDSNET-13833 has not resolved in v16.7.0\tBug\nWORDSNET-14057\tChinese words are rotated after conversion from Doc to HtmlFixed\tBug\nWORDSNET-14066\tSignature become invalid after conversion from Docx to Pdf\tBug\nWORDSNET-14068\tWhen Chart object in Word document is converted to .jpg image, part of legend is missing\tBug\nWORDSNET-14072\tFooter of produced PDF file has different alignment\tBug\nWORDSNET-14073\tDocumentBuilder.InsertDocument changes page margins in output document\tBug\nWORDSNET-14077\t/font substitution/ Txt to Pdf conversion issue with text encoding/rendering\tBug\nWORDSNET-14081\tText overlapping when Word document is converted to PDF\tBug\nWORDSNET-14085\tChart's Data Table is not rendered correctly in Doc/Pdf\tBug\nWORDSNET-14086\tImage color is lost after conversion from Docx to Html\tBug\nWORDSNET-14096\tHebrew text alignment problem in PDF\tBug\nWORDSNET-14115\tAspose.Words.FileCorruptedException when opening RTF file\tBug\nWORDSNET-14117\tDOCX to PDF conversion produces blurred output\tBug\nWORDSNET-14121\tImage renders as black box in output XPS\tBug\nWORDSNET-14130\tWriteProtection.IsWriteProtected returns wrong value for RTF\tBug\nWORDSNET-14132\tImages are inverted after conversion from Doc to Pdf\tBug\nWORDSNET-14133\tImages are inverted after conversion from Doc to Pdf\tBug\nWORDSNET-14141\t/Mixed fonts metrics/ A blank page got inserted when rendering\tBug\nWORDSNET-14149\tLower case formatting of mail merge is lost in output document\tBug\nWORDSNET-14155\tMS Word equation conversion problem during rendering\tBug\nWORDSNET-14158\tFormula negative value is not rendered correctly (German)\tBug\nWORDSNET-14163\tHyperlink.Result update = lost link formatting (font size, link color)\tBug\nWORDSNET-14180\tRange.Replace overloads not finding text to replace in citations\tBug\nWORDSNET-4632\tREF field switches does not work correctly.\tBug\nWORDSNET-4723\tField code is taken from a deleted run when change tracking is on.\tBug\nWORDSNET-5789\t/KeepWithNext + Shape/ The output PDF page count is greater than the input document.\tBug\nWORDSNET-5892\tHidden ASK field becomes visible when converting to Fixed Page Formats\tBug\nWORDSNET-7900\t/table grid/ Table width is incorrect in PDF\tBug\nWORDSNET-8650\tNot correct working NEXTIF field with nested fields and spaces\tBug\nWORDSNET-8674\tDocx to Pdf conversion issue with table layout\tBug\nWORDSNET-8763\tTable width is changed upon rendering document.\tBug\nWORDSNET-9217\tA DrawingML is rendering more towards the left edge of PDF\tBug\nWORDSNET-9249\t/advanced typography/ Arabic characters are being rendered as circles in TIFF format\tBug\nWORDSNET-9295\tContents are missing in output Pdf file after conversion from Doc file\tBug\nWORDSNET-9306\tDashed type Straight Line Connector Shape is converted to solid line during open/save DOCX\tBug\nWORDSNET-9667\tContents move to previous page after conversion from Docx to fixed file format\tBug\nWORDSNET-9900\tBuiltInDocumentProperties.LastPrinted is not updated when saving in pdf format\tBug\nWORDSNET-9939\tDocx to Pdf conversion issue with Field rendering\tBug\nWORDSNET-11358\tTrack changes on Heading issue in HTML\tEnhancement\nWORDSNET-12027\tGenerate results closer to what Word generates after comparison\tEnhancement\nWORDSNET-12339\tCompare Word documents is wrongly comparing Normal text to Heading text\tEnhancement\nWORDSNET-12460\tEnhancement in Document.Compare when complete section is removed/inserted\tEnhancement\nWORDSNET-12461\tEnhancement in Document.Compare (when a lot of contents are changed)\tEnhancement\nWORDSNET-14160\tReduce number of [span] in HtmlFixed\tEnhancement\nWORDSNET-14196\tTable top row is missing when DOCX converted to PDF\tEnhancement\nWORDSNET-5582\tConsider filling multiple regions with the same name.\tEnhancement\nWORDSNET-8396\tMulti-paragraph DocVariable do not render correctly in output Pdf\tEnhancement\nWORDSNET-13297\tSystem.InvalidOperationException occurs when saving DOCX to DOCX\tException\nWORDSNET-13556\tException is thrown in VmlShapeReader while reading VML shape\tException\nWORDSNET-13775\tSystem.ArgumentException is thrown while saving Odt to image\tException\nWORDSNET-13826\tSystem.InvalidCastException is thrown while loading document under different Culture\tException\nWORDSNET-13874\tBookmark.Text throws System.ArgumentException\tException\nWORDSNET-13945\tLayoutEnumerator.Kind throws System.ArgumentOutOfRangeException\tException\nWORDSNET-13979\tSystem.InvalidCastException is thrown while loading document under different Culture\tException\nWORDSNET-13984\tinserting MathML with insertHTML - bug with binomials\tException\nWORDSNET-13985\tSystem.IndexOutOfRangeException occurs during saving to HTML\tException\nWORDSNET-14023\tSystem.NullReferenceException is thrown while saving Docx to Html.\tException\nWORDSNET-14055\tDocument.Save throws System.NullReferenceException\tException\nWORDSNET-14187\tArgumentException is thrown while saving to png\tException\nWORDSNET-7527\t/slow/ Document.Save method throws exception while conversion from Docx to fixed file format\tException\nWORDSNET-10723\tReply To Comments nesting is lost during open/save a DOC\tFeature\nWORDSNET-12337\tCompare documents like MS Word does\tFeature\nWORDSNET-12387\tAdd feature to compare document as MS Word does\tFeature\nWORDSNET-13740\tChinese text renders incorrectly in HtmlFixed\tFeature\nWORDSNET-13851\t/document grid + charSpace/ Shape's text is truncated in HtmlFixed\tFeature\nWORDSNET-13852\t/document grid + charSpace/ Chinese text moves to next line and pushes text to next page in HtmlFixed\tFeature\nWORDSNET-13999\tSupport underline color during HTML import/export\tFeature\nWORDSNET-14046\tSupport edit revisions for table cells.\tFeature\nWORDSNET-3762\tConsider adding an ability to determine 2007/2010 compliance.\tFeature\nWORDSNET-4660\tAdd an ability to get field names from Addressblock fields.\tFeature\nWORDSNET-9210\tAdd feature to detect OoxmlCompliance of Document\tFeature\nWORDSNET-976\tAdd an analogue of the Fields.Unlink method.\tFeature\nWORDSNET-9769\tDocx-Html-Docx round-trip - Add feature to preserve Page field\tFeature\nWORDSNET-14027\tGetEffectsKey() causes a performance decrease when comparing 16.6 to 13.2\tPerformance\nWORDSNET-14165\tSystem.NullReferenceException occurs during converting DOCX to PDF\tRegression",
  "requireLicenseAcceptance": true,
  "title": "Aspose.Words for .NET",
  "verbatimVersion": "16.10.0",
  "version": "16.10.0",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2016.10.12.21.18.59/aspose.words.16.10.0.json#Aspose.Words.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 3781,
      "fullName": "Aspose.Words.nuspec",
      "length": 10745,
      "name": "Aspose.Words.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2016.10.12.21.18.59/aspose.words.16.10.0.json#lib/net20/Aspose.Words.dll",
      "@type": "PackageEntry",
      "compressedLength": 5288571,
      "fullName": "lib/net20/Aspose.Words.dll",
      "length": 11689472,
      "name": "Aspose.Words.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2016.10.12.21.18.59/aspose.words.16.10.0.json#lib/net20/Aspose.Words.xml",
      "@type": "PackageEntry",
      "compressedLength": 216080,
      "fullName": "lib/net20/Aspose.Words.xml",
      "length": 1578705,
      "name": "Aspose.Words.xml"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2016.10.12.21.18.59/aspose.words.16.10.0.json#lib/net35-client/Aspose.Words.dll",
      "@type": "PackageEntry",
      "compressedLength": 5288915,
      "fullName": "lib/net35-client/Aspose.Words.dll",
      "length": 11688960,
      "name": "Aspose.Words.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2016.10.12.21.18.59/aspose.words.16.10.0.json#lib/net35-client/Aspose.Words.xml",
      "@type": "PackageEntry",
      "compressedLength": 215885,
      "fullName": "lib/net35-client/Aspose.Words.xml",
      "length": 1577613,
      "name": "Aspose.Words.xml"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2016.10.12.21.18.59/aspose.words.16.10.0.json#lib/net40/Aspose.Words.dll",
      "@type": "PackageEntry",
      "compressedLength": 5288859,
      "fullName": "lib/net40/Aspose.Words.dll",
      "length": 11674624,
      "name": "Aspose.Words.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2016.10.12.21.18.59/aspose.words.16.10.0.json#lib/net40/Aspose.Words.xml",
      "@type": "PackageEntry",
      "compressedLength": 216080,
      "fullName": "lib/net40/Aspose.Words.xml",
      "length": 1578705,
      "name": "Aspose.Words.xml"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2016.10.12.21.18.59/aspose.words.16.10.0.json#lib/net40-client/Aspose.Words.dll",
      "@type": "PackageEntry",
      "compressedLength": 5289607,
      "fullName": "lib/net40-client/Aspose.Words.dll",
      "length": 11689472,
      "name": "Aspose.Words.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2016.10.12.21.18.59/aspose.words.16.10.0.json#lib/net40-client/Aspose.Words.xml",
      "@type": "PackageEntry",
      "compressedLength": 215885,
      "fullName": "lib/net40-client/Aspose.Words.xml",
      "length": 1577613,
      "name": "Aspose.Words.xml"
    }
  ],
  "tags": [
    "Word",
    "DOC",
    "DOCX",
    "OOXML",
    "OpenDocument",
    "PDF",
    "XPS",
    "ODT",
    "HTML",
    "XHTML",
    "WordprocessingML",
    "Document",
    "EPUB"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    }
  }
}