{
  "@id": "https://api.nuget.org/v3/catalog0/data/2015.08.07.20.37.31/aspose.words.15.7.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "Aspose",
  "catalog:commitId": "a8f16cce-b18b-4829-87ad-aeae64e503b1",
  "catalog:commitTimeStamp": "2015-08-07T20:37:31.5775652Z",
  "copyright": "(C) Aspose 2002-2015. All Rights Reserved.",
  "created": "2015-08-07T20:36:42.337Z",
  "description": "Aspose.Words for .NET is a class library for .NET that enables you to perform a wide range of document processing tasks directly within your .NET applications.",
  "iconUrl": "http://www.aspose.com/images/products/dotnet/Aspose.Words_128x128.png",
  "id": "Aspose.Words",
  "isPrerelease": false,
  "lastEdited": "0001-01-01T00:00:00Z",
  "licenseUrl": "http://www.aspose.com/corporate/purchase/end-user-license-agreement.aspx",
  "packageHash": "Ct6uUSOtn5y9p0T9jHW9GXAIbkKdQqe7qgk3IKSL/6d6g8mziETJAPqlWRDzOgaSZHHYwivcLaU40c6S1FM0Ew==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 10306262,
  "projectUrl": "http://www.aspose.com/categories/.net-components/aspose.words-for-.net/default.aspx",
  "published": "2015-08-07T20:36:42.337Z",
  "releaseNotes": "Aspose.Words for .NET 15.7 Release Notes\n\n\nMajor Features\n\nThere are 103 improvements and fixes in this regular monthly release. The most notable are: \n\n* Added API to work with Themes\n* Allow inserting of TIFF images\n* API to change footnote/endnote separator\n* Improved footnote balancing\n* Improved text wrapping around objects in footers\n* Ternary raster operations for EMF/WMF rendering implemented\n* PDF background rendering improved\n* Text with gradient fill rendering implemented\n* Japanese OTF fonts overlapping characters problem in rendered images fixed\n\nAll Changes\n\nKey Summary Category \nWORDSNET-10241 Text with gradient fill not saved in PDF output Bug \nWORDSNET-10740 Line breaks at incorrect word during open/save a RTF Bug \nWORDSNET-11093 CheckBox is visible after re-saving Doc Bug \nWORDSNET-11117 Bigger copy of existing image appears after open/save a DOC Bug \nWORDSNET-11258 ParagraphFormat and ListFormat attribute values are not presevred when importing Style to another Document Bug \nWORDSNET-11260 ParagraphFormat attribute values are not presevred when importing Style to another Document Bug \nWORDSNET-11282 Picture inside word document turns into black square after converting to PDF/A Bug \nWORDSNET-11395 Textboxes are incorrectly converted to images in MHTML Bug \nWORDSNET-11569 HTML multilevel list is improperly imported when list item is empty. Bug \nWORDSNET-11629 Html to Word document conversion issue with Svg Bug \nWORDSNET-11688 /negative page margins/ Content missing and many pages are produced in PDF Bug \nWORDSNET-11701 Editable SDT is no longer editable in generaed DOCX Bug \nWORDSNET-11857 Docx to Pdf conversion issue with multi lines Chinese text Bug \nWORDSNET-11881 Font size is changed after conversion from RTF to Docx Bug \nWORDSNET-11929 Footnote symbol turns into square box and Footnote marker is repeated twice Bug \nWORDSNET-11974 Text is missing after conversion form Docx to Jpeg Bug \nWORDSNET-11994 Saving Word document with a Textbox changes the Textbox's layout Bug \nWORDSNET-12000 Charts are missing after re-saving docx Bug \nWORDSNET-12005 Html to Docx/pdf conversion issue with Superscript Bug \nWORDSNET-12021 The symbol(†) is missing after conversion from Doc to pdf Bug \nWORDSNET-12024 Some document elements and Layout is not preserved during open/save an ODT Bug \nWORDSNET-12038 Unexpected information is presented in Footer Bug \nWORDSNET-12039 CellFormat.Orientation return incorrect value Bug \nWORDSNET-12043 Texture fill effect renders different when saving to PDF Bug \nWORDSNET-12044 Logo on top left of page is not rendering correctly in PDF Bug \nWORDSNET-12052 SDT data is lost during saving to PDF Bug \nWORDSNET-12055 Aspose.Words.FileCorruptedException when reading HTML document. Bug \nWORDSNET-12060 Watermark (shape node) is lost after re-saving Docx Bug \nWORDSNET-12074 Doc to pdf/html conversion issue with list labels Bug \nWORDSNET-12082 Update fields with \"de-DE\" culture doesn't work Bug \nWORDSNET-12084 Convert RTF to PDF/RTF scrambles up document's paragraphs Bug \nWORDSNET-12087 Page margins are changed after re-saving ODT Bug \nWORDSNET-12088 Content position is changed after re-saving Odt Bug \nWORDSNET-12090 Take in a count Dml textbox shape border width during rendering. Bug \nWORDSNET-12094 Assert in LineReflower fires when the line starts with floating shape. Bug \nWORDSNET-12104 Continuous Section break is converted to Section Break (Next Page) Bug \nWORDSNET-12109 Document.GetPageInfo(0) goes into infinite loop Bug \nWORDSNET-12122 Hand symbols inside Textboxs renderd upside down in PDF Bug \nWORDSNET-3898 /tiff insert/ TIF image is too dark after inserting into a document. Bug \nWORDSNET-3987 Rtl paragraph containing more than one inline element is imported incorrectly Bug \nWORDSNET-4158 The field code of FormField is not changed after changing FormField type. Bug \nWORDSNET-4450 Export table styles to HTML Bug \nWORDSNET-4465 \"Error! Unknown op code for conditional.\" is shown after executing mail merge. Bug \nWORDSNET-4498 Support revisions upon importing HTML. Bug \nWORDSNET-4823 Content from first two pages overlaps when exporting to HTML Bug \nWORDSNET-4929 Items from field code go to TOC Bug \nWORDSNET-5144 /import floating image/ Floating image is imported from Html as inline Bug \nWORDSNET-5202 Aspose Generated PDF contains critical parser error Bug \nWORDSNET-5425 Non-ASCII characters are missing from EPUB TOC entries Bug \nWORDSNET-5494 Object reference exception occurs when inserting a table into a hanging cell via InsertHtml Bug \nWORDSNET-5507 /hidden/ Hidden text causes a redundant blank page upon rendering. Bug \nWORDSNET-5540 Document in memory is changed during saving to Doc. These changes break its saving to Html Bug \nWORDSNET-5611 Figure misplaced and becomes black upon conversion to epub. Bug \nWORDSNET-5652 Image followed the paragraph appears inside the paragraph after importing HTML. Bug \nWORDSNET-5982 RTL paragraph alignment is not preserved upon DOC to HTML conversion Bug \nWORDSNET-6067 /import floating image/ While converting html to doc, Image aligned centre to left. Bug \nWORDSNET-6169 Extra page appears during rendering Bug \nWORDSNET-6247 Header text position is slightly incorrect while converting docx to PDF format. Bug \nWORDSNET-6422 The wrong layout. Inline shape truncation and incorrect horizontal position Bug \nWORDSNET-6475 Frame lost when encounters paragraph tag of Html (Aspose.Words for java) Bug \nWORDSNET-6487 Doc to PDF conversion issue, colour blocks appears on the page Bug \nWORDSNET-6526 Unable to view Aspose.Words generated DOCX file with MS WORD WEB APP Bug \nWORDSNET-6637 Unexpected empty bookmark appears in output pdf file Bug \nWORDSNET-9519 UpdateFields does not calculate SUM forumla field's value correctly Bug \nWORDSNET-9647 An extra page is rendered at the end of PDF Bug \nWORDSNET-9802 ALPHABETIC switch of AUTONUM field is not preserved upon building TOC Bug \nWORDSNET-11289 Include version in the file name of the MSI Enhancement \nWORDSNET-11619 Ternary raster operations work incorrectly Enhancement \nWORDSNET-11784 Check if there are any restrictions on certificate usage when signing Enhancement \nWORDSNET-11799 Transparency is lost when converting Emf to Png Enhancement \nWORDSNET-11978 Rectangles appear on some characters after ODT to HTML_Fixed Enhancement \nWORDSNET-12020 Support 'width' attribute of 'col' element in HTML import Enhancement \nWORDSNET-12111 Checkbox states are not preserved during open/save a DOCX Enhancement \nWORDSNET-12149 DocumentBuilder.InsertOleObject behaves differently for MPP files created with Aspose.Tasks Enhancement \nWORDSNET-12154 Shadow looks bigger than should be when DmlRenderingMode.DrawingML is set as default. Enhancement \nWORDSNET-2491 Improve horizontal rule support Enhancement \nWORDSNET-8706 /footnote balance/ Footnote balancing is not perfect Enhancement \nWORDSNET-9205 Portable implementation of SRC_PAINT ternary raster operation for EMF/WMF. Enhancement \nWORDSNET-9831 Mention expandTableStylesToDirectFormatting in Working with Tables docs Enhancement \nWORDSNET-9861 Mention in Docs that Aspose.Words uses \"system property for temporary dir\" upon rendering Enhancement \nWORDSNET-11509 System.ArgumentOutOfRangeException is thrown while saving Docx to Pdf Exception \nWORDSNET-11759 System.NullReferenceException is thrown while creating instance of StructuredDocumentTag Exception \nWORDSNET-11945 Aspose.Words.FileCorruptedException occurs during loading a DOCX Exception \nWORDSNET-11964 Aspose.Words.FileCorruptedException is thrown while loading Docx Exception \nWORDSNET-12015 Document.Save throws System.ArgumentOutOfRangeException Exception \nWORDSNET-12051 System.ArgumentOutOfRangeException is thrown while saving Docx to Html Exception \nWORDSNET-12065 Aspose.Words.FileCorruptedException is thrown while loading Docx Exception \nWORDSNET-12066 System.ArgumentNullException thrown when ResourceLoadingCallback is specified Exception \nWORDSNET-12068 System.InvalidOperationException is thrown while saving docx to pdf Exception \nWORDSNET-12144 System.InvalidOperationException is thrown while converting RTF to Doc Exception \nWORDSNET-12185 DOC file cannot be loaded and throws The document appears to be corrupted exception Exception \nWORDSNET-10513 Provide API to programmatically manipulate Themes Feature \nWORDSNET-10557 How to get/set Shape height/width when it is in GroupShape Feature \nWORDSNET-11763 Footnote Continuation Notice is not preserved when saving a document Feature \nWORDSNET-11981 Support for MERGEBARCODE merge field Feature \nWORDSNET-2748 Provide an option to suppress writing CSS style sheet to external file. Feature \nWORDSNET-2768 Implement Run.GetAutoFontColorResolved to determine actual color of text output that will be used for the \"auto color\" Feature \nWORDSNET-425 Allow inserting TIFF images Feature \nWORDSNET-4255 Allow changing footnote/endnote separator. Feature \nWORDSNET-5251 Consider providing a one line method in the API for InsertDocument Feature \nWORDSNET-6051 Implement Load and Save warnings for HTML/MHTML/EPUB formats Feature \nWORDSNET-866 Support TABLE.borderColor attribute import. Feature \nWORDSNET-12114 LineStyle.None does not work for table's borders Regression",
  "requireLicenseAcceptance": true,
  "title": "Aspose.Words for .NET",
  "version": "15.7.0",
  "tags": [
    "Word",
    "DOC",
    "DOCX",
    "OOXML",
    "OpenDocument",
    "PDF",
    "XPS",
    "ODT",
    "HTML",
    "XHTML",
    "WordprocessingML",
    "Document",
    "EPUB"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    }
  }
}