{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.11.15.48/_summoners-war-hack-working-2022-version-enw.1.3.89.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "SharpCrafters s.r.o.",
  "catalog:commitId": "e4f6db62-5eab-44d4-a4c8-68d5d5ee3a0a",
  "catalog:commitTimeStamp": "2022-01-26T11:15:48.2391037Z",
  "created": "2022-01-26T11:12:54.293Z",
  "description": "# _Summoners War Hack Working 2022 Version enw\n\n\nCLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; [http://8.bltadwin.ru/hack.php](http://8.bltadwin.ru/hack.php)\n\n\ndownload › blog › hack-cheat. Summoners War MOD APK Latest version Download for your android Mobile. MOD Features are High Damage, Instant Win, summoners war hack. Contents [hide]. Summoners War Mod Apk (Hack, cracked Unlimited Damage) - New Updates Online game Free crystals, Unlocked, High Attack Mod hack.\n\n## [CLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; http://8.bltadwin.ru/hack.php](http://8.bltadwin.ru/hack.php)\n\nSummoners War Hacks, Cheats  Bots. Download or share your Summoners War hack at world's leading forum for all kind of Summoners War hacks, cheats and bots. Here you will find a list of discussions in the Summoners War forum at the Mobile Games category. Post any trade regarding Summoners War in this downloadted Reading Time: 1 min.  · CLICK HERE 👉👉 FREE SUMMONERS WAR CRYSTALS HACK GENERATOR percent WORKING Resources Tips and Tricks As the game is composed of easy controls and also a modest hard play, so it is crucial for. Free Download Generator Hack In Summoners War ; Free Download Generator Hack In Summoners War Simulator.  · What’s the legit way to get Legendary runes, scrolls, and crystals? 6-Star Runes: 5-Star Runes: Legend Runes: Crystals: Mana: million. Energy: Star Max Rainbowmons: Mystical Scrolls: 3.\n\nsummoners war hacks, summoners war hacks 2021, summoners war hack ios, summoners war hacked account, summoners war hack apk, summoners war hack ipa, summoners war hack that actually works, summoners war hack codes, summoners war hack 2021, summoners war hack ios 2021, summoners war hack crystal, summoners war hack apk 2021, summoners war hack apk 2020, summoners war hack android, summoners war hack apk ios, summoners war hack app ios, summoner war hack apk android, summoners war hack best, summoners war hack buy, summoners war bluestacks hack, summoners war hack cydia, summoners war crystal hack no human verification, summoner war crystal hack no survey, summoners war lost centuria hack, summoners war lost centuria ios hack, summoners war free crystals no hack, summoners war hack download, summoners war hack damage, summoners war diamond hack, summoner war hack apk download, summoners war hack pc download, summoners war hack ios deutsch, hack de summoners war, summoners war hack element evil, summoners war energy hack, unlimited energy summoners war hack, summoners war hack erfahrung, code for summoners war hack, hack for summoners war, summoners war hack fr, summoners war hack game guardian, summoners war hack god mode, summoners war gem hack, summoners war account got hacked, tải game summoners war hack, hack game summoners war, summoners war hack without human verification, panda helper summoners war hack, summoners war 1 hit hack, summoners war hack ohne handynummer, summoners war hack iosgods, summoners war hack ios 2020, summoners war hack jailbreak, summoners war kristalle hack, summoners war hack lucky patcher, summoners war hack latest, summoners war ld hack, hack summoners war lost centuria, summoners war legendary scroll hack, summoners war ld nat 5 hack, summoners war hack mod apk, summoners war hack mod, summoners war hack menu, summoners war hack mystical scroll, summoners war monster hack, summoners war mana hack, hack summoner war mới nhất, summoner war hack no survey, summoners war hack ios no jailbreak, hack summoners war nat 5, summoners war temple of wishes hack, summoners war hack ohne verifikation, hack summoners war sans offre, summoners war online hack, summoners war hack pc, summoners war hack platinmods, summoners war private server hack, hack para summoners war 2020, hack para summoners war 2021, summoner war hack, summoners war hack reddit, summoners war hack rune, summoners war hacked account recovery, summoners war hack skill, summoners war summon hack, summoners war scroll hack, summoners war speed hack,",
  "id": "_Summoners-War-Hack-Working-2022-Version-enw",
  "isPrerelease": false,
  "language": "en-US",
  "lastEdited": "2022-01-26T11:15:27.29Z",
  "listed": true,
  "packageHash": "U2MEeJDjrUWDuyHvp/cVs8AlGkeV/mdWjWYFifqNd2leM2L4zzGGFvv8l2UL74RqLirdlD5nGFJQyP40Ra3ZKw==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 11635,
  "published": "2022-01-26T11:12:54.293Z",
  "requireLicenseAcceptance": false,
  "title": "_Summoners-War-Hack-Working-2022-Version-enw",
  "verbatimVersion": "1.3.89",
  "version": "1.3.89",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.11.15.48/_summoners-war-hack-working-2022-version-enw.1.3.89.json#imsugmstju.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1504,
      "fullName": "imsugmstju.nuspec",
      "length": 4476,
      "name": "imsugmstju.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.11.15.48/_summoners-war-hack-working-2022-version-enw.1.3.89.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9471,
      "fullName": ".signature.p7s",
      "length": 9471,
      "name": ".signature.p7s"
    }
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}