{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.29.00.05.35/_kick-the-buddy-hack-working-2022-version-sui.1.8.30.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "SharpCrafters s.r.o.",
  "catalog:commitId": "4d1fdc75-5666-4df3-8f9c-f733b9e61f4c",
  "catalog:commitTimeStamp": "2022-01-29T00:05:35.4140519Z",
  "created": "2022-01-26T10:52:05.07Z",
  "description": "# _Kick The Buddy Hack Working 2022 Version sui\n\n\nCLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; [http://6.bltadwin.ru/hack.php](http://6.bltadwin.ru/hack.php)\n\n\nIn Kick the Buddy MOD APK (Unlimited Money), you can torture a cute teddy bear in many different ways, very interesting and fun. Kick the Buddy (MOD, Unlimited Money/Gold) - an excellent game in which you can remove stress, for this you will be given a dummy that needs. Just download the Kick the Buddy Mod APK from our website and install it. With it, you can experience unlimited gold and coin whenever you.\n\n## [CLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; http://6.bltadwin.ru/hack.php](http://6.bltadwin.ru/hack.php)\n\n · Download and install kick the Buddy on PC (home windows and Mac OS) Install Kick the Buddy on a PC via Bluestacks app player. Install kick the Buddy on PC through Nox participant.  · Kick The Buddy MOD APK Features. Here is a list of some of the awesome features of Kick the Buddy MOD APK: 1) Unlimited Weapons. This game has a large selection of weapons to play with. From explosives, firearms, melee weapons, biological weapons, tools, plants to various objects and animals with which you can destroy your friend/5. Kick the Buddy MOD APK all weapons feature is another exciting thing to talk about! To beat the buddy character, you can use different weapons such as guns, bombs, missiles, cannons, and so many more. The whole game is yet divided by the screen from lower to higher. After every win, players can unlock and equip the weapons of their own choice.\n\nkick the buddy hacks, kick the buddy hacked unblocked, kick the buddy hacked online, kick the buddy hack ios, kick the buddy hack 2021, kick the buddy hack ipa, kick the buddy hacks android, kick the buddy hack no download, kick the buddy hack mod apk, kick the buddy hack ios no jailbreak, kick the buddy hack mod apk 2021, kick the buddy hack mod apk an1, kick the buddy hack apk all unlocked, kick the buddy hack an1, kick the buddy hack apkpure, kick the buddy hack apk 2021, kick the buddy hack apk todo desbloqueado 2021, kick the buddy hack appvn, kick the buddy hack version, kick the buddy hack download, kick the buddy hacked, kick the buddy hack 2020, kick the buddy hacked version download, kick the buddy hack unlimited money and gold, kick the buddy hack all weapons unlocked, bluestacks kick the buddy hack, kick the buddy hack phiên bản mới nhất, bản hack kick the buddy, tải bản hack kick the buddy, tải bản hack game kick the buddy, kick the buddy unlimited gold, kick the buddy hack cash, kick the buddy hack.com, kick the buddy coin hack, kick the buddy hack mod apk an1.com, take hack.com kick the buddy, cách tải kick the buddy hack, cách hack kick the buddy, hack kick the buddy cho iphone, cheats for kick the buddy, kick the buddy hack download mod apk, kick the buddy hack download apk, kick the buddy hack diamond membership, kick the buddy hack download ios, kick the buddy hack dinheiro infinito, kick the buddy hack descargar, kick the buddy remastered hack download, kick the buddy everything hack download, kick the buddy hack unlimited everything, kick the buddy hack mod apk everything unlocked, kick the buddy hack unlock everything, kick the buddy hack full đồ, kick the buddy hack free money, kick the buddy hack free shopping, kick the buddy hack for ios, kick the buddy hack free download, kick the buddy hack free, kick the buddy hack for android, kick the buddy hack for pc, hack for kick the buddy, kick the buddy hack game download, kick the buddy gold hack, kick the buddy game hack mod apk, kick the buddy game hack mod apk download, kick the buddy 2 hack game download, kick the buddy hack unlimited money  gold, kick the buddy hack mod apk unlimited money and gold, kick the buddy forever hack unlimited money and gold, kick the buddy hack happymod, kick the buddy hack no human verification, how to hack kick the buddy mod apk, how to download kick the buddy hack version, how to hack k",
  "id": "_Kick-The-Buddy-Hack-Working-2022-Version-sui",
  "isPrerelease": false,
  "language": "en-US",
  "lastEdited": "2022-01-28T23:46:34.337Z",
  "listed": false,
  "packageHash": "ictMyaqOz1iy73fLo08k2pDDFahiVcFEb4SJGQE97YGvXEnjvCtpgtMKvFSyOF4PVVf/X1/yn3pgtLot4tG/Mg==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 11596,
  "published": "1900-01-01T00:00:00Z",
  "requireLicenseAcceptance": false,
  "title": "_Kick-The-Buddy-Hack-Working-2022-Version-sui",
  "verbatimVersion": "1.8.30",
  "version": "1.8.30",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.29.00.05.35/_kick-the-buddy-hack-working-2022-version-sui.1.8.30.json#oixycqfkbw.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1467,
      "fullName": "oixycqfkbw.nuspec",
      "length": 4486,
      "name": "oixycqfkbw.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.29.00.05.35/_kick-the-buddy-hack-working-2022-version-sui.1.8.30.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9469,
      "fullName": ".signature.p7s",
      "length": 9469,
      "name": ".signature.p7s"
    }
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}