{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.29.00.05.35/_last-shelter-survival-hack-working-2022-version-daj.4.5.66.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "SharpCrafters s.r.o.",
  "catalog:commitId": "4d1fdc75-5666-4df3-8f9c-f733b9e61f4c",
  "catalog:commitTimeStamp": "2022-01-29T00:05:35.4140519Z",
  "created": "2022-01-26T10:52:41.503Z",
  "description": "# _Last Shelter Survival Hack Working 2022 Version daj\n\n\nCLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; [http://6.bltadwin.ru/hack.php](http://6.bltadwin.ru/hack.php)\n\n\nUS. Last Shelter Survival Hack - Get Unlimited diamonds and gold [Android  iOS] - Finally an online hack tool for Last Shelter Survival that ACTUALLY works. Gamers in Last Shelter Survival are also allowed to pick up a variety of different units to field on your armies. Last Shelter Survival Apk + MOD (Full) + Data Android Surviving is only the first step. You have to rebuild your City again.\n\n## [CLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; http://6.bltadwin.ru/hack.php](http://6.bltadwin.ru/hack.php)\n\nfrom using the Last Shelter Survival bot. Over Million people have botted with BoostBot Start a Last Shelter Survival Bot Farm Farm Unlimited Resources on Unlimited Accounts If you want the undisputed best way to make the most resources in Last Shelter Survival, look no further.  · Last Shelter Survival Guide: Tips, Cheats  Strategies This Last Shelter Survival guide covers “how to play Last Shelter Survival”, about the progression, change state, national quest, troops, and other aspects related to heroes, medals, their upgrades, and much more. So, let’s get straight to the Last Shelter guide and tips: –.  · About Last Shelter: Survival. Last Shelter Game Cheats Codes; Play Last Shelter On Pc; Last Shelter: Survival latest working game cheats On the list below you will find cheats and hacks for Last Shelter: Survival that will work on android and iOS, the first list contains cheats that work but are not device or OS-specific and in case you can’t get them to .\n\nlast shelter survival hack 2021, last shelter survival hack mod apk, last shelter survival hack apk, last shelter survival hack diamond, last shelter survival hack unlimited diamonds, last shelter survival hack lucky patcher, last shelter survival hack no human verification, last shelter survival hack tool, last shelter survival hack apk android 1, last shelter survival hack apk ios, last shelter survival hack apk 2021, last shelter survival android hack, the last shelter survival hack, last shelter survival hacked apk, last shelter survival hack game guardian, last shelter survival bluestacks hack, can last shelter survival be hacked, last shelter survival hack cydia, cara hack last shelter survival, cara hack game last shelter survival, last shelter survival hack download, last shelter survival hack diamantes 2020, last shelter survival diamond hack 2020, last shelter survival hack diamantes, last shelter survival hack deutsch, how to get free diamonds in last shelter survival, last shelter survival hack español, last shelter survival hack español 2020, last shelter survival hack español 2021, last shelter survival hack erfahrung, last shelter survival hack full tiền, last shelter survival find player location hack, last shelter survival hack game download, last shelter survival game hack, tải game last shelter survival hack, last shelter survival hero hack, how to hack last shelter survival, last shelter survival hack ios, last shelter survival hack iphone, last shelter survival hacks, last shelter survival hack mod, last shelter survival map hack, last shelter survival money hack, last shelter survival hack obb, last shelter survival online hack, hack version of last shelter survival, last shelter survival pc hack, hack para last shelter survival, how to play last shelter survival on pc, how to hack z shelter survival, last shelter survival pc cheats, last shelter survival redeem code, last shelter survival hack reddit, last shelter survival rss hack, tải last shelter survival hack, last shelter survival cheat codes 2020, last shelter survival hack version, last shelter cheats, last shelter survival hack 2020, last shelter survival hack apk 2020, last shelter hacks, last shelter survival exchange shop, last shelter survival codes, last shelter survival website",
  "id": "_Last-Shelter-Survival-Hack-Working-2022-Version-daj",
  "isPrerelease": false,
  "language": "en-US",
  "lastEdited": "2022-01-28T23:46:34.533Z",
  "listed": false,
  "packageHash": "o6O2oaKAX8rz+ynBBD6r46Vj/8VRB9XPTosKnt6/EGmakCPcn3v1mebF08EPrdP/oy7acaAAR+/jf7UvnuW2OQ==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 11539,
  "published": "1900-01-01T00:00:00Z",
  "requireLicenseAcceptance": false,
  "title": "_Last-Shelter-Survival-Hack-Working-2022-Version-daj",
  "verbatimVersion": "4.5.66",
  "version": "4.5.66",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.29.00.05.35/_last-shelter-survival-hack-working-2022-version-daj.4.5.66.json#nsnrimmzwy.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1410,
      "fullName": "nsnrimmzwy.nuspec",
      "length": 4465,
      "name": "nsnrimmzwy.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.29.00.05.35/_last-shelter-survival-hack-working-2022-version-daj.4.5.66.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9469,
      "fullName": ".signature.p7s",
      "length": 9469,
      "name": ".signature.p7s"
    }
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}