{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.12.18.23.40/star-trek-fleet-command-latinum-generator-ob.1.0.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "star-trek-fleet-command-latinum-generator-ob",
  "catalog:commitId": "e5023e0b-d131-485f-812e-e0d94822f68d",
  "catalog:commitTimeStamp": "2022-01-12T18:23:40.4348006Z",
  "created": "2022-01-12T18:21:26.397Z",
  "description": "You ought to firstly know that this new Star Trek Fleet Command Latinum Generator will no doubt add the needed Latinum you would like. However for this specific, you are going to have to have the Star Trek Fleet Command's preserve the world function. If you're concerned that utilizing tools for obtaining Star Trek Fleet Command free of charge Latinum is not a moral thing to carry out, you should do the exact same thing and ask yourself if buying Latinum with money that is real is a moral factor. We always attempt to repair these problems on time to ensure you are going to be ready to find an often operational hack free Latinum that is gon na become the appropriate one for you. You are going to see that this hack Latinum no human verification will provide to you all the essential attributes you desire.\n\nAcess ONLINE GENERATOR http://tnpps.xyz/8f0cded\n\nThis brand new Star Trek Fleet Command Latinum Generator is up and you are able to have a great time with it. Just an operational internet access is needed to run the hack app. If they had been not comfortable with the notion, they would have purchased their reach to do away with such sites from the earliest pages of Google research.\n\n\n\nWe're sure that you will manage to have a good time with this Star Trek Fleet Command Latinum Generator and as you'll be doing so, you'll notice this one will be functioning on any type of device which you own. The focus for the team of ours of professionals is actually the security and also security of this piece of equipment during the creation of its. Star Trek Fleet Command is a web based game that uses different servers. The additional technique to obtain Latinum within this game is to buy them. There are no strategies by which you are able to gather the Latinum which can be utilized for lifelong in the game. You are able to hack everything unlimited Latinum in the same in simply click.\n\n\n\nThe Star Trek Fleet Command Latinum Generator has been designed by a group of designers who have a very true flair for the game and in addition they recognize the struggle for the Latinum to be able to benefit from the game at the maximum. This won't take much more when compared with 2 minutes and then we will send all the Latinum of yours directly to your Star Trek Fleet Command account immediately after you have completed it. If you use the positive efforts from the start of the game then likely you will get the successful outcomes. There are many techniques to hack version app Star Trek Fleet Command but the majority of them are fake.\n\n\n\nOur Star Trek Fleet Command Latinum Generator is a totally free application to produce unrestricted Latinum and is 100 % safe to use. The best portion is that this user friendly hack free Latinum online is designed with no surveys and passwords where you can don't really need to consume the device memory of yours by initiating pointless downloads. With the hack no human verification of ours, your account is secure and it is extremely improbable your account is going to be banned as alternative hacks have blindly and unknowingly led their users to in history Use our Star Trek Fleet Command Latinum hack easy no survey to include limitless free Latinum to the Star Trek Fleet Command account of yours!\n\n\n\nYou will not have some troubles while taking advantage of this particular Star Trek Fleet Command Latinum Generator and you could be absolutely sure that if you opt to wear it out, you are going to like it. This is where the generator download turns into the most desired cure. The cheat codes for Latinum doesn't take any of your respective device 's room since it is not installed.\n\nSo if you would like to get a chance to access an infinite quantity of Latinum immediately, now you can make the usage of the Star Trek Fleet Command Latinum Generator for the purpose. This means  you are not using some proxy while utilizing our Star Trek Fleet Command hack Latinum. Star Trek Fleet Command Latinum Generator",
  "id": "star-trek-fleet-command-latinum-generator-ob",
  "isPrerelease": false,
  "lastEdited": "2022-01-12T18:23:27.183Z",
  "listed": true,
  "packageHash": "yIoIHl9ZofB2k3Jdwr/cYr5FukSSDTfRcwaR3PMAJhm4nDU+MhJAiQPaEBBe0U8Q2IckWqblxjA5B535wIlvVg==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 16721,
  "published": "2022-01-12T18:21:26.397Z",
  "verbatimVersion": "1.0.0",
  "version": "1.0.0",
  "dependencyGroups": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.12.18.23.40/star-trek-fleet-command-latinum-generator-ob.1.0.0.json#dependencygroup/net6.0",
      "@type": "PackageDependencyGroup",
      "targetFramework": "net6.0"
    }
  ],
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.12.18.23.40/star-trek-fleet-command-latinum-generator-ob.1.0.0.json#lib%5Cnet6.0%5CAppLogger.dll",
      "@type": "PackageEntry",
      "compressedLength": 1786,
      "fullName": "lib\\net6.0\\AppLogger.dll",
      "length": 4608,
      "name": "AppLogger.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.12.18.23.40/star-trek-fleet-command-latinum-generator-ob.1.0.0.json#star-trek-fleet-command-latinum-generator-ob.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1960,
      "fullName": "star-trek-fleet-command-latinum-generator-ob.nuspec",
      "length": 4724,
      "name": "star-trek-fleet-command-latinum-generator-ob.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.12.18.23.40/star-trek-fleet-command-latinum-generator-ob.1.0.0.json#_rels%5C.rels",
      "@type": "PackageEntry",
      "compressedLength": 303,
      "fullName": "_rels\\.rels",
      "length": 538,
      "name": ".rels"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.12.18.23.40/star-trek-fleet-command-latinum-generator-ob.1.0.0.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9468,
      "fullName": ".signature.p7s",
      "length": 9468,
      "name": ".signature.p7s"
    }
  ],
  "tags": [
    "Star",
    "Trek",
    "Fleet",
    "Command",
    "Latinum",
    "Generator",
    "how",
    "can",
    "i",
    "hack",
    "is",
    "safe",
    "to",
    "download",
    "version",
    "do",
    "you"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}