{
  "@id": "https://api.nuget.org/v3/catalog0/data/2015.09.11.08.15.58/aspose.pdf.10.8.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "Aspose",
  "catalog:commitId": "eaf1fbb5-6688-47ec-953b-d691b7b3146e",
  "catalog:commitTimeStamp": "2015-09-11T08:15:58.1479415Z",
  "copyright": "©Aspose 2002-2014. All Rights Reserved.",
  "created": "2015-09-11T08:14:47.823Z",
  "description": "Aspose.Pdf for .NET is a PDF document creation and manipulation component that enables your .NET applications to read, write and manipulate existing PDF documents without using Adobe Acrobat. It also allows you to create forms and manage form fields embedded in a PDF document. This component is written in managed C# and it allows developers to add PDF creation and manipulation functionality to their Microsoft .NET applications (WinForms, ASP.NET and .NET Compact Framework).\n        Aspose.Pdf for .NET is affordable and offers an incredible wealth of features including PDF compression options; table creation and manipulation; support for graph objects; extensive hyperlink functionality; extended security controls; custom font handling; integration with data sources; add or remove bookmarks; create table of contents; add, update, delete attachments and annotations; import or export PDF form data; add, replace or remove text and images; split, concatenate, extract or inset pages; transform pages to image; print PDF documents and much more.",
  "iconUrl": "http://www.aspose.com/blogs/wp-content/uploads/2013/06/aspose-Pdf-for-net_100.png",
  "id": "Aspose.Pdf",
  "isPrerelease": false,
  "lastEdited": "0001-01-01T00:00:00Z",
  "licenseNames": "",
  "licenseReportUrl": "",
  "licenseUrl": "http://www.aspose.com/corporate/purchase/end-user-license-agreement.aspx",
  "listed": true,
  "packageHash": "twy4c9ntMv2iXDNkAS2Q75pJ6cSK/oUWTjTf6kAQchPzxCtzqC0oPw9F8LP+xS3VN616Wn/TrV2njIxQ+rt8eg==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 29955165,
  "projectUrl": "http://www.aspose.com/categories/.net-components/aspose.pdf-for-.net/default.aspx",
  "published": "2015-09-11T08:14:47.823Z",
  "releaseNotes": "This release introduces the features, enhancements and bug fixes as detailed below:\n\nExceptions\nPDFNEWNET-34222\tSystem.StackOverflowException during HTML to PDF conversion\nPDFNEWNET-38498\tException while adding HTML contents inside table cell\nPDFNEWNET-39191\tCreation of TextFragment with Teligu/hindy texts throws NullReferenceException on absolutely \"clean\" test mahine (with only standard Windows fonts)\nPDFNEWNET-38853\tXML to PDF conversion throws ArgumentException\n\nBugs\nPDFNEWNET-37829 PDF to PDFA1B: compliance failure\nPDFNEWNET-36332\tIncorectly converting international characters from text file\nPDFNEWNET-39259\tFootnote does not reflect as expected when document expand to second page\nPDFNEWNET-38890\tInline image rendering issues\nPDFNEWNET-39089\tFootNote does not render correctly when using LineSpacing\nPDFNEWNET-39221\tLinespacing issue with multiple TextFragments containing hyperlinks\nPDFNEWNET-39195\tTextReplace moves page contents\nPDFNEWNET-38642\tPDF to APS : text is converted incorrectly(weird chars appear in result APS).\nPDFNEWNET-39266\tFloatingBox ignores the margin setting of TextFragment with IsInlineParagrapsh property set to true\nPDFNEWNET-38963\tPDF to HTML results incorrect output\nPDFNEWNET-38819\tPDF to HTML - Text is overlapped in Header section\nPDFNEWNET-38896\tText wrapping in FreeTextAnnotation\nPDFNEWNET-38522\tImage to PDF - Evaluation watermark appears when setting IsBlackWhite as True\nPDFNEWNET-39108\tAuto font size of form field is not being honored after Aspose.PDF API fill\nPDFNEWNET-38039\tTo replace attachments in PDF file\nPDFNEWNET-39198\tTOC split while using the heading property IsInNewPage\nPDFNEWNET-39254\tLinespacing issue of first line with IsInlineParagraph property\nPDFNEWNET-38728\tHTML to PDF: HTML file with SVG image throws exception\nPDFNEWNET-38912\tHTML to PDF: HTML containing svg\nPDFNEWNET-38516\tPDF to DOCX - Images are flipped in resultant files\nPDFNEWNET-38877\tPDF to PDFA preflight verification failed\nPDFNEWNET-39051\tRepeating Header row of table has left Alignment, instead of Center\nPDFNEWNET-38960\tTable issue in FloatingBox\nPDFNEWNET-38815\tEPUB to PDF: PDF page is trimmed\nPDFNEWNET-34223\tDoc to PDF and then PDF to Image does not show Chinese Text\nPDFNEWNET-34854\tForm Fill: Fields associated with drop down are not appearing\nPDFNEWNET-39119\tWords split across lines in table\nPDFNEWNET-36083\tXML to PDF: Tab stop issue\nPDFNEWNET-39273 PDF to HTML: square characters are rendered in resultant HTML\nPDFNEWNET-38825 PDF to HTML conversion takes too much time\nPDFNEWNET-39302 Exception when trying to convert XFA to Standard format\nPDFNEWNET-38593 PDF to HTML: results encoding issue\nPDFNEWNET-38976 XPS to PDF throws exception while using Aspose.Pdf for .NET net4.0 dll\nPDFNEWNET-36258 PCL to PDF conversion: Text postion\nPDFNEWNET-38934 HTML to PDF: Checkboxes are not visible",
  "requireLicenseAcceptance": true,
  "summary": "Aspose.Pdf for .NET is an amazing component which provides the feature to create and manipulate PDF documents.",
  "title": "Aspose.Pdf for .NET",
  "verbatimVersion": "10.8.0",
  "version": "10.8.0",
  "tags": [
    "Aspose.Pdf",
    "PDF",
    "XFA",
    "XPS",
    "TIFF",
    "PCL",
    "SVG",
    "HTML",
    "XML",
    "XSL-FO",
    "FDF",
    "XFDF",
    "PDF/A",
    "form",
    "Portfolio",
    "EPUB",
    "PSD",
    "to",
    "XLS",
    "DOC"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    }
  }
}