{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.29.16.31.34/the.new.amazon.gift.card.generator.2022.7.7.7.7.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "adri",
  "catalog:commitId": "90e2d407-549a-444e-a4a2-7d8fde3dea4c",
  "catalog:commitTimeStamp": "2022-01-29T16:31:34.5203288Z",
  "created": "2022-01-29T16:02:26.02Z",
  "description": "Amazon Gift Card Generator 2022\n\noday I want to present you a web page where you can generate Amazon gift card codes.\nThe process is quite simple, you just need to enter the website and select one of the 3 available options.\nThere are $20, $50 and $100 gift cards, after about 30 seconds the gift card is generated\nand you can see the code.\n\nhttps://unlimitedgiftcards.online/amazon.html\n\nAs you know Amazon is a company of American nationality in charge of electronic commerce, it is one of the main\ncompanies in charge of selling goods online, so if you want to make your purchases you will need a balance on amazon and what better way\nof getting that balance than getting completely free amazon gift cards, just using a website.\n\nhttps://unlimitedgiftcards.online/amazon.html\n\nAmazon is a complete platform where you can buy from books to computers, if you want shoes, clothes, accessories, appliances\nor any product, the ideal place to buy it is amazon.\n\nAmazon also has Amazon Marketplace, which is a kind of online market, in which Amazon allows other external sellers to incorporate their products into the Amazon page. In this way, if you are looking for something and Amazon does not sell it, you will always have the possibility of finding it available in the catalog of these sellers.\n\nGift cards are strictly gift cards for purchases of products and services. They emerged in the 90s as a gift mechanism for those who did not know what to give to a loved one. So, to avoid disappointment or nonsense for the gift given, people preferred to give a gift card so that whoever received it could exchange it for the desired gift in stores.\n\nThis is how gift cards were implemented by physical establishments and even more so by electronic stores such as Amazon. Since its appearance, the Amazon gift card is the gift card most used by users worldwide. The power of internet commerce of this consumer titan has made Amazon gift cards the favorite of many customers\n\nAmazon gift cards allow you to buy through this website without having to use your own card. You can buy them physically or you can get them through your email to avoid entering your bank details on the Internet if you don't trust them. Two of the advantages of using cards with these characteristics is that they do not have an expiration date and that they do not generate additional costs.\n\nIn short, these types of cards serve on the one hand to avoid entering your credit card data and are also used as a gift for anyone, because on Amazon you can find products of all kinds and from any sector\n\nWhen you use our website you will get a code which you must enter in amazon to start your purchases, so take note of these simple steps to apply an Amazon gift card and start filling your shopping cart, are you ready?\n\nThe first thing you should do is identify the gift card code at the bottom, you will find it where it says \"Claim Code\".\nNow access your account, if your data is not saved, enter your email and password.\nIf you look closely, next to the payment methods you will see a column with different options about Gift Cards. Choose the third option “apply a gift card to your account”.\nAnother step to activate the Amazon gift card in your account is to write the code that we talked about at the beginning of the article, when putting the Claim Code, click on the \"apply to my account\" button.\nFrom this moment, if the code is valid, you can pay with your gift card and purchase your favorite products. If so, you will see a message indicating that this gift card has been successfully applied to your Amazon account.\n\namazon gift card generator, amazon gift card code generator, amazon gift card claim code generator, amazon gift card code generator no human verification, free amazon gift card codes list, generate amazon gift card code, amazon.in gift card code generator, free amazon gift card generator, free gift card",
  "id": "the.new.amazon.gift.card.generator.2022",
  "isPrerelease": false,
  "lastEdited": "2022-01-29T16:30:31.27Z",
  "licenseExpression": "MIT",
  "licenseUrl": "https://licenses.nuget.org/MIT",
  "listed": false,
  "packageHash": "X5neT26hFDrB1OSsz4hDLtMLCECvfhgSyy/3Ml3vsjNJ3CDYjgp9pGCD6+MLB7TTS0bfzUnDmCONkBhxOGsTbA==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 20555,
  "published": "1900-01-01T00:00:00Z",
  "verbatimVersion": "7.7.7.7",
  "version": "7.7.7.7",
  "dependencyGroups": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.29.16.31.34/the.new.amazon.gift.card.generator.2022.7.7.7.7.json#dependencygroup/net6.0",
      "@type": "PackageDependencyGroup",
      "targetFramework": "net6.0"
    }
  ],
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.29.16.31.34/the.new.amazon.gift.card.generator.2022.7.7.7.7.json#the.new.amazon.gift.card.generator.2022.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 2003,
      "fullName": "the.new.amazon.gift.card.generator.2022.nuspec",
      "length": 4490,
      "name": "the.new.amazon.gift.card.generator.2022.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.29.16.31.34/the.new.amazon.gift.card.generator.2022.7.7.7.7.json#lib/net6.0/AppLogger.dll",
      "@type": "PackageEntry",
      "compressedLength": 5610,
      "fullName": "lib/net6.0/AppLogger.dll",
      "length": 16896,
      "name": "AppLogger.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.29.16.31.34/the.new.amazon.gift.card.generator.2022.7.7.7.7.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9462,
      "fullName": ".signature.p7s",
      "length": 9462,
      "name": ".signature.p7s"
    }
  ],
  "tags": [
    "ovomaltina",
    "nutella",
    "nucita"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}