{
  "@id": "https://api.nuget.org/v3/catalog0/data/2015.02.03.06.41.19/aspose.words.13.3.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "Aspose",
  "catalog:commitId": "456c82e8-16ad-4410-8728-cdc842791e07",
  "catalog:commitTimeStamp": "2015-02-03T06:41:19.20798Z",
  "copyright": "© Aspose 2002-2013. All Rights Reserved.",
  "created": "2013-04-03T09:22:06.503Z",
  "description": "Aspose.Words for .NET class library supports DOC, DOCX, RTF, HTML, OpenDocument, PDF, XPS, EPUB and other formats. With Aspose.Words you can generate, modify, convert, render and print documents without utilizing Microsoft Word®",
  "iconUrl": "http://www.aspose.com/images/products/dotnet/Aspose.Words_128x128.png",
  "id": "Aspose.Words",
  "isPrerelease": false,
  "lastEdited": "0001-01-01T00:00:00Z",
  "licenseUrl": "http://www.aspose.com/corporate/purchase/end-user-license-agreement.aspx",
  "packageHash": "6wlIgZ8lVsiiq2AibpLKVCFrLel0VPXSF4rXzbbOtVQevOjxwKrkRWK1II7dUQy5UcX939ubFXlkpgsjC1FRgw==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 10195763,
  "projectUrl": "http://www.aspose.com/categories/.net-components/aspose.words-for-.net/default.aspx",
  "published": "2013-04-03T09:22:06.503Z",
  "releaseNotes": "There are 97 improvements and fixes in this regular monthly release. The most notable are:\n\n• Improvements in style handing in Tables, Format Revisions\n• Improvements and resiliency code for ODT, RTF and DOCX\n• DrawingML Charts 3D mode rendering implemented\n• VML perspective shadows rendering implemented\n• Outline rendering to PDF and XPS improved\n• Multi-level bookmark rendering supported\n• PDF rendering performance improved for documents with images\n• Improved clipping of text boxes\n• Fixed issue with missing footnotes in complex page layout\n\nThis release introduces the new features, enhancements and fixes to the excptions/bugs as detailed below:\n\n• New features\nWORDSNET-7113\tSupport rendering of 3D Charts\nWORDSNET-7132\tSupport pyramid charts.\nWORDSNET-7440\tExpose property for Shape to detect 3D shapes\nWORDSNET-7774\tSupport 3D Column/Bar charts.\nWORDSNET-7775\tSupport cone charts.\nWORDSNET-7776\tSupport cylinder charts.\nWORDSNET-7777\tSupport 3D line charts.\nWORDSNET-7778\tSupport pie 3D charts.\nWORDSNET-7779\tSupport area 3D charts.\nWORDSNET-7790\tSupport rendering Cartesian axis plane in 3D mode.\nWORDSNET-7834\tSupport \"Do full justification the way WordPerfect 6.x for Windows does\" compatibility option\nWORDSNET-7843\tSupport export to FixedPage HTML.\nWORDSNET-7862\tDevelopment of attributes inheritance model\nWORDSNET-7906\tRead characterSet attribute (strict OOXML).\nWORDSNET-7927\tPublish this month's blog post and public API changes\nWORDSNET-7955\tSupport rendering of bubbles in 3D mode.\n\n• Enhancements\nWORDSNET-3906\tRewrite PDF signing code to avoid using X509Certificate2\nWORDSNET-5290\tConsider making a single data source merge duplicate regions\nWORDSNET-6823\tIssue with paragraph borders in TextBox\nWORDSNET-7110\tShadow effect of TextBox Shape is not preserved in PDF\nWORDSNET-7178\tAdd a warning to the PdfSaveOptions.NumeralFormat description that modifying this option can rebuild page layout\nWORDSNET-7627\tSupport multi-level Bookmarks rendering\nWORDSNET-7671\tImprove outlines rendering to PDF, XPS and SWF\nWORDSNET-7754\tImplement support of perspective shadows.\nWORDSNET-7755\tImplement support of additional shadow styles.\nWORDSNET-7811\tEULA 28th August 2012 update\nWORDSNET-7861\tBig square shape is colored incorrectly while rendered.\nWORDSNET-7863\tCreate required method for testing Fixed Html output.\nWORDSNET-7865\tInvestigate what save options are required for Fixed Html.\nWORDSNET-7904\tExpress: EULA 28th August 2012 update\nWORDSNET-7907\tCustomDocumentProperties are not retrieved in the order they were added\nWORDSNET-7916\tConversion from doc to tiff - black text in colored background produced solid black output\nWORDSNET-7924\tODF OLE object (\"draw:object\" element) is imported incorrectly when it contains pictures\nWORDSNET-7929\tCheck code comments for new public API members of FixedHTML classes\nWORDSNET-7947\tInvestigate why does Aspose.Words add a blank Paragraph at the start of Bookmark\nWORDSNET-7972\t/revisions/ StyleId is incorrect in ParaPr.FormatRevision.RevPr\n\n• Exceptions\nWORDSNET-7587\tException while loading Doc file into Aspose.Words.Document\nWORDSNET-7794\tException (System.IndexOutOfRangeException) Error in Doc2Html\nWORDSNET-7857\tAspose.Words.FileCorruptedException occurs when loading a DOCX\nWORDSNET-7910\tSystem.ArgumentOutOfRangeException occurs during rendering to PDF\nWORDSNET-7913\tSystem.InvalidOperationException occurs during rendering Doc to Pdf\nWORDSNET-7923\tFix the code of DocumentLayoutHelper example project\nWORDSNET-7930\tSystem.ArgumentException is thrown when rendering a DML chart to PDF\nWORDSNET-7931\tSystem.ArgumentException is thrown when rendering a DOCX to PDF\nWORDSNET-7957\tStackOverflowError occurs during open/save RTF\nWORDSNET-7971\tAspose.Words.FileCorruptedException occurs when loading RTF documents\n\n• Bugs\nWORDSNET-6488\tBullet symbols are rendering incorrectly in HTML\nWORDSNET-7196\tShading effect of AutoShapes are getting lost when rendering to PDF\nWORDSNET-7402\tStyleCollection.AddCopy changes Font Color\nWORDSNET-7485\tDocument.UpdateFields incorrectly update TOC\nWORDSNET-7538\tDML properties are lost when saving Docx to Rtf\nWORDSNET-7592\tIcons for embedded objects are not saved in pdf\nWORDSNET-7619\tDoc to HTML conversion issue with image rendering\nWORDSNET-7688\tListLabel.LabelValue values are rendering incorrectly in fixed page formats\nWORDSNET-7769\tShapes in Footer become invisible during open/save RTF\nWORDSNET-7796\tImage do not preserve in output doc/docx\nWORDSNET-7801\tUnable to Open RTF Document\nWORDSNET-7824\tFont size of Hebrew content do not preserve in output document.\nWORDSNET-7826\tLink between multiple grouped textboxes breaks when save to Docx\nWORDSNET-7827\tLink between multiple grouped textboxes breaks after merging multiple document\nWORDSNET-7836\tDocument.HasRevisions returns false but document contain revisions\nWORDSNET-7837\tDocument.AcceptAllRevisions do not work with Paragraph formatting changes\nWORDSNET-7851\tTable is not preserved during open/save RTF\nWORDSNET-7856\tMS Word 2007 incorrectly layouts List at second ListLevel in DOC\nWORDSNET-7860\tText misplaced after conversion from Doc to Fixed file format.\nWORDSNET-7864\tFootnote numbering restarts with each page in output ODT\nWORDSNET-7866\tDocument to PDF conversion issue with image position\nWORDSNET-7867\tUpdateFields doesn't update the value of a STYLEREF field in PDF file\nWORDSNET-7870\tSizes of Shapes are not preserved during open/save DOC\nWORDSNET-7879\tIncorrect rendering of footnotes in Fixed Page Formats\nWORDSNET-7881\tDocument.UpdateFields duplicate the Shape node\nWORDSNET-7886\t3D shape without rotation renders incorrectly if it has relative size.\nWORDSNET-7897\tAspose.Words hangs during rendering Line AutoShape to Pdf\nWORDSNET-7898\tAspose.Words hangs during rendering DOC to Pdf\nWORDSNET-7899\tLine AutoShapes cause Aspose.Words to hang during rendering\nWORDSNET-7901\tFileFormatInfo.LoadFormat return Docx for password protected docm\nWORDSNET-7915\tText moved to next page after conversion from Doc to Pdf\nWORDSNET-7917\taltchunk contents are lost while open/save\nWORDSNET-7926\tStyleIdentifier is not applied to Table unless cell/row formatting is reset to defaults\nWORDSNET-7928\tUpdateFields inserts an error message in document against a DOCPROPERTY field\nWORDSNET-7941\tFill color of pie chart is rendered as white in PDF\nWORDSNET-7946\tLabel numbering of first TOC item is missed by UpdateFields\nWORDSNET-7949\tWPF host/viewer is unable to load XAML generated by Aspose.Words\nWORDSNET-7952\tNon standard Quotation marks are not recoginzed during MailMerge\nWORDSNET-7958\tDocument.Save method hangs while converting Doc to fixed file formats\nWORDSNET-7989\tA Bookmark is displayed twice in PDF document outline\nWORDSNET-7990\tA Bookmark is not preserved during open/save a DOCX\nWORDSNET-7991\tA Bookmark is not preserved during open/save a DOCX\nWORDSNET-7992\tBookmarks are not preserved during open/save a DOCX\nWORDSNET-8036\tLeft page margin for even pages is not respected in fixed page formats\n\n• Performance\nWORDSNET-7802\tSlow saving documents with images (to PDF)\nWORDSNET-7804\tInvestigate the PrinterSettingsContainer storage with Multi-threaded print operation\nWORDSNET-7948\tConsider improving the execution time of the updateFields method\nWORDSNET-7961\tA Table causes Aspose.Words to hang during rendering to PDF\n\n• Regressions\nWORDSNET-7625\tEven pages have incorrect left page margin in PDF\nWORDSNET-7939\tConsider filling mail merge region with empty name\nWORDSNET-7975\tConditional mail merge stop mail merge operation",
  "requireLicenseAcceptance": true,
  "title": "Aspose.Words for .Net",
  "version": "13.3.0",
  "tags": [
    "Aspose.Words",
    "DOC",
    "DOCX",
    "RTF",
    "HTML",
    "OpenDocument",
    "XPS",
    "EPUB",
    "Word",
    "Document",
    "Processing"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    }
  }
}