{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.16.44.20/_township-hack-working-2022-version-ekx.4.4.79.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "SharpCrafters s.r.o.",
  "catalog:commitId": "34e9f80f-0cc0-428e-aa4b-eb67529a38c8",
  "catalog:commitTimeStamp": "2022-01-26T16:44:20.1322564Z",
  "created": "2022-01-26T16:41:55.173Z",
  "description": "# _Township hack Working 2022 Version ekx\n\n\nCLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; [http://12.bltadwin.ru/hack.php](http://12.bltadwin.ru/hack.php)\n\n\nBy making you responsible, the Township Mod Apk lets you can develop how to hack unlimited cash and money in our old game m at level  Free Download Township v Hack mod apk (Unlimited Money) For android mobiles, Samsung HTC Nexus LG Sony Nokia Tablets and More. Township Mod: % working on devices, voted by 44, developed by Playrix Township Mod Apk [Unlimited money] no hack.\n\n## [CLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; http://12.bltadwin.ru/hack.php](http://12.bltadwin.ru/hack.php)\n\nAfter a long process and we finally made a working hack tool for Township game. With this particular powerfull Township Hack you will add to your account free Coins and Cash. It is time for anyone to enjoy all the game experience with this Township cheats and be the best. This tool enables all the elements necessary to finish all levels in Township.  · Township Hack - Township Cheats - Township Cash Cheats, This new joke video will be showing you guys a cool township hack or township cheat to get unlimited.  · Township Hack is very simple to use. All you need to do to get it started is to click on it. Below are the steps you need to follow to make it work for you: Click on the ‘ONLINE HACK V1’, or ‘ONLINE HACK V2’, or ‘ONLINE HACK V3’; visit the website hack and submit all the required information, the click ‘generate’.\n\ntownship hack 2021, township hacks and cheats, township hack 2021 ios, township hack unlimited coins and cash, township hack 2021 unlimited money, township hack no ban, township hack coin and cash, township hack pc, township hack 2020, township hack android, township hack apk download ios, township hack apk download 2021, township hack app, township hack apk 8.7.0, township hack apk coins cash, township hack apk 2021, township hack apk 7.9.6, a township tale hacks, township hack ban, township barn hack, township bluestacks hack, township bubblegum hack, township hack without ban, township hack anti ban, township hack download by apk home, township hack cash, township hack code, township hack coins, township hack.com, township hack cheats, township hack cheat engine, township hack coins and cash android, township hack download, township hack download ios, township hack download no ban, township hack download for pc, township hack download apkpure, township dollar hack, township expansion hack, township event hack, township easy hack, township hack unlimited everything, township.extreme hack.net, descargar township hack apk español, township hack apk español, township hack for ios, township hack for pc, township hack free cash, township hack file, township hack for mac, township hack tool free download for pc, township hack tool free download, township hack generator, township hack game guardian, township hack game download 2019, township hack generator 2020, township hack.game tricks.us, township hack gold pass, township game hack unlimited coins and cash, township gumball hack, township hack ios, township hack ios no jailbreak, township hack ipa, township hack ios 2020, township hack ios jailbreak, township hack ios no human verification, township hack in pc, township hack install, can i hack township, is there a hack for township, can you cheat in township, township hack jailbreak, hack township ios chưa jailbreak, juego township hack apk, township hack kaise kare, township ko hack kaise kare, township hack kim cương, township hack deutsch kostenlos, hack coin township, township hack level, township hack latest version, township hack latest version 2022, township hack level 99, township hack latest version 2021, township hack latest version 2020, township hack live, township level hack download, township hack mod apk unlimited money and cash, township hack mod apk anti ban, township hack money, township hack mod 2021, township hack max level, township hack no ver",
  "id": "_Township-hack-Working-2022-Version-ekx",
  "isPrerelease": false,
  "language": "en-US",
  "lastEdited": "2022-01-26T16:43:56.327Z",
  "listed": true,
  "packageHash": "pcKvCDlsZm0m/iQnylwp/2LwRt86LO8B1D/D9rrg19aJu3tjLDB0+FyeVLjkLOEhATkdn8Wz0iOTFmvpB6KLpQ==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 11652,
  "published": "2022-01-26T16:41:55.173Z",
  "requireLicenseAcceptance": false,
  "title": "_Township-hack-Working-2022-Version-ekx",
  "verbatimVersion": "4.4.79",
  "version": "4.4.79",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.16.44.20/_township-hack-working-2022-version-ekx.4.4.79.json#qunrfcvyca.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1522,
      "fullName": "qunrfcvyca.nuspec",
      "length": 4472,
      "name": "qunrfcvyca.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.16.44.20/_township-hack-working-2022-version-ekx.4.4.79.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9470,
      "fullName": ".signature.p7s",
      "length": 9470,
      "name": ".signature.p7s"
    }
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}