{
  "@id": "https://api.nuget.org/v3/catalog0/data/2018.12.11.00.29.16/aspose.words.custom.16.6.4.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "Aspose",
  "catalog:commitId": "6ac4fa50-6619-431c-aa6f-23024dc88e3c",
  "catalog:commitTimeStamp": "2018-12-11T00:29:16.313176Z",
  "copyright": "(C) Aspose 2002-2016. All Rights Reserved.",
  "created": "2017-02-18T11:05:32.55Z",
  "description": "Aspose.Words for .NET is a class library for .NET that enables you to perform a wide range of document processing tasks directly within your .NET applications.",
  "iconUrl": "http://www.aspose.com/images/products/dotnet/Aspose.Words_128x128.png",
  "id": "Aspose.Words.Custom",
  "isPrerelease": false,
  "lastEdited": "2018-12-11T00:28:33.987Z",
  "licenseUrl": "http://www.aspose.com/corporate/purchase/end-user-license-agreement.aspx",
  "listed": false,
  "packageHash": "DdDB6POtxiRCibPqdV2veqRC2lXe9J9JXnD8toPCxZJi5XgD0ytHA5YYQF3cK0KIEqqsOODCikT3AjQmYotWKw==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 21753459,
  "projectUrl": "http://www.aspose.com/categories/.net-components/aspose.words-for-.net/default.aspx",
  "published": "1900-01-01T00:00:00Z",
  "releaseNotes": "Aspose.Words for .NET 16.6 Release Notes\n\nMajor Features\n\nThere are 113 improvements and fixes in this regular monthly release. The most notable are:\n\n* Fast extraction from DOC format via PlainTextDocument class is faster by a factor of ten (at a cost).\n* Saving DOCX as ISO 29500 Strict OOXML format is available now.\n* Added support for outer document insertion to LINQ Reporting Engine.\n* Added feature to insert empty values in chart series.\n* HTML radio input fields are imported to AW as HtmlOleControl nodes/HtmlOleControl nodes are exported to HTML as HTML input tags.\n* Implemented support for \"show revisions in balloons\" option.\n* Implemented \"suppress endnotes\" property.\n* Numerous Complex Script improvements, asian typography detection, kinsoku rule handling.\n* Improved PDF export to support Acrobat PDF IFilter.\n* Field.GetFieldCode() improved to work with nested fields' codes that spanned among paragraphs or sections.\n* Introduced a Field.GetFieldCode(bool) overload that controlling whether to include child field codes.\n* Added the MailMerge.GetRegionsByName() method so that the user can obtain a list of regions by the specified name.\n* Added the MailMergeRegionInfo.Level property that allows to get the nesting level of a mail merge region.\n\nFull List of Issues Covering all Changes in this Release\nKey\tSummary\tCategory\nWORDSNET-10518\tUpdateFields does not calculate NOTEREF field properly\tBug\nWORDSNET-12497\tCamera Rotation DML effect with shadow looks incorrect after rendering.\tBug\nWORDSNET-12568\tText overlaps after generating pdf\tBug\nWORDSNET-12935\tDocumentBuilder.InsertHtml issue with list items\tBug\nWORDSNET-13008\tSystem.ArgumentOutOfRangeException is thrown when getting chart title font or setting chart title text.\tBug\nWORDSNET-13187\t/shrink spaces/ System.NullReferenceException during converting to PDF\tBug\nWORDSNET-13194\tAdobe Accessibility check fails for Links\tBug\nWORDSNET-13225\tWord to PDF conversion tables formatting changing between the source and the converted document\tBug\nWORDSNET-13235\tDocument.UpdateFields doesn't update TOC as MS Word 2016 does in German language environment\tBug\nWORDSNET-13272\t/CJK baseline /The last line is moved to the next page\tBug\nWORDSNET-13304\tCompatibilityOptions.OptimizeFor does not remove \"Compatibility mode\" ribbon\tBug\nWORDSNET-13320\tIssue with hr indentation when saving doc as html\tBug\nWORDSNET-13408\tDoc to Pdf conversion issue with MACROBUTTON rendering\tBug\nWORDSNET-13415\tThe contents of last page are truncated after re-saving the Doc\tBug\nWORDSNET-13416\tThe contents of last page are truncated after re-saving the Doc\tBug\nWORDSNET-13423\tDoc to XML conversion issue with markup of images\tBug\nWORDSNET-13476\tImage is lost after saving html to Png/Docx/Html\tBug\nWORDSNET-13486\tCheck boxes occupy more space which causes blank page in PDF\tBug\nWORDSNET-13527\tStructuredDocumentTag.RemoveSelfOnly changes the Sdt text\tBug\nWORDSNET-13539\tRule Kinsoku is applied incorrectly\tBug\nWORDSNET-13552\tDocx to Pdf conversion issue with image rendering\tBug\nWORDSNET-13562\tResult of STYLEREF is rendered on next line in output Pdf\tBug\nWORDSNET-13572\tAspose.Words.Document generates inefficient XPS\tBug\nWORDSNET-13580\tHeaderFooter of last section is removed after mail merge process\tBug\nWORDSNET-13583\tGetFieldCode on a IF field returning Empty\tBug\nWORDSNET-13586\tTOC update shows Error Bookmark not defined\tBug\nWORDSNET-13587\tTOC update shows Error Bookmark not defined\tBug\nWORDSNET-13588\tImages are not completely visible in generated PDF\tBug\nWORDSNET-13590\tBounds of primary vertical axis of chart are changed after conversion from Docx to Pdf\tBug\nWORDSNET-13600\tDocumentBuilder.InsertHtml does not render MathML in output document\tBug\nWORDSNET-13604\tSpace between ListLabel and List item is removed after conversion from Docx to Pdf\tBug\nWORDSNET-13607\tBullet list is converted to numbered list after re-saving Docx\tBug\nWORDSNET-13608\tImages are rendering at incorrect position in PDF\tBug\nWORDSNET-13609\tNon-breaking space is converted to square block after conversion from Html to Doc\tBug\nWORDSNET-13610\tTable in TextBox renders incorrectly in PDF\tBug\nWORDSNET-13614\tFormat (custom angle) of horizontal axis of chart is changed after re-saving Docx\tBug\nWORDSNET-13615\tDocx to Pdf conversion issue with chart rendering\tBug\nWORDSNET-13616\tBackground lines in plot area of chart do not render in output Pdf/Doc\tBug\nWORDSNET-13617\tChart title is changed after conversion from Docx to Pdf/Doc\tBug\nWORDSNET-13618\tGradient background appears in plot area of chart in output Doc/Pdf\tBug\nWORDSNET-13620\tChart data series are changed after conversion from Docx to Pdf\tBug\nWORDSNET-13622\tStructuredDocumentTag of type DROP_DOWN_LIST is not retaining its value when saving as PDF format\tBug\nWORDSNET-13627\tLink disappears during open save a DOCX\tBug\nWORDSNET-13628\tDocument.UpdateFields does not update the TOC field\tBug\nWORDSNET-13632\tDiagram gets messed up during open/save a DOCX\tBug\nWORDSNET-13636\tCOLSPAN not working for insertHTML\tBug\nWORDSNET-13637\tImages not visible in pdf output\tBug\nWORDSNET-13638\tIncorrect encoding applied upon converting DOC to PDF\tBug\nWORDSNET-13645\tPicture width is incorrect in generated HtmlFixed\tBug\nWORDSNET-13646\tA Drawing renders incorrectly in PDF\tBug\nWORDSNET-13649\tData missing when inserting SVG image in Word document\tBug\nWORDSNET-13663\tIncorrect positions of list items markers with Roman numerals imported from HTML\tBug\nWORDSNET-13673\tInvalid location of the META element when converting DOCX to HtmlFixed\tBug\nWORDSNET-13680\tHorizontal lines appear at the start of document after re-saving RTF\tBug\nWORDSNET-13687\tImage is cropped after conversion from Docx to Pdf\tBug\nWORDSNET-13693\tDocument.UpdateFields incorrectly calculates SUM fields value\tBug\nWORDSNET-13694\tDocument.UpdateFields incorrectly calculates SUM fields value\tBug\nWORDSNET-13713\tField Function 'Page' does not handle all formats when converting Flat-OPC to PDF\tBug\nWORDSNET-13718\tDiagram gets messed up during open/save to PDF.\tBug\nWORDSNET-13720\tContents of OfficeMath are changed after re-saving Docx\tBug\nWORDSNET-13727\tField.IsLocked property has no effect when saving document\tBug\nWORDSNET-13728\tContents move to previous page after conversion from Docx to Pdf\tBug\nWORDSNET-13731\tThe rule \"Allow hanging punctuation\" should not be applied.\tBug\nWORDSNET-13742\tParagraph alignment is changed after conversion from Doc to HtmlFixed\tBug\nWORDSNET-13746\tProblem converting OfficeMath equations into PDF\tBug\nWORDSNET-13751\tDocx to Pdf conversion issue with NumeralFormat.Context\tBug\nWORDSNET-1829\tRow Height is not retrieved into HTML when HeightRule is Auto.\tBug\nWORDSNET-5853\tWhile doc to Pdf, Pdf page count is less than input Word file\tBug\nWORDSNET-6470\tAW ignores the sign of the currency when calculating the sum of the range of table cells but Word saves one and shows it in the result field.\tBug\nWORDSNET-7179\t/line metrics + font substitution/ Spacing between lines is incorrect in PDF\tBug\nWORDSNET-8358\tCharts move on to the next page and lose their X,Y position in PDF\tBug\nWORDSNET-9151\tHidden comments are rendered in PDF\tBug\nWORDSNET-13239\tIndent lists inserted with InsertHtml\tEnhancement\nWORDSNET-13455\tList label revision is not exported properly.\tEnhancement\nWORDSNET-13460\tDocuments converted from Word to PDF are not properly extractable by an IFilter\tEnhancement\nWORDSNET-13683\tAspose.Words.FileCorruptedException is thrown while loading RTF\tEnhancement\nWORDSNET-13692\tDocx to Pdf conversion issue with Hebrew content's position\tEnhancement\nWORDSNET-13724\tImprove Asian typography detection by using TTFont.IsCjkSupported instead of predefined Asian font list\tEnhancement\nWORDSNET-13738\tExport HtmlOleControls to HTML using HTML tags\tEnhancement\nWORDSNET-5412\tCheckbox selected attribute is ignored in HTML import\tEnhancement\nWORDSNET-7822\tRadioButtons are not preserved during converting HTML to DOCX\tEnhancement\nWORDSNET-8826\tImport radio input html field as HTMLCONTROL Forms.HTML:Option.1\tEnhancement\nWORDSNET-13314\tDocument.Save throws System.ArgumentException while saving Docx to Html\tException\nWORDSNET-13443\tSystem.Xml.XmlException is thrown while loading Docx\tException\nWORDSNET-13493\tMailMerge.ExecuteWithRegions throws System.InvalidOperationException\tException\nWORDSNET-13546\tAspose.Words.FileCorruptedException occurs upon loading a XML\tException\nWORDSNET-13642\tMailMerge.ExecuteWithRegions throws System.InvalidOperationException\tException\nWORDSNET-13651\tAspose.Words.FileCorruptedException is thrown while loading Docx\tException\nWORDSNET-13656\tAspose.Words.FileCorruptedException is thrown while loading RTF\tException\nWORDSNET-13657\tAspose.Words.FileCorruptedException is thrown while loading RTF\tException\nWORDSNET-13658\tAspose.Words.FileCorruptedException is thrown while loading RTF\tException\nWORDSNET-13659\tSystem.InvalidOperationException occurs during DOCX-to-HTML conversion\tException\nWORDSNET-13697\tUpdateFields throws \"Index was outside the bounds of the array\" exception\tException\nWORDSNET-13698\tAspose.Words.FileCorruptedException occurs upon loading a MHT\tException\nWORDSNET-13703\t'An object already included into list' error during document reflow\tException\nWORDSNET-13721\tHandle the case when DML text effects are used for OTF(CFF) fonts\tException\nWORDSNET-12425\tTag with name 'effectStyleLst' is not supported\tFeature\nWORDSNET-12426\tImport of element 'effectStyleLst' is not supported in Docx format by Aspose.Words\tFeature\nWORDSNET-12427\tTag with name 'objectDefaults' is not supported\tFeature\nWORDSNET-12428\tImport of element 'objectDefaults' is not supported in Docx format by Aspose.Words\tFeature\nWORDSNET-13054\tProvide API to change default proofing language\tFeature\nWORDSNET-13329\tAdd feature to insert Document after populating it with data using LINQ Reporting Engine\tFeature\nWORDSNET-13428\tAdd feature to insert empty values in chart series\tFeature\nWORDSNET-13432\tAdd feature to get the nested level number of Mail Merge Region\tFeature\nWORDSNET-13433\tAdd feature to get MailMergeRegionInfo by Region name\tFeature\nWORDSNET-13739\tAdd the feature to show the delete revision in pdf\tFeature\nWORDSNET-7741\tLoad and save ISO/IEC 29500 Strict / Word 2013 OOXML\tFeature\nWORDSNET-9431\tA Paragraph in Table breaks into two lines during saving a RTF to DOCX\tFeature\nWORDSNET-9664\tSupport SuppressEndnotes property when saving to fixed page formats\tFeature\nWORDSNET-13654\tPerformance degradation in v16.4.0 while inserting EMF into Document and save document to Pdf\tPerformance\nWORDSNET-13711\tAspose.Words.FileCorruptedException occurs upon loading a FlatOpc\tRegression\nWORDSNET-13712\tSystem.InvalidOperationException is thrown while saving Docx to Pdf\tRegression\nWORDSNET-13809\tDocument.UpdateFields throws System.InvalidOperationException\tRegression",
  "requireLicenseAcceptance": true,
  "title": "Aspose.Words for .NET",
  "verbatimVersion": "16.6.4",
  "version": "16.6.4",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.12.11.00.29.16/aspose.words.custom.16.6.4.json#Aspose.Words.Custom.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 4219,
      "fullName": "Aspose.Words.Custom.nuspec",
      "length": 11931,
      "name": "Aspose.Words.Custom.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.12.11.00.29.16/aspose.words.custom.16.6.4.json#lib/net20/Aspose.Words.dll",
      "@type": "PackageEntry",
      "compressedLength": 5222844,
      "fullName": "lib/net20/Aspose.Words.dll",
      "length": 11503616,
      "name": "Aspose.Words.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.12.11.00.29.16/aspose.words.custom.16.6.4.json#lib/net20/Aspose.Words.xml",
      "@type": "PackageEntry",
      "compressedLength": 214221,
      "fullName": "lib/net20/Aspose.Words.xml",
      "length": 1569228,
      "name": "Aspose.Words.xml"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.12.11.00.29.16/aspose.words.custom.16.6.4.json#lib/net35-client/Aspose.Words.dll",
      "@type": "PackageEntry",
      "compressedLength": 5211850,
      "fullName": "lib/net35-client/Aspose.Words.dll",
      "length": 11516416,
      "name": "Aspose.Words.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.12.11.00.29.16/aspose.words.custom.16.6.4.json#lib/net35-client/Aspose.Words.xml",
      "@type": "PackageEntry",
      "compressedLength": 214030,
      "fullName": "lib/net35-client/Aspose.Words.xml",
      "length": 1568136,
      "name": "Aspose.Words.xml"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.12.11.00.29.16/aspose.words.custom.16.6.4.json#lib/net40/Aspose.Words.dll",
      "@type": "PackageEntry",
      "compressedLength": 5222234,
      "fullName": "lib/net40/Aspose.Words.dll",
      "length": 11504128,
      "name": "Aspose.Words.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.12.11.00.29.16/aspose.words.custom.16.6.4.json#lib/net40/Aspose.Words.xml",
      "@type": "PackageEntry",
      "compressedLength": 214221,
      "fullName": "lib/net40/Aspose.Words.xml",
      "length": 1569228,
      "name": "Aspose.Words.xml"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.12.11.00.29.16/aspose.words.custom.16.6.4.json#lib/net40-client/Aspose.Words.dll",
      "@type": "PackageEntry",
      "compressedLength": 5222234,
      "fullName": "lib/net40-client/Aspose.Words.dll",
      "length": 11504128,
      "name": "Aspose.Words.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.12.11.00.29.16/aspose.words.custom.16.6.4.json#lib/net40-client/Aspose.Words.xml",
      "@type": "PackageEntry",
      "compressedLength": 214221,
      "fullName": "lib/net40-client/Aspose.Words.xml",
      "length": 1569228,
      "name": "Aspose.Words.xml"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.12.11.00.29.16/aspose.words.custom.16.6.4.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9466,
      "fullName": ".signature.p7s",
      "length": 9466,
      "name": ".signature.p7s"
    }
  ],
  "tags": [
    "Word",
    "DOC",
    "DOCX",
    "OOXML",
    "OpenDocument",
    "PDF",
    "XPS",
    "ODT",
    "HTML",
    "XHTML",
    "WordprocessingML",
    "Document",
    "EPUB"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    }
  }
}