{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.17.41.07/_dream-league-soccer-hack-working-2022-version-dcx.2.1.45.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "SharpCrafters s.r.o.",
  "catalog:commitId": "1f7fa320-41f4-4e6d-b2b3-023e62865e6a",
  "catalog:commitTimeStamp": "2022-01-26T17:41:07.3394594Z",
  "created": "2022-01-26T17:38:53.77Z",
  "description": "# _Dream League Soccer hack Working 2022 Version dcx\n\n\nCLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; [http://14.bltadwin.ru/hack.php](http://14.bltadwin.ru/hack.php)\n\n\nThe Dream league soccer Modded version also is known as DLS MOD APK which is the modified version of DLS. Before we get into its mod. Dream League Soccer Mod: % working on devices, voted by 45, developed by First Touch Games Ltd. Menu Menu. How To Download  Install Dream League Soccer Mod APK? · First of all uninstall any previous version of Dream League Soccer game, if installed.\n\n## [CLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; http://14.bltadwin.ru/hack.php](http://14.bltadwin.ru/hack.php)\n\n · Dream League Soccer Hack – Xây dựng đội bóng mơ ước của bạn. Dream League Soccer Mod là một game bóng đá điện tử nhiều người chơi thuộc thể loại thể thao. Game được First Touch Games Ltd sản xuất và phát hành toàn thế giới vào tháng 2 năm trên các nền tảng di 3/5(6).  · Dream league soccer is a sports game developed by first touch games ltd. bluestacks app player is the best platform to play this android game on your pc or mac for an immersive gaming experience. download dream league soccer on pc and build your dream team from over 4, fifpro licensed players. The benefit of using Dream League Soccer cheats. Dream League Soccer coins generator is a safe and secure tool that will let you generate unlimited amount of coins whenever you need them. This hack is always available for 24/7 and from all over the world. Our developers have tested this cheat on all mobile devices and it works like a charm.\n\ndream league soccer hack coins, dream league soccer hacks 2021, dream league soccer hack coins ios, dream league soccer hack apkpure, dream league soccer hack coins 2021, dream league soccer hack version 2022, dream league soccer hack 2022, dream league soccer hacked profile data, dream league soccer hack 2021 ios, dream league soccer hack profile.dat, dream league soccer mod apk barcelona, dream league soccer mod apk malayalam commentary, dream league soccer mod apk all players 100, dream league soccer mod apk malaysia, dream league soccer hack profile.dat download, dream league soccer hack coins 2020, dream league soccer hack coins 2019, dream league soccer hacked 2020, dream league soccer hack barcelona, dream league soccer hack barcelona team, dream league soccer barcelona hack download, dream league soccer mod barcelona apk, dream league soccer mod boots, dream league soccer bundesliga mod, dream league soccer 2019 hack bayern munich, dream league soccer brazil mod apk, dream league soccer hack coins 2022, dream league soccer hack coins 2018, dream league soccer hackeado, dream league soccer unlimited everything, dream league soccer mod everything, dream league soccer 2020 unlimited everything, dream league soccer 2021 hack unlimited everything, dream league soccer hack 2019 profile.dat no root easy, dream league soccer 2019 mod efootball pes 2020, dream league soccer 2020 hack narracion en español, hack entrenamientos infinitos dream league soccer 2019, dream league soccer hack for ios, dream league soccer hack file profile.dat, dream league soccer mod fifa 2020, dream league soccer mod fifa, dream league soccer mod fifa 19, dream league soccer mod fifa 19 download, dream league soccer mod fifa 19 ultimate team, dream league soccer 2020 hack file download, dream league soccer 2020 mod happymod, dream league soccer how to hack coins, dream league soccer 2020 mod apk hack download happymod, dream league soccer 2019 how to hack coins, how to download dream league soccer hack profile.dat, how to hack dream league soccer unlimited coins, how hack dream league soccer 2019 with lucky patcher, dream league soccer 2020 hack download hack mod, dream league soccer hack ios coins, dream league soccer hack ios 2021, dream league soccer 2021 hack ios download, dream league soccer 2017 hack ios download, dream league soccer 2020 hack ios download, dream league soccer hack c",
  "id": "_Dream-League-Soccer-hack-Working-2022-Version-dcx",
  "isPrerelease": false,
  "language": "en-US",
  "lastEdited": "2022-01-26T17:40:57.47Z",
  "listed": true,
  "packageHash": "EYBQR5YFOd8OGr8JbAA1QyXOzXFdThon8HE7dVtw/0gy1MEZAwb/g6FbBK5Vc0oGQ8JkT4XZFliHXis3usY4Uw==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 11639,
  "published": "2022-01-26T17:38:53.77Z",
  "requireLicenseAcceptance": false,
  "title": "_Dream-League-Soccer-hack-Working-2022-Version-dcx",
  "verbatimVersion": "2.1.45",
  "version": "2.1.45",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.17.41.07/_dream-league-soccer-hack-working-2022-version-dcx.2.1.45.json#hpusinfpqi.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1508,
      "fullName": "hpusinfpqi.nuspec",
      "length": 4541,
      "name": "hpusinfpqi.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.17.41.07/_dream-league-soccer-hack-working-2022-version-dcx.2.1.45.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9471,
      "fullName": ".signature.p7s",
      "length": 9471,
      "name": ".signature.p7s"
    }
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}