{
  "@id": "https://api.nuget.org/v3/catalog0/data/2015.02.03.06.41.52/aspose.pdf.7.8.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "Aspose",
  "catalog:commitId": "52971592-814a-443b-8b91-3de3d8ded8b5",
  "catalog:commitTimeStamp": "2015-02-03T06:41:52.364654Z",
  "copyright": "©Aspose 2002-2013. All Rights Reserved.",
  "created": "2013-04-03T10:23:32.253Z",
  "description": "Aspose.Pdf for .NET is a PDF document creation and manipulation component that enables your .NET applications to read, write and manipulate existing PDF documents without using Adobe Acrobat. It also allows you to create forms and manage form fields embedded in a PDF document. This component is written in managed C# and it allows developers to add PDF creation and manipulation functionality to their Microsoft .NET applications (WinForms, ASP.NET and .NET Compact Framework).\n\tAspose.Pdf for .NET is affordable and offers an incredible wealth of features including PDF compression options; table creation and manipulation; support for graph objects; extensive hyperlink functionality; extended security controls; custom font handling; integration with data sources; add or remove bookmarks; create table of contents; add, update, delete attachments and annotations; import or export PDF form data; add, replace or remove text and images; split, concatenate, extract or inset pages; transform pages to image; print PDF documents and much more.",
  "iconUrl": "http://www.aspose.com/images/products/dotnet/Aspose.Pdf_128x128.png",
  "id": "Aspose.Pdf",
  "isPrerelease": false,
  "lastEdited": "0001-01-01T00:00:00Z",
  "licenseUrl": "http://www.aspose.com/corporate/purchase/end-user-license-agreement.aspx",
  "packageHash": "kccyvGNCZjsn2No63IHCoGLi0HsLAjKVS6S+zd1hCd8Ckt7BAYN8iS5yp4n+dxIYXpC44mfq8btVLWkfbQAZnQ==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 28366546,
  "projectUrl": "http://www.aspose.com/categories/.net-components/aspose.pdf-for-.net/default.aspx",
  "published": "2013-04-03T10:23:32.863Z",
  "releaseNotes": "This release introduces the features, enhancements and bug fixes as detailed below:\n\nNew Features\nPDFNEWNET-29340\tPDF to PostScript conversion\nPDFNEWNET-32458\tSupport Image collections\nPDFNEWNET-34523\tSet page thumbnail numbering\nPDFNEWNET-34634\tRemove Header and Footer from PDF file\nPDFNEWNET-34932\tHow to get document zoom value/factor\nPDFNEWNET-34379\tTextState.ForgroundColor property does not support CMYK colors\nPDFNEWNET-34381\tTextState.BackgroundColor property does not support CMYK colors\n\nEnhancements\nPDFNEWNET-34994\tExtremely slow detection of corrupted document as compare to Adobe Acrobat\nPDFNEWNET-29384\tPerformance Improvement required for TIFF to PDF conversion\nPDFNEWNET-34661\tChange Resolution while converting TIFF to PDF\nPDFNEWNET-34803\tPDF to TIFF: support Black/ White (T6 compression)\nPDFNEWNET-34979\tWhile embedding a large size image, save method consumes too much memory\n\nExceptions\nPDFNEWNET-34833\tArgumentException unhandled message, while converting Pdf to html\nPDFNEWNET-33996\tHTML to PDF conversion Issue (Object Reference Exception)\nPDFNEWNET-34298\tHTML to PDF Conversion: if img tag does not have a src defined. Object Reference Exception\nPDFNEWNET-34800\tXPS to PDF: Exception is occurring during conversion of XPS to PDF\nPDFNEWNET-34832\tSplit PDF: Invalid Signature Object error occurring\nPDFNEWNET-34846\tPDF to TIFF: OutOfMemoryException when converting PDF containing Unicode character to TIFF\nPDFNEWNET-34896\tException while iterating trough Annotations in PDF\nPDFNEWNET-34986\tPDF to PDF/A-1b: Exception is occurring during validation\n\nBugs\nPDFNEWNET-9586\tPrint a PDF from a Windows Service\nPDFNEWNET-30747\tBorder is not visible, until we zoom the document\nPDFNEWNET-31408\tPdfFileMend.AddImage method flips image upside down\nPDFNEWNET-31978\tImage is not extracting from PDF document\nPDFNEWNET-31991\tIssue regarding adding of extra bookmarks (6.4.2)\nPDFNEWNET-32675\tmender.AddText results in PDF Error (PDF contains a rotated page).\nPDFNEWNET-33119\tPageHeight and PageWidth properties not working properly\nPDFNEWNET-34100\tImages are broken when using Images.Replace method\nPDFNEWNET-34132\tOrdered list not rendering correctly during HTML to PDF conversion\nPDFNEWNET-34139\tImages are scrambled in the resultant PDF file\nPDFNEWNET-34165\tWhen IsHtmlTagSupported is set to true, resultant output is always in Times New Roman\nPDFNEWNET-34186\tResultant PDF generated from HTML is showing Text in Times New Roman instead of Arial\nPDFNEWNET-34213\tDuring HTML conversion to PDF base64 image is not being embedded\nPDFNEWNET-34229\tFont Issue in when text is in \"p\" tag\nPDFNEWNET-34338\tPdf.Save never finish: Image to PDF Conversion\nPDFNEWNET-34339\tFacades Stamp problem with font\nPDFNEWNET-34365\tSpace is not right between text and hyperlink\nPDFNEWNET-34412\tFont embedding issue when using \"Aquitaine Initials LET\"\nPDFNEWNET-34433\tImages are not coming properly in the generated file\nPDFNEWNET-34434\tText Fields are blacked out in generated file\nPDFNEWNET-34533\tEmf to Pdf Image Quality\nPDFNEWNET-34539\tSignature Fields are not showing Signatures with v7.5\nPDFNEWNET-34580\tAttachment problem using ImportAnnotationFromXfdf method\nPDFNEWNET-34639\theight attribute in \"tr\" i.e table row is not working in the pdf file.\nPDFNEWNET-34640\tvertical align is also not working in the pdf file.\nPDFNEWNET-34641\talign='center' is not working in the pdf file.\nPDFNEWNET-34646\tDuring HTML to PDF conversion, vertical alignment attribute is not working\nPDFNEWNET-34655\tGigantic white-space after last page and right side of all pages\nPDFNEWNET-34676\tPDF to Image: All contents are not appearing\nPDFNEWNET-34677\tPrinting a PDF in a wide pagesize fails\nPDFNEWNET-34687\tRow Border is not appearing\nPDFNEWNET-34755\tAspose.Pdf Api fails to convert thick line during XPS to Pdf conversion\nPDFNEWNET-34799\tXPS to PDF: URL does not convert to PDF\nPDFNEWNET-34829\tPDF to XPS: Contents are missing on resultant XPS\nPDFNEWNET-34853\tPDF Print Issue - Loss of Format, Extra characters\nPDFNEWNET-34868\tIssue while converting PDF page Size\nPDFNEWNET-34900\tRich Text Box support of HTML text lost in Aspose.Pdf 7.7.0\nPDFNEWNET-34918\tWhile concatenate same file with original, fields with comb of characters formatting lost\nPDFNEWNET-34925\tConcatenation of two Pdf documents resulting incorrect output\nPDFNEWNET-34958\tLine Break is not working in FreeTextAnnotation\nPDFNEWNET-33315\tLink Annotation does not return the Content\nPDFNEWNET-33807\tisWordWrapped property issue\nPDFNEWNET-33901\ttable.GetHeight issue\nPDFNEWNET-34834\tReplace TextBoxField value with text containing Html formatting\nPDFNEWNET-34869\tMultiple Form fields with same partial name\nPDFNEWNET-34899\tAdding special character (®) in rich text box field loses font style\nPDFNEWNET-34934\tRow height does not increase if contents are larger than its height",
  "requireLicenseAcceptance": true,
  "summary": "Aspose.Pdf for .NET is an amazing component which provides the feature to create and manipulate PDF documents.",
  "title": "Aspose.Pdf for .NET",
  "version": "7.8.0",
  "tags": [
    "Aspose.Pdf",
    "PDF",
    "XFA",
    "XPS",
    "TIFF",
    "PCL",
    "SVG",
    "HTML",
    "XML",
    "XSL-FO",
    "FDF",
    "XFDF",
    "PDF/A",
    "form"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    }
  }
}