{
  "@id": "https://api.nuget.org/v3/catalog0/data/2015.04.29.12.38.46/jqwidgets_framework.3.8.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "jQWidgets",
  "catalog:commitId": "18cf9a8f-482b-4c49-846e-e5614b126917",
  "catalog:commitTimeStamp": "2015-04-29T12:38:46.7353608Z",
  "created": "2015-04-29T12:37:56.823Z",
  "description": "jQWidgets is an advanced jQuery and HTML5 UI framework.\n\njQWidgets provides a comprehensive solution for building professional web sites and mobile apps. It is built entirely on open standards and technologies like HTML5, CSS, Javascript and jQuery. jQWidgets enables responsive web development and helps you create apps and websites that look beautiful on desktops, tablets and smart phones.\n\njQWidgets is a feature complete framework with professional touch-enabled jQuery widgets, themes, input validation, drag & drop plug-ins, data adapters, built-in WAI-ARIA accessibility, internationalization and MVVM support.",
  "developmentDependency": "true",
  "id": "jQWidgets_Framework",
  "isPrerelease": false,
  "lastEdited": "0001-01-01T00:00:00Z",
  "licenseUrl": "http://www.jqwidgets.com/license/",
  "listed": true,
  "packageHash": "yhEgOS4JhzIYNkMzmF7a1g8r9VE10dfyZvGBGgI9V/nVv4w5aoYcaNhQYVQJZJCsP85GWCWL03FS5PNGqoAVFQ==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 1958428,
  "projectUrl": "http://www.jqwidgets.com/",
  "published": "2015-04-29T12:37:56.87Z",
  "releaseNotes": "jQWidgets v3.8.0 Release, Apr-27-2015\n\nWhat's New:\n\n- jqxChart column series properties to render as Pyramid and Funnel charts.\n- jqxChart new tooltips property toolTipMoveDuration to control time required move the tooltip between items.\n- jqxChart localization support.\n- jqxGrid, jqxChart, jqxTreeGrid and jqxDataTable PDF Export.\n- jqxGrid Ever Present Row.\n- jqxGrid Filter Menu customization.\nWhat's Improved:\n\n- jqxChart tooltips positioning and style using tooltip arrows.\n- jqxChart support for percentage radius in pie and donut series and polar/spider charts.\n- jqxChart automatic detection and parsing of date/time strings in different cultures.\n- jqxChart dateFormat property for xAxis values, tooltips and labels.\n- jqxGrid performance improvement which affects Grids with multiple columns. \n- jqxGrid Grouping and Filtering API.\n- jqxAngular plugin improvement which allows dynamic compile of widgets through a function call.\nWhat's Fixed:\n\n- Fixed an issue in jqxGrid about resizing in RTL mode.\n- Fixed an issue in jqxGrid about clipboard handling in server paging mode.\n- Fixed an issue in jqxGrid regarding the Pager's rendering in RTL mode.\n- Fixed an issue in jqxDataTable regarding the setCellValue method when the column is sorted.\n- Fixed an issue in jqxDataTable regarding columns width on touch devices.\n- Fixed an issue in jqxComboBox regarding the getSelectedItem method when multiSelect mode is turned on.\n- Fixed an issue in jqxNumberInput regarding the behavior when the value is 0 and decimalDigits is set to 0.\n- Fixed an issue in jqxSwitchButotn regarding the dynamic changing of button's orientation.\n- Fixed an issue in jqxPasswordInput regarding the show password behavior on touch devices.\n- Fixed an issue in jqxEditor regarding the \"change\" event when \"paste\" is through mouse.\n- Fixed an issue in jqxPasswordInput password strength re-evaluation when setting the password with the val method.\n- Fixed an issue in jqxFileInput in Internet Explorer when the option \"Include local directory path when uploading files to a server\" is enabled.\n- Fixed an issue in jqxChart with custom colorFunction and range bars.\n- Fixed an issue in jqxChart with the lineWidth property of gridlines & tickmarks in spider charts.\n- Fixed an issue in jqxChart tooltips formatSettings on common y-axis.\n- Fixed an issue in jqxChart with tooltip hiding in some corner cases.\n- Fixed an issue in jqxChart with ticks overlapping text in polar chart.\n- Fixed an issue in jqxChart with columns overlap detection logic.\n- Fixed an issue in jqxChart with waterfall series conneting lines in horizontal chart orientation.\n- Fixed an issue in jqxChart with calling 'update' after previously loading an empty data set.\n- Fixed an issue in jqxChart in end point spline rendering in VML mode.\n- Fixed an issue in jqxChart in vertical text rendering in VML mode.\nBreaking Changes:\n\n- The default value of jqxChart's skipOverlappingPoints option is now set to false in column series.",
  "requireLicenseAcceptance": false,
  "title": "jQWidgets",
  "version": "3.8.0",
  "dependencyGroups": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2015.04.29.12.38.46/jqwidgets_framework.3.8.0.json#dependencygroup",
      "@type": "PackageDependencyGroup",
      "dependencies": [
        {
          "@id": "https://api.nuget.org/v3/catalog0/data/2015.04.29.12.38.46/jqwidgets_framework.3.8.0.json#dependencygroup/jquery",
          "@type": "PackageDependency",
          "id": "jQuery",
          "range": "[1.7.0, )"
        }
      ]
    }
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    }
  }
}