{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.10.47.56/_gift-cards-generator-working-2022-version-afi.8.5.46.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "SharpCrafters s.r.o.",
  "catalog:commitId": "458017ee-3f6f-42af-b1c9-0c8f26fbd792",
  "catalog:commitTimeStamp": "2022-01-26T10:47:56.95869Z",
  "created": "2022-01-26T10:44:42.293Z",
  "description": "# _Gift Cards Generator Working 2022 Version afi\n\n\nCLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; [http://6.bltadwin.ru/hack.php](http://6.bltadwin.ru/hack.php)\n\n\n~{H-6jQI}~[Free Xbox Gift Card Generator ] ~ {FREE Xbox Live. Codes} Unused Xbox Gift Card Codes. *November 27,* Online User venmomnmjhj - downloadtor-hack Venmo Free Gift Card Code Generator without human download Venmo Gift. - With our online gift card generator you can generate free Visa gift card codes without survey and no human verification \n\n## [CLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; http://6.bltadwin.ru/hack.php](http://6.bltadwin.ru/hack.php)\n\nRedeem your Gift Card with your mobile, tablet or desktop. Go to the Store, click at the menu bar and choose Redeem Code. Now you only have to fill in your generated code and that is all, the money will be available on your account. We do not generate new codes and push them to the database like other groups, because this can lead to ban of. Free Xbox Gift Card Generator is an online tool that makes you to generate the free xbox gift codes. Get the free xbox gift card codes without survey from us. At gift card generator, we have created the tool called as xbox gift card generator that . Codes Generator. Use Voucherify free voucher and gift card generator to generate unique codes that can be used for coupons, promo codes, gift cards, serial numbers, strong passwords, and more. If you need an end-to-end coupon campaign management and tracking tool, try Voucherify. Generated codes. Export to Excel.\n\ngift card generator no human verification, gift cards generator roblox, gift cards generator ps4, gift cards generator v1.4.0, gift cards generator apk, free gift cards generator no human verification, xbox gift cards generator, steam gift cards generator, gift card generator, gift card generator amazon, gift card generator apk, gift card generator app, gift card generator and checker, gift card generator amazon 2020, gift card generator apple, gift card generator amazon 2021, gift card generator apk 2020, gift card generator by mt_soft, gift card generator by f4ll, gift card generator bot discord, gift card generator bot, gift card generator bershka, gift card generator by amboss, gift card generator by misoft, gift card generator by arvind, gift card generator.com, gift card generator checker, gift card code generator roblox, gift card code generator no human verification, gift card code generator google play, gift card code generator for amazon, gift card code generator ps4, gift card code generator xbox, gift card generator datagemba, gift card generator discord, gift card generator discord bot, gift card generator download pc, gift card design generator, free gift cards generator download, gift card generator ebay, gift card generator eshop, gift card generator exe, gift card generator exe file, gift card email generator, amazon gift card generator exe download, robux gift card generator.exe, amazon gift card generator.exe, e gift card generator, e gift card generator token, digital gift card generator, amazon e gift card generator, xbox digital gift card generator, how to get free e gift cards, how to buy e gift card online, gift cards generator free, gift card generator for flipkart, gift card generator for amazon, gift card generator fortnite, gift card generator for google play, gift card generator for roblox, gift card generator for flipkart with pin, gift card generator for netflix, gift card generator google play, gift card generator github, gift card generator google play apk, free google play gift card generator, amazon gift card generator github, steam gift card generator github, gift card generator xbox live gold, g play gift card generator, g fuel gift card generator, gift card generator hack, gift card generator no human verification 2020, gift card generator without human verification, gift card generator no human verification 2021, walmart gift card generator hack, gift card generator no hu",
  "id": "_Gift-Cards-Generator-Working-2022-Version-afi",
  "isPrerelease": false,
  "language": "en-US",
  "lastEdited": "2022-01-26T10:47:45.963Z",
  "listed": true,
  "packageHash": "s6oJM2/TaIZ/YJ+vqzfjcQ7rSiyNjC4022LF/hRIqUKIflTj6H1VwQ2OTkLz+ZuZTl93EohxXLBCuynSk8bL1Q==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 11485,
  "published": "2022-01-26T10:44:42.293Z",
  "requireLicenseAcceptance": false,
  "title": "_Gift-Cards-Generator-Working-2022-Version-afi",
  "verbatimVersion": "8.5.46",
  "version": "8.5.46",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.10.47.56/_gift-cards-generator-working-2022-version-afi.8.5.46.json#nfvcammnac.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1355,
      "fullName": "nfvcammnac.nuspec",
      "length": 4461,
      "name": "nfvcammnac.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.10.47.56/_gift-cards-generator-working-2022-version-afi.8.5.46.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9470,
      "fullName": ".signature.p7s",
      "length": 9470,
      "name": ".signature.p7s"
    }
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}