{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.29.00.05.03/_injustice-gods-among-us-hack-working-2022-version-dhp.7.8.16.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "SharpCrafters s.r.o.",
  "catalog:commitId": "4a70a15e-e003-4360-98a7-2a3e6ea3b16d",
  "catalog:commitTimeStamp": "2022-01-29T00:05:03.067847Z",
  "created": "2022-01-26T08:41:32.63Z",
  "description": "# _Injustice Gods Among Us Hack Working 2022 Version dhp\n\n\nCLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; [http://bltadwin.ru/hack.php](http://bltadwin.ru/hack.php)\n\n\nAug 2, - Use Our Injustice Gods Among Us Hack and you will receive an unlimited number of Power Credits and Energy Recharge in your game account for. Injustice: Gods Among Us Mod Apk + Download + All Characters Unlocked,is fighting game between DC superheroes and supervillains. It is completely free. Injustice Mod Apk is a modified (hacked) version of the official Injustice: Gods Among Us game. With which you can enjoy all modded features.\n\n## [CLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; http://bltadwin.ru/hack.php](http://bltadwin.ru/hack.php)\n\n · Injustice: Gods Among Us is an entertaining and attractive game that you cannot miss. This is a free game; it is entirely suitable for all ages. When entering this game world, you have the right to collect warriors from the main role to the villain. Not only that, you can choose your own characters to battle/5().  · Injustice Gods Among Us Hack Download; Injustice: Gods Among Us Mod Apk:is a high-intensity battle game with a variety of characters that are real-life inspired to intrigue the download this game there is a whole team of villains and superheroes that are fighting opposite to each other in a soul ripping battle.  · Injustice Gods Among Us Hack Tool is a very strong program which gives to its users the chance to add to their accounts more money and energy. You will be probably surprised when you will see your game account with up to Money and Energy and in the same time you will feel invincible. To increase your enjoyment, in this new version you can also .\n\ninjustice gods among us hacked account, injustice gods among us hack 2021, injustice gods among us hack ios 2021, injustice gods among us hacked account ios, injustice gods among us hack apk, injustice gods among us hack ios, injustice gods among us hack 2020, injustice gods among us hack ios download, injustice gods among us hack android, injustice gods among us hack apk download, injustice gods among us hack app, injustice gods among us hack apk ios, injustice gods among us hack all characters, injustice gods among us hack download, injustice gods among us hack mod apk download, injustice gods among us hacked, injustice gods among us hacked accounts, injustice gods among us hacked apk, injustice gods among us coin hack, injustice gods among us power credits hack, injustice gods among us ios all characters hack, can lucky patcher hack injustice gods among us, hacked version of injustice gods among us, hack for injustice gods among us, free injustice gods among us hacked accounts, injustice gods among us hack download zip, injustice gods among us hack download ios, injustice gods among us hack version download, injustice gods among us hack game download for android, how do you hack injustice gods among us, hack de injustice gods among us android, injustice gods among us esp hack android, injustice gods among us esp hack, how to hack energy in injustice gods among us, injustice gods among us hack for ios, injustice gods among us hack for ipad, injustice gods among us hack for android, injustice gods among us free hacked accounts, injustice gods among us hack download for android, injustice gods among us hack download for ios, injustice gods among us hack apk for apple, injustice gods among us hack save file, injustice gods among us hack game download, injustice gods among us hack generator, injustice gods among us hack game, how to hack injustice gods among us with game guardian, injustice gods among us hack no human verification, how to play injustice gods among us hack, how to hack injustice gods among us, how to hack injustice gods among us mobile, how to hack injustice gods among us ios 2020, how to hack injustice gods among us ios, how to hack injustice gods among us android, how to hack injustice gods among us iphone, injustice gods among",
  "id": "_Injustice-Gods-Among-Us-Hack-Working-2022-Version-dhp",
  "isPrerelease": false,
  "language": "en-US",
  "lastEdited": "2022-01-28T23:46:33.257Z",
  "listed": false,
  "packageHash": "/By9RgDnmd/x1c04CR6tyEemTCevMaPUI6kzQIWISKDV8pw6DkIm/3gnppXiaVtGpn9cue9LoQ53ijn0y+RbnQ==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 11465,
  "published": "1900-01-01T00:00:00Z",
  "requireLicenseAcceptance": false,
  "title": "_Injustice-Gods-Among-Us-Hack-Working-2022-Version-dhp",
  "verbatimVersion": "7.8.16",
  "version": "7.8.16",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.29.00.05.03/_injustice-gods-among-us-hack-working-2022-version-dhp.7.8.16.json#asusxghrkj.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1343,
      "fullName": "asusxghrkj.nuspec",
      "length": 4483,
      "name": "asusxghrkj.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.29.00.05.03/_injustice-gods-among-us-hack-working-2022-version-dhp.7.8.16.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9462,
      "fullName": ".signature.p7s",
      "length": 9462,
      "name": ".signature.p7s"
    }
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}