{
  "@id": "https://api.nuget.org/v3/catalog0/data/2016.03.20.10.27.19/aqlaserializer.2.0.0.96.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "Vladyslav Taranov",
  "catalog:commitId": "87524968-cd86-47de-a89d-dfbb2cb4dee6",
  "catalog:commitTimeStamp": "2016-03-20T10:27:19.343644Z",
  "copyright": "Vladyslav Taranov 2016, fork source from Marc Gravell 2016",
  "created": "2016-03-20T09:50:56.03Z",
  "description": "AqlaSerializer is intended to serialize objects, not just data. \n\nWhat the difference? Data serializers don't care much about language runtime specifics like references, inheritance, etc. In contrast, an object serializer should take such things into account.\n\nAqlaSerializer primary goal is to support important .NET features like nested collections, multi-dimensional arrays, references, etc. And it still supports Google Protocol Buffers format.\n\nLike protobuf-net AqlaSerializer makes possible to store objects as a small in size binary data (far smaller than xml). And it's more CPU effective than BinaryFormatter and other core .NET serializers (which could be unavailable on your target platform). Its format is designed to be: small in size - efficient data storage (far smaller than xml) cheap to process - both at the client and server platform independent - portable between different programming architectures extensible - to add new data to old messages.\n\nThe implementation is compatible with most of the .NET family, including .NET 2.0/3.0/3.5/4.0, Windows Phone 8, Silverlight, etc. The code is heavily based on Marc Gravell's protobuf-net but there are a lot of improvements and fixes.\n\nThe original protobuf-net project contains many \"red\" unit tests but I managed to fix a lot of them.\n\nSome build configurations may be not available through nuget, you can download their binaries manually from github (use Project Site link).",
  "id": "aqlaserializer",
  "isPrerelease": false,
  "language": "en-US",
  "lastEdited": "2016-03-20T10:19:41.41Z",
  "licenseNames": "",
  "licenseReportUrl": "",
  "licenseUrl": "https://github.com/AqlaSolutions/AqlaSerializer/blob/master/Licence.txt",
  "listed": true,
  "packageHash": "3A0IlhiOIFLGJZvOk8EGADopeo8MzvCZ7ENpDkj21GXSo9AmtywIMK6kvAOud0YU5u2D6Pw7TzmvLMdDDB6D6g==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 5353689,
  "projectUrl": "https://github.com/AqlaSolutions/AqlaSerializer",
  "published": "2016-03-20T09:50:56.03Z",
  "releaseNotes": "* 2.0.0.96: V2 RC\n- Google Protocol Buffers format support is back (I've reconsidered this) - (de)serialization.\n- Nested collections.\n- Multi-dimensional arrays.\n- Improved reference tracking (e.g. surrogate fix and referencing arrays from inside themselves).\n- Improved versioning (e.g. between reference-nonreference-null-nonnull-dynamic).\n- Optimizations for better output size.\n- Collection subtypes (will read subtype number to create correct concrete type).\n- Array types may be registered as collections and use full set of features (null support, etc) even when passed as root objects.\n- Primitive types are allowed to be set to fields marked as dynamic type.\n- Reference serialization will avoid using too much recursion #1.\n- Possibility to specify different attribute sets for different models (see ModelId property on attributes).\n- Attributes to specify behavior on collection and collection elements (and nested) separately.\n- Significant peformance improvements.\n\n* 1.0.0.938:\n- more effficient memory usage\n- if writing stream CanSeek and CanRead the serializer may use it as a buffer when its own buffer grows too big\n\n* 1.0.0.818: merged changes from the fork origin (except DNX)\n* 1.0.0.793: fixed AsReferenceDefault correct usage for legacy protobuf-net attributes\n* 1.0.0.776:\n- fixed issue when surrogated value was not correctly reference tracked\n- add method is recognized not only on IEnumerable<T> but also on its inheritors like IReadOnlyCollection<T>\n\n* 1.0.0.767 - improvements in list handling, merged changes from original protobuf-net \n\n* 1.0.0.58 - initial AqlaSerializer release",
  "requireLicenseAcceptance": false,
  "summary": "Fork of well known protobuf-net, contains improved API, reference tracking, list handling and multiple fixes. It's a binary serializer designed for serializing **objects** on a wide range of .NET platforms.",
  "verbatimVersion": "2.0.0.96",
  "version": "2.0.0.96",
  "tags": [
    "binary",
    "serialization",
    "protocol",
    "buffers",
    "protobuf",
    "deserialization",
    "aqlaserializer",
    "aqla",
    "aqlasolutions"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    }
  }
}