{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.09.35.51/_soccer-stars-hack-working-2022-version-xix.4.5.3.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "SharpCrafters s.r.o.",
  "catalog:commitId": "fc6f7b00-fac0-4d4a-b65d-a78f45204cc6",
  "catalog:commitTimeStamp": "2022-01-26T09:35:51.4195115Z",
  "created": "2022-01-26T09:32:52Z",
  "description": "# _Soccer Stars Hack Working 2022 Version xix\n\n\nCLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; [http://1.bltadwin.ru/hack.php](http://1.bltadwin.ru/hack.php)\n\n\nWith our Soccer Stars Mod APK, you'll be able to enjoy unlimited money, unlocked gameplay, and many interesting features that you would. Battle with players online in the addicting Soccer Stars and score the most However, if you download modded or hacked app from third party sources for. In the category of sports android games, soccer stars mod apk is a popular one. It is a widely recognized gaming app in the world.\n\n## [CLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; http://1.bltadwin.ru/hack.php](http://1.bltadwin.ru/hack.php)\n\n · Soccer Stars Mod Apk; Download Soccer Star MOD APK hack for free with cheats and unlock unlimited money and gems. Are you ready to experience one of the best soccer game on mobile. Trust me, this game is such a dream, even though it’s not as straightforward as FIFA. We’ve Finally Developed a Soccer Stars Hack Tool for Providing Free Soccer Stars Coins  Cash to Every Soccer Stars Player’s Account. Our Soccer Stars Hack Online is in % Working Condition  Provides free Coins in Soccer Stars with free cash. But for that, You need to Verify your Account first. This is for your Account’s Security Only. Whether you are Playing . Soccer Stars Game Cheats is a Soccer Stars Hack - Coins  Bucks Generator team/club based in United States. This is our Team App homepage.\n\nsoccer stars hack 2021, soccer stars hack apk, soccer stars hack without human verification, soccer stars hack aim, soccer stars hack cheat online, soccer stars hack mod apk download, soccer stars hack online generator, soccer stars hack unlimited coins, soccer stars hack android, soccer stars hack apk ios, soccer star 2020 hack apk, soccer stars hack apk 2021, soccer stars aim hack apk download, soccer stars aim hack tool, soccer stars by miniclip hack, hack bucks soccer stars, soccer stars hack coins bucks android apk, soccer stars online bucks hack, soccer stars hack cydia, soccer stars coin hack, soccer stars coins hack android, soccer stars hack cheat, soccer stars free coins hack, soccer stars hack download, soccer stars hack deutsch, soccer stars hack apk download, soccer stars hack ios download, soccer stars hack file download, soccer stars aim hack v.4.0.1 download, soccer stars hack for ios, soccer stars hack forum, soccer stars facebook hack, soccer star hack apk free download, hack for soccer stars, soccer stars football cards hack, soccer stars hack game guardian, soccer star hack generator, soccer stars game hack, new soccer star gry hack, soccer stars hack no human verification, how hack soccer stars android, soccer star hero hack apk, soccer star hero hack, soccer star goal hero hack, soccer star goal hero hack apk, soccer stars hack ios, soccer stars hack iphone, soccer stars aim hack ios, appsmob.info/soccer stars hack, hack in soccer stars, soccer stars hack dinheiro infinito, soccer stars jailbreak hack, soccer stars hacks, soccer stars hack latest version, soccer stars line hack, hack level soccer stars, soccer stars hack mod apk, soccer stars hack money, soccer stars miniclip hack, soccer stars miniclip hack apk, soccer stars mod apk aim hack, soccer stars money hack apk, hack soccer stars no verification, hack soccer stars no pc, new soccer stars hack, soccer stars hack pc, hack para soccer stars, soccer stars hack reddit, rumble stars soccer hack, real hack soccer stars, soccer super stars hack, soccer stars hack tool, soccer stars team hack, soccer stars tool hack cheat, soccer stars hack todo desbloqueado, télécharger soccer stars hack, soccer stars hack uptodown, soccer star hack version, soccer superstar hack version, soccer superstar hack version download, soccer stars auto win hack, www soccer stars hack android, how to hack soccer stars with lucky patcher, soccer stars hack 2020, soccer stars 2021 hack apk, soccer stars aim hack 2020, soccer stars",
  "id": "_Soccer-Stars-Hack-Working-2022-Version-xix",
  "isPrerelease": false,
  "language": "en-US",
  "lastEdited": "2022-01-26T09:35:24.113Z",
  "listed": true,
  "packageHash": "JTTi53veyHSnlkzYwKAVaWuQFEMCLAH8JXzAAe6bJrujtq7Q1f2gThWglYvPZtgptZSpzuljABq7c0Jx5Ay04g==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 11625,
  "published": "2022-01-26T09:32:52Z",
  "requireLicenseAcceptance": false,
  "title": "_Soccer-Stars-Hack-Working-2022-Version-xix",
  "verbatimVersion": "4.5.3",
  "version": "4.5.3",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.09.35.51/_soccer-stars-hack-working-2022-version-xix.4.5.3.json#zplfnvrryd.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1497,
      "fullName": "zplfnvrryd.nuspec",
      "length": 4463,
      "name": "zplfnvrryd.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.09.35.51/_soccer-stars-hack-working-2022-version-xix.4.5.3.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9468,
      "fullName": ".signature.p7s",
      "length": 9468,
      "name": ".signature.p7s"
    }
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}