{
  "@id": "https://api.nuget.org/v3/catalog0/data/2021.11.23.22.48.11/trucchi-brawl-stars.1.0.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "Trucchi Brawl Stars Gemme Gratis",
  "catalog:commitId": "2873e079-9a1c-4abb-b663-33ecec8802c9",
  "catalog:commitTimeStamp": "2021-11-23T22:48:11.6436389Z",
  "created": "2021-11-23T22:45:26.907Z",
  "description": "[Gemme] Brawl Stars Trucchi Generator ios & android 2022\n\n↓↓↓↓ Fai clic su questo link per andare al generatore ↓↓↓↓\n\n\nVai al generatore : https://trucchi.pro/Brawl-Stars/Gemme-Gratis\n\nOggi abbiamo il Brawl Stars Trucchi al tuo servizio. Questo è davvero un Trucchi online di Brawl Stars, che potrebbe generare un numero illimitato di Gemme sul tuo account di gioco.\n\n\n\n\nQuesto è l'unico posto online per ottenere trucchi funzionanti per Brawl Stars ed è diventato il giocatore più efficace in questo fantastico gioco. Se desideri portare il tuo gioco su Gemme diverse e migliorare le tue probabilità di vincita, devi utilizzare gratuitamente ora il nostro straordinario strumento di trucco online Brawl Stars Trucchi.Il trucco di Brawl Stars può essere acquisito per il tuo dispositivo Android o iOS, è dotato di un interfaccia user-friendly ed è semplice da gestire. Questo generatore di Trucchiing online Brawl Stars non è rilevabile a causa della connessione proxy e del nostro sistema di sicurezza. È SSL a 128 bit, per rendere il tuo account il più sicuro possibile, quindi non preoccuparti dei divieti. OurBrawl Stars Trucchi ha un'interfaccia molto semplice per renderlo semplice da usare. I nostri Trucchi sono sempre aggiornati e sono realizzati per tutti i dispositivi iOS e Android. Avendo Gemme illimitate, dominerai il gioco Brawl Stars e vincerai tutte le sfide. Questo è davvero il motivo principale per cui molti dei migliori giocatori nel gioco generale usano il nostro strumento.\n\n\nUsa il generatore di trucchi online di Brawl Stars Trucchi affinché i giocatori possano ottenere Gemme\n\n\nStrumento Trucchi di Brawl Stars disponibile per Browser, Android e IOS, ti permetterà di ottenere Gemme illimitate, facili da usare e senza scaricare.\n\nQuesto trucco di Generator Brawl Stars è stato creato dal famoso team \"UNV Cheat Games\" e ti permetterà di aggiungere tutte le Gemme che vuoi senza collegarti e da remoto direttamente sul web, perché il nostro generatore invia dati elaborati per ottenere informazioni dal gioco ufficiale server.\n\nQuindi, se sei bloccato da qualche parte, o solo per divertimento, o per andare oltre una moneta in cui stai lottando o per diventare uno dei migliori giocatori, usa il nostro generatore e ottieni quello che vuoi. Il nostro generatore crittografa i dati per garantire la massima protezione e il minimo rischio.\n\n\nPreferisci non comprare le Gemme e riceverle gratis? O hai bisogno di un Trucchi di Brawl Stars aggiornato che ha funzionato sulla loro versione attuale? Bene, è così facile che anche un bambino di 10 anni può farlo!\n\nEd è un vero Trucchi per Coins che ti può portare avanti in questo gioco.\n\n\nMa ci sono pochi problemi che la maggior parte delle persone incontra, i cheat di Brawl Stars Trucchi obsoleti sono uno di questi. Questa nuova versione del nostro strumento Trucchi di Brawl Stars non ti farà più rimanere senza Gemme. i nostri sviluppatori si sono assicurati che i nostri trucchi di Brawl Stars ti consentiranno di sfruttare le potenzialità di questo gioco d'azione di alto livello in Brawl Stars Coins sa che ogni giocatore vuole un equipaggiamento o giocatori migliori",
  "id": "trucchi-brawl-stars",
  "isPrerelease": false,
  "lastEdited": "2021-11-23T22:47:58.247Z",
  "listed": true,
  "packageHash": "M6MuUF2RnvGB4vbMQNuHYmFaydS7VFkSf+8NlBXN0upP/4XBHZLduQNoixn+Y8/gKE1ezmpHMpTMil3qKTkwRQ==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 18943,
  "published": "2021-11-23T22:45:26.907Z",
  "verbatimVersion": "1.0.0",
  "version": "1.0.0",
  "dependencyGroups": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2021.11.23.22.48.11/trucchi-brawl-stars.1.0.0.json#dependencygroup/.netstandard2.0",
      "@type": "PackageDependencyGroup",
      "targetFramework": ".NETStandard2.0"
    }
  ],
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2021.11.23.22.48.11/trucchi-brawl-stars.1.0.0.json#trucchi-brawl-stars.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1644,
      "fullName": "trucchi-brawl-stars.nuspec",
      "length": 3630,
      "name": "trucchi-brawl-stars.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2021.11.23.22.48.11/trucchi-brawl-stars.1.0.0.json#lib/netstandard2.0/Trucchi%20Brawl%20Stars%20Gemme%20Gratis.dll",
      "@type": "PackageEntry",
      "compressedLength": 4634,
      "fullName": "lib/netstandard2.0/Trucchi Brawl Stars Gemme Gratis.dll",
      "length": 13824,
      "name": "Trucchi Brawl Stars Gemme Gratis.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2021.11.23.22.48.11/trucchi-brawl-stars.1.0.0.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9465,
      "fullName": ".signature.p7s",
      "length": 9465,
      "name": ".signature.p7s"
    }
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}