{
  "@id": "https://api.nuget.org/v3/catalog0/data/2018.09.04.22.44.54/xamarin.agora.voice.ios.2.3.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "dreamteammobile",
  "catalog:commitId": "e8641a31-0c2f-4c5b-86b4-854310a8d116",
  "catalog:commitTimeStamp": "2018-09-04T22:44:54.2463449Z",
  "created": "2018-09-04T22:13:21.427Z",
  "description": "Xamarin bindings to the native iOS Agora.io Voice SDK.",
  "id": "Xamarin.Agora.Voice.iOS",
  "isPrerelease": false,
  "lastEdited": "2018-09-04T22:44:53.237Z",
  "listed": true,
  "packageHash": "I3Dz1VL9bC6BRVhRt+qs7z99WZsnOanWBLIJNSlitmi0g0Mtfg2KzEccvCOXjjoTC5eff5ebkfkPovuQjqzEZQ==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 80859098,
  "projectUrl": "http://www.agora.io/",
  "published": "2018-09-04T22:13:21.427Z",
  "releaseNotes": "v2.3.0 (Released Aug 31st, 2018)\nBefore Reading\nAn Accelerate.framework library was added to the SDK in v2.3.0, which is capable of large-scale mathemetical computations and image calculations, optimzed for high performance.\nThe security keys are improved and updated in v2.1.0. If you are using an Agora SDK version earlier than v2.1.0 and wish to migrate to the latest version, see Token Migration Guide.\nNew Features\n1. Notifies the user that the Token will expire in 30 seconds\nThe SDK returns the tokenPrivilegeWillExpire callback 30 seconds before a Token expires to notify the app to renew it. When this callback is received, you need to generate a new Token on your server and call renewToken to pass the newly-generated Token to the SDK.\n\n2. Returns user-specific upstream and downstream statistics, including the bitrate, frame rate, packet loss rate and time delay\nThe audioTransportStatsOfUid callback is added to provide user-specific upstream and downstream statistics, including the bitrate, frame rate, and packet loss rate. During a call or a live broadcast, this callback is triggered every two seconds after the user receives audio packets from a remote user. The callback includes the user ID, audio bitrate at the receiver, packet loss rate, and time delay (ms).\n\n3. Sets the SDK’s Control over an Audio Session\nThe SDK and app both have control over the audio session. However, the app may restrict the SDK’s control over an audio session and allow another app or a third-party component to control it by using the setAudioSessionOperationRestriction method. You can implement different levels of control by choosing the corresponding restriction. You can call this method before or after joining the channel.\n\nImprovements\nImproved the quality for one-on-one voice/video scenarios with optimized latency and smoothness, especially for areas like Southeast Asia, South America, Africa and Middle East.\nImproved the audio encoder efficiency in a live broadcast to reduce user traffic while ensuring the call quality.\nImproved the audio quality during a call or a live broadcast using the deep-learning algorithm.\nIssues Fixed\nCrashes after publishing streams from some iOS devices.\nOccasional crashes on some iOS devices.\nCrash when a user frequently mutes and resumes all sound effects on some iOS devices.\nExcessive increase in memory usage associated with a host when he/she frequently joins and leaves a channel of multiple delegated hosts.\nOccasional issue that the remote user cannot hear the host when the host swithces to AUDIENCE and then back to BROADCASTER.\nOccasional issue on some iOS devices that a user fails to hear any sound after returnning to the channel from a system phone call.\nThe audience cannot adjust the channel volume on some special occasions.\nOccasional crashes when a user frequently joins and leaves the channel.\nOccasional crashes when one of the two broadcasters mutes or disables the local audio while playing the background music.\nOccasional crashes on the iOS device when the device interoperates with the web and when a Web user frequently joins and leaves a channel.\nOccasional crashes on some devices when preloading the sound effects.\nOccasional failure to interoperate between an iOS and a macOS device.\nOccasional crashes on some iOS devices when a user leaves the live broadcast channel while playing music using a third-party application.\nOccasional crashes on some iOS devices when leaving the channel.\nOccasional echoes when using a specific audio card.\nFailure to adjust the volume on some iOS devices.\nAPI Changes\nTo improve user experience, Agora has cleaned up and made the following changes to its APIs:\n\nTo avoid adding too many users with the same UID into the CDN publishing channel, the following APIs are added in v2.3.0:\n\naddUser\nremoveUser\nThe following APIs are deleted and no longer supported in v2.3.0. Agora provides the Recording SDK for better recording services. For more information on the Recoding SDK, see Release Notes for Agora Recording SDK.\n\nstartRecordingService\nstopRecordingService\nrefreshRecordingServiceStatus\nThe following deprecated APIs are deleted and no longer supported from v2.3.0:\n\nsetSpeakerphoneVolume\nBackwards Compatibility Breaking Changes\nNone.\n\nKnown Issues and Limitations\nTo use the startAudioMixing API, ensure that the iOS device is 8.0 or later.\nEncryption does not interoperate with the Web SDK (based on Web RTC).\nBluetooth on iPhone 8 is not supported.\n\norigin: https://docs.agora.io/en/2.4/product/Voice/Product%20Overview/release_ios_audio",
  "requireLicenseAcceptance": false,
  "summary": "Xamarin Agora iOS SDK lets you use Agora.in-powered audio sessions in apps",
  "title": "Xamarin bindings to the native iOS Agora Voice SDK.",
  "verbatimVersion": "2.3.0",
  "version": "2.3.0",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.09.04.22.44.54/xamarin.agora.voice.ios.2.3.0.json#Xamarin.Agora.Voice.iOS.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 2304,
      "fullName": "Xamarin.Agora.Voice.iOS.nuspec",
      "length": 5376,
      "name": "Xamarin.Agora.Voice.iOS.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.09.04.22.44.54/xamarin.agora.voice.ios.2.3.0.json#lib/Xamarin.iOS10/Xamarin.Agora.Voice.iOS.dll",
      "@type": "PackageEntry",
      "compressedLength": 80845497,
      "fullName": "lib/Xamarin.iOS10/Xamarin.Agora.Voice.iOS.dll",
      "length": 99582976,
      "name": "Xamarin.Agora.Voice.iOS.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.09.04.22.44.54/xamarin.agora.voice.ios.2.3.0.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9499,
      "fullName": ".signature.p7s",
      "length": 9499,
      "name": ".signature.p7s"
    }
  ],
  "tags": [
    "Agora",
    "Agora.io",
    "Voice",
    "SDK",
    "Xamarin",
    "iOS",
    "Xamarin.iOS",
    "MonoTouch",
    "Binding",
    "DreamTeam",
    "DreamTeamMobile"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    }
  }
}