{
  "@id": "https://api.nuget.org/v3/catalog0/data/2016.01.19.16.49.06/aspose.pdf.11.2.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "Aspose",
  "catalog:commitId": "e1b37780-d3be-47dc-af84-fda301d6c675",
  "catalog:commitTimeStamp": "2016-01-19T16:49:06.8736173Z",
  "copyright": "©Aspose 2002-2014. All Rights Reserved.",
  "created": "2016-01-19T16:48:45.373Z",
  "description": "Aspose.Pdf for .NET is a PDF document creation and manipulation component that enables your .NET applications to read, write and manipulate existing PDF documents without using Adobe Acrobat. It also allows you to create forms and manage form fields embedded in a PDF document. This component is written in managed C# and it allows developers to add PDF creation and manipulation functionality to their Microsoft .NET applications (WinForms, ASP.NET and .NET Compact Framework).\n        Aspose.Pdf for .NET is affordable and offers an incredible wealth of features including PDF compression options; table creation and manipulation; support for graph objects; extensive hyperlink functionality; extended security controls; custom font handling; integration with data sources; add or remove bookmarks; create table of contents; add, update, delete attachments and annotations; import or export PDF form data; add, replace or remove text and images; split, concatenate, extract or inset pages; transform pages to image; print PDF documents and much more.",
  "iconUrl": "http://www.aspose.com/blogs/wp-content/uploads/2013/06/aspose-Pdf-for-net_100.png",
  "id": "Aspose.Pdf",
  "isPrerelease": false,
  "lastEdited": "0001-01-01T00:00:00Z",
  "licenseNames": "",
  "licenseReportUrl": "",
  "licenseUrl": "http://www.aspose.com/corporate/purchase/end-user-license-agreement.aspx",
  "listed": true,
  "packageHash": "h7EtEM1OXvdk9DuCwaLPk+/Oo0ZlRVTwR3qM0L3RqL9H0Q9xFx0sY7+THPKw4Vs8qEihpwzSmVIz6J3Ujb5AhA==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 30159086,
  "projectUrl": "http://www.aspose.com/categories/.net-components/aspose.pdf-for-.net/default.aspx",
  "published": "2016-01-19T16:48:45.373Z",
  "releaseNotes": "This release introduces the features, enhancements and bug fixes as detailed below:\n\t\t\nFeatures\nPDFNEWNET-40014\tAccess TextFragement and TextSegment elements from XML file\nPDFNEWNET-38173\tSupport Grouped checkboxes\n\nEnhancements\nPDFNEWNET-39168\tImplement handling of new field in form element 'button'.\nPDFNEWNET-39947\tCreate Rectangle with alpha color channel support\nPDFNEWNET-39641\tChange TOC page numbering\nPDFNEWNET-40051 To add drawing with transparent color\n\nExceptions\nPDFNEWNET-40028\tException when placing large contents inside table cell\nPDFNEWNET-40003\tOpening PDF document Aspose.Pdf for .NET throws CrossTableNotFoundException\nPDFNEWNET-39961\tUpon loading PDF document it throws CrossTableNotFoundException\nPDFNEWNET-38798\tPDF to HTML throw unhandled ArgumentException\nPDFNEWNET-38666\tAPI throws CrossTableNotFoundException upon Loading PDF document\n\nBugs\nPDFNEWNET-40046\tFooter Text overlapping with Footnote\nPDFNEWNET-40044\tRectangles are not rendering on correct position\nPDFNEWNET-40029\tImage to PDF - Evaluation watermark appears when setting IsBlackWhite as True\nPDFNEWNET-39959\tLocalHyperlink doesn't jump back to a previous spot in page\nPDFNEWNET-39621\tEvaluation watermark when using attached license file\nPDFNEWNET-40114\tTable Horizontal alignment issue\nPDFNEWNET-39730\tReplacing text in numbered list with 3 or more items adds extra white-space\nPDFNEWNET-39193\tAnnotation arrow head size changes in flatten PDF file\nPDFNEWNET-39128\tAdding javascript action to comboboxfield throws NullReferneceException\nPDFNEWNET-37974\tPDF to excel: cells are being merged\nPDFNEWNET-40053\tFooter image is not rendering in 11.1.0\nPDFNEWNET-40040\tLicense embedded as resource is not working with 11.1.0 but 11.0.0\nPDFNEWNET-38811 Fast Web view issue\nPDFNEWNET-40011 Incorrect text wrapping in the table\nPDFNEWNET-38663 PDF to HTML results extra white lines in color background\nPDFNEWNET-37971 HTML to PDF - Image do not appear in PDF file\nPDFNEWNET-39483 Performance difference in Old generator and New generator",
  "requireLicenseAcceptance": true,
  "summary": "Aspose.Pdf for .NET is an amazing component which provides the feature to create and manipulate PDF documents.",
  "title": "Aspose.Pdf for .NET",
  "verbatimVersion": "11.2.0",
  "version": "11.2.0",
  "tags": [
    "Aspose.Pdf",
    "PDF",
    "XFA",
    "XPS",
    "TIFF",
    "PCL",
    "SVG",
    "HTML",
    "XML",
    "XSL-FO",
    "FDF",
    "XFDF",
    "PDF/A",
    "form",
    "Portfolio",
    "EPUB",
    "PSD",
    "to",
    "XLS",
    "DOC"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    }
  }
}