{
  "@id": "https://api.nuget.org/v3/catalog0/data/2015.07.15.17.31.55/51degrees.mobi.3.1.13.20-beta3.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "James Rosewell,  Iftikhar Ahmed,  Mike Morozov",
  "catalog:commitId": "7830f5d6-61c2-4ff6-b8c6-b7c5e320e510",
  "catalog:commitTimeStamp": "2015-07-15T17:31:55.345339Z",
  "copyright": "51Degrees Mobile Experts Limited",
  "created": "2015-06-18T19:38:31.407Z",
  "description": "The fastest, most accurate tools. Deployed by millions.\n      Request.Browser properties will be populated with data from 51Degrees Lite Device Data. Other features\n      include automatic image optimisation, monitoring of network conditions and client side feature detection.",
  "iconUrl": "https://51degrees.com/portals/0/Logos/Square%20Logo.png?width=128",
  "id": "51Degrees.mobi",
  "isPrerelease": true,
  "language": "en-GB",
  "lastEdited": "2015-07-15T17:31:43.543Z",
  "licenseUrl": "http://51degrees.codeplex.com/license",
  "packageHash": "fvtESaGb0i1JPefBIMWXLlI4/HouEoIlxapvwOSPcfq/xNLq3oW4crGq2Qe1wNKuPO9tR7yD/lo9ZKfYlGbmPw==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 9151732,
  "projectUrl": "http://51degrees.com/Support/Documentation/NET",
  "published": "1900-01-01T00:00:00Z",
  "releaseNotes": "Version 3.1.13 Highlights \nThe design focus of the release is to reduce memory consumption when the data file used directly from the disk, and to improve performance. \n* Embedded data has been removed from the assembly and now must be provided from the App_Data folder. \n* .NET 3.5 is not supported in this release in order to use memory mapped files and simplify overriding default browser capabilities. \n* In stream mode entity data properties that can allocate large arrays only initialise these arrays when needed.  \n* Caches used with stream operation are now fixed memory size and serviced via the thread pool. \n* Automatic update processes uses temporary files rather than main memory to verify integrity of updated files prior to using them. \n* Temporary files are now created in the App_Data/51Degrees folder of the web application rather than a UNC path or the master data file folder. \n* Values associated with Profiles are now retrieved using a more efficient algorithm. \n* DataSet.Properties collection now has a string accesser to make retrieving properties by name simpler. \nImport Change: The embedded device data has been removed from the assembly and by default placed in the App_Data folder if used with a web site. The solution will not work without the associated data file being provided and the WebProvider.ActiveProvider property can now return null. \n\n-- Changes between version 3.1.13.20 --\n\n1. Embedded device data has been removed from the assembly. A data file must be provided in order for detection to operate. As a result the WebProvider.ActiveProvider singleton can now return a null value and no detection results will be returned. In this situation the default capabilities providers used by .NET will be used exclusively and 51Degrees specific capabilities cannot be returned. \n2. The project no longer supports .NET v3.5. The MobileCapabilitiesProvider of 51Degrees is used to provide results to the HttpRequest.Browser property and the underlying default capabilities are no longer altered. This simplifies code and improves performance. All references to VER4 and VER35 have been removed. \n3. StreamFactory will now use a memory mapped file to access the source data file provided. This improves performance and is not possible in versions of .NET prior to v4. \n4. The following new files have been added to Foundation to support new performance features. \n a. Stream/DataSet.cs – inherits the base data set to provide access to the Pool of data source readers from any entity associated with the stream dataset. \n b. Stream/EntityFactories.cs – used to provide specific factories to Node and Profile lists that know about the data source pool and can create stream Node and Profile entities. \n c. Stream/Node.cs – Ranked Signatures and Numeric Children collections are no longer loaded into memory when the entity is constructed, they’re loaded when first requested. \n d. Stream/Profile.cs – Value Indexes and Signature Indexes collections are no longer loaded into memory when the entity is constructed, they’re loaded when first requested. \n e. Memory/Node.cs – As per the previous implementation all data associated with the Node is initialised when the entity is constructed. Need to maintain current memory based operation functionality. \n f. Memory/Profile.cs – As per the previous implementation all data associated with the Profile is initialised when the entity is constructed. Need to maintain current memory based operation functionality. \n g. Memory/EntityFactories.cs – used to provide the previous functionality where entities are initialised with all associated data when constructed. \n h. Factories/CommonFactory.cs – the DataSet no longer includes a constructor which loads the header information from a reader. Instead this information is loaded using a static method in the CommonFactory called LoadHeader. This change is needed so that a single data source can be used to load all data into the dataset to support memory mapped file sharing. \n5. The Node and Profile entities are now abstract requiring the complete implementation to be achieved in the inheriting classes in Stream or Memory. \n6. Cache has been updated to switch the active and inactive lists when the inactive list contains 50% of the total cache items. The thread pool is used to perform the switch avoiding the need for timers, background threads or delaying the detection process. \n7. A single Cache generic class is used for both UserAgent caching and also caching entities. \n8. Provider now exposes information about the user agent cache misses and switches. \n9. Stream fixed and variable lists now require a cache size to be specified when they’re created.  \n10. Memory/PropertiesList.cs has been added to support retrieval of Property entities using the string key name, not just the index of the property. \n11. ICacheList used for the stream lists now provides a property called Switches that enables the data set to be queried to determine the number of times the cache has been switched. This can be used along the cache miss information to alter the default cache sizes provided in DetectionConstants.cs. \n12. Auto update process will now download data to temporary files rather than main memory. \n13. Temporary files are now always stored in the ~/App_Data/51Degrees folder. If the directory does not exist it will be created subject to security permissions of the worker process identity. \n14. WebProvider’s method to get the published data of a data set file will now just create and destroy the data set without loading any data other than the header. \n15. Bandwidth, ImageOptimiser and Profile override features have been enhanced to access the Match results more efficiently. \n16. When used in a web application the Provider will now longer record the detection. The detection time is set from the WebProvider and provides a true figure as to the time taken to calculate the match result. \n17. Web UI elements have been updated to use new interfaces and methods. \n18. Values results can now be accessed by value name to determine the presence of a value in the list more easily. \n19. The retailer defaults have been updated to reflect the new primary web site URLs. \n20. If the Activator.cs used in the PreApplication start event does not fire and the 51Degrees MobileCapabilitiesProvider does not become the active capabilities provider the DetectorModule will \nperform the change to MobileCapabilitiesProvider. This has been observed in some IIS configurations where pre application start does not run reliably.",
  "requireLicenseAcceptance": false,
  "summary": "Fast & Accurate Device Detection. Deployed by millions.",
  "title": "51Degrees Mobile Detection & Optimisation",
  "version": "3.1.13.20-beta3",
  "dependencyGroups": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2015.07.15.17.31.55/51degrees.mobi.3.1.13.20-beta3.json#dependencygroup",
      "@type": "PackageDependencyGroup",
      "dependencies": [
        {
          "@id": "https://api.nuget.org/v3/catalog0/data/2015.07.15.17.31.55/51degrees.mobi.3.1.13.20-beta3.json#dependencygroup/microsoft.web.infrastructure",
          "@type": "PackageDependency",
          "id": "Microsoft.Web.Infrastructure",
          "range": "[1.0.0, )"
        }
      ]
    }
  ],
  "tags": [
    "mobile",
    "phone",
    "detection",
    "device",
    "data",
    "handset",
    "tablet",
    "responsive",
    "design",
    "images",
    "51degrees"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    }
  }
}