{
  "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.21.06.25.31/aspose.words.13.8.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "Aspose",
  "catalog:commitId": "649b4106-0323-4bd2-bb5b-b29e7daeadc7",
  "catalog:commitTimeStamp": "2018-10-21T06:25:31.5425735Z",
  "copyright": "© Aspose 2002-2013. All Rights Reserved.",
  "created": "2013-09-04T08:34:08.253Z",
  "description": "Aspose.Words for .NET class library supports DOC, DOCX, RTF, HTML, OpenDocument, PDF, XPS, EPUB and other formats. With Aspose.Words you can generate, modify, convert, render and print documents without utilizing Microsoft Word®",
  "iconUrl": "http://www.aspose.com/images/products/dotnet/Aspose.Words_128x128.png",
  "id": "Aspose.Words",
  "isPrerelease": false,
  "lastEdited": "2018-10-21T06:25:15.967Z",
  "licenseUrl": "http://www.aspose.com/corporate/purchase/end-user-license-agreement.aspx",
  "listed": true,
  "packageHash": "AGpVZMo3FwzhogrGD8go262dw2xraI6ad8iiSeHGgqSJKe4360uqFPgq+aCpZHxe95+2r+xtf9vlN4OHXs1umg==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 10700034,
  "projectUrl": "http://www.aspose.com/categories/.net-components/aspose.words-for-.net/default.aspx",
  "published": "2013-09-04T08:34:08.253Z",
  "releaseNotes": "There are 159 improvements and fixes in this regular monthly release. The most notable are:\n\n• Rendering to PostScript 3.0 is now supported\n• Metafile rendering performance significantly improved\n• EditableRange API introduced\n• German ordinal/cardinal list label generation supported\n• Improved tab width computation in marginal scenarios\n• Improved table border rendering with conflicting or missing attributes\n\nThis release introduces the new features, enhancements and fixes to the excptions/bugs as detailed below:\n\n• New features\nWORDSNET-1067\t/protection ranges/ Support protection of selected ranges in documents.\nWORDSNET-1960\tAdd an option to resample images to size and resolution before writing to PDF\nWORDSNET-2304\tConsider adding an ability to remove style from the document.\nWORDSNET-3995\tSupport rendering document to PostScript\nWORDSNET-4252\tConsider adding a property to Style class which shows if a Style is part of the Quick Styles gallery in a document\nWORDSNET-4726\t/protection ranges/ permStart/permEnd tags are lost during open/save DOCX and WML\nWORDSNET-5998\tConsider public API for removal of External Custom XML Schema References\nWORDSNET-6196\tSupport German numbering localization\nWORDSNET-6719\t/protection ranges/ Header footer protection while document remains editable\nWORDSNET-6905\tContent controls become non-editable during open/save\nWORDSNET-8389\tPreserve protection of selected ranges upon DOC round-trip.\nWORDSNET-8593\tDocument.Save do not preserve unprotected regions\nWORDSNET-8594\tSpan width is not preserved during converting MHTML to Word\nWORDSNET-8655\tAdd option to convert SVG to EMF instead of PNG in output Pdf file\nWORDSNET-8765\tText moves to next line after conversion from Docx to Pdf\nWORDSNET-8799\tRender path gradient in SWF.\n\n• Enhancements\nWORDSJAVA-765\topen DataTable-related classes for public api.\nWORDSNET-2570\tCenter-aligned text becomes left-aligned after HTML roundtrip\nWORDSNET-2778\tBackground specified using patterns is not displayed in HTML.\nWORDSNET-2800\t< br > between two tables doesn't take effect\nWORDSNET-3550\tLeft alignment of text in one cell is changed to center alignment during HTML export.\nWORDSNET-3703\tColor specified in row style has no effect during HTML import.\nWORDSNET-3726\tFirst table row appears bold during converting to HTML.\nWORDSNET-4244\tFormating of table is incorrect when save to DOCX.\nWORDSNET-4467\tMake it possible to detect floating tables via the public API\nWORDSNET-4477\tDocuments when saved in doc and pdf format looks different\nWORDSNET-4482\tFile size is unacceptably increased after HTML export.\nWORDSNET-4566\tBackground color applied to paragraph has no effect during HTML export.\nWORDSNET-4703\tFileCorruptedException is thrown upon loading MHTML.\nWORDSNET-4951\tPart of content is moved to the next page upon rendering.\nWORDSNET-5702\tWMF Raster operations is not supported // Doc to PDF conversion issue, when an excel embedded object exists in doc file\nWORDSNET-5723\tImage appears as \"red cross\" after open and save in html format.\nWORDSNET-5791\tsection.PageSetup.RestartPageNumbering does not effect after conversion\nWORDSNET-5857\ttable layouts get corrupted when \"PAGE\" field inserted\nWORDSNET-6106\tImprove Paragraph border rendering\nWORDSNET-6262\tUpdateFields messes the rendering of merged cells of table\nWORDSNET-6385\tCellMerge do not work properly when InsertField(\"Page\") inserted after table\nWORDSNET-6641\tLayout Problems with DOC to PDF conversion\nWORDSNET-7214\tConsider adding a Callback event that triggers when a table is split across pages\nWORDSNET-7819\tRevision is read incorrecly.\nWORDSNET-7981\tArrow heads in flow chart Shape are not visible in PDF\nWORDSNET-8583\tTable Borders are missing when converting Docx to PDF\nWORDSNET-8611\tValue of PAGE field is incorrectly calculated during RTF to PDF conversion\nWORDSNET-8620\tA Paragraph renders on to the previous page in PDF\nWORDSNET-8653\tStyleCollection.AddCopy do not work correctly with themes\nWORDSNET-8666\tCopies of the template are not getting separated by a section break in destination document\nWORDSNET-8684\t/legacy lists/ Amount of Tab space between List number and Text is incorrectly calculated during rendering to PDF\nWORDSNET-8694\tAspose.Words.FileCorruptedException while loading Docx file int DOM\nWORDSNET-8703\tdoc.Styles[StyleIdentifier.xxxx] creates new style in the empty document\nWORDSNET-8720\tSystem.ArgumentException is thrown when exporting a Doc to Html\nWORDSNET-8722\tFont formatting issue after conversion from Doc to Png\nWORDSNET-8807\tTextBox overlaps the content of following Paragraph after appending documents\n\n• Exceptions\nWORDSJAVA-521\tExternalFontCache appears to have a problem in a multi threaded envrionment when processing a document with embedded fonts\nWORDSJAVA-733\tCLONE - Document clones with multi threading\nWORDSJAVA-745\tjava.lang.RuntimeException occurs when converting DOC to HTML or PDF\nWORDSJAVA-760\tjava.lang.OutOfMemoryError: Investigate memory leaks when using openjdk on linux\nWORDSNET-366\tSpecifying an asterisk as table width during HTML import throws\nWORDSNET-5192\tInvalidOperationException is thrown upon rendering/converting to HTML\nWORDSNET-6760\tSystem.InvalidOperationException thrown while rendering DOCX to PDF\nWORDSNET-7291\tAspose.Words.Document unable to load HTML file\nWORDSNET-8270\tInvestigate exception with Aspose.Email dashboard examples\nWORDSNET-8371\tException while loading RTF file into Aspose.Words DOM.\nWORDSNET-8572\tNullReferenceException occurs during rendering Shape to Html or PDF\nWORDSNET-8648\tAspose.Words.FileCorruptedException occurs when loading Docx file\nWORDSNET-8697\tDashboard exception with Aspose.Email product\nWORDSNET-8708\tSystem.DivideByZeroException occurs during rendering Docx to Pdf\nWORDSNET-8709\tSystem.IndexOutOfRangeException occurs when converting Docx to Pdf\nWORDSNET-8717\tCan not find part of the path - Aspose.Email dashboard exception\nWORDSNET-8748\tInvalidCastException occurs during exporting DOCX to HTML\nWORDSNET-8751\tSystem.DivideByZeroException occurs during rendering Docx to Pdf\nWORDSNET-8777\tInvalidOperationException occurs during open/save a Docx\nWORDSNET-8787\tInvalidOperationException occurs when calling Document.AcceptAllRevisions method\nWORDSNET-8817\tAspose.Words.FileCorruptedException occurs when loading DOC file\n\n• Bugs\nWORDSJAVA-507\tImage quality is degraded when converting to HTML\nWORDSJAVA-548\tWhile converting Doc to Pdf, Circular image rendered as Square.\nWORDSJAVA-746\tMetaFile images are not rendering correctly in PDF\nWORDSJAVA-747\tImages are not preserved during rendering to PDF\nWORDSJAVA-753\t'\\PAGE' and '\\NUMPAGES' fields are displaying 'Error! Bookmark not defined' message in PDF\nWORDSJAVA-755\tAspose.Words.FileCorruptedException occurs when loading MHTML file\nWORDSJAVA-759\tFont resource unproperly loaded in test environment.\nWORDSJAVA-761\tMail Merge with regions do not work when used with IF field\nWORDSJAVA-766\tPAGE and NUMPAGES fields are displaying 'Error! Bookmark not defined' message in PDF\nWORDSNET-1739\tColspan duplicates cells during opening HTML.\nWORDSNET-5239\tNumbering in RTL document goes outside right margin\nWORDSNET-5286\tVertical merge information lost after open/save HTML.\nWORDSNET-5358\tShapes does not appear on \"Selection Pane\" in MS Word 2010 after open/save DOCX\nWORDSNET-5416\tOn DOC to PDF conversion, Table at the end of page is truncated\nWORDSNET-5630\tIncorrect page layout in PDF and Debug.Assert warnings while loading the document.\nWORDSNET-5636\tIncorrect rotation of the image\nWORDSNET-5669\tWord Table header row content is aligned incorrectly in HTML\nWORDSNET-5771\tHorizontally merged cells doesn't work in PDF/DOC etc\nWORDSNET-5923\tA graybox is added on top left corner in Fixed page formats\nWORDSNET-5944\tWhile converting docx to html, left border of the table is missing.\nWORDSNET-5952\tWhile converting doc to html, empty paragraphs are missing.\nWORDSNET-5967\tFrame around the image is misplaced during rendering\nWORDSNET-6068\tMissing table contents after converting doc to PDF.\nWORDSNET-6263\tIncorrect text font occurs while simple merge field execute (merge field within page footer).\nWORDSNET-6272\tIncorrect DrawingML image layout while rendering.\nWORDSNET-6348\tSurrogate characters are not visible in Docx format.\nWORDSNET-6407\tRTF to PDF conversion same page duplicated many times\nWORDSNET-6429\tOutput PDF/TIFF/XPS has one more page than the input DOC\nWORDSNET-6539\tOne line Paragraph is rendering into two lines of text\nWORDSNET-6604\tParagraph's first line is hanging incorrectly to the left\nWORDSNET-7010\tCell widths are not maintained during open/save DOCX file\nWORDSNET-7192\tContent Controls display incorrect values after AppendDocument\nWORDSNET-7692\tNegative font size of a list label\nWORDSNET-8353\tSVG image do not render correctly in exported document\nWORDSNET-8420\tText in Tables is made extra bold when rendering to PNG/TIFF\nWORDSNET-8451\tRemoveEmptyParagraphs does not remove empty Paragraphs containing NEXTIF fields\nWORDSNET-8493\tDoc to Pdf conversion issue - Underline is missing in PDF\nWORDSNET-8512\tInaccurate baseline position of text fields when rendering to PDF\nWORDSNET-8523\tHidden checkboxes become visible in PDF\nWORDSNET-8528\tSTYLEREF is not working for German language\nWORDSNET-8562\tDocx to Pdf conversion issue with (pictograph) chart rendering\nWORDSNET-8599\t/extra long runs/ Base64 image data (text) is partially rendering to PDF\nWORDSNET-8605\t\"Unknown document property name\" error message is displayed in place of a DOCPROPERTY in PDF\nWORDSNET-8617\tRectangle Shapes are shifted vertically down when appending document to another document\nWORDSNET-8625\tParagraphs are not preserved during open/save an ODT\nWORDSNET-8627\tContent inside Shape is truncated from bottom in fixed page formats\nWORDSNET-8628\tShape overlaps the content on it's right side in fixed page formats\nWORDSNET-8629\tShape is rendering at incorrect place in PDF\nWORDSNET-8630\tIncorrect position of checkboxes when rendering to PDF\nWORDSNET-8631\tIncorrect position of text fields when rendering to PDF\nWORDSNET-8643\tAfter conversion from DOCX, text inside table becomes bold\nWORDSNET-8654\tValues of Date picker StructuredDocumentTags are not preserved when rendering to Pdf\nWORDSNET-8657\tDropCapPostion property is not working\nWORDSNET-8660\tFont size of non-English text increases when rendering to PDF\nWORDSNET-8664\tDocument.AcceptAllRevisions do not work correctly\nWORDSNET-8680\tDocx to Fixed file format conversion issue with table borders rendering\nWORDSNET-8682\tImages are not imported from HTML when href contains escaped percent character (%25)\nWORDSNET-8683\tText in Shapes is truncated from bottom when rendering Docx to Pdf\nWORDSNET-8695\tDoc to Pdf conversion issue with comment's position\nWORDSNET-8699\tList changes its number format after appending one document to another\nWORDSNET-8713\tInvestigate if wrong fonts are used when rendering a Docx to Pdf or not\nWORDSNET-8714\tOleFormat.SuggestedExtension returns .bin for an embedded Doc\nWORDSNET-8723\tFont rendering issue after conversion from Doc to Png\nWORDSNET-8746\tFrames are not positioned at correct places when rendering to Pdf\nWORDSNET-8753\tText is missing after conversion from RTF to Pdf\nWORDSNET-8759\tUpdateFields hangs on calculating PAGE and NUMPAGES fields\nWORDSNET-8774\tField.Remove method doesn't remove all INCLUDEPICTURE fields from a Doc\nWORDSNET-8778\tBitmap, Worksheet and Slide OleObjects are not preserved during open/save DOT\nWORDSNET-8781\tValue of FORMTEXT field is not preserved during open/save a Docx\nWORDSNET-8782\tDash character is added right after the bullet after conversion from Docx to Pdf\nWORDSNET-8791\tParagraph Font's inconsistency when it is set via DocumentBuilder.Font\nWORDSNET-8793\tDoc to Pdf conversion issue with page border\nWORDSNET-8800\tShape causes Aspose.Words to hang during rendering DOC to HTML\nWORDSNET-8806\tA graph image is cropped from bottom and right during appending documents\nWORDSNET-8831\tDoc to Pdf conversion issue with Eq field\n\n• Performance\nWORDSNET-8118\tDocument constructor hangs during loading a MHTML\nWORDSNET-8543\tSlow conversion of word to pdf with 13.6.0.0 but not with 11.4.0.0\nWORDSNET-8822\tSystem.OutOfMemoryException occurs during loading a MHTML\n\n• Regressions\nWORDSJAVA-751\tImage options (chroma key) unproperly added for grayscale images.\nWORDSJAVA-763\tDuring mail merge, mergefields in the document are not getting replaced with values from data source\nWORDSNET-8370\tPageNumberFinder does no longer generate two column structured document\nWORDSNET-8565\tSystem.ArgumentOutOfRangeException occurs during rendering to HTML\nWORDSNET-8578\tAspose.Pdf no longer reads metadata keys/values correctly in PDF generated by Aspose.Words\nWORDSNET-8802\tInvalidOperationException occurs during exporting DOC to HTML\nWORDSNET-8803\tAspose.Words.FileCorruptedException occurs when loading DOC file",
  "requireLicenseAcceptance": true,
  "title": "Aspose.Words for .Net",
  "verbatimVersion": "13.8.0",
  "version": "13.8.0",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.21.06.25.31/aspose.words.13.8.0.json#Aspose.Words.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 5579,
      "fullName": "Aspose.Words.nuspec",
      "length": 14014,
      "name": "Aspose.Words.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.21.06.25.31/aspose.words.13.8.0.json#lib/net2.0/Aspose.Words.dll",
      "@type": "PackageEntry",
      "compressedLength": 5341376,
      "fullName": "lib/net2.0/Aspose.Words.dll",
      "length": 9361920,
      "name": "Aspose.Words.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.21.06.25.31/aspose.words.13.8.0.json#lib/net3.5/Aspose.Words.dll",
      "@type": "PackageEntry",
      "compressedLength": 5340801,
      "fullName": "lib/net3.5/Aspose.Words.dll",
      "length": 9360384,
      "name": "Aspose.Words.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.21.06.25.31/aspose.words.13.8.0.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9462,
      "fullName": ".signature.p7s",
      "length": 9462,
      "name": ".signature.p7s"
    }
  ],
  "tags": [
    "Aspose.Words",
    "DOC",
    "DOCX",
    "RTF",
    "HTML",
    "OpenDocument",
    "XPS",
    "EPUB",
    "Word",
    "Document",
    "Processing"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    }
  }
}