{
  "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.21.06.25.31/aspose.words.13.6.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "Aspose",
  "catalog:commitId": "649b4106-0323-4bd2-bb5b-b29e7daeadc7",
  "catalog:commitTimeStamp": "2018-10-21T06:25:31.5425735Z",
  "copyright": "© Aspose 2002-2013. All Rights Reserved.",
  "created": "2013-07-03T08:16:12.29Z",
  "description": "Aspose.Words for .NET class library supports DOC, DOCX, RTF, HTML, OpenDocument, PDF, XPS, EPUB and other formats. With Aspose.Words you can generate, modify, convert, render and print documents without utilizing Microsoft Word®",
  "iconUrl": "http://www.aspose.com/images/products/dotnet/Aspose.Words_128x128.png",
  "id": "Aspose.Words",
  "isPrerelease": false,
  "lastEdited": "2018-10-21T06:25:30.233Z",
  "licenseUrl": "http://www.aspose.com/corporate/purchase/end-user-license-agreement.aspx",
  "listed": true,
  "packageHash": "btec00HExyXFRdHeKf3ujm+prskV7TWjxV3j4i4SQUOZhvQnxKC2IpY6VORjuRljHRr7SQktQ3waaJxG7on2kQ==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 10518425,
  "projectUrl": "http://www.aspose.com/categories/.net-components/aspose.words-for-.net/default.aspx",
  "published": "2013-07-03T08:16:12.29Z",
  "releaseNotes": "There are 142 improvements and fixes in this regular monthly release. The most notable are:\n\n• Improved algorithm of content width calculation inside table cells.\n• More support for compatibility options in layout.\n• Layout performance improvements.\n• Decrease document size with Document.RemoveUnusedResources().\n• Theme fonts are used in calculation of Run.Font font names.\n• Many HTML and MHTML import improvements.\n• Material when rendering VML objects with 3D effects.\n• PDF form fields rendering improvements.\n\nThis release introduces the new features, enhancements and fixes to the excptions/bugs as detailed below:\n\n• New features\nWORDSNET-2584\tSupport OpenXPS\nWORDSNET-3291\tConsider adding an ability to remove unused Styles/Lists/Fonts from the document.\nWORDSNET-3312\tConsider exposing theme’s information.\nWORDSNET-3925\tConsider adding RegionStart/End as equivalent of TableStart/End.\nWORDSNET-4695\tValues of controls are changed when rendering. (CustomXml)\nWORDSNET-4719\tProvide an ability to save a document from SWF viewer.\nWORDSNET-5328\tAdd Table Text Wrapping property to Table object.\nWORDSNET-5554\tList labels format is changed after rendering.\nWORDSNET-6299\tCreate DmlX model objects for every diagram element according to specs.\nWORDSNET-6300\tRead XML and build DmlX model. (Proper DmlXBuilder classes development).\nWORDSNET-6592\tSupport all \"layout\" and \"fake\" fields in HTML export.\nWORDSNET-7253\t[VML 3D] Implement influence of material on face and edge color\nWORDSNET-7278\tList numbering style is not preserved during rendering to Pdf\nWORDSNET-7306\tStyle.Font.Name does not return the correct font name\nWORDSNET-7649\tProvide options to generate a scalable SVG\nWORDSNET-7950\tSupport OL and LI style attribute\nWORDSNET-8127\tText file with ANSI encoding is not correctly loaded into Aspose.Words.Document\nWORDSNET-8129\tRelease the .NET examples dashboard\nWORDSNET-8153\tUpdate Aspose.Total installer build scripts\nWORDSNET-8283\tConsider updating the REF field based off the SelectedValue of FORMDROPDOWN\nWORDSNET-8316\tProvide a way to specify a remote location as a Fonts Folder\nWORDSNET-8350\tDate (fixed) field is not preserved during open/save an ODT\nWORDSNET-8362\tLegend is rendered incorrectly.\nWORDSNET-8372\tDate content control (SDT) is not rendered in PDF\n\n• Enhancements\nWORDSJAVA-704\tHtml: numeric fallback for symbols non-supported by document's encoding.\nWORDSJAVA-707\tMail Merge with regions do not work with TYPE_FORWARD_ONLY ResultSet\nWORDSJAVA-727\tManually lift AsposeWordsPrintDocument\nWORDSJAVA-736\tCharset decoder numeric fallback default as in .Net\nWORDSNET-3531\tAutoShape color is changed upon open/save.\nWORDSNET-4326\tVertical text is positioned inmproperly in textbox upon rendering\nWORDSNET-4720\tDisplay pages side by side when there is enough space\nWORDSNET-4771\tStrange heading name appears in EPUB navigation map\nWORDSNET-4901\tChild region name is case-sensitive during mail merge.\nWORDSNET-5685\tdocument to pdf file conversion with Full Fonts generates large size file\nWORDSNET-6065\tImprove thick textbox border rendering\nWORDSNET-6622\tDoc to ePub conversion issue with image\nWORDSNET-7918\tCreate CSS selector classes\nWORDSNET-7940\tMultiple copies of a single page document are not printed\nWORDSNET-7997\tText alignment issue in a table after conversion from Doc to HTML\nWORDSNET-8052\tThe test TestCollector sometimes is failed\nWORDSNET-8174\tSupport \"Don't vertically align inside of textboxes\" compatibility option in the layout\nWORDSNET-8210\tPost this month's blog post and API changes\nWORDSNET-8212\tAdd support of @page rulesets\nWORDSNET-8220\tClean up doc build script\nWORDSNET-8254\tWatermark is not displayed in TIFF when specifying TiffCompression.Ccitt4\nWORDSNET-8257\tBorders.LineStyle is same for single, thick, hairline, inset, outset\nWORDSNET-8280\tContent inside TextBox Shapes is not visible in fixed page formats\nWORDSNET-8287\tConfigure TC to run unit tests as parallel tasks\nWORDSNET-8288\tConfigure TC to use an external database\nWORDSNET-8292\tShape is only partially visible in fixed page formats\nWORDSNET-8308\tCheck red tests in ab_CssInheritance\nWORDSNET-8320\tTable column widths are calculated incorrectly during rendering\nWORDSNET-8323\tImprove CSS Parser performance\nWORDSNET-8331\tDocument.Range.Replace throws exception System.NotSupportedException\nWORDSNET-8332\tUpdate TC pages in wiki\nWORDSNET-8348\tWrong algorithm of calculation CellPart.SpaceRight\nWORDSNET-8352\tDocument.Save method double the RTF size\nWORDSNET-8354\tUpdate information in the docs about merging duplicate regions\nWORDSNET-8356\tAspose.Pdf is unable to locate images in Aspose.Words' generated PDFs\nWORDSNET-8361\tTextbox position on DmlChart is incorrect.\nWORDSNET-8369\tConsider HtmlMargins in the layout engine.\nWORDSNET-8386\tSmartArt text rendering issue while conversion from docx to PDF\nWORDSNET-8393\tDoc to Pdf conversion issue with image rendering\nWORDSNET-8402\tFind a way to remove IsStroked property from the Shape class.\nWORDSNET-8417\tSupport Smart tag recognizer data during open/save DOC\n\n• Exceptions\nWORDSNET-7895\tSystem.OutOfMemoryException occurs during rendering to PDF\nWORDSNET-8209\tAcceptAllRevisions throws NullReferenceException\nWORDSNET-8277\tAspose.Words.FileCorruptedException occurs when loading RTF file\nWORDSNET-8341\tAspose.Words.FileCorruptedException while loading Docx\nWORDSNET-8351\tSystem.InvalidCastException occurs when rendering a DOCX many times in a loop\nWORDSNET-8394\tAspose.Words.FileCorruptedException occurs when loading DOC file\nWORDSNET-8395\tSystem.ArgumentException is thrown when rendering a DrawingML to PNG/TIFF\nWORDSNET-8422\tSystem.ArgumentOutOfRangeException occurs during saving to XAML\n\n• Bugs\nWORDSJAVA-514\tPicture from header overlaps with body text after export to html.\nWORDSJAVA-596\tWeblogic Server startup lag in development mode\nWORDSJAVA-614\tPNG is not rendering correctly in PDF\nWORDSJAVA-621\tAutoshape is sent behind an image while saving DOCX to PDF\nWORDSJAVA-724\tHyperlink address becomes relative to the 'java project' root directory during rendering RTF to PDF\nWORDSJAVA-735\tMailMerge merges object ID instead of value\nWORDSNET-4307\tA thick line shape when rendered, is cut off on its side.\nWORDSNET-5421\tAutoShape border is cut off during open/save.\nWORDSNET-5608\tDrawingML does not get rendered to flow formats other than DOCX\nWORDSNET-6173\tIncorrect font problem occurs after loading Word docx format.\nWORDSNET-6291\tLarge image is rescaled to height of 1px when added to model\nWORDSNET-6594\tProblem in exporting HTML Cell with border having display none and size medium\nWORDSNET-7099\tLeft Margin of Border Line is incorrect in HTML\nWORDSNET-7190\tTxt to PDF conversion issue\nWORDSNET-7605\tDocx to HTML conversion issue with bullets rendering\nWORDSNET-7956\tFont fallback is not working for EMF+ metafile\nWORDSNET-7978\tPortrait page orientation changes to Landscape in PDF\nWORDSNET-7996\tTable's contents become bold after conversion from Doc to HTML\nWORDSNET-8031\tSet field do not work when used with mail merge fields\nWORDSNET-8056\tDrawingML is pushed back to previous page in PDF\nWORDSNET-8069\tUpdateFields calculates value of a formula field incorrectly\nWORDSNET-8079\tDocx to HTML conversion issue with bullet items\nWORDSNET-8112\tText layout is not preserved during converting to any format\nWORDSNET-8117\tDOC to HTML conversion issue: A TR is exported without any TD\nWORDSNET-8119\tData points are rendering at incorrect places in PDF\nWORDSNET-8120\tContent at chart's x-axis is truncated in fixed page formats\nWORDSNET-8173\t/Do not suppress indentation/ Indentation of list lines is not exported correctly to fixed page formats\nWORDSNET-8194\tDoc to HTML conversion issue with Textbox rendering\nWORDSNET-8213\tDoc to Txt conversion issue with text rendering in RTL\nWORDSNET-8243\tDocx to Pdf conversion issue with inserted text when change tracking is enabled\nWORDSNET-8247\tExtra border lines appear in exported Pdf from Docx\nWORDSNET-8264\tForm Fields are rendered with incorrect font when PreserveFormFields is set to true\nWORDSNET-8278\tDocumentBuilder.InsertHtml insert the bullet list incorrectly\nWORDSNET-8279\tImageData.Save does not save the DrawingML node into image\nWORDSNET-8286\tParagraphs overlap a Shape after converting document to fixed page formats\nWORDSNET-8289\tTab spacing is not respected in fixed page formats\nWORDSNET-8290\tFour column Section layout is not preserved during rendering\nWORDSNET-8294\tFormatting of next Cell is applied to the content in previous Cell\nWORDSNET-8297\tTextbox renders incorrectly when saving Shape with ShapeRenderer.\nWORDSNET-8298\tOleFormat.SuggestedExtension returns .bin for a DOCX file which is embedded in ODT\nWORDSNET-8305\tNative HTML list element (UL) does not close when a common border DIV element starts\nWORDSNET-8306\t'left' CSS properties are used for RTL list items in HTML\nWORDSNET-8310\tMail Merge result are overlapped in output Docx\nWORDSNET-8328\tList bullets become corrupted after import from HTML if the 'font-family' property is applied to LI elements\nWORDSNET-8330\tDocument.Update do not work with multi language\nWORDSNET-8333\tAspose.Words.Document do not load MHTML shape\nWORDSNET-8336\tHorizontal Axis are missing while conversion from Docx to JPG\nWORDSNET-8346\tBorder appears around text boxes on conversion to docx, pdf which is not present in the source file\nWORDSNET-8359\tText inside Chart is missing when rendering to PDF\nWORDSNET-8360\tDocument.Protect does not work with ProtectionType.AllowOnlyFormFields\nWORDSNET-8365\tMERGEFIELD contained inside an IF field is not getting merged by Execute method\nWORDSNET-8366\tText in Legend of Chart truncates when converted to fixed page formats\nWORDSNET-8378\tUnwanted boxes around checkboxes appear during rendering\nWORDSNET-8379\tIncorrect vertical spacing between lines result in an extra page during rendering\nWORDSNET-8382\tDocument.Save change the page orientation\nWORDSNET-8383\tTable moved to second page after re-saving the document\nWORDSNET-8384\tDoc to Tiff conversion issue with RTL text rendering\nWORDSNET-8392\tCharacter spacing between Chinese Words is reduced in PDF\nWORDSNET-8403\tDouble quote character appears in output Pdf file after conversion\nWORDSNET-8405\tClearFormatting does not work for hyper link having direct formatting\nWORDSNET-8411\tImageResolution option in HtmlSaveOptions is cutting off images\nWORDSNET-8415\tOdd/Even Footer are lost when re-saving ODT\nWORDSNET-8416\tDocx to Pdf conversion issue with NumeralFormat.Context\nWORDSNET-8421\tFlowDocumentScrollViewer does not display 'All Caps' effect in XamlFlowPack document\nWORDSNET-8424\tHyperlink on image missing when saving to pdf\n\n• Performance\nWORDSNET-8248\tPerformance reduced in Aspose.Words 11.11.0.0\nWORDSNET-8265\t/slow/ PageCount takes quite a long time\n\n• Regressions\nWORDSNET-8285\tExecuteWithRegions is not performing nested mail merge regions on child Table\nWORDSNET-8357\tDocument.PageCount throws System.NullReferenceException",
  "requireLicenseAcceptance": true,
  "title": "Aspose.Words for .Net",
  "verbatimVersion": "13.6.0",
  "version": "13.6.0",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.21.06.25.31/aspose.words.13.6.0.json#Aspose.Words.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 5218,
      "fullName": "Aspose.Words.nuspec",
      "length": 12086,
      "name": "Aspose.Words.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.21.06.25.31/aspose.words.13.6.0.json#lib/net2.0/Aspose.Words.dll",
      "@type": "PackageEntry",
      "compressedLength": 5252150,
      "fullName": "lib/net2.0/Aspose.Words.dll",
      "length": 9157632,
      "name": "Aspose.Words.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.21.06.25.31/aspose.words.13.6.0.json#lib/net3.5/Aspose.Words.dll",
      "@type": "PackageEntry",
      "compressedLength": 5248778,
      "fullName": "lib/net3.5/Aspose.Words.dll",
      "length": 9156096,
      "name": "Aspose.Words.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.21.06.25.31/aspose.words.13.6.0.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9463,
      "fullName": ".signature.p7s",
      "length": 9463,
      "name": ".signature.p7s"
    }
  ],
  "tags": [
    "Aspose.Words",
    "DOC",
    "DOCX",
    "RTF",
    "HTML",
    "OpenDocument",
    "XPS",
    "EPUB",
    "Word",
    "Document",
    "Processing"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    }
  }
}