{
  "@id": "https://api.nuget.org/v3/catalog0/data/2015.02.03.19.41.30/aspose.pdf.8.4.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "Aspose",
  "catalog:commitId": "57151762-1437-4a5a-9ebc-723d5e9e0cd5",
  "catalog:commitTimeStamp": "2015-02-03T19:41:30.6163684Z",
  "copyright": "©Aspose 2002-2013. All Rights Reserved.",
  "created": "2013-09-12T05:19:17.72Z",
  "description": "Aspose.Pdf for .NET is a PDF document creation and manipulation component that enables your .NET applications to read, write and manipulate existing PDF documents without using Adobe Acrobat. It also allows you to create forms and manage form fields embedded in a PDF document. This component is written in managed C# and it allows developers to add PDF creation and manipulation functionality to their Microsoft .NET applications (WinForms, ASP.NET and .NET Compact Framework).\n\tAspose.Pdf for .NET is affordable and offers an incredible wealth of features including PDF compression options; table creation and manipulation; support for graph objects; extensive hyperlink functionality; extended security controls; custom font handling; integration with data sources; add or remove bookmarks; create table of contents; add, update, delete attachments and annotations; import or export PDF form data; add, replace or remove text and images; split, concatenate, extract or inset pages; transform pages to image; print PDF documents and much more.",
  "iconUrl": "http://www.aspose.com/App_Themes/V2/images/productLogos/NET/aspose_pdf-for-net.jpg",
  "id": "Aspose.Pdf",
  "isPrerelease": false,
  "lastEdited": "2013-09-12T05:29:08.637Z",
  "licenseUrl": "http://www.aspose.com/corporate/purchase/end-user-license-agreement.aspx",
  "packageHash": "7mVpLtu9HYh26tCB7L/EXk2W2fqHiXSiaso3Wxbg/Zg5DYBOtwlAKLan4GQ7b6+MV5Q+GWnn07ccltPG2i7ubw==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 32207082,
  "projectUrl": "http://www.aspose.com/categories/.net-components/aspose.pdf-for-.net/default.aspx",
  "published": "2013-09-12T05:19:21.22Z",
  "releaseNotes": "This release introduces the features, enhancements and bug fixes as detailed below:\n\nNew Features\nPDFNEWNET-13041\tWinForms control wrapping PdfViewer\nPDFNEWNET-13042\tWeb Control wrapping PdfViewer\nPDFNEWNET-35287\tEPUB to PDF conversion\nPDFNEWNET-35612\tSupport Wordwrap in TextStamp\n\nEnhancements\nPDFNEWNET-33812\tSetPageSize Method is not well defined\nPDFNEWNET-35663\tExport PDF file pages to JPEGs using MediaBox bounds\nPDFNEWNET-35521\tImage extraction from PDF file takes too much time\nPDFNEWNET-35723\tDOM output is 10 times in size as compate to Generator namespace\n\nExceptions\nPDFNEWNET-34891\tInsufficient data for an image message appears when adding bmp image\nPDFNEWNET-35649\tArgumentNullException when reading form field\nPDFNEWNET-34115\tWrong format of PDF String Exception when loading PDF file\nPDFNEWNET-34162\tException is occurring when trying to extract text from PDF file\nPDFNEWNET-35482\tNullReferenceException when adding text to PDF file\nPDFNEWNET-35525\tOutofMemoryException while trying to extract text from large PDF\nPDFNEWNET-34568\tSecured PDF (using Certificate Security) gives exception when using PdfFileInfo\nPDFNEWNET-35605\tIncorrect linearization information being returned\n\nBugs\nPDFNEWNET-33629\tUnable to open all EmbeddedFiles from PDF document\nPDFNEWNET-33827\tDocument.EmbeddedFiles.Count does not return the proper result\nPDFNEWNET-35245\tText Fragment Absorber returns sometimes bad X position\nPDFNEWNET-35345\tWhile converting PDF to JPEG, line is missing\nPDFNEWNET-35448\tProblem converting PDF to PDF/A\nPDFNEWNET-35504\tFast Web View is not being applied\nPDFNEWNET-35531\tPDF to TIFF - Blank pages removal doesn't work\nPDFNEWNET-35594\tAll fonts are inaccessible\nPDFNEWNET-35600\tPDF to DOC - problem displaying accented characters\nPDFNEWNET-35601\tCopyright symbol doesnt display after being processed with pdfEditor.Concatenate\nPDFNEWNET-35610\tCorrupted PDF when text contains spacial characters\nPDFNEWNET-35613\tError while adding text to PDF files\nPDFNEWNET-35616\tTable column width issue\nPDFNEWNET-35618\tWrong drawing of borders\nPDFNEWNET-35644\tProblem loading PDF document\nPDFNEWNET-35687\tDollar signs cause wierd text issue\nPDFNEWNET-35719\tBMP image, resultant PDF contains incorrect colors\nPDFNEWNET-35726\tHTML to PDF - Chinese text not appearing\nPDFNEWNET-35324\tDatat extraction issue with radio buttons / drop downs fields of XFA form\nPDFNEWNET-35385\tIssue in modifying LinkAnnotation, changing RemoteAction to LaunchAction\nPDFNEWNET-35408\tPDFA1B compliance test fails\nPDFNEWNET-35439\tImage extraction issue from PDF document, generated using Aspsoe.Words\nPDFNEWNET-35568\tPDF to PNG conversion produces blank images\nPDFNEWNET-35573\tOrder Issue in extracting PDF Portfolio embedded files\nPDFNEWNET-35591\tTable formatting issue\nPDFNEWNET-35626\tNAV0324NP text is being extracted as NAV0324NF\nPDFNEWNET-35647\tPDFA1B compliance test fails with Pdf-tools\nPDFNEWNET-35660\tPDF to PDFA1b: Unable to convert eForms to PDFA1b\nPDFNEWNET-35676\tAnnotation import fails\nPDFNEWNET-35685\tValidate method return wrong value\nPDFNEWNET-35690\tRemoving Keywords also removes some xmpmeta data\nPDFNEWNET-35494\tUnable to add Bookmark to PDF file",
  "requireLicenseAcceptance": false,
  "summary": "Aspose.Pdf for .NET is an amazing component which provides the feature to create and manipulate PDF documents.",
  "title": "Aspose.Pdf for .NET",
  "version": "8.4.0",
  "tags": [
    "Aspose.Pdf",
    "PDF",
    "XFA",
    "XPS",
    "TIFF",
    "PCL",
    "SVG",
    "HTML",
    "XML",
    "XSL-FO",
    "FDF",
    "XFDF",
    "PDF/A",
    "form",
    "Portfolio",
    "EPUB",
    "to",
    "DOC/DOCX"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    }
  }
}