{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.29.00.06.38/_matchington-mansion-hack-working-2022-version-feq.5.7.46.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "SharpCrafters s.r.o.",
  "catalog:commitId": "21ef0dca-0686-4fc7-9bd4-ab5e2f187473",
  "catalog:commitTimeStamp": "2022-01-29T00:06:38.5281898Z",
  "created": "2022-01-26T10:34:51.08Z",
  "description": "# _Matchington Mansion hack Working 2022 Version feq\n\n\nCLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; [http://5.bltadwin.ru/hack.php](http://5.bltadwin.ru/hack.php)\n\n\nMatchington Mansion is a mobile puzzle game where you need to match different colorful objects. There are lots of levels with different. Download Apk Latest Version of Matchington Mansion MOD, The Puzzle Game of Matchington Mansion Mod in your Android Device today you're able to Hack that. Decorate your mansion in this match 3 interior design game! Download Matchington Mansion Hack MOD APK + Data Unlimited Coins + Stars APK For.\n\n## [CLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; http://5.bltadwin.ru/hack.php](http://5.bltadwin.ru/hack.php)\n\n · Watch this Matchington Mansion Hack tutorial video. This is the LATEST (Updated Feb ) Matchington Mansion Hack tool for UNLIMITED Stars  Coins. Thi.  · Matching Mansion Hack Ios; Matchington Mansion Hack Pro; Also the Matchington Mansion match 3 Hack shall aid you with completing the provided missions easily and shorten out the moment. Matchington Mansion (hacked) for android is a mobile 3-in-a-row. Enter your Matchington Mansion Username and select the platform you are currently using. Using Matchington Mansion Hack is one of them – the most effective. How to collect the coins? There are also many smart ways of collecting the coins, which is basically the significant factor of the whole game.\n\nmatchington mansion hack no human verification, matchington mansion hack android, matchington mansion hack apk download, matchington mansion hack mod apk download, matchington mansion hack app, matchington mansion hack apk 2020, matchington mansion hack apk ios, can you cheat on matchington mansion, matchington mansion cheat codes, how to cheat in matchington mansion, matchington mansion hack club, matchington mansion coins hack, cara hack matchington mansion, cách hack matchington mansion, matchington mansion hack estrellas ilimitadas, matchington mansion hack español, matchington mansion hack free stars, matchington mansion hack free download, hack for matchington mansion, matchington mansion hack without human verification, hack matchington mansion, matchington mansion hack ios, matchington mansion hack ios 2020, matchington mansion hack iphone, hack game matchington mansion ios, matchington mansion hack kostenlos, matchington mansion lives hack, how to get more lives on matchington mansion, matchington mansion hack mod, matchington mansion hack 2020, matchington mansion hack unlimited stars, matchington mansion hack pro, hack para matchington mansion, matchington mansion reddit, matchington mansion hacks, matchington mansion hacks 2020, matchington mansion hacks iphone, matchington mansion hack without survey, matchington mansion sterne hack, tải game matchington mansion hack, matchington mansion hack version, matchington mansion hack version download, matchington mansion hack 2021, hack matchington mansion 2019, hacks for matchington mansion, matchington mansion 954",
  "id": "_Matchington-Mansion-hack-Working-2022-Version-feq",
  "isPrerelease": false,
  "language": "en-US",
  "lastEdited": "2022-01-28T23:46:36.203Z",
  "listed": false,
  "packageHash": "PPWSoi3s5w8GGWveYIdn7S4Yile8X6nx+zWVofUTqU3QCqDTvuG+El5xASKdmPCcpwC8yEk0kcpZL1hAp5DIjQ==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 11309,
  "published": "1900-01-01T00:00:00Z",
  "requireLicenseAcceptance": false,
  "title": "_Matchington-Mansion-hack-Working-2022-Version-feq",
  "verbatimVersion": "5.7.46",
  "version": "5.7.46",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.29.00.06.38/_matchington-mansion-hack-working-2022-version-feq.5.7.46.json#bbmyspsrej.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1179,
      "fullName": "bbmyspsrej.nuspec",
      "length": 3507,
      "name": "bbmyspsrej.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.29.00.06.38/_matchington-mansion-hack-working-2022-version-feq.5.7.46.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9470,
      "fullName": ".signature.p7s",
      "length": 9470,
      "name": ".signature.p7s"
    }
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}