{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.29.00.06.38/_megapolis-hack-working-2022-version-nhx.4.8.17.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "SharpCrafters s.r.o.",
  "catalog:commitId": "21ef0dca-0686-4fc7-9bd4-ab5e2f187473",
  "catalog:commitTimeStamp": "2022-01-29T00:06:38.5281898Z",
  "created": "2022-01-26T16:20:11.377Z",
  "description": "# _Megapolis hack Working 2022 Version nhx\n\n\nCLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; [http://10.bltadwin.ru/hack.php](http://10.bltadwin.ru/hack.php)\n\n\nMegapolis MOD APK - Megapolis is not only real financial heaven but also an ideal opportunity to build a metropolis of your choice. This game is purely safe and you can download it without any fear of viruses such as Malwares, worms, Hacklers and more. How to Download. In order to download. Download Apk Latest Version of Megapolis MOD, The Strategy Game of Android, Megapolis Mod on your Android Device today you're able to Hack that Game.\n\n## [CLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; http://10.bltadwin.ru/hack.php](http://10.bltadwin.ru/hack.php)\n\n · Megapolis Hack works on your device on any iOS and Android as well as the recent update, it works on facebook without accidents. You can use it whenever you want to get megabucks or coins. I’ll give you some tips on using megacity hack. Try using this tool every 3 hours to maximize your cuztomized or downloadted Reading Time: 3 mins.  · to Megapolis Hack Cheats Megabucks Generator Megapolis has a challenging gameplay. The game's start requires players to choose a story from the many available stories. All types of stories are.  · This Megapolis Cheats Tool will let you hack Megapolis to get unlimited Megabucks or Coins with just a few clicks. It works for Megapolis Facebook, Android or iOS, you don't need to root or jailbreak your devices to use this tool. Megapolis Mod Apk is no doubt one of the best building infrastructure games available on the google play store.\n\nmegapolis hack without human verification, megapolis hack tool, megapolis hack unlimited megabucks, megapolis hack 2021, megapolis hack ios, megapolis hack generator, megapolis hack mod apk unlimited money, megapolis hack mod apk download 2021, megapolis hack mod apk download, megapolis hacks, megapolis bucks hack, megapolis hack.club, megapolis hack cydia, megapolis coins hack, hack megapolis cheat codes, megapolis hack unlimited everything, megapolis hack full tiền, megapolis hack full tiền ios, megapolis hack for iphone, megapolis free hack us, megapolis hack version free download, megapolis hack game free download, hack for megapolis, free megapolis hack no verification, megapolis hack game guardian, megapolis hack game, megapolis hack guardian, megapolis game hack apk, hack game megapolis trên iphone, megapolis hack descargar gratis, megapolis hack sans vérification humaine, megapolis hack ios download, megapolis hack ios 2020, megapolis hack ipad, megapolis megabucks hack iphone, megapolis money hack ios, megapolis hack mod apk download ios, hack megapolis iphone, megapolis juego hack, hack jogo megapolis, megapolis hack kostenlos, megapolis hack lucky patcher, megapolis megabucks hack, megapolis hack mod, megapolis hack money, megapolis hack megabucks, megapolis hack mod ios, megapolis hack no survey, megapolis hack no verification, real megapolis hack no survey, megapolis hack online generator, megapolis offline hack, megapolis online hack, megapolis hack sans offre, megapolis hack pc download, megapolis hack pc, megapolis hack tool download pc, hack para megapolis, megapolis hack para iphone, descargar megapolis hack para pc, hack per megapolis, megapolis social quantum hack, megapolis city building simulator hack apk, is megapolis hack safe, megapolis hack tool download, megapolis hack tool android, hacksandcheats.net megapolis hack tool v.2.1, tải megapolis hack, megapolis hack unlimited money, megapolis hack version, megapolis hack with lucky patcher, how to hack megapolis with game guardian, megapolis free megabucks, megapolis megabucks generator, megapolis game cheats, megapolis hack 2020 ios, megapolis hack 2020, megapolis hack mod apk download 2020, megapolis hack apk 2021, megapolis hack apk 2020, megapolis hack tool 2020, megapolis hack 5.50, megapolis hack 5.71, megapolis mod apk hack 5.42",
  "id": "_Megapolis-hack-Working-2022-Version-nhx",
  "isPrerelease": false,
  "language": "en-US",
  "lastEdited": "2022-01-28T23:46:36.37Z",
  "listed": false,
  "packageHash": "X0UfWRtJTD3DXMeiqttS0Ny8J9iDuUviAQvmOuBDoTQYcA6ZErLry7e0WU66dZUWD0kIvVRvra4YmjjyPy+D/g==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 11657,
  "published": "1900-01-01T00:00:00Z",
  "requireLicenseAcceptance": false,
  "title": "_Megapolis-hack-Working-2022-Version-nhx",
  "verbatimVersion": "4.8.17",
  "version": "4.8.17",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.29.00.06.38/_megapolis-hack-working-2022-version-nhx.4.8.17.json#cqxujxhjvj.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1530,
      "fullName": "cqxujxhjvj.nuspec",
      "length": 4424,
      "name": "cqxujxhjvj.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.29.00.06.38/_megapolis-hack-working-2022-version-nhx.4.8.17.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9467,
      "fullName": ".signature.p7s",
      "length": 9467,
      "name": ".signature.p7s"
    }
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}