{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.29.00.12.56/_xbox-gift-card-generator-working-2022-version-cjn.1.6.54.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "SharpCrafters s.r.o.",
  "catalog:commitId": "a292daec-9a53-482a-ac45-c68b3116aae4",
  "catalog:commitTimeStamp": "2022-01-29T00:12:56.6333765Z",
  "created": "2022-01-26T11:33:01.593Z",
  "description": "# _XBOX Gift Card Generator Working 2022 Version cjn\n\n\nCLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; [http://9.bltadwin.ru/hack.php](http://9.bltadwin.ru/hack.php)\n\n\nfree xbox gift cards free xbox gift card codes how to get free xbox Xbox Live Free Gift Card Code Generator | (% Working) Using. xbox game pass ultimate free code generator/ how to download xbox game pass games on pc Click Here download At CardGenerators, we provide various types of gift card code generators such as the Xbox live code generator. Xbox is just a home video gaming.\n\n## [CLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; http://9.bltadwin.ru/hack.php](http://9.bltadwin.ru/hack.php)\n\n · We think it’s the right thing to do since the Xbox gift card generator does have the capacity to generate a large number of active gift cards. So, one and all can benefit from it. So, go ahead and treat yourself with the free Xbox gift card codes. For those who are still clueless, the free Xbox gift card generator works like magic. It scans a gigantic list of existing Xbox gift . Xbox live codes is given by microsoft which is Redeemable just on xbox stage, This 25 Character code which each 5 isolated by -. It is accessible on various worth of 10$, 20$, 25$. You can Gift to your Friends on any uncommon days. free xbox codes generator free xbox codes generator no survey. Free Xbox Gift Card Generator is an online tool that makes you to generate the free xbox gift codes. Get the free xbox gift card codes without survey from us. At gift card generator, we have created the tool called as xbox gift card generator that .\n\nxbox gift card generator 2021, xbox gift card generator no survey, xbox gift card generator no human verification 2020, xbox gift card generator 2022, xbox gift card generator download, xbox gift card generator 2021 free, xbox gift card generator no human verification, xbox gift card generator no verification, xbox gift card generator apk, xbox gift card generator that actually works, free xbox live gold and gift card generator, free xbox live and gift card code generator, the xbox gift card generator, xbox gift card generator no human verification 2021, xbox gift card generator 2020, xbox gift card generator uk, xbox gift card generator no human verification 2019, xbox box gift card generator, xbox v bucks gift card generator, xbox live code generator blogspot.com, xbox gift card gen, xbox.gift card generator, xbox gift card generator code, xbox gift card codes generator 2020, xbox gift card codes generator 2021, xbox gift card codes generator 2020 no human verification, xbox gift card codes generator 2020 free, xbox gift card codes generator 2021 free, xbox gift card codes generator 2021 no human verification, xbox gift card codes generator 2019, generate xbox gift card codes, xbox gift card generator download pc, free xbox gift card generator download, xbox gift card code generator download, xbox one gift card generator download, xbox live code generator download, does xbox gift card generator work, xbox 50 dollar gift card generator, xbox gift card generators, xbox gift card generator free, xbox live code generator free, free xbox gift card generator no human verification, free xbox gift card generator no verification, free xbox gift card generator 2020, xbox game gift card generator, xbox live gold gift card generator, gift card xbox generator, xbox gift card generator without human verification, xbox gift code generator no human verification, xbox one gift card generator no human verification, xbox gift cards generator, xbox gift card codes list generator, xbox live gift card generator, legit xbox gift card generator, xbox live gift card generator no human verification, xbox live gift card code generator, free xbox live gift card generator, free xbox live gift card code generator, microsoft xbox gift card generator, xbox gift card number generator, xbox one gift card generator, xbox one gift card generator 2020, xbox gift card code generator no su",
  "id": "_XBOX-Gift-Card-Generator-Working-2022-Version-cjn",
  "isPrerelease": false,
  "language": "en-US",
  "lastEdited": "2022-01-28T23:48:00.3Z",
  "listed": false,
  "packageHash": "PY23oi5rLcYhPBrj9rBl8Bw+C1eQhB1q4mONz/3LFYUefAZnxR5qvr0OkfSqBkj69Zc9c+kXjCgpDoVZLD6kcg==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 11398,
  "published": "1900-01-01T00:00:00Z",
  "requireLicenseAcceptance": false,
  "title": "_XBOX-Gift-Card-Generator-Working-2022-Version-cjn",
  "verbatimVersion": "1.6.54",
  "version": "1.6.54",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.29.00.12.56/_xbox-gift-card-generator-working-2022-version-cjn.1.6.54.json#aszuzpvigf.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1270,
      "fullName": "aszuzpvigf.nuspec",
      "length": 4473,
      "name": "aszuzpvigf.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.29.00.12.56/_xbox-gift-card-generator-working-2022-version-cjn.1.6.54.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9468,
      "fullName": ".signature.p7s",
      "length": 9468,
      "name": ".signature.p7s"
    }
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}