{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.16.48.08/_dragon-ball-legends-hack-working-2022-version-icn.4.8.12.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "SharpCrafters s.r.o.",
  "catalog:commitId": "282bd29b-6b3a-407d-9201-1d0e18004c58",
  "catalog:commitTimeStamp": "2022-01-26T16:48:08.1025542Z",
  "created": "2022-01-26T16:45:25.323Z",
  "description": "# _Dragon Ball Legends hack Working 2022 Version icn\n\n\nCLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; [http://12.bltadwin.ru/hack.php](http://12.bltadwin.ru/hack.php)\n\n\nModded/Hacked App: DRAGON BALL LEGENDS by BANDAI NAMCO Entertainment download ID: downloadnamcoent. A Dragon Ball Legends Hack is any technique, app, tool, mod or software that allows you to gain an advantage, to farm free Chrono Chrono crystals (CC) (CC). Dragon Ball Legends Hack Apk has a plot sticking to the original version. We are all too familiar with the adventures of Goku and his friends.\n\n## [CLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; http://12.bltadwin.ru/hack.php](http://12.bltadwin.ru/hack.php)\n\n · How to Install Dragon Ball Legends Hack Android. 1. After download, click on the install option. 2. Go to settings and give permission to install this game. 3. Now click on the install option. Congratulation, your game is successfully installed. Enjoy Game/5.  · DRAGON BALL LEGENDS VIP Hack Role Playing, Entertainment. DRAGON BALL LEGENDS - Free H. Role Playing, Entertainment. Jurassic World Alive Hack. Shadow Fight 3 Hack. Version: Hack Features: Enemy FrozenIf you can't get pass the tutorial. Download and play the original version here. Dragon Ball Legends Hack Tool. FOLLOW OUR INSTRUCTIONS BELOW! Step 1: Enter your Dragon Ball Legends Username! Step 2: Select Chrono Crystals amount! Step 3: Click on I AGREE! CONTINUE to start!\n\ndragon ball legends hack chrono crystals, dragon ball legends hack no human verification, dragon ball legends hackers, dragon ball legends hack generator, dragon ball legends hack ios, dragon ball legends hack unlimited crystals, dragon ball legends hack reddit, dragon ball legends hack 2021, dragon ball legends hack ipa, dragon ball legends hack apk unlimited crystals, dragon ball legends hack apk ios, dragon ball legends hack apk 2.9.0, dragon ball legends hack apk 2.19.0, dragon ball legends crystal hack apk, dragon ball legends all characters unlocked hack, dragon ball legends apk hack 2021, dragon ball legends hack chrono crystals apk, dragon ball legends apk unlimited crystals, dragon ball legends hack no human verification or survey, dragon ball legends hack crystals, dragon ball legends hack no human verification 2020, dragon ball legends bluestacks hack, dragon ball legends hack crystals blogspot com, dragon ball legends hack chrono crystals generator, dragon ball legends hack.com, dragon ball legends hack cydia, dragon ball legends hack chrono crystals 2021, dragon ball legends hack equipment, dragon ball legends hack erfahrung, dragon ball legends hack game guardian, dragon ball legends online hack generator, how to get dragon ball legends hack ios, dragon ball legends hack without human verification, dragon ball legends hack no human verification 2021, dragon ball legends hack ios no human verification, dragon ball legends chrono crystals hack no human verification 2021, dragon ball legends chrono crystals hack no human verification 2020, hack dragon ball legends crystal, dragon ball legends hack ios no jailbreak, dragon ball legends hack ios unlimited crystals, dragon ball legends hack ios 2020, dragon ball legends hack ios crystals, dragon ball legends hack iphone, dragon ball legends hack iosgods, dragon ball legends hack jailbreak, dragon ball legends hack ios jailbreak, dragon ball legends hack no jailbreak, dragon ball legends kristalle hack, dragon ball legends hack no survey, dragon ball legends hack online, dragon ball legends chrono crystals hack reddit, dragon ball legends rare medals hack, dragon ball legends - summon hack, hacks para dragon ball legends, dragon ball legends hack tool, dragon ball legends hack tool 2020, dragon ball legends hack tutuapp, dragon ball legends hack todos los personajes, how to hack dragon ball legends, how to hack dragon ball legends 2021, how to hack dragon ball legends ios, dragon ball legends hack unlimited chrono crystals, dragon ball legends hack unlimited ",
  "id": "_Dragon-Ball-Legends-hack-Working-2022-Version-icn",
  "isPrerelease": false,
  "language": "en-US",
  "lastEdited": "2022-01-26T16:47:57.69Z",
  "listed": true,
  "packageHash": "AR63nnxDEVhp3NQ9O7sSDSkpw0zlSfrN+P95UH/NSVwFbpmvzu+eKAoOwxO8vygTm+fEJzSBiq3O3k53bLvJLg==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 11446,
  "published": "2022-01-26T16:45:25.323Z",
  "requireLicenseAcceptance": false,
  "title": "_Dragon-Ball-Legends-hack-Working-2022-Version-icn",
  "verbatimVersion": "4.8.12",
  "version": "4.8.12",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.16.48.08/_dragon-ball-legends-hack-working-2022-version-icn.4.8.12.json#bvdjvzomcm.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1315,
      "fullName": "bvdjvzomcm.nuspec",
      "length": 4473,
      "name": "bvdjvzomcm.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.16.48.08/_dragon-ball-legends-hack-working-2022-version-icn.4.8.12.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9471,
      "fullName": ".signature.p7s",
      "length": 9471,
      "name": ".signature.p7s"
    }
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}