{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.02.12.02.28.56/knight-war-idle-defense-cheats.8.9.4.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "cmkaep",
  "catalog:commitId": "f3352a05-90a6-4960-a9f4-0fceaeb74fe6",
  "catalog:commitTimeStamp": "2022-02-12T02:28:56.4809973Z",
  "created": "2022-02-12T02:25:40.487Z",
  "description": "Knight War: Idle Defense Hack Mod APK Get Unlimited Coins Cheats Generator IOS Android\n\nKnight War: Idle Defense Hack [2021 WORKING] Unlimited Coins Android | iOS ! 100% Work\nToday, we got the Knight War: Idle Defense Hack at your service. This really is an Knight War: Idle Defense ONLINE Hack, which could generate Unlimited number of Coins to your game account. \nThis is the sole place online to get working cheats for Knight War: Idle Defense and became the most effective player in this great game. If you wish to take your game to a different level and improve your odds for winning, you need to use free of charge now our amazing Knight War: Idle Defense Hack Online Cheat Tool. Knight War: Idle Defense Cheat Tool can be acquired for your Android or iOS device, it features a user-friendly interface and is simple manageable. \n\n➡ ➡ ➡  GET IT HERE: http://tinybit.cc/648f398d\n\nThis Knight War: Idle Defense hack online generator is undetectable because of proxy connection and our safety system. It's 128-bit SSL, to produce your account as safe as you are able to so don't bother about bans. Our Knight War: Idle Defense Hack has very simply interface to produce it simple to use. Our hacks are always up to date and they are made for every one of iOS and Android devices.By having Unlimited Coins, you'll dominate the Knight War: Idle Defense game and win all challenges.This really is the key reason why many top players in the overall game uses our tool. \nKnight War: Idle Defense Hack Generator Screenshot!!!\nUse Knight War: Idle Defense Hack cheats online generator for players to get Coins\nKnight War: Idle Defense Hack Tool available for Browser, Android and IOS, it will allow you to Get unlimited Coins, easy to use and without downloading.\nThis Generator Knight War: Idle Defense Cheat was set up by the Famous Team \"UNV Cheat Games\" and will allow you to add as many Coins as you want without connecting and remotely directly on the web, because our Generator sends processed data to get information from the official game servers.\nSo if you're stuck somewhere, or just for fun, or to go beyond a level where you're struggling or to become one of the best players use our Generator and get what ever you want. Our Generator Encrypt Data to ensure maximum protection and minimal risk.\nDid you prefer not to buy Coins just get them for free? Or you need an updated Knight War: Idle Defense Hack that worked on their current version? Well, it is so easy even a 10-year-old child can do it!\nAnd it’s true hack for Coins can get you ahead in this game .\nBut there are few problems that most people encountered, outdated Knight War: Idle Defense Hack cheats are one of them. This new version of our Knight War: Idle Defense Hack Tool will never make you run out of Coins anymore. our developers made sure that our Knight War: Idle Defense cheats will let you enjoy the potential of this top action game in Knight War: Idle Defense fans know that each player wants a better equipe or players.\n\n\n➡ ➡ ➡  GET IT HERE: http://tinybit.cc/648f398d",
  "id": "knight-war-idle-defense-cheats",
  "isPrerelease": false,
  "lastEdited": "2022-02-12T02:28:40.98Z",
  "listed": false,
  "packageHash": "Ag+lK9m3OZ4U126INJmi16Lv+dNMl4K9pcsGSS2+hL2EkFUXccfs8NSDgh7V/XFTkhhUCOkPxcQdHaTOx+NS/g==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 14085,
  "published": "1900-01-01T00:00:00Z",
  "requireLicenseAcceptance": false,
  "verbatimVersion": "8.9.4",
  "version": "8.9.4",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.02.12.02.28.56/knight-war-idle-defense-cheats.8.9.4.json#knight-war-idle-defense-cheats.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1576,
      "fullName": "knight-war-idle-defense-cheats.nuspec",
      "length": 3485,
      "name": "knight-war-idle-defense-cheats.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.02.12.02.28.56/knight-war-idle-defense-cheats.8.9.4.json#readme.txt",
      "@type": "PackageEntry",
      "compressedLength": 0,
      "fullName": "readme.txt",
      "length": 0,
      "name": "readme.txt"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.02.12.02.28.56/knight-war-idle-defense-cheats.8.9.4.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9475,
      "fullName": ".signature.p7s",
      "length": 9475,
      "name": ".signature.p7s"
    }
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}