{
  "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.21.06.19.44/aspose.words.16.7.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "Aspose",
  "catalog:commitId": "b35fd598-0042-49de-a33a-94251f42014f",
  "catalog:commitTimeStamp": "2018-10-21T06:19:44.5362442Z",
  "copyright": "(C) Aspose 2002-2016. All Rights Reserved.",
  "created": "2016-08-09T14:33:12.473Z",
  "description": "Aspose.Words for .NET is a class library for .NET that enables you to perform a wide range of document processing tasks directly within your .NET applications.",
  "iconUrl": "http://www.aspose.com/images/products/dotnet/Aspose.Words_128x128.png",
  "id": "Aspose.Words",
  "isPrerelease": false,
  "lastEdited": "2018-10-21T06:19:43.793Z",
  "licenseUrl": "http://www.aspose.com/corporate/purchase/end-user-license-agreement.aspx",
  "listed": true,
  "packageHash": "+Uy/3IXJl8laquc+YZkzE7iyKDT8m+2iwMFjlcm0p6Jh9Lm4ihTdVChHvr/iX6jZtUZN+ay/Aap/KzYYTOGT2A==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 21931082,
  "projectUrl": "http://www.aspose.com/categories/.net-components/aspose.words-for-.net/default.aspx",
  "published": "2016-08-09T14:33:12.473Z",
  "releaseNotes": "Aspose.Words for .NET 16.7 Release Notes\n\nMajor Features\n\nThere are 132 improvements and fixes in this regular monthly release. The most notable are:\n\n* A document page can now be saved in GIF format using SaveFormat.Gif in ImageSaveOptions.\n* Font substitution rules improved. Now embedded font is used for substitution if available.\n* Multilevel strings rendering in DrawingML Chart axis labels improved.\n* OfficeMath objects now can be exported (optional) to HTML,MHTML or EPUB as mathml elements.\n* Implemented rendering of format revisions in balloons.\n* SKIPIF field supported.\n* LINQ Reporting Engine supports more numeric and string formats missing in standard .Net/Java libraries.\n* Replace API v2.0. Advanced replace methods added.\n* ReplaceAction, IReplacingCallback and ReplacingArgs moved to Aspose.Words.Replacing.\n* Old Range.Replace API marked as [Obsolete].\n* Font Embedding API (Implemented API for adding or removing embedded fonts).\n* MsWordVersion enum moved to Aspose.Words.Settings.\n* Added public methods to the DigitalSignatureUtil class that allow to specify a password for decrypting document before it will be signed.\n\n\nFull List of Issues Covering all Changes in this Release\n\nKey\tSummary\tCategory\nWORDSNET-11021\tLayout issues with Kinosku and AsianHangingPunctuation.\tBug\nWORDSNET-11563\tSize of images changed during open/save a HTML\tBug\nWORDSNET-12205\tList label is lost when list item is first in comment.\tBug\nWORDSNET-13012\tCSS is lost after re-saving Html\tBug\nWORDSNET-13149\tDoc to Pdf conversion issue with contents position\tBug\nWORDSNET-13279\tInsertHtml reuses imported styles even if their CSS don't match\tBug\nWORDSNET-13339\t/format revision/ Preserve Revision details in Balloons in PDF\tBug\nWORDSNET-13344\tContent Control is not rendering in output Pdf\tBug\nWORDSNET-13430\tTable layout is corrupted after saving a DOCX to DOCX\tBug\nWORDSNET-13475\tParagraphFormat.StyleName returns incorrect value for custom styles\tBug\nWORDSNET-13485\tAppendDocument does not preserve table's cell width\tBug\nWORDSNET-13530\tText direction of cell's text is changed in output Html\tBug\nWORDSNET-13550\tMixed Numbers, English and non-English content is incorectly encoded\tBug\nWORDSNET-13558\tCell's position is changed after re-saving Rtf\tBug\nWORDSNET-13559\tFont size of text is changed after re-saving Rtf\tBug\nWORDSNET-13565\tNumeric formatting does not take effect in Linq Reporting Engine\tBug\nWORDSNET-13595\tFont size of Hebrew text is changed after conversion from Docx to Html\tBug\nWORDSNET-13599\tTables do not merge correctly after removing paragraph between them\tBug\nWORDSNET-13605\t/para rules/ Paragraphs are rendered on next page in output Pdf\tBug\nWORDSNET-13611\tParts of chart lost when converted to png with aspose words\tBug\nWORDSNET-13613\tAlignment of a list item imported from HTML gets incorrect after Indent+Outdent or Remove+Insert\tBug\nWORDSNET-13631\tText font's color is lost after re-saving RTF\tBug\nWORDSNET-13641\tImages are inverted after conversion from Doc to Pdf\tBug\nWORDSNET-13672\t/format revision/ Formatting markup changes are not rendered in PDF\tBug\nWORDSNET-13681\tTwo empty pages appear in output document after re-saving RTF\tBug\nWORDSNET-13685\tDocx to Pdf conversion issue with ListLabel\tBug\nWORDSNET-13706\tCorrupted document is generated on saving as DOCX\tBug\nWORDSNET-13708\tDoc to Pdf conversion issue with textbox's text rendering\tBug\nWORDSNET-13710\tChart x-Axis is rendered incorrectly in output Pdf when DataTable is visible\tBug\nWORDSNET-13715\tNumPages field value in PDF is not according to the culture/language\tBug\nWORDSNET-13716\tNumPages field value in PDF is not according to the culture/language\tBug\nWORDSNET-13717\tSECTIONPAGES field value in PDF is not according to the culture/language\tBug\nWORDSNET-13723\tDocx to Pdf conversion issue with SmartArt rendering\tBug\nWORDSNET-13733\tDocument.UpdateFields does not update Formula field inside Table\tBug\nWORDSNET-13747\t/footnote balancing/ Footnote separator is overlapped with body text in output Pdf\tBug\nWORDSNET-13753\tImages in GroupShape become inverted when saving to PDF\tBug\nWORDSNET-13758\tDocument's footer and some text elements will be rendered with the Error! No text of specified style in document\tBug\nWORDSNET-13760\tTable's merged cells are repeated after re-saving Rtf\tBug\nWORDSNET-13777\tFileFormatInfo.LoadFormat : Text document format detected as Unknown\tBug\nWORDSNET-13781\tA picture in HtmlFixed repeats\tBug\nWORDSNET-13786\tText font's color is lost after re-saving RTF\tBug\nWORDSNET-13805\tShape's text color is lost after conversion from Docx to Pdf\tBug\nWORDSNET-13806\tException occured while saving MathML to DOC document\tBug\nWORDSNET-13814\tDocumentBuilder.InsertHtml renders a blank Math equation\tBug\nWORDSNET-13819\tContents render on previous page in output Pdf\tBug\nWORDSNET-13820\tDocx to Pdf conversion issue with table's rendering in HtmlFixed/Pdf\tBug\nWORDSNET-13827\tLocal document link incorrect when inside a shape (PDF)\tBug\nWORDSNET-13828\tOffice MathML matrix equation in PDF has too much spacing\tBug\nWORDSNET-13833\tDoc to HtmlFixed conversion issue with OLE\tBug\nWORDSNET-13839\tMathMLReader ignores accents in some cases\tBug\nWORDSNET-13862\tMailMerge.Execute does not update IF field when it is inside table\tBug\nWORDSNET-13897\tState of checkbox SDT is lost after conversion from Docx to Doc/Fixed file format\tBug\nWORDSNET-13898\tCheckbox (SDT ) does not render correctly in Pdf\tBug\nWORDSNET-13899\tNumbers in hebrew text are reversed after conversion from Docx to Pdf\tBug\nWORDSNET-13903\tProblem converting Document with data bindings to PDF\tBug\nWORDSNET-13917\tInvalidOperationException is thrown upon rendering.\tBug\nWORDSNET-13947\tSmartArt text is overlapped in output Pdf\tBug\nWORDSNET-3766\t/hidden/ Hidden content remains when rendered to PDF\tBug\nWORDSNET-3878\t/table grid/ Table width is incorrect during HTML to PDF conversion, if table contains very long link url.\tBug\nWORDSNET-4572\t/table grid/ Width of table is incorrect during rendering.\tBug\nWORDSNET-4810\tNested lists with DIV tags are not properly imported from HTML.\tBug\nWORDSNET-5642\t/revision marks/ Deleted bullets/Listitems appear again when converting to PDF\tBug\nWORDSNET-6320\tTable does not render across pages in PDF\tBug\nWORDSNET-6490\tHeader formatting lost during conversion DOCX to HTML\tBug\nWORDSNET-7868\t/nonstandard font/ Incorrect fonts are used during rendering to PDF\tBug\nWORDSNET-7911\t/nonstandard font/ Docx to PDF conversion issue with Arabic text fonts\tBug\nWORDSNET-8219\tDOC to HTML conversion issue with border lines\tBug\nWORDSNET-8621\tBug: 'font-weight' from default CSS style is applied as direct formatting\tBug\nWORDSNET-8651\tSUM(ABOVE) not correct working with values in brackets\tBug\nWORDSNET-8932\tVertical spacing between some table rows is not preserved in PDF\tBug\nWORDSNET-9258\tThe checkbox position is incorrect after conversion from HTML to Pdf\tBug\nWORDSNET-9357\tProblem with Top Margin when converting DOC to PDF\tBug\nWORDSNET-9444\tDocument.Save does not preserve the FormField\tBug\nWORDSNET-1252\tImprove Range.Replace to support breaks\tEnhancement\nWORDSNET-13676\tAssertion for unknown shape property when opening a document\tEnhancement\nWORDSNET-13817\tImprove font substitution in case when embedded font and substitute available\tEnhancement\nWORDSNET-12078\tRange.Replace method throws System.NotSupportedException\tException\nWORDSNET-12954\tDocument.Range.Replace is throwing exception when isForward is set to true\tException\nWORDSNET-13046\tRange.Replace throws System.NotSupportedException\tException\nWORDSNET-13105\tDocument.UpdateFields throws System.IndexOutOfRangeException\tException\nWORDSNET-13138\tDocument.Range.Replace throws exception when isForward is set to true\tException\nWORDSNET-13364\tDocument.PageCount throws \"Index was outside the bounds of the array\" exception\tException\nWORDSNET-13500\tDocumentBuilder.InsertHtml throws System.NullReferenceException\tException\nWORDSNET-13545\tNodeCollection.Clear throws System.InvalidOperationException\tException\nWORDSNET-13573\tDocument.PageCount throws \"Index was outside the bounds of the array\" exception\tException\nWORDSNET-13574\tAspose.Words.FileCorruptedException occurs upon loading WordML files\tException\nWORDSNET-13684\tDocument.AcceptAllRevisions throws System.InvalidOperationException\tException\nWORDSNET-13686\tAspose.Words.FileCorruptedException is thrown while loading Docx\tException\nWORDSNET-13735\tAspose.Words.16.4.0 Exception when signing a password-protected Words file with a digital signature\tException\nWORDSNET-13767\tMailMerge.Execute throws System.InvalidCastException\tException\nWORDSNET-13773\tSystem.NullReferenceException occurs during converting DOC to PDF\tException\nWORDSNET-13807\tSystem.ArgumentException is thrown while saving Docx to pdf\tException\nWORDSNET-13813\tSystem.IndexOutOfRangeException is thrown while saving docx to pdf\tException\nWORDSNET-13815\tSystem.InvalidOperationException is thrown while conversion of Docx to Pdf\tException\nWORDSNET-13830\tDocument.UpdateFields throws System.InvalidOperationException\tException\nWORDSNET-13831\tAspose.Words.FileCorruptedException is thrown while loading Doc\tException\nWORDSNET-13834\tSystem.NullReferenceException during converting to PDF/HTML\tException\nWORDSNET-13836\tOut of memory exception occurs during rendering to PDF\tException\nWORDSNET-13838\tSystem.NullReferenceException during converting to PDF\tException\nWORDSNET-13841\tSystem.OverflowException occurs upon rendering to TIFF\tException\nWORDSNET-13843\tLength cannot be less than zero exception occurs during Word to PDF/HTML conversion\tException\nWORDSNET-13844\tLength cannot be less than zero exception occurs during Word to PDF/HTML conversion\tException\nWORDSNET-13845\tLength cannot be less than zero exception occurs during Word to PDF/HTML conversion\tException\nWORDSNET-13846\tAspose.Words.FileCorruptedException occurs upon loading a DOCX\tException\nWORDSNET-13848\tAttempted to divide by zero exception occurs during rendering\tException\nWORDSNET-13858\tLayoutEnumerator constructor throws System.NullReferenceException\tException\nWORDSNET-13904\tNullReferenceException occurs when converting from Word to PDF\tException\nWORDSNET-13911\tDocument.AppendChild throws System.NullReferenceException\tException\nWORDSNET-13932\tDocument.PageCount throws System.IndexOutOfRangeException\tException\nWORDSNET-13936\tDocument.AcceptAllRevisions throws System.InvalidOperationException\tException\nWORDSNET-2847\tNullReferenceException occurs during Replace\tException\nWORDSNET-7456\tNullReferenceException occurs when performing a find and replace operation\tException\nWORDSNET-8404\tDocument.UpdateFields throws System.NullReferenceException exception\tException\nWORDSNET-8558\tSystem.NullReferenceException is thrown while conversion from Docx to fixed file format.\tException\nWORDSNET-10085\t/Show revisions in balloons/ Support rendering of revisions inside of balloons rather than inline\tFeature\nWORDSNET-10086\t/Show revisions in balloons/ Images from Markup Area are rendered in the middle of main content area in PDF\tFeature\nWORDSNET-10988\t/format revision/ Add feature to show format revision in pdf\tFeature\nWORDSNET-12753\t/format revision/ Add feature to show format revision in pdf\tFeature\nWORDSNET-12891\tConvert OfficeMath nodes into MathML\tFeature\nWORDSNET-13084\troot/ Support loading of Mobi (Mobipocket) documents\tFeature\nWORDSNET-13537\tProvide ability to create mathematical equation from MathML string\tFeature\nWORDSNET-13566\tAdd feature to format string values in Linq Reporting Engine\tFeature\nWORDSNET-13603\tImport html image tag with height only (or width only) proportionally\tFeature\nWORDSNET-13734\tAdd new save format in ImageSaveOptions as SaveFormat.GIF\tFeature\nWORDSNET-13768\tNon ECMA-367 documents with CustomXML issue with Microsoft Word Online\tFeature\nWORDSNET-3827\tAllow embedding fonts into DOCX documents.\tFeature\nWORDSNET-4285\tSupport the SKIPIF mailmerge field\tFeature\nWORDSNET-6205\tExport W3C MathML formulas to HTML\tFeature\nWORDSNET-8752\tRuby (Equation) field does not import in Aspose.Words DOM\tFeature\nWORDSNET-13575\tCells widths are changed after joining the tables\tRegression\nWORDSNET-13585\tAspose.Words.FileCorruptedException is thrown while loading Docx\tRegression\nWORDSNET-13920\tJapanese ruby text does not render correctly in output pdf\tRegression",
  "requireLicenseAcceptance": true,
  "title": "Aspose.Words for .NET",
  "verbatimVersion": "16.7.0",
  "version": "16.7.0",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.21.06.19.44/aspose.words.16.7.0.json#Aspose.Words.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 4391,
      "fullName": "Aspose.Words.nuspec",
      "length": 13310,
      "name": "Aspose.Words.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.21.06.19.44/aspose.words.16.7.0.json#lib/net20/Aspose.Words.dll",
      "@type": "PackageEntry",
      "compressedLength": 5261563,
      "fullName": "lib/net20/Aspose.Words.dll",
      "length": 11619840,
      "name": "Aspose.Words.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.21.06.19.44/aspose.words.16.7.0.json#lib/net20/Aspose.Words.xml",
      "@type": "PackageEntry",
      "compressedLength": 216041,
      "fullName": "lib/net20/Aspose.Words.xml",
      "length": 1582082,
      "name": "Aspose.Words.xml"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.21.06.19.44/aspose.words.16.7.0.json#lib/net35-client/Aspose.Words.dll",
      "@type": "PackageEntry",
      "compressedLength": 5259123,
      "fullName": "lib/net35-client/Aspose.Words.dll",
      "length": 11611136,
      "name": "Aspose.Words.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.21.06.19.44/aspose.words.16.7.0.json#lib/net35-client/Aspose.Words.xml",
      "@type": "PackageEntry",
      "compressedLength": 215853,
      "fullName": "lib/net35-client/Aspose.Words.xml",
      "length": 1580990,
      "name": "Aspose.Words.xml"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.21.06.19.44/aspose.words.16.7.0.json#lib/net40/Aspose.Words.dll",
      "@type": "PackageEntry",
      "compressedLength": 5267054,
      "fullName": "lib/net40/Aspose.Words.dll",
      "length": 11628032,
      "name": "Aspose.Words.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.21.06.19.44/aspose.words.16.7.0.json#lib/net40/Aspose.Words.xml",
      "@type": "PackageEntry",
      "compressedLength": 216041,
      "fullName": "lib/net40/Aspose.Words.xml",
      "length": 1582082,
      "name": "Aspose.Words.xml"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.21.06.19.44/aspose.words.16.7.0.json#lib/net40-client/Aspose.Words.dll",
      "@type": "PackageEntry",
      "compressedLength": 5261857,
      "fullName": "lib/net40-client/Aspose.Words.dll",
      "length": 11619328,
      "name": "Aspose.Words.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.21.06.19.44/aspose.words.16.7.0.json#lib/net40-client/Aspose.Words.xml",
      "@type": "PackageEntry",
      "compressedLength": 215853,
      "fullName": "lib/net40-client/Aspose.Words.xml",
      "length": 1580990,
      "name": "Aspose.Words.xml"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.21.06.19.44/aspose.words.16.7.0.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9462,
      "fullName": ".signature.p7s",
      "length": 9462,
      "name": ".signature.p7s"
    }
  ],
  "tags": [
    "Word",
    "DOC",
    "DOCX",
    "OOXML",
    "OpenDocument",
    "PDF",
    "XPS",
    "ODT",
    "HTML",
    "XHTML",
    "WordprocessingML",
    "Document",
    "EPUB"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    }
  }
}