{
  "@id": "https://api.nuget.org/v3/catalog0/data/2015.05.27.10.31.28/51degrees.mobi.3.1.12.5.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "James Rosewell,  Thomas Holmes",
  "catalog:commitId": "3529ba72-75ac-4acb-8e3f-e92ff6060a3e",
  "catalog:commitTimeStamp": "2015-05-27T10:31:28.0499129Z",
  "copyright": "51Degrees Mobile Experts Limited",
  "created": "2015-05-27T10:26:57.84Z",
  "description": "The fastest, most accurate tools. Deployed by millions.\n      Request.Browser properties will be populated with data from 51Degrees Lite Device Data. Other features\n      include automatic image optimisation, monitoring of network conditions and client side feature detection.",
  "iconUrl": "https://51degrees.com/portals/0/Logos/Square%20Logo.png?width=128",
  "id": "51Degrees.mobi",
  "isPrerelease": false,
  "language": "en-GB",
  "lastEdited": "2015-05-27T10:31:20.637Z",
  "licenseUrl": "http://51degrees.codeplex.com/license",
  "listed": true,
  "packageHash": "nAK7PLhPzpw4UUUjRBvu057W/svwog6aK58PqpOgYEOkAviAA7+8eveVG0HcYbOmJZykxsUHXeqDmuzk1Lgu8w==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 7956786,
  "projectUrl": "http://51degrees.com/Support/Documentation/NET",
  "published": "2015-05-27T10:26:57.98Z",
  "releaseNotes": "Important: Upgrading users of Enhanced Data need version 3.1 format data.\nDevice detection algorithm is over 100 times faster than version 2. Regular expressions and levenshtein distance calculations are no longer used.\nThe device detection algorithm performance is no longer limited by the number of device combinations contained in the dataset.\nTwo modes of operation are available:\n  Memory – the detection data set is loaded into memory and there is no continuous connection to the source data file. Slower initialisation time but faster detection performance.\n  Stream – relevant parts of the data set are loaded into memory when required and cached to improve performance. Rapid initialisation time but approximately 50% slower detection performance. This mode is used when operated in a web environment.\nJPG and PNG format images can be optimised to improve performance.\nBandwidth and response times can be monitored to understand in real time the end users experience.\nFeature detection is used to override properties in the data set to provide details such as iPhone model or the screen orientation. These values become available to the server from the 2nd request from the device onwards.\nMulti-threading is no longer used within the matching algorithm.\nWhen used in a web environment the detection results are stored within the session when available and are no longer cached separately.\n\n-- Changes for 3.1.12.5 --\n1. Modified TopDevices.cs in the Web UI namespace so that duplicated devices within the same HardwareFamily are removed. This results in a nicer looking user interface when multiple models in the same family are present.\n\n2. Fixed Source.Dispose throwing an exception if a temporary data file could not be deleted. This should result in less temporary files being created.\n\n3. When working in Stream mode the temporary file must be present for the data set to be created. This addresses a rare situation where after the temporary file is checked but before the data set is created another process could delete the temporary file resulting in a Lite data set being created.\n\n4. WebProvider has been modified to augment Request.Browser with 3 additional pieces of information: MatchMethod, MatchDifference and MatchSignatureRank. All 3 can be used to check the level of confidence of the detector. I.e. when MatchMethod contains ‘exact’ the detector is confident that the user agent string in question corresponds to the matched device. If on the other hand the MatchMethod contains ‘none’ then the user agent is most certainly fake. For more information on all match methods please see: https://51degrees.com/support/documentation/pattern\n\n5. Added the response text from the server to the error log when a data file update fails. This can help provide more information about why automatic updates have failed. \n",
  "requireLicenseAcceptance": false,
  "summary": "Fast & Accurate Device Detection. Deployed by millions.",
  "title": "51Degrees Mobile Detection & Optimisation",
  "version": "3.1.12.5",
  "dependencyGroups": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2015.05.27.10.31.28/51degrees.mobi.3.1.12.5.json#dependencygroup",
      "@type": "PackageDependencyGroup",
      "dependencies": [
        {
          "@id": "https://api.nuget.org/v3/catalog0/data/2015.05.27.10.31.28/51degrees.mobi.3.1.12.5.json#dependencygroup/microsoft.web.infrastructure",
          "@type": "PackageDependency",
          "id": "Microsoft.Web.Infrastructure",
          "range": "[1.0.0, )"
        }
      ]
    }
  ],
  "tags": [
    "mobile",
    "phone",
    "detection",
    "device",
    "data",
    "handset",
    "tablet",
    "responsive",
    "design",
    "images",
    "51degrees"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    }
  }
}