{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.02.11.18.54.44/line-i-love-coffee-cheats.9.3.9.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "mpkgyp",
  "catalog:commitId": "4433a02e-d620-4c75-be2e-86962575d60a",
  "catalog:commitTimeStamp": "2022-02-11T18:54:44.6747697Z",
  "created": "2022-02-11T18:52:32.543Z",
  "description": "LINE I Love Coffee Hack Mod APK Get Unlimited Coins Cheats Generator IOS Android\n\nLINE I Love Coffee Hack [2021 WORKING] Unlimited Coins Android | iOS ! 100% Work\nToday, we got the LINE I Love Coffee Hack at your service. This really is an LINE I Love Coffee ONLINE Hack, which could generate Unlimited number of Coins to your game account. \nThis is the sole place online to get working cheats for LINE I Love Coffee and became the most effective player in this great game. If you wish to take your game to a different level and improve your odds for winning, you need to use free of charge now our amazing LINE I Love Coffee Hack Online Cheat Tool. LINE I Love Coffee Cheat Tool can be acquired for your Android or iOS device, it features a user-friendly interface and is simple manageable. \n\n➡ ➡ ➡  GET IT HERE: http://tinybit.cc/e4bcb7fc\n\nThis LINE I Love Coffee hack online generator is undetectable because of proxy connection and our safety system. It's 128-bit SSL, to produce your account as safe as you are able to so don't bother about bans. Our LINE I Love Coffee Hack has very simply interface to produce it simple to use. Our hacks are always up to date and they are made for every one of iOS and Android devices.By having Unlimited Coins, you'll dominate the LINE I Love Coffee game and win all challenges.This really is the key reason why many top players in the overall game uses our tool. \nLINE I Love Coffee Hack Generator Screenshot!!!\nUse LINE I Love Coffee Hack cheats online generator for players to get Coins\nLINE I Love Coffee Hack Tool available for Browser, Android and IOS, it will allow you to Get unlimited Coins, easy to use and without downloading.\nThis Generator LINE I Love Coffee Cheat was set up by the Famous Team \"UNV Cheat Games\" and will allow you to add as many Coins as you want without connecting and remotely directly on the web, because our Generator sends processed data to get information from the official game servers.\nSo if you're stuck somewhere, or just for fun, or to go beyond a level where you're struggling or to become one of the best players use our Generator and get what ever you want. Our Generator Encrypt Data to ensure maximum protection and minimal risk.\nDid you prefer not to buy Coins just get them for free? Or you need an updated LINE I Love Coffee Hack that worked on their current version? Well, it is so easy even a 10-year-old child can do it!\nAnd it’s true hack for Coins can get you ahead in this game .\nBut there are few problems that most people encountered, outdated LINE I Love Coffee Hack cheats are one of them. This new version of our LINE I Love Coffee Hack Tool will never make you run out of Coins anymore. our developers made sure that our LINE I Love Coffee cheats will let you enjoy the potential of this top action game in LINE I Love Coffee fans know that each player wants a better equipe or players.\n\n\n➡ ➡ ➡  GET IT HERE: http://tinybit.cc/e4bcb7fc",
  "id": "line-i-love-coffee-cheats",
  "isPrerelease": false,
  "lastEdited": "2022-02-11T18:54:34.453Z",
  "listed": false,
  "packageHash": "hp3nsjnWNFSytBTIglz5ih7n8rMoDpPLT6Zu77XF1HuHVl6orzuCHQH/obfzgVvy4PmZ3rT015yKV34njgac4A==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 14039,
  "published": "1900-01-01T00:00:00Z",
  "requireLicenseAcceptance": false,
  "verbatimVersion": "9.3.9",
  "version": "9.3.9",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.02.11.18.54.44/line-i-love-coffee-cheats.9.3.9.json#line-i-love-coffee-cheats.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1565,
      "fullName": "line-i-love-coffee-cheats.nuspec",
      "length": 3366,
      "name": "line-i-love-coffee-cheats.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.02.11.18.54.44/line-i-love-coffee-cheats.9.3.9.json#readme.txt",
      "@type": "PackageEntry",
      "compressedLength": 0,
      "fullName": "readme.txt",
      "length": 0,
      "name": "readme.txt"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.02.11.18.54.44/line-i-love-coffee-cheats.9.3.9.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9470,
      "fullName": ".signature.p7s",
      "length": 9470,
      "name": ".signature.p7s"
    }
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}