{
  "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.22.23.23.55/aspose.pdf.8.7.0.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "Aspose",
  "catalog:commitId": "e671d978-9e06-445b-8820-5535bab49270",
  "catalog:commitTimeStamp": "2018-10-22T23:23:55.0662037Z",
  "copyright": "©Aspose 2002-2013. All Rights Reserved.",
  "created": "2013-12-05T14:35:28.42Z",
  "description": "Aspose.Pdf for .NET is a PDF document creation and manipulation component that enables your .NET applications to read, write and manipulate existing PDF documents without using Adobe Acrobat. It also allows you to create forms and manage form fields embedded in a PDF document. This component is written in managed C# and it allows developers to add PDF creation and manipulation functionality to their Microsoft .NET applications (WinForms, ASP.NET and .NET Compact Framework).\n\tAspose.Pdf for .NET is affordable and offers an incredible wealth of features including PDF compression options; table creation and manipulation; support for graph objects; extensive hyperlink functionality; extended security controls; custom font handling; integration with data sources; add or remove bookmarks; create table of contents; add, update, delete attachments and annotations; import or export PDF form data; add, replace or remove text and images; split, concatenate, extract or inset pages; transform pages to image; print PDF documents and much more.",
  "iconUrl": "http://www.aspose.com/blogs/wp-content/uploads/2013/06/aspose-Pdf-for-net_100.png",
  "id": "Aspose.Pdf",
  "isPrerelease": false,
  "lastEdited": "2018-10-22T23:23:46.013Z",
  "licenseUrl": "http://www.aspose.com/corporate/purchase/end-user-license-agreement.aspx",
  "listed": true,
  "packageHash": "s2YQU4q1Yz7LVPcdSuyhIzPJle9UykPCIFQee+Pr3hU9bDDPw4BGdg7O9gAcepvF9PRGnejMARaZTBUICoF5gA==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 32396360,
  "projectUrl": "http://www.aspose.com/categories/.net-components/aspose.pdf-for-.net/default.aspx",
  "published": "2013-12-05T14:35:28.42Z",
  "releaseNotes": "This release introduces the features, enhancements and bug fixes as detailed below:\n\nNew Features\nPDFNEWNET-15072\tproduce PDF files that conform to PDF/X-1 (ISO 15930) standard.\nPDFNEWNET-18802\tPDF/X validation\nPDFNEWNET-33790\tConverting HTML to PDF - Font Issue\nPDFNEWNET-35233\tHow to allow only numeric values in (textbox) form field\nPDFNEWNET-35487\tSupport of PDF/X-1A: 2001 compliance\nPDFNEWNET-35926\tShrink a Multipage PDF document to single page PDF document\nPDFNEWNET-35942\tPDF to HTML - Split CSS to files, when resultant HTML is split to pages\nPDFNEWNET-35951\tPDF to HTML: Extract Images,Fonts and CSS in separate folders and create their aliases\nPDFNEWNET-36023\tSupport adding/updating a field\nPDFNEWNET-36064\tSupport of required field flag for a from field\n\nEnhancements\nPDFNEWNET-34273\tPDF/A-1a conversion stopped working in .Net version 7.2.0.0 and 7.3.0.0\nPDFNEWNET-35530\tHow to preserve form field formatting, while filing form.\nPDFNEWNET-35740\tTextBoxField appearance issue\nPDFNEWNET-35834\tAdd JavaScript to PushButton using Aspose.Pdf.Generator\nPDFNEWNET-35882\tExportXML/ImportXML methods doesn't honor Checkbox group subfield values\nPDFNEWNET-35940\tPDF to HTML - For non vector SVG elements, convert them to PNG / JPG\nPDFNEWNET-35941\tPDF to HTML - Shorten font names\nPDFNEWNET-35981\tPDF to XPS - Resultant file size is too large\nPDFNEWNET-36047\tMark Producer and Creator properties of DocumentInfo as Read Only\nPDFNEWNET-36054\tText of a cell with rowspan value that spanned over the pages, appears on only first page\n\nExceptions\nPDFNEWNET-33860\tHTML to PDF conversion - Exception found\nPDFNEWNET-35902\tOptimize operation throws an Object Reference not set exception\nPDFNEWNET-35921\tNull reference exception when calling OptimizeResources method\nPDFNEWNET-35932\tInValidOperationException is being thrown on FillField method\nPDFNEWNET-35947\tNullReferenceException while splitting PDF to pages\nPDFNEWNET-35994\tPDF to HTML: Upgrading from 8.1 to 8.5 throwing NullReferenceException\nPDFNEWNET-36019\tHTML to PDF: Vladimir Script Font throwing StackOverFlow exception\nPDFNEWNET-36101\tFilling a form results in InvalidCastException\n\nBugs\nPDFNEWNET-34972\tPDF generation time is longer in new release versions\nPDFNEWNET-35027\tUnable to use Aspose.Pdf in VS 2008/2010 C++/CLR (error C2686)\nPDFNEWNET-35518\tPDF concatenation - resultnt file opens in the middle document\nPDFNEWNET-35555\tLinks are not working when merging Interactive PDF files\nPDFNEWNET-35664\tTiff to Pdf conversion: SystemImage property of ImageInfo renders only first frame\nPDFNEWNET-35793\tAspose.pdf with C++/CLI: compilation error C2686\nPDFNEWNET-35832\tCreateWebLink() incorrectly places link above matching text\nPDFNEWNET-35837\tUnable to add JavaScript to PushButton\nPDFNEWNET-35852\tAttachment corrupts, while we add attachment and encrypt simultaneously\nPDFNEWNET-35869\tFormEditor: Change in rectangle coordinates has not impact on radio button size\nPDFNEWNET-35879\tPageInfo doesn't return correct values\nPDFNEWNET-35883\tError importing annotations from xfdf file\nPDFNEWNET-35906\tHidden page element prints when using PdfViewer\nPDFNEWNET-35909\tUnable to retrieve form fields information\nPDFNEWNET-35931\tAspose.VerticalAlignment doesn't place textstamp at correct location when page sizes is large\nPDFNEWNET-35971\tPDF to PNG: document text is missing in resultant image\nPDFNEWNET-35982\tPDF to XPS - Text is rendering twice\nPDFNEWNET-36028\tTable border is not appearing correctly on subsequent page\nPDFNEWNET-36033\tPDF to JPEG - Garbled contents in resultant file\nPDFNEWNET-36034\tAnnotation import - cloud outbox is changed to stright line\nPDFNEWNET-36035\tAnnotations import - When rotating callouts, text comes out of outbox or text is hidden\nPDFNEWNET-36036\tHeader of Subsequent table is not appearing\nPDFNEWNET-36042\tImport Annotations - Text rotation, missing arrow, wrong padding issues\nPDFNEWNET-36049\tUsing same stamp object for different PDF document results in corrupt output document\nPDFNEWNET-36051\tException while reading links from PDF file\nPDFNEWNET-36059\tMarkup annotation is not honoring Rectangular coordinates\nPDFNEWNET-36065\tNested table is not working in 8.5 and above\nPDFNEWNET-36068\tWrong / missing trailer information from PDF\nPDFNEWNET-36077\tAdding an image to a pdf results a in blurry / not readable document\nPDFNEWNET-36091\tTXT to PDF - Table alignment is not correct\nPDFNEWNET-36093\twatermark is not being added in pdf in C++/cli\nPDFNEWNET-36096\tGraph objects not being added to PDF file",
  "requireLicenseAcceptance": true,
  "summary": "Aspose.Pdf for .NET is an amazing component which provides the feature to create and manipulate PDF documents.",
  "title": "Aspose.Pdf for .NET",
  "verbatimVersion": "8.7.0",
  "version": "8.7.0",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.22.23.23.55/aspose.pdf.8.7.0.json#Aspose.Pdf.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 3099,
      "fullName": "Aspose.Pdf.nuspec",
      "length": 6606,
      "name": "Aspose.Pdf.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.22.23.23.55/aspose.pdf.8.7.0.json#lib/net2.0/Aspose.Pdf.dll",
      "@type": "PackageEntry",
      "compressedLength": 16194746,
      "fullName": "lib/net2.0/Aspose.Pdf.dll",
      "length": 21802832,
      "name": "Aspose.Pdf.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.22.23.23.55/aspose.pdf.8.7.0.json#lib/net40-client/Aspose.Pdf.dll",
      "@type": "PackageEntry",
      "compressedLength": 16185402,
      "fullName": "lib/net40-client/Aspose.Pdf.dll",
      "length": 21787984,
      "name": "Aspose.Pdf.dll"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2018.10.22.23.23.55/aspose.pdf.8.7.0.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9462,
      "fullName": ".signature.p7s",
      "length": 9462,
      "name": ".signature.p7s"
    }
  ],
  "tags": [
    "Aspose.Pdf",
    "PDF",
    "XFA",
    "XPS",
    "TIFF",
    "PCL",
    "SVG",
    "HTML",
    "XML",
    "XSL-FO",
    "FDF",
    "XFDF",
    "PDF/A",
    "form",
    "Portfolio",
    "EPUB",
    "PSD",
    "to",
    "XLS",
    "DOC"
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    }
  }
}