{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.11.35.00/_coin-master-free-spins-working-2022-version-sss.4.5.95.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "SharpCrafters s.r.o.",
  "catalog:commitId": "ecb86c15-34c1-4a4e-bf81-2d62a7e4f1db",
  "catalog:commitTimeStamp": "2022-01-26T11:35:00.3397924Z",
  "created": "2022-01-26T11:33:13.667Z",
  "description": "# _Coin Master Free Spins Working 2022 Version sss\n\n\nCLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; [http://9.bltadwin.ru/hack.php](http://9.bltadwin.ru/hack.php)\n\n\nBuild your Coin Master village by spinning the free slot machines  collecting enough coins for your upgrades. Check daily free spin links. Follow coin master on social media · Sign up for email gifts · Invite friends · Request spins as gifts · Watch video ads · Spin · Level up your village · Participate. Every time you invite a friend on Facebook to play the game, you can get 40 Coin Master free spins. To obtain credit, your friend needs to accept the invite.\n\n## [CLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; http://9.bltadwin.ru/hack.php](http://9.bltadwin.ru/hack.php)\n\nIronically, you can actually get a ton of Coin Master free spins by, well, spinning. If you get three spin energy symbols in a row, you’ll get a bunch of free spins. Pick up a chain of them and you can spin for ages before you run out. Level up your village. Each time you level up your village, you’ll get a bunch of Coin Master free spins. Coin master free spins is a new dedicated website that always tries to provide daily the latest free spins coin master links for unlimited coins. Coin MasterFree Spins. English. Germany. Invite friends to play Coin Master. If that's not enough, you can always rely on your friends (quite literally). For each new friend that you invite to play Coin Master, you'll receive 40 free spins. After you've invited a bunch of friends, you can ask for their help too.\n\ncoin master free spins 2022, coin master free spins level, coin master free spins and coins (today gift reward), coin master free spins link today instagram, coin master free spins link, coin master free spins link today new, coin master free spins 2021, coin master free spins levvvel, coin master free spins and coins, coin master free spins and coins app, coin master free spins android, coin master free spins app for iphone, coin master free spins and coin links, coin master free spins and coins links 2019, coin master free spins and cards, the coin master free spins, coin master free spins hack, coin master free spins 2020, coin master free spins link today, coin master free spins link today facebook, coin master free spins today daily links, coin master free spins 2019, coin master free spins blogger, coin master free spins blog, coin master free spins blogspot 2021, coin master free spins bonus, coin master free spins bit.ly, coin master free spins bigils, coin master free spin bug, coin master free spins link blogspot, how to get free spins on coin master for free, how to get 50 free spins on coin master, how to get unlimited free spins on coin master, coin master free spins codes, coin master free spins coin master, coin master free spins cheat codes, coin master free spins coin link, coin master free spins cmfs, coin master free spins cheat, coin master free spins cm spin and coin link, coin master free spins cm spins and coins, coin master free spins app, coin master free spins 2021 hack without human verification, coin master free spins promo code today, coin master free spins daily, coin master free spins daily links, coin master free spins daily free rewards, coin master free spins daily link game mod, coin master free spins december 2021, coin master free spins daily 2020, coin master free spins daily mosttechs, coin master free spins download, coin master free spins d, coin master free spins every day, coin master free spins email link, coin master free spins extra, coin master free spins email, coin master free spins español, coin master free spins not expired, coin master free spins cheat engine, coin master earn free spins, links diários para coin master free spins e coins, coin master free spins facebook, coin master free spins for today, coin master free spins free, coin master free spins free links, coin master free spins for iphone, coin master free spins freespinlink.com, coin ma",
  "id": "_Coin-Master-Free-Spins-Working-2022-Version-sss",
  "isPrerelease": false,
  "language": "en-US",
  "lastEdited": "2022-01-26T11:34:44.47Z",
  "listed": true,
  "packageHash": "wVeowbZfpr2NdhMwT6p5ElWh2aNkOkauBhi9M2ncsdxz4gNN+Fv/V37zrideStOjGBDz2UimT9jFP6oJQvnOEQ==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 11469,
  "published": "2022-01-26T11:33:13.667Z",
  "requireLicenseAcceptance": false,
  "title": "_Coin-Master-Free-Spins-Working-2022-Version-sss",
  "verbatimVersion": "4.5.95",
  "version": "4.5.95",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.11.35.00/_coin-master-free-spins-working-2022-version-sss.4.5.95.json#cmghcztyht.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1340,
      "fullName": "cmghcztyht.nuspec",
      "length": 4477,
      "name": "cmghcztyht.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.11.35.00/_coin-master-free-spins-working-2022-version-sss.4.5.95.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9469,
      "fullName": ".signature.p7s",
      "length": 9469,
      "name": ".signature.p7s"
    }
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}