{
  "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.11.21.20/_rise-of-kingdoms-generator-working-2022-version-pjf.3.3.67.json",
  "@type": [
    "PackageDetails",
    "catalog:Permalink"
  ],
  "authors": "SharpCrafters s.r.o.",
  "catalog:commitId": "800a2408-4dc3-457c-bef9-716bfc2a5b34",
  "catalog:commitTimeStamp": "2022-01-26T11:21:20.217246Z",
  "created": "2022-01-26T11:18:30.457Z",
  "description": "# _Rise of Kingdoms Generator Working 2022 Version pjf\n\n\nCLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; [http://8.bltadwin.ru/hack.php](http://8.bltadwin.ru/hack.php)\n\n\nRise of Kingdoms Hack Unlimited Gems Generator Latest Version Game Get Free unlimited gems to ENJOY. ***CLICK icon below to use the hack***. UpLabs curates the best of design  development inspiration, resources and freebies. Every day! Rise of Kingdoms Hack Gems Online Generator Tool. Use our Rise of Kingdoms Hack Gems Online Generator Tool now to add Unlimited Gems to your account!\n\n## [CLICK HERE TO DOWNLOAD  gt;gt;gt;gt;gt; http://8.bltadwin.ru/hack.php](http://8.bltadwin.ru/hack.php)\n\nRise of Kingdoms Hack Tool. FOLLOW OUR INSTRUCTIONS BELOW! Step 1: Enter your Rise of Kingdoms Username! Step 2: Select Gems amount! Step 3: Click on I AGREE! CONTINUE to start! download?riseofkingdomshackRise of Kingdoms is to accomplish your daily tasks. While some tasks can be easy to accomplish, others take more a. Rise of Kingdoms is a more recent variant of this rising of civilizations. This is a game that's comprised of a governor, troops, a farm, land, along with an alliance. In this match, the consumers are joining together to form a peace alignment and supply help to a territory, and profits gems in download features are the same as the old one just that, you can play this game on Android .\n\nrise of kingdoms generator gems, rise of kingdoms name generator, rise of kingdoms gem generator no survey, rise of kingdoms nickname generator, rise of kingdoms text generator, rise of kingdoms online generator, rise of kingdoms code generator, rise of kingdom hack generator, rise of kingdoms alliance description generator, rise of kingdoms alliance name generator, how do you create an alliance in rise of kingdoms, how to join alliance in rise of kingdoms, how to merge alliance in rise of kingdoms, what are alliance credits in rise of kingdoms, install rise of kingdoms, is rise of kingdoms free, how to start a new game in rise of kingdoms, what is rise of kingdoms, rise of kingdom free gems, rise of kingdoms gem generator, rise of kingdoms.ig4mes.com generator, rise of kingdoms redeem code generator, codes for rise of kingdoms, new code rise of kingdoms, rise of kingdoms free gems generator, rise of kingdoms hack free gems generator no survey, gems generator for rise of kingdoms, font generator for rise of kingdoms, how to get unlimited gems in rise of kingdoms, how to buy gems in rise of kingdoms, how to get gems rise of kingdoms, how to get more gems in rise of kingdoms, rise of kingdoms gem generator no human verification, rise of kingdoms hack free gems generator, rise of kingdoms gem hack, rise of kingdom gems, rise of kingdoms creator, good names for rise of kingdoms, the rise of kingdoms, rise of kingdoms online, rise of kingdoms online pc, is rise of kingdoms online, rise of kingdom ysg, rise of kingdoms names",
  "id": "_Rise-of-Kingdoms-Generator-Working-2022-Version-pjf",
  "isPrerelease": false,
  "language": "en-US",
  "lastEdited": "2022-01-26T11:21:03.2Z",
  "listed": true,
  "packageHash": "cR+oDjHvZmG5M5XYvWZVfdwCa7Wv8fMufFRt0QlZPOyPRB3A0JLWX8t+q7DDAaUg8pDx5rL9HeG4/Lfy0F6rhQ==",
  "packageHashAlgorithm": "SHA512",
  "packageSize": 11321,
  "published": "2022-01-26T11:18:30.457Z",
  "requireLicenseAcceptance": false,
  "title": "_Rise-of-Kingdoms-Generator-Working-2022-Version-pjf",
  "verbatimVersion": "3.3.67",
  "version": "3.3.67",
  "packageEntries": [
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.11.21.20/_rise-of-kingdoms-generator-working-2022-version-pjf.3.3.67.json#xffisxutcy.nuspec",
      "@type": "PackageEntry",
      "compressedLength": 1190,
      "fullName": "xffisxutcy.nuspec",
      "length": 3407,
      "name": "xffisxutcy.nuspec"
    },
    {
      "@id": "https://api.nuget.org/v3/catalog0/data/2022.01.26.11.21.20/_rise-of-kingdoms-generator-working-2022-version-pjf.3.3.67.json#.signature.p7s",
      "@type": "PackageEntry",
      "compressedLength": 9471,
      "fullName": ".signature.p7s",
      "length": 9471,
      "name": ".signature.p7s"
    }
  ],
  "@context": {
    "@vocab": "http://schema.nuget.org/schema#",
    "catalog": "http://schema.nuget.org/catalog#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dependencies": {
      "@id": "dependency",
      "@container": "@set"
    },
    "dependencyGroups": {
      "@id": "dependencyGroup",
      "@container": "@set"
    },
    "packageEntries": {
      "@id": "packageEntry",
      "@container": "@set"
    },
    "packageTypes": {
      "@id": "packageType",
      "@container": "@set"
    },
    "supportedFrameworks": {
      "@id": "supportedFramework",
      "@container": "@set"
    },
    "tags": {
      "@id": "tag",
      "@container": "@set"
    },
    "vulnerabilities": {
      "@id": "vulnerability",
      "@container": "@set"
    },
    "published": {
      "@type": "xsd:dateTime"
    },
    "created": {
      "@type": "xsd:dateTime"
    },
    "lastEdited": {
      "@type": "xsd:dateTime"
    },
    "catalog:commitTimeStamp": {
      "@type": "xsd:dateTime"
    },
    "reasons": {
      "@container": "@set"
    }
  }
}